[{"dvar_torah_id":"vayikru2_c28be554","title":"מחשבות דוד על גלות ישראל","summary":"דוד המלך חשב על גלות ישראל והכפרה עליה, אך חזר בו והבין כי אם ישראל ישמרו תורה, לא יזדקקו לגלות. הכתוב מבטיח שלום בארץ, וריבוי מאכל אינו סיבה להעדר שלום, אלא חטא ישראל הוא הגורם לגלות.","contents":[{"passage_id":"vayikru2_c28be554_p1","passage_content":"אם בחקתי תלכו וגו' במד\"ר ריש פרשתן הה\"ד (תהלים קי\"ט) חשבתי דרכי ואשיבה רגלי אל עדותיך אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות הה\"ד ואשיבה רגלי אל עדותיך. והתמיהה מפורסמת הכיצד יתכן לומר כזאת על דוד מלך ישראל שהיה מעלה על לבו בכל יום ויום להלך אל אותם מקומות לא טובים, והלא אפילו אחד הריקים אינו מעלה כזאת על לבו בכוונה תחילה, אלא שבמשך היום מתגרה בו היצה\"ר ומסיתו לרע, ועאכו\"כ שלא יתכן שהיה דוד חושב מחשבות בכל יום ללכת לאותן מקומות."},{"passage_id":"vayikru2_c28be554_p2","passage_content":"ב) ונתתי שלום בארץ פירש\"י ז\"ל שמא תאמרו הרי מאכל הרי משתה אם אין שלום אין כלום ת\"ל אחר כל זאת ונתתי שלום בארץ. וצ\"ב דמסתימת דברי רש\"י ז\"ל שכתב שמה תאמרו הרי מאכל הרי משתה אם אין שלום אין כלום וכו' מוכח דריבוי השפע של מאכל ומשתה הוא הגורם לכך שאין שלום, וזה תמוה מדוע יהיה ריבוי מאכל ומשתה גורם להעדר השלום מן הארץ, אדרבה איפכא מסתברא דחסרון הפרנסה והעדר המזונות הוא סיבה גדולה למריבה וקטטה, כדאיתא בגמרא (בבא מציעא נ\"ט ע\"א) שאין מריבה מצויה בתוך ביתו של אדם אלא על עסקי תבואה וכו' דאמרי אינשי כמשלם שערי מכדא נקיש ואתי תיגרא בביתא."},{"passage_id":"vayikru2_c28be554_p3","passage_content":"ונראה בהקדם מה שחקרו הקדמונים דהרי בברית בין הבתרים נגזר על ישראל ועבדום ועינו אותם ארבע מאות שנה ובאמת לא היו במצרים אלא רד\"ו שנה, וכיצד השלימו זמן הגלות הנקצב להם בגזירת הקב\"ה. ונאמרו בדברי המפרשים תירוצים שונים, רש\"י ז\"ל כתב בפ' לך לך דחשבינן תחלת הגלות מזמן לידת יצחק. ויש שכתבו לתרץ כי קושי השעבוד השלים את הזמן. ומקצת המפרשים כתבו דבאמת לא נשלם עדיין זמן הגלות בצאתם ממצרים, כדמוכח במדרשי חז\"ל שהקב\"ה דילג על הקץ, ומה שנותר עדיין להשלים מכח מה שנגזר עליהם בברית בין הבתרים משלימין ישראל בשאר הגליות."},{"passage_id":"vayikru2_c28be554_p4","passage_content":"ועל תירוץ זה קשה לכאורה שהרי מפני חטאינו גלינו מארצנו, ואילו לא היו ישראל. חוטאים לא היו גולים, ואם כן כיצד היתה מתקיימת גזירת ת' שנה אילו לא חטאו ישראל. ותירץ מרן זיע\"א בספה\"ק דברי חיים שאם היו ישראל זוכים היו מכריעים בשמים כאחד משאר תירוצים, או דחשבינן ת' שנה מלידת יצחק, או דקושי השיעבוד השלים ולא היו זקוקים לגלות בעבור כן. וכיון שלא זכו גרם החטא לפסוק כתירוץ זה ששאר הגליות משלימין, עכתדה\"ק."},{"passage_id":"vayikru2_c28be554_p5","passage_content":"והנה בגמרא שבת (דף פ\"ט ע\"ב וכ\"ה בב\"ר פפ\"ו ובתנחומא פ' וישב) איתא ארחב\"א אר\"י ראוי היה יעקב אבינו לירד למצרים בשלשלאות של ברזל (פירש\"י כדרך הגולים שהרי עפ\"י גזירת גלות ירד לשם) אלא שזכותו גרמה לו דכ' (הושע י\"א) בחבלי אדם אמשכם בעבותות אהבה ואהיה להם כמרימי עול על לחייהם ואט אליו אוכיל (וכתב המהרש\"א ז\"ל שם שבזכותו של יעקב משכו אותו בחבלי אדם דהיינו ע\"י יוסף וכו',  ואהיה להם כמרימי עול וכו' ר\"ל כפרה זו החורשת כשבאים ליתן לה מאכל מרימין ומקילין העול מעל צוארה שתוכל לאכול בנקל, ולפעמים המאכל רחוק ממנה ומטה לה הנותן ומראה לה שתלך לשם אל האוכל, כן עשה הקב\"ה ליעקב שהראה והטה אליו שם אוכל כדי שיבא לשם. כמ\"ש וכלכלתי אותך שם כי עוד חמש שנים רעב וכו' פן תורש אתה וביתך). עכ\"פ מבואר מזה דגזירת הגלות אפשר שתתקיים באחד מב' הדרכים, הדרך הא' ע\"י מלחמה שהולכים שבי לפני צר אסורים בשלשלאות של ברזל, והדרך הב' שאם הזכות גורם מסבב הקב\"ה שיצאו ישראל בגולה מחמת כי כבד הרעב בארץ, וכאשר עשה הקב\"ה ליעקב אע\"ה שנגזר עליו ללכת בגולה, ומחמת זכותו הגדולה חיסך עליו הקב\"ה שלא ירד והוא אסור באזיקים, אלא נמשך למצרים בחבלי אדם בעבותות אהבה בסבת הרעב."},{"passage_id":"vayikru2_c28be554_p6","passage_content":"ובזה נבוא אל הביאור דהנה בצאת בני ישראל ממצרים היה הדבר גלוי וידוע להם כי עדיין לא שלמו ימי גלותם אשר נגזרו עליהם בברית בין הבתרים, אלא שדילג הקב\"ה על הקץ, ועדיין צריכים הם להשלים אותו הזמן החסר לתשלום גזירת ת' שנה, ועתידין הם ללכת בגולה בזמן מן הזמנים להשלים העת הנקצב. ולפי מה שנתבאר תתכן סיבת יציאתן בגלות או בדרך מלחמה כבולים בשלשלאות של ברזל ומובלים כשבויי חרב או בסבת רעב כבד בארץ אשר יהיו מוכרחים לצאת לחו\"ל. ובזה היה להם לישראל מקום להתנחם אף שהיה נודע להם שהם עתידין לגלות, מ\"מ אפשר לא תהיה ירידתן בגלות אלא בדרך כבוד בסיבת הרעב. אך כאשר הובטח להם ונתתי גשמיכם בעתם וגו' ואכלתם לחמכם לשובע, א\"כ שוב לא יתכן שתהיה ירידתן לגולה בסיבת הרעב, שהרי הם מובטחים ועומדים לשפע מאכל ומשתה, לשובע ולא לרזון, וא\"כ מכח הבטחה זו נולד להם החשש שבהכרח תתקיים בהם גזירת הגלות העתידה לבא עליהם באופן הא', דהיינו בדרך מלחמה שינהגו אותם כבולים בשלשלאות של ברזל."},{"passage_id":"vayikru2_c28be554_p7","passage_content":"וז\"ש שמא תאמרו הרי מאכל הרי משתה אם אין שלום אין כלום, כי ריבוי המאכל והמשתה היא הנותנת לחשוש להעדר השלום, שהרי שוב לא תתכן הליכתן בגולה בסבת הרעב, ובע\"כ תהיה סיבת ירידתן מחמת שאין שלום, כי יבואו עליהם האויבים למלחמה ויורידום לגלות כבולים בשלשלאות מחמת הגזירה. וכלפי חשש זה הבטיח הכתוב ונתתי שלום בארץ, כי אין להם להתיירא מפני המלחמה, שהרי מה שהבטיחן הכתוב על שפע המאכל והמשתה תנאי הן הן הדברים כאמור בראש הענין אם בחקתי תלכו ואת מצוותי תשמרו וגו', ובזמן שישמרו ישראל מצוות ה' ותורותיו ינצורו אזי אין צורך כלל שילכו בגולה להשלים מה שנגזר עליהם בברית בין הבתרים, דמפני חטאינו גלינו מארצינו, ואילולא החטא היו פוסקים בשמים כאותו תירוץ שכבר השלימו ישראל ת' שנה שנגזרו עליהם דחשבינן להו מלידת יצחק, או שאר תירוצים, כמ\"ש הדברי חיים זלה\"ה הנ\"ל. וזהו שכתב רש\"י ז\"ל ת\"ל \"אחר כל זאת\" ונתתי שלום בארץ, היינו אחרי שהתנה הכתוב אם בחקתי תלכו ושוב לא יהיו ישראל צריכין להשלים גזירת הגלות כלל, לא בסיבת חרב ולא בסיבת הרעב, וא\"כ לא תהיה הבעחת שפע המאכל והמשתה גורמת להשבתת השלום, כי ישבו ישראל בארצם שלוים ושקעים ושלום אמת יהיה להם."},{"passage_id":"vayikru2_c28be554_p8","passage_content":"ועפי\"ז נבא אל הביאור גם בדברי המד\"ר הה\"ד חשבתי דרכי וכו', דהנה דוד המע\"ה ידע דאכתי לא שלמו ימי הגלות והשעבוד שנגזרו על בני ישראל בברית בין הבתרים ועבדום ועינו אותם ת' שנה, ועדיין צריכים הם להשלים הזמן בגלויות אחרות. וכרועה נאמן חשב בתום לבבו מחשבות בעצה כדת מה לעשות לפעור את ישראל מעול הגלות הקשה הרובץ על צוארם. ועלתה תמיד במחשבתו שיקבל הוא על עצמו לסבול יסורי גלות כדי לכפר בצער הגלות שלו על כלל ישראל, ולפטרם ע\"י כן מלצאת בגולה עוד (וכהא דאיתא בגמרא סנהדרין ל\"ט ע\"ב כך דרכו של המקום ב\"ה ברוב רחמיו וחסדיו שאם נגזרה גזירה על כלל ישראל הרי מייסר את הצדיק ביסורים כדי למרק עוונותיהם של ישראל). ולכוונה זו היה דוד המע\"ה מחשב בכל יום ויום ללכת למקום פלוני ולבית דירה פלונית, הם בתי קרקסיאות וטרטיאות וכדומה, מקום מדורן של אנשי רשע, כי אין לך גלות גדולה לצדיקים מלהיות במקומות המטונפים ההם, אשר שם סביב רשעים יתהלכון. וחשב דהמע\"ה לצאת ידי חובה ביסורין אלו עבור גזירת הגלות המועלת על כלל ישראל. אבל אחרי כן חזר בו ממחשבה זו והיו רגליו מוליכות אותו לביהמ\"ד, כי התבונן בכך שכל מה שעתידין ישראל לגלות אינו אלא אם יחטאו, אבל אם יהיה בתורת ה' חפצם כבר הבעיחן הכתוב אם בחקתי תלכו וגו' ונתתי שלום בארץ, שיהיה העיקר כאותם תירוצים שכבר נשלמה גזירת הגלות, וא\"כ מוטב ללכת לבתי מדרשות לעסוק בתורה, ולהשפיע בכך על בני ישראל להכניס בקרבם אהבת הבוי\"ת לעבדו באמת, ואז לא יהיו זקוקים ללכת בגולה עוד. וא\"ש דשייכא דרשה זו לפרשת אם בחקתי, שהרי מחמת האמור בפרשה זו הוא שנמלך דהמע\"ה בדעתו והיו רגליו מביאות אותו לבתי כנסיות ולבתי מדרשות, משום שכבר הבטיח הכתוב ונתתי שלום בארץ, ואין הכרא שתתקיים בהם גזירת הגלות עוד."}]},{"dvar_torah_id":"vayikru2_367b7781","title":"הכנה לקיום מצוות והשתוקקות לעבודת ה'","summary":"דוד המלך חשב דרכיו, אך רגליו הביאו אותו לביהמ'd מעצמן, כי היה משתוקק לעבודת ה'. כאשר רצה לעסוק בדרכי הרשות, היה צריך הכנה. כך יובן אם בחקותי תלכו, שכשהאדם מקיים מצוות, יוכל ללכת מעצמו ללא הכנה.","contents":[{"passage_id":"vayikru2_367b7781_p1","passage_content":"שנת ה'תרצ\"א לפ\"ג"},{"passage_id":"vayikru2_367b7781_p2","passage_content":"אם בחקותי תלכו וגו' איתא במד\"ר הה\"ד חשבתי דרכי ואשיבה רגלי אל עדותיך אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לביהמ\"ד. וצ\"ב דהיתכן שדהמע\"ה לא הלך מעולם במכוון לביהמ\"ד, רק תמיד בדרך זה, שהי\"ל מחשבות אחרות, ואח\"כ מתוך דרכי הרשות בא לביהמ\"ד. הלא עינינו הרואות בהיפוך שכל בר ישראל יש לו תמיד מחשבות טובות ללמוד התוה\"ק ולקיום המצוות, אך מפני מניעות היצר כי רבו מאד על האדם, לזאת מתרמי לפעמים ח\"ו אשר לא יוכל להוציא מחשבתו הטובה מכח אל הפועל, אבל עכ\"פ המחשבה יש לכ\"א. ובפרט לדהמע\"ה שהקדיש כל ימיו לתורה ועבודת השי\"ת בפועל ג\"כ, היתכן שלא עשה כ\"ז מתחילה במחשבה רצויה."},{"passage_id":"vayikru2_367b7781_p3","passage_content":"והנ\"ל דהנה ידוע אשר אם האדם רוצה לקיים איזו מצוה ממצוות הבוב\"ה צריך לזה התחזקות גדול והכנה לזרז א\"ע, יען כי הגוף מקושר בהבלי עוה\"ז ותאוות הגשמיים. אבל לדברי הרשות אין צריך שום זריזות והכנה, כי אדרבה הגוף מושך אותו מעצמו לזה. אבל באדונינו דהמע\"ה היה בהיפוך, כי מחמת שהוא השלים א\"ע לעבודת הבורא ב\"ה, ולא הי\"ל שוב התנגדות ממניעת היצר, ולזה אדרבה היה גופו משתוקק רק לעבודת הבוב\"ה וקיום המצוות, ולא הי' צריך לזה שום הכנה. רק כשרצה לעסוק באיזה דבר הרשות לזה לא היה גופו מושכו כנ\"ל, לזה היה צריך להתבונן ולהכין עצמו מקודם. ולזה יתפרש חשבתי דרכי, ר\"ל כשהוצרכתי לילך בדרכי הם דרכי הרשות הוצרכתי לחשב מקודם ולעשות לזה הכנה וזריזות, אבל ואשיבה רגלי אל עדותיך, כשרציתי לילך לקיים איזו מצוה אזי הלכו רגלי מעצמם בלי שום התבוננות."},{"passage_id":"vayikru2_367b7781_p4","passage_content":"וז\"פ המדרש ג\"כ בכ\"י הייתי מחשב ואומר לבית פלוני וכו' לזה הייתי צריך לחשב, ורגלי מביאות אותי לביהמ\"ד, ר\"ל כשארצה לילך לביהמ\"ד רגלי מביאות אותי מעצמן כנ\"ל. ולזה מסמיכו המדרש על הכתוב אם בחקתי תלכו ר\"ל כשתקיימו מצוות הבוב\"ה ג\"כ עז\"ה שכשתבוא לידכם איזה מצוה לקיימה תלכו מעצמכם שלא תצטרכו לזה שום הכנה ומחשבה ע\"ד שפי' האה\"ח הק' תלכו בתמידות מל' ובלכתך בדרך שיהיה ההרגל שלו כך ודו\"ק."}]},{"dvar_torah_id":"vayikru2_6c43042a","title":"מעלת מחשבות דוד המלך בעבודת ה'","summary":"דוד המלך חשב דרכיו כדי להכניע את אויבי ישראל, והבין שסגולת עבירה לשמה יכולה להביא ברכות על ישראל. לימוד תורה, אף אם שלא לשמה, מהווה כלי להפעיל דינים על שונאיהם, והקב\"ה מנחה את רגליו לבתי מדרשות.","contents":[{"passage_id":"vayikru2_6c43042a_p1","passage_content":"באופן אחר יתבאר המד\"ר הה\"ד חשבתי דרכי ואשיבה רגלי אל עדותיך אמר דוד בכל יום הייתי מחשב למקום פלוני וכו' אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות. והוא פלאי היתכן כי דהמע\"ה חשב מחשבות בכ\"י ללכת לאותם מקומות, הלא אף איש המוני ההולך לשם אינו מחשב על כך מתחילה, אלא שיצרו מושכו ומפתהו לשם, ועאכו\"כ לא יאומן על המלך החסיד עליו השלום שחשב מחשבות כאלו בכל יום."},{"passage_id":"vayikru2_6c43042a_p2","passage_content":"ב) עוד במד\"ר ד\"א חשבתי מה שכתבת לנו בתורה אם בחקתי תלכו מה כתיב תמן ונתתי שלום בארץ, ואם לא תשמעו לי ויספתי ליסרה אתכם. חשבתי ברכות חשבתי קללות ברכות מא' עד ת' קללות מן ו' ועד ה' ולא עוד אלא שהן הפוכות. הא כיצד אם זכיתם אני הופך לכם את הקללות לברכות, אימתי כשתשמרו את תורתי הה\"ד אם בחקתי תלכו. וצ\"ב להבין דברי המדרש דלפי זה נמצא שקיים דהמע\"ה מצוות התורה מחמת שחישב מתן שרן של מצוות, וא\"כ היתה עבודתו עמלק\"פ, אתמהה."},{"passage_id":"vayikru2_6c43042a_p3","passage_content":"ג) ועוד צ\"ב מה שדרשו אם זכיתם אני הופך לכם את הקללות לברכות אימתי כשתשמרו את תורתי, דלכאורה אם ישראל משמרין תורת ה' א\"כ אין כאן מקום לקללות כלל לחול, ומה צורך להפוך להם את הקללות לברכות, מוטב לא יראו ולא ימצאו הקללות בעולם כלל, ויהיו נשפעים עליהם ברכות ממעון הברכות."},{"passage_id":"vayikru2_6c43042a_p4","passage_content":"ונראה דב' הפירושים במדרש זה עולים בקנה אחד ועל קוטב אחד יסובו, מר אמר חדא ומר אמר חדא ולא פליגי, אלא דמשמעות דורשין איכא בינייהו, והא בהא תליין. וביאור הענין עפ\"י מש\"כ אבא מארי זלה\"ה בקדושת יו\"ט פרשת בשלח בהא דאיתא בזה\"ק פ' ויקהל (רע\"ו ע\"א) לפרש הפסוק (משלי ד') ואורח צדיקים כאור נוגה וגו' דרך רשעים כאפלה וכו', מה בין אורח לדרך הא אוקמוה, אבל אורח הוא דהשתא אתפתח ואתגליא ואתעביד בההיא אתר אורח דלא כתישו ביה רגלין מקדמת דנא, דרך וכו' דכתשין ביה רגלין כל מאן דבעי. וע\"ד לצדיקייא קרי אורח דאינון הוו קדמאי למפתח האי אתר וכו'. דרך איהו פתוח לכולא דכתשין ביה כל מאן דבעי ואפילו חייבין, עכ\"ל הזוה\"ק. וקשה על זה לכאורה הלא מצינו שאמר דהמע\"ה כי יודע ה' דרך צדיקים וא\"כ מצינו ג\"כ אצל צדיקים הלשון דרך."},{"passage_id":"vayikru2_6c43042a_p5","passage_content":"וביאר עפ\"י מ\"ש בספה\"ק אגרא דכלה הפסוק ראה אנכי נותן לפניכם היום ברכה וקללה, דהנה אין שום דבר נעשה רק מסגולות התורה כי פעולת המצוות לעורר כל הטובות, וסגולת העבירות לעורר רע ח\"ו, והנה אם יצטרך האדם לעורר רע כדי לפעול נקמות ברשעים מה יעשה, אם יעשה המצוה הנה סגולת המצוה לעורר רק טוב, ואם יעשה עבירה הרי אסור לעשותה. וכ' הוא ז\"ל שקיבל מרבותיו שהפעולה הזאת לפעול נקמות ברשעים נעשית ע\"י עבירה לשמה, דהיא בעצם עבירה וסגולתה לעורר הרע אבל הרע ההוא הוא לטוב לישראל ויחול על ראש הצוררים המעיקים לישראל ועי\"ז ימשך הטוב לישראל, כי באבוד רשעים רנה. וזש\"ה ראה אנכי נותן לפניכם, ר\"ל אנכי נותן בידכם היום לפעול את הברכה לישראל ואת הקללה לשונאיהם, וע\"ז אמר איך תהי' הפעולה את הברכה אשר תשמעו וגו', ועי\"ז יבואו הברכות, והקללה תפעלו לשונאיהם אם לא תשמעו אל מצוות ה' וסרתם מן הדרך, ירצה שההסרה מן הדרך תהיה ג\"כ באופן \"אשר אנכי מצוה אתכם\" דהיינו שתהיה עבירה לשמה, שהיא ג\"כ ציווי הקב\"ה."},{"passage_id":"vayikru2_6c43042a_p6","passage_content":"ועפ\"י זה מבואר מ\"ש דהמע\"ה כי יודע ה' דרך צדיקים, ר\"ל שהשי\"ת יודע מה שהצדיקים עושים לפעמים כמעשה הרשעים והולכים בדרכם, כדי שעי\"ז דרך רשעים תאבד, דזוהי סגולת עבירה לשמה לפעול רעות לשונאי ישראל. ובזה יתפרש גם מ\"ש דהמע\"ה לו עמי שומע לי ישראל בדרכי יהלכו כמעט אויביהם אכניע וגו', שאם ישראל ישמעו לי ב\"דרכי\" יהלכו ר\"ל אפילו בעת שעושין כמעשי הרשעים המרומז במלת דרך גם אז ישמעו לי, שתהיה עבירה לשמה, אז כמעט אויביהם אכניע, כי זוהי סגולת עבירה לשמה להכניע באמצעותה שונאי ישראל, עכתדה\"ק עיי\"ש שהאריך בזה."},{"passage_id":"vayikru2_6c43042a_p7","passage_content":"ועפ\"י דרכו בקודש נבא אל הביאור בענינינו, דהנה דהמע\"ה רועה ישראל הנאמן היה חושב מחשבות בעצה כדת מה לעשות כדי לנצח את אומות העולם המצירים לישראל ומעיקים להם, והתבונן בדבר כי ניתן להתגבר עליהם ולהכניעם באמצעות עבירה לשמה. וזהו שאמר דהמע\"ה בכל יום ויום הייתי מחשב לבית פלוני וכו' אני הולך, כלומר שהיה מחשב ומתבונן כי היה ראוי לו לילך בעצה זו של עשיית עבירה לשמה, כדי לנצח באמצעות כן את שונאי ישראל הקמים עליהם, והיינו דקאמר למקום פלוני וכו' אני הולך, כי הליכה יאמר גם על הליכה בעצה, כמ\"ש הרמב\"ן ז\"ל בפרשת שמות עה\"פ וילך איש מבית לוי שהוא ענין הליכה בעצה, וכאמרז\"ל שהלך בעצת בתו. והיה דוד המלך מתהלך בעצה זו וחושב מחשבות כי אילו היה עושה עבירה לשמה היה בידו הכח לגבור על הרשעים."},{"passage_id":"vayikru2_6c43042a_p8","passage_content":"ומובן היטב מה שדרש לה המד\"ר מדכתיב חשבתי דרכי ואשיבה רגלי אל עדותיך, דיליף לה ממה שאמר חשבתי דרכי, דלכאורה קשה הלא בצדיקים ראוי לכתוב אורח, דדרך כתיב גבי רשעים כמבואר בזה\"ק הנ\"ל, וע\"כ לומר דגם צדיקים יש אשר יעשו לפעמים כמעשי הרשעים וילכו בדרכם, כדי להשיג ע\"י עבירה לשמה סגולה זו להמשיך מפלות על הרשעים כמבואר בקדוי\"ט. והיינו דדריש מדכתיב חשבתי \"דרכי\" שאמר דוד בכ\"י לבית פלוני אני הולך כדי להשפיע דינים על הרשעים באמצעות עבירה לשמה, ואשיבה רגלי אל עדותיך שהיו רגלי מביאות אותי לביהמ\"ד לעסוק בתורה."},{"passage_id":"vayikru2_6c43042a_p9","passage_content":"ויתבאר דהנה בגמרא (פסחים דף נ' ע\"ב) איתא דאר\"י א\"ר לעולם יעסוק אדם בתורה ובמצוות אעפ\"י שלא לשמה שמתוך שלא לשמה בא לשמה. וידוע מה שהקשו המפרשים דכיון דכל טעמא שהתירה תורה לימוד שלא לשמה הוא משום דמתוך שלא לשמה יבא לשמת א\"כ מה זה שאמר \"לעולם\" יעסוק אדם בתומ\"צ שלא לשמה, הלא אסור ללמוד שלא לשמה \"לעולם\", דלא הותר אלא באופן שיבא לשמה. והנה התוספות בכ\"מ נתקשו במאמר זה שהוא סותר אל מה שאמרו ז\"ל כל הלומד של\"ש נוח לו שלא נברא וכתבו לחלק בזה (עי' סוטה כ\"ב ע\"ב וברכות י\"ז ע\"א). והנראה דהנה באמת עצם לימוד התורה שלא לשמה הוא עוון פלילי, שמערב פניותיו וטובת הנאותיו בעבודת השי\"ת, אלא דמכיון שהוא עושה כן כדי להגיע אל לימוד תורה לשמה התירתו תורה. וביאור הדבר בהקדם מ\"ש ק\"ז זלה\"ה בייטב לב פ' צו עובדא מק\"ז בעל ישמח משה זלה\"ה וזלה\"ק, פעם אחת אירע כשהלך וישב ללמוד נתערב בלבו איזה מחשבה להנאתו לחדש איזה דבר להתנאות וכדומה, אז גמר בלבו כיון שזה לא לשמה לא אלמוד עתה, ורצה לילך בטל. ושוב אמר עם לבבו וכי אני רשאי לילך בטל, הא כתיב והגית בו יומם ולילה, ואין אני רשאי להבטל ממנה אפילו רגע אחת, ואני מוכרח ללמוד. חזר ואמר אתה ה' יודע מחשבות לבי אם לא מכח שאני מחוייב לקיים מצות והגית בו לא הייתי לומד עתה, מחמת כוונת הנאתי, רק מכח שאני מחוייב לקיים מצוותך, א\"כ כוונתי לשמה לקיים רצונך, ואם אפילו יתערב בכל זה כוונה בלתי רצויה וענוש אענש ע\"ז, עכ\"ז אני מחוייב בדבר ללמוד, ושלא לילך בטל אפילו רגע, א\"כ ממילא כוונתי לש\"ש. אז אמר בלבו עתה אני מבין מה מאד עמקו מחשבותם של חז\"ל שאמרו לעולם יעסוק אדם בתורה אפילו שלא לשמה, כלומר אפילו אם עולה בלבו שילמוד להנאתו שלא לשם שמים, לא יאמר אלך בטל כי אם ילמד, שהרי אינו רשאי לילך בטל והוא מוכרח ללמוד אפילו בכוונה בלתי רצויה, א\"כ בהעלותו על לבו כך הרי כוונתו רצויה לשם שמים. וכ\"ש שמתוך שלא לשמה בא לשמת עכ\"ד, והבן כי זה שכל עמוק."},{"passage_id":"vayikru2_6c43042a_p10","passage_content":"והנה להשיג מעלת לימוד תורה לשמה בשלימות הוא דבר כבד מאד, דל\"מ פשוטי העם אין באפשרותם להשיג בחינה זו כלל, אלא אפילו לצדיקים בעלי מדריגות גבוהות קשה מאד לזכות להגיע לבחי' לשמה בשלימות, כי גדול מאד כחו של היצה\"ר המתגבר עליהם וכאמרם ז\"ל (סוכה נ\"ב ע\"ב) שהיצה\"ר מניח את אוה\"ע ומתגרה בישראל ובת\"ח יותר מכולת דכל הגדול מחבירו יצרו גדול הימנו. ובכל עת זורק היצה\"ר במחשבתו של אדם פניות שונות כל חד לפום דרגא דיליה להתכוון בלימודו לדברים שהוא משתוקק ומתאווה אליהם לפי ערכו ובחינתו. וזה שייך אפילו בגדולי עולם, דשלא לשמה מקרי לא בלבד היכא שהוא עושה מאהבת השכר או מיראת העונש, אלא אפילו כאשר הוא עושה המצוה למען השלמת הנפש, נמי הוה שלא לשמה, ולא מקרי לשמה בשלימות אלא כשכוונתו טהורה ונקייה בלתי לה' לבדו (ועי' בדברינו לעיל פ' תרומה עמוד רכ\"ז). ולא זכו להשיג מדריגת לשמה בשלימות אלא אותם האנשים אשר זכו לעקור את היצה\"ר כליל מלכם, כענין שאמרו ז\"ל כדוד (ב\"ב י\"ז ע\"א) שהרגו ליצרו דכתיב ולבי חלל בקרבי. וכן באברהם כתיב ומצאת את לבבו נאמן לפניך שהפך יצרו לטוב."},{"passage_id":"vayikru2_6c43042a_p11","passage_content":"ומ\"מ אף אלו שלא הגיעו לידי מדה זו ועדיין היצה\"ר אורב לנפשם ומבלבלם באמצע הלימוד בפניות שונות, אפ\"ה הם מתחזקים באמצע לימודם בבחינה זו, שסוף כל סוף הם חייבים ללמוד מחמת ציווי השי\"ת עליהם לעסוק בד\"ת בכל עת ועונה ובכל מצב ובחינה, ובהכרח עליהם ללמוד לקיים מצות הבוי\"ת, ובאותו זמן שהם מעלים מחשבה זו על לבם הוה למודם לשמה בשלימות, כדברי הישמח משה הנ\"ל. ועבור רגע זו שלומדים בשלימות לעשות נח\"ר לבוי\"ת ויתעלה שאמר ונעשה רצונו כדאי הכל, אף שקודם לכך וגם לאחר מכן למדו של\"ש, משום שחזקה עליהם התגברות היצה\"ר, מ\"מ אותו זמן שהם לומדים לשמה הוא חשיבות גדולה לפני בוכה\"ע."},{"passage_id":"vayikru2_6c43042a_p12","passage_content":"ובדברינו אפ\"ל מה שאמרו ז\"ל \"לעולם\" יעסוק אדם בתורה ובמצוות שלא לשמה, כי לבחינת לשמה ממש כמעט א\"א להגיע כי אם השרידים אשר זבחו את יצרם לגמרי כנ\"ל. וע\"כ הלימוד הוא שלא לשמה, אלא שכיון שלומדים כדי לקיים רצון הבורא ומעלה זאת במחשבתו באמצע הלימוד, על כן אמרו שילמוד תורה אעפ\"י שלא לשמה משום שמתוך שלא לשמה יבא לשמה, כלומר שבתוך ובאמצע הלימוד שלא לשמה יבא לשמה כאשר יעלה ברעיונו כי כל לימודו הוא מחמת שהוא מוכרח לקיים ציווי השי\"ת עליו."},{"passage_id":"vayikru2_6c43042a_p13","passage_content":"היוצא מכל זה כי לימוד התורה שלא לשמה בעצם הוא עוון פלילי, אלא שנצטוינו לעסוק בתורה בכל עת משום שנשיג לפעמים בחינת לשמה. וא\"כ הוי לימוד התורה שלא לשמה בחינת עבירה לשמה, שהרי באמת לימוד זה הוא עבירה, אלא שנצטוינו לעסוק בתורה של\"ש מחמת אותם הרגעים שנתעלה לעסוק בה לשמה. וא\"כ ניתן להשפיע באמצעות לימוד התורה דינים וגבורות על ראש שונאי ישראל, דזאת היא סגולת עבירה לשמה כמבואר בבנ\"י הנ\"ל. ובזה מבואר מאמר הגמרא בגיטין (דף ז' ע\"א) שלח ליה מר עוקבא לר' אלעזר בני אדם העומדים עלי (לחרף ולגדף) ובידי למסרם למלכות וכו' מהו שלח ליה (תהלים ל\"ז) דום לה' והתחולל לו דום לה' והוא יפילם לך חללים חללים השכם והערב עליהם לביהמ\"ד והן כלין מאליהם. ומסקו התוספות שם דהשכם והערב עליהן לביהמ\"ד היינו לעסוק בתורה, ובאמצעות עסק התורה הם כלין מאליהן. ולדרכינו טעם הדבר מובן היטב, דכיון דלימוד התורה הוא בחי' עבירה לשמה, על כן מסגולתו להכניע את הרשעים הקמים עליו."},{"passage_id":"vayikru2_6c43042a_p14","passage_content":"וזהו מה שאמר דוד בכל יום היינו מחשב למקום פלוני וכו' אני הולך, כמו שנתבאר שהיה מתבונן כיצד תעלה בידו לנצח את אויבי ה' הקמים על עמו ישראל, וחשב מחשבות לעשות עבירה לשמה שמסגולתה להדוף אויבי ה' ולהכניעם, והיו רגליו מוליכות אותו לביהמ\"ד לעסוק בתורה, כי בזכות עסק התורה יעלה בידו להמשיך מפנה ננחת על שונאי ישראל, כנ\"ל דלימוד התורה הוי בחינת עבירה לשמה. ואף כי דוד המע\"ה הרגו ליצרו כאמור לעיל, וזכה ללמוד תורה לשמה בשלימות, מ\"מ דברים אלו נאמרו בזמן שטרם זכה לבחינה זו של ולבי חלל בקרבי."},{"passage_id":"vayikru2_6c43042a_p15","passage_content":"ויתכן עוד לומר דגם אחרי שכבר זכה לזבוח את יצרו, והשיג ללמוד תורה לשמה, לא בעבור כך נגרע ערך תורתו, שלא יעלה עוד בידו לפעול רעות על ראש שונאי ישראל, דאין בדין דבעבור שהוסיף במעלה תנעל ממנו סגולה זו. ועל כן אפילו אחרי שהגיע לבחי' לשמה בשלימות לא החסיר הקב\"ה ממנו כח זה, שהיה בידו מאותו זמן שעדיין לא הגיע לבחי' לשמה בשלימות."},{"passage_id":"vayikru2_6c43042a_p16","passage_content":"ועפ\"י זה אפ\"ל כי דהמע\"ה לא ידע שעדיין יש בכח עסק התורה שלו להמשיך מפלות על שונאי ישראל, דאיהו סבר שמכיון שהרגו ליצרו שוב אין בידו מעלה זו, ועל כן היה מחשב ואומר למקום פלוני אני הולך, כדי לעשות עבירה לשמה, דתו אין לימוד התורה שלו בבחינת עבירה לשמה, אבל היו רגלי מביאות אותי לביהמ\"ד, כי הקב\"ה הנחהו בדרך אמת שלא יעשה שום פעולה אחרת חוץ מלימוד תוה\"ק, והיא הועילה לו לגבור על שונאיו. וז\"ש והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות, דהיינו מעצמן, אף שהייתי סבור בדעתי דלא סגי בלימוד התורה לכוונה זו, שהרי כבר זכה לבחי' לשמה בשלימות."},{"passage_id":"vayikru2_6c43042a_p17","passage_content":"ועתה נבא אל הביאור גם במה שדרשו להלן במד\"ר (קושיא ב') מהך קרא חשבתי מה שכתבת לנו בתורה אם בחקתי תלכו מה כתיב תמן ונתתי שלום בארץ ואם לא תשמעו לי ויספתי ליסרה אתכם, חשבתי ברכות חשבתי קללות וכו'. ולא עוד אלא שהן הפוכות הא כיצד אם זכיתם אני הופך לכם קללות לברכות וכו'. דדרשה זו הרי היא כמשלימה ומבארת לדרשה הקודמת הנ\"ל אמר דוד בכ\"י הייתי מחשב למקום פלוני וכו' אני הולך, וה\"פ דהאי מדרשא חשבתי מה שכתבת לנו בתוה\"ק אם בחקתי תלכו וכו', ומפרשה זו נראה להדיא כי סגולת המצוה להשפיע אך טוב, כדמסיים קרא ונתתי שלום בארץ וגו', ולהיפך העבירות סגולחן להמשיך רע, דכתיב ואם לא תשמעו לי ויספתי ליסרה אתכם וגו', ומחמת כן חשבתי דרכי למקום פלוני אני הולך לעשות עבירה לשמה להשפיע דינים על שונאי ישראל, דאל\"כ מנין אוכל להמשיך עליהם קללות, דבאמצעות המצוות אי אפשר."},{"passage_id":"vayikru2_6c43042a_p18","passage_content":"והיינו דקאמר חשבתי ברכות חשבתי קללות ברכות מא' עד ת' קללות מו' ועד ה' ולא עוד אלא שהן הפוכות אם זכיתן הריני הופך לכם קללות לברכות, היינו שאם תזכו ע\"י עבירה לשמה תהיה הקללה עצמה הבאה מכח העבירה נהפכת לברכה, במה שתחול על ראש שונאי ישראל. דכיון שבעצם עשיה זו עבירה היא, אלא שאתם עשיתם אותה מחמת ציווי הבוי\"ת תתהפך לברכה, שיחול אותו הרע על ראש שונאי ישראל. ואשיבה רגלי אל עדותיך, היא בחי' לימוד תורה שלא לשמה, שסגולתה להמשיך מפלות על ראש שונאי ישראל. וזוהי העצה לכלל ישראל להכניע שונאיהם השכם והערב עליהן לביהמ\"ד והם כלים מאליהם, כי ע\"י לימוד התורה מביאים עליהם השפעת דינים. השי\"ת יקרב לבבות בני ישראל לעבודתו, וירחם על שארית עמו ישראל בכל מקומות מושבותיהם, ונזכה לראות במהרה בישועת כל ישראל ושמחתן ובהתגלות כבוד שמים עלינו בב\"א."}]},{"dvar_torah_id":"vayikru2_7d48ac2c","title":"מדרשים על חובת שמירת תורה ומצוות","summary":"המדרש עוסק במחשבות דוד המלך על שמירת תורה ומצוות, מתן שכרן והפיכת קללות לברכות. יש דעות שונות בין האמוראים האם עדיף המתגבר על יצרו או זה שאין לו נטייה לרע. ההבנה היא שהשמירה על התורה מביאה לבריאה חדשה.","contents":[{"passage_id":"vayikru2_7d48ac2c_p1","passage_content":"אם בחקתי תלכו וגו' במד\"ר הה\"ד חשבתי דרכי ואשיבה רגלי אל עדותיך אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מוליכות אותי לבתי כנסיות ולבתי מדרשות הה\"ד ואשיבה רגלי אל עדותיך. וכתב היפ\"ת דדרשו כן מדכתיב תלכו דהול\"ל אם חקתי תשמרו עיי\"ש, אבל צ\"ב דאיך יתכן שהיה דהמע\"ה חושב מחשבות בכל יום לילך לאותן מקומות אלא שרגליו מוליכות אותו לביהמ\"ד, והרי בודאי היו כל מחשבותיו בלתי לד' לבדו וצ\"ב."},{"passage_id":"vayikru2_7d48ac2c_p2","passage_content":"ב) עוד איתא במד\"ר שם ר' הונא בש\"ר אחא אמר חשבתי מתן שכרן של מצות והפסדן של עבירות ואשיבה רגלי אל עדותיך, ר' מנחם חתנא דר\"א בר אבינא אמר חשבתי מה שכתבת לנו בתורה אם בחקתי חנכו, ומה כתיב תמן ונתתי שלום בארץ, ואם לא תשמעו לי, ומה כתיב תמן ויספתי ליסרה אתכם. ר' אבא ברי' דר' חייא בש\"ר יונתן אמר חשבתי ברכות חשבתי קללות ברכות מאל\"ף ועד תי\"ו קללות מן וי\"ו ועד ה\"א ולא עוד אלא שהן הפוכות, א\"ר אבין אם זכיתן הריני הופך לכם קללות לברכות, אימתי כשתשמרו את תורתי הה\"ד אם בחקתי תלכו, ע\"כ במדרש. וצ\"ב במאי פליגי הני אמוראי, ולמה לא ניחא לי' למר בדרשא דחבריה. גם צ\"ב איך יתכן שחשב דוד המלך ע\"ה מתן שכרן של מצות, וברכות וקללות, וזהו שהביאהו לידי קיום המצות, וכי ס\"ד שעשה דוד ע\"מ לקבל פרס."},{"passage_id":"vayikru2_7d48ac2c_p3","passage_content":"ג) עוד צ\"ב במדרש א\"ר אבין אם זכיתן הריני הופך לכם קללות לברכות, אימתי כשתשמרו את תורתי. והרי יש להקב\"ה ברכות די והותר לתת לישראל אם ישמרו את התורה, ולאיזה צורך יהפוך את הקללות לברכות, וטוב יותר שלא יהיו בעולם לגמרי וישלח לנו ברכות ממקור הברכות שהן ברכות בשרשן, ולא ברכות הבאות מהפיכת הקללות."},{"passage_id":"vayikru2_7d48ac2c_p4","passage_content":"ד) עוד במד\"ר ושמרתם ועשיתם אותם א\"ר חנינא בר פפא א\"ל הקב\"ה אם שמרתם את התורה, הריני מעלה עליכם כאילו עשיתם עצמכם, וצ\"ב הכוונה בזה."},{"passage_id":"vayikru2_7d48ac2c_p5","passage_content":"ה) עוד במד\"ר אם בחקתי תלכו ר' לוי בש\"ר חמא ב\"ר חנינא אמר חוקים שהם חקוקים על יצה\"ר וכו' אמר הקב\"ה תורה קרוי' אבן ויצה\"ר קרוי אבן וכו' האבן תשמור את האבן ע\"כ. וצ\"ב קישור דרשא זו לכאן."},{"passage_id":"vayikru2_7d48ac2c_p6","passage_content":"ו) גם יל\"ד בפסוק ואם עד אלה לא תשמעו לי ויספתי ליסרה אתכם שבע על חטאתיכם, ופירש\"י ויספתי ליסרה עוד יסורין אחרים, וצ\"ב דמבואר בפרטן שיסורים הן, ויספיק לומר ויספתי עוד שבע על חטאתיכם ומאי הכוונה בזה."},{"passage_id":"vayikru2_7d48ac2c_p7","passage_content":"ואפ\"ל דכל אלו המדרשים על קוטב אחד נאמרו, ויובן עפימ\"ש ק\"ז הישמח משה זלה\"ה בהפטורת פ' ראה, כי כבר נחלקו הקדמונים איזהו עדיף אם המתאוה ומתגבר על יצרו, או האינו מתאוה כלל, דלדעת הרמב\"ם ז\"ל מי שאינו מתאוה כלל ואין לו שום נטיה אל הרע הוא עדיף, כי הוא השלם במידותיו ובתבונתו וחסיד יתקרי, אבל חלקו עליו הרבה מהראשונים, דאדרבה המתגבר עדיף שעושה לכבוד קונו, משא\"כ מי שטבעו כך א\"כ במה עובד אדוניו. והנה אמרם ז\"ל בתו\"כ סו\"פ קדושים אל יאמר אדם אי אפשי בבשר חזיר וכו' מסייע להחולקים על הרמב\"ם, וממ\"ש במס' ב\"ב (דף י\"ז) ג' לא שלט בהן יצה\"ר אלו הן אברהם יצחק ויעקב, וי\"א אף דוד דבתיב ולבי חלל בקרבי, מבואר דיותר משובח מי שאין יצרו מתגבר עליו כלל. אבל באמת אלו ואלו דברי אלקים חיים, דהתחלת האדם ודאי העיקר כהחולקים, דאם נטבע כך מבטן שאין היצה\"ר מתגבר עליו א\"כ צדיק מה פעל, אלא ודאי שיותר טוב כשע\"י מלחמתו בחזקה כבשו כ\"כ עד שבא לבחי' דוד המע\"ה, וזה עדיף יותר מהלוחם כל ימיו והיינו כהרמב\"ם ז\"ל. כללו של דבר דבהתחלתו קיי\"ל כהחולקים שיותר טוב מי שלוחם עם יצרו, ובסופו קיי\"ל כהרמב\"ם ז\"ל שמשובח יותר מי שבא למדריגה זו שאין יצרו מתגבר עליו עוד ואין לו נטיה אל הרע כלל, אלא שהפכו גם ליצה\"ר לטוב. ופי' בזה כוונת הכתוב סוף דבר הכל נשמע וגו', דהאדם יש לו ב' שמיטות יצה\"ט אומר לו עשה כך עבוד בוראך ושמע למצותיו, והיצה\"ר אומר לו ההיפך, והוא שומע לדברי שניהן ובוחר באחד מהן אם לטוב אם להפכו, אבל סוף דבר ראוי להיות ולהגיע אל המדריגה שיהיה הכל נשמע את האלקים ירא ואת מצותיו שמור, ולא שמיעה אחרת כי זה כל האדם ר\"ל דרק זה הוא אדם שהוא תכלית המכוון בבריאה, משא\"כ הלוחם עדיין הוא רק מקצת אדם ולא נשלם עדיין וכו' עייש\"ד ז\"ל."},{"passage_id":"vayikru2_7d48ac2c_p8","passage_content":"ועפי\"ז יתבארו המדרשים הנ\"ל בשנאמר דהמ\"ד הראשון שבמדרש ס\"ל כהחולקים על הרמב\"ם, דיותר טוב מי שיש לו נטיה לרע ולוחם עם יצרו ומתגבר עליו, אבל דוד המע\"ה נאמר בו ולבי חלל בקרבי כאמרם ז\"ל שלא שלט בו היצה\"ר, וכתבו התוס' בב\"ב אין לפרש שלא שלט בהן כלל, דא\"כ היכי קבלו אגרא, אלא כדאמרינן במס' יומא (דף ל\"ח ע\"ב) מ\"ד רגלי חסידיו ישמור כיון שעבר אדם רוב שנותיו ולא חטא, שוב אינו חוטא, וה\"נ כיון שראה הקב\"ה באבות העולם ובדוד שהיו דוחקין עצמן כ\"כ להתרחק מן העבירה, סייעם הקב\"ה מכאן ואילך שלא שלט בהם יצה\"ר. אמנם לדיעה זו שבמדרש היה דור משתוקק אל ההתחלת המדריגה שהיה עומד בה בתחינתו, כשהיה לו עדיין מלחמה עם יצרו, כי רצה דוד המע\"ה לעבוד השי\"ת באופן היותר משובח ורצוי לפניו ית', ולדיעה זו יותר משובח הלוחם ומתגבר, וע\"כ אמר דוד בכל יום ויום הייתי מחשב לבוא למדריגה זו להשתוקק לילך לבית פלוני ולמקום פלוני, ולהתגבר אח\"כ על היצה\"ר, אבל לא היה בו מידה זו, אלא ורגלי מוליכות אותי לבתי כנסיות ולבתי מדרשות, כמ\"ש האוהחה\"ק שהיה דוד חושב לעשות עניניו ורגליו מוליכות אותו מעצמם אל בית המדרש לרוב החפץ והרצון והרגילות ופי' בזה אם בחקתי תלכו שהליכתם מעצמם תהיה אחריהם לרוב החשק והרגילות עיי\"ש. עכ\"פ השתוקק דוד על זה, כי זהו המשובח שבמדריגות בעבדות השי\"ת."},{"passage_id":"vayikru2_7d48ac2c_p9","passage_content":"והדיעה שני' שבמדרש ס\"ל כשיטת הרמב\"ם, דיותר טוב מי שאין לו נטיה לרע כלל, והוא השלם במידותיו ובתכונותיו, והביא לו דוד המלך ראיה לשיטה זו מן הפסוקים, וז\"ש חשבתי מה שכתבת לנו בתורה אם בחקתי תלכו, ומה כתיב תמן ונתתי שלום בארץ. ויובן עפימ\"ש האוהחה\"ק וז\"ל צריך לדעת אחר שכבר אמר וישבתם לבטח בארצכם, למה הוצרך לומר עוד ונתתי שלום בארץ, ותירצו בכמה אופנים עיי\"ש, ובאופן א' כתב ואולי שיכוין בזה על עם בנ\"י עצמם שלא יהיה להם פירוד לבבות, ויטע ד' ביניהם שלום וריעות. ולדרכנו אפ\"ל קרוב לבחי' זו, שהבפיח השי\"ת לנו אם נשתדל לילך בחקותיו שיהיה לנו שלום מן היצה\"ר האויב הפנימי, שזו היא המלחמה היותן גדולה כידוע מאמר החכם בזה, ואמחז\"ל לעולם ירגיז אדם יצ\"ט על יצה\"ר, וא\"כ איך אפשר לאדם להיות זוכה לשלום במלחמה זו, כיון שנצטוינו להלחם עמו תמיד. אמנם כפי שכתבו התוס' ב\"ב הנ\"ל, עפימ\"ש חז\"ל רגלי חסידיו ישמור וכו', וע\"כ כיון שראה הקב\"ה באבות העולם שהיו דוחקין עצמן כ\"כ להתרחק מהעבירה, מנע מהם המלחמה ההיא ולא שלט עליהם היצה\"ר עוד, וזו היא הבטחת הכתוב ונתתי שלום מן האויב הפנימי, שינוצח לגמרי ולא יתגבר עוד נערוך מנחמה נגדך, כי לא יתכן השלום באופן אחר, דאם ח\"ו ירצה האדם לעשות שלום עמו ע\"ד הפשרה, אז בדבר קל וקטן שישמע אליו יתוסף כחו ויתחזק ויתגבר למולו יותר, ותהיה המלחמה כבידה עליו יותר."},{"passage_id":"vayikru2_7d48ac2c_p10","passage_content":"וז\"ש הכתוב ואם עד אלה לא תשמעו לי ויספתי ליסרה אתכם שבע על חטאתיכם, ואפשר שירמוז הכתוב שחוץ מהעונשין המפורעין בכתוב, יתוספו עליכם עוד יסורין אחרים כפירש\"י ז\"ל, ואינם מבוארים בתורה אבל היסורים הם גודל ההתגברות היצה\"ר שיחזק עליכם באם תשמעו לו קצת. ומעתה המלחמה עמו סכנה כרוכה בצידה, וע\"כ יותר משובח מי שאין לו נטי' לרע כלל, ויש לו שלום מן היצה\"ר. וז\"ש דוד חשבתי מה שכתבת לנו בתורה אם בחקתי תלכו, ומה כתיב תמן ונתתי שלום בארץ, ואם לא תשמעו לי ומה כתיב תמן ויספתי ליסרה אתכם וגו'. ומזה מוכח דיותר טוב השלום, באופן שאין לו נטי' לרע ואין יצרו מתגבר לנגדו כלל שהרי זה מכלל התוכחות."},{"passage_id":"vayikru2_7d48ac2c_p11","passage_content":"ואפשר שהדיעה הג' שבמדרש ס\"ל כהכרעה שכתב ק\"ז זלה\"ה שכן רצונו ית' שילחום האדם בהתחלת עבודתו עם היצה\"ר, ויתגבר עליו כ\"כ עד שיהפכו לטוב כבחי' האבות הקדושים כנ\"ל. וז\"ש ר' אבין אם זכיתן הריני הופך לכם קללות לברכות, ויובן עפימ\"ש הרמב\"ן ז\"ל דשורש כל הברכות והטובות הן מעוה\"ז והן מעוה\"ב הם מתוה\"ק ומצות ומע\"ט, ושורש כל הקללות והעונשים ח\"ו הם מהסט\"א רל, דמקור הקללות ר\"ל ע\"י העוונות הם באים ע\"ד הכתוב תיסרך רעתך, ונמצא ע\"י שיזכה להיות הופך את היצה\"ר לטוב, ממילא יהיו מהופכים כל הקללות לברכות, כי לא יהיה דרך אחר כ\"א דרך התוה\"ק, והוא שורש כל הברכות. וזה אפ\"ל כוונת מאמר ר' אבין אם זכיתם הריני הופך לכם קללות לברכות, שזו הבטחה שיסייע השי\"ת להפוך את היצה\"ר שהוא מקור העונשין והקללות לטוב גמור ולברכות, ולא על עצם הקללות כוונו, כי אין צורך בהפיכתם, ויותר טוב שלא יהיו כלל, ויש להקב\"ה די והותר מאותן הברכות שהן ברכות משרשן, אלא על היצה\"ר כוונו כאן, ויש צורך גדול בהבטחה זו. והבטחה זו רמזה תוה\"ק במה שהקללות הם מוא\"ו ועד ה\"א והן הפוכות, לרמז שאם יזכו יהפוך ד' אותם והיצה\"ר יהיה כולו מהופך לטוב."},{"passage_id":"vayikru2_7d48ac2c_p12","passage_content":"והנה איתא בב\"ר בפ' בראשית (פר' י\"ד ס\"ד), וייצר ד' אלקים את האדם כתוב בב' יודין, ודרשו בו כמה דרשות, ואמרו שם שברא ד' את האדם בב' יצרים יצר טוב ויצה\"ר עיי\"ש. ומעתה אדם הזוכה להפכו כלו לטוב נעשה בריה חדשה, דמתחלה נברא האדם בב' יצרים, ועפי\"ז יתבאר המדרש אם בחקתי תלכו וכו' תקים שהם חקוקים על יצה\"ר וכו' התורה קרוי' אבן והיצה\"ר אבן האבן תשמור את האבן, ומסגולת שמירת התוה\"ק להפכו כלו לטוב כנ\"ל. וע\"כ אמרו במדרש ושמרתם ועשיתם אתם, אם שמרתם את התורה, הריני מעלה עליכם כאלו עשיתם עצמם, שעי\"ז תהיו בריאה חדשה, דהאדם נברא בב' יצרין, ואם תזכו להפכו לטוב, יהיה כאלו עשיתם את עצמכם לבריאה חדשה."}]},{"dvar_torah_id":"vayikru2_05df1f2c","title":"אם בחקתי תלכו: עקרונות התנהגות בתורה","summary":"הדבר תורה עוסק בחשיבות ההליכה בדרכי התורה, ומדגיש את תפקיד התורה בהנחיית האדם. דוד המלך מהווה דוגמה למי שחשב מחשבות טובות אך חזר בו כדי לשמור על קדושת התורה, ולא נמשך אחרי רשעים. יש להתרחק מעצות זרות ולשמור על דרך התורה.","contents":[{"passage_id":"vayikru2_05df1f2c_p1","passage_content":"אם בחקתי תלכו ואת מצוותי תשמרו ועשיתם אותם. יל\"ד דהוה סגי שיאמר הכתוב אם את חקתי ואת מצוותי תשמרו וגו', ותיבת תלכו יתירא היא לכאורה."},{"passage_id":"vayikru2_05df1f2c_p2","passage_content":"ב) במד\"ר (ר\"פ זו) איתא הה\"ד (תהלים קי\"ט) חשבתי דרכי ואשיבה רגלי אל עדותיך, אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות וכו'. והוא פלאי איך עלתה במחשבתו של דוד המע\"ה לסור למקומות כאלו, והרי לגודל דביקותו בהשי\"ת בכל עת ורגע היה ראוי שבל יראו ובל ימצאו בלבו מחשבות כאלו."},{"passage_id":"vayikru2_05df1f2c_p3","passage_content":"ג) עוד איתא במד\"ר (פל\"ה ד') אם בחקתי תלכו חקים שבהם חקקתי את השמים וארץ שנאמר (ירמיה ל\"ג) אם לא בריתי יומם ולילה חקות שמים וארץ לא שמתי, חקים שבהם חקקתי את השמש ואת הירח וכו',  וצ\"ב."},{"passage_id":"vayikru2_05df1f2c_p4","passage_content":"ונראה עפ\"י מה שביארנו הא דאיתא במסכת עבודה זרה (דף י\"ח סע\"ב) אמר ר' שמואל בר נחמני אמר ר' יוחנן אשרי האיש אשר לא הלך בעצת רשעים (תהלים א') זה אברהם אבינו שלא הלך בעצת אנשי דור הפלגה שרשעים היו וכו', ובדרך חטאים לא עמד שלא עמד בעמידת סדום שחטאים היו שנאמר (בראשית י\"ג) ואנשי סדום רעים וחטאים לה' מאד, ובמושב לצים לא ישב שלא ישב במושב אנשי פלשתים מפני שליצנים היו וכו', ע\"כ. ולכאורה דרשה זו תמוהה עד מאד, שהרי כך היא המדה לשבח את הצדיק בתוקף תהלות תפארתו ולספר מעלותיו הרמות ומדרגותיו הנשגבות, וא\"כ ממה שבחר הכתוב לשבח את אברהם אבינו עליו השלום ולאשרו בדבר זה שלא הלך בעצת אנשי דור הפלגה, ולא עמד בעמידתן של סדומיים, ולא ישב במושב הפלישתים, נראה כי שבחים אלו הם ממבחר מעלותיו, ועל כך יש להפליא דהלא שבח זה במה נחשב הוא לעומת המעלות הנשגבות אשר עלה ונתעלה האדם הגדול בענקים אברהם אע\"ה, שנלחם במסירות נפש נגד כל העולם כולו, והודיע והרגיל שמו יתברך ויתעלה בפי כל יושבי תבל. וכלפי כל המדרגות העליונות אשר להם זכה איתן זה, לכאורה אין נחשב לכלום שבח זה שלא הלך בעצת רשעי דור הפלגה ואנשי סדום והפלישתים. ומדוע שבק קרא כל הני שבחי אחריני דאיתנייהו באברהם ונקט שבח זה דייקא."},{"passage_id":"vayikru2_05df1f2c_p5","passage_content":"וביארנו דברי הגמרא דהנה בסנהדרין (דף ק\"ט ע\"א) איתא שאנשי דור הפלגה נחלקו לשלש כתות, אחת אומרת נעלה לרקיע ונשב שם, ואחת אומרת נעלה ונעבוד ע\"ז, ואחת אומרת נעלה ונעשה מלחמה, ע\"כ. ובאותיות דר\"ע איתא שהיתה ביניהם כת אחת שאמרה נעלה לרקיע ונשב בתוכו ונהיה כמלאכי השרת. ולכאורה כיצד השתתפו כל הכתות הללו יחד לבנות להם עיר ומגדל, בעוד שהיו דיעותיהם שונות זו מזו מן הקצה אל הקצה, אלו בנאוהו במטרה להלחם בהקב\"ה, או לעבוד שם ע\"ז, ואלו התכוונו לעלות לשמים ולהיות קדושים וזכים כמלאכי השרת ואיך היתה ביניהם שפה אחת ודברים אחדים, לפעול כאיש אחד למטרות שהן מנוגדות וסותרות זו לזו בתכלית."},{"passage_id":"vayikru2_05df1f2c_p6","passage_content":"ונראה כי לאמתו של דבר היתה לכל הכתות מטרה אחת למרוד בהקב\"ה, וכדאיתא בגמרא סנהדרין (שם) תנא כולם לע\"ז נתכוונו. אלא שטיכסו עצה כיצד ללכוד ברשת אשר טמנו את כל יושבי תבל מן הקצה אל הקצה. וזאת היה ידוע להם בבירור כי למטרה זו לא די להם באותם הכתות אשר קמו בגלוי למרוד בממ\"ה הקב\"ה, לאמר נעלה ונלחמה אתו בביתו, כי הבינו שבדרכים אלו לא יעלה בידיהם לצוד ברשתם את האנשים המאמינים בבורא העולם ית\"ש, ומה גם את ראש המאמינים אברם העברי אשר חזקה אמונתו כחלמיש צור, ובוז יבוז להבליהם וירחיק מעליהם דרכו."},{"passage_id":"vayikru2_05df1f2c_p7","passage_content":"ולזאת התחכמו להחלק לכתות שונות, כדי שידעו להלוך נגד רוחו של כל אחד ואחד מיושבי תבל, ולצורך כך יסדו והקימו נוסף לכל מפלגות המינים והאפיקורסים אשר הרימו בגלוי את נס המרד במלכות שמים, גם כת ומפלגה אשר התנשאה לאמר כי גם הם בעצה אחת עם בוני המגדל, אך כוונתם זכה וטהורה לשמים לשכון בשמי מרום עם שרפים חיות ואופני הקדש, ולהיות קדושים כמותם. וכל האנשים אשר אין את נפשם להסתפח אל שאר המפלגות, מפני שהם מאמינים בבורא עולם ואינם חפצים להתחבר אל כופרים פורקי עול מלכות שמים, יבואו להדבק באנשי הכת הלזו אשר שם שמים שגור בפיהם, ושם אלהים אחרים לא יזכירו לא ישמע על פיהם. ובאמצעות מפלגת הצבועים הזו קיוו בוני המגדל כי יעלה בידם להמשיך אחר עצתם את כל העולם כולו, ואף אברהם אע\"ה יסכים להתחבר אליהם לחזק דרכם ושיטתם, והוא יהיה להם לעזר רב להמשיך אליהם גם את מעט היראים המעוררין והנוקפין, כי מי יראה את אברהם אע\"ה יוצא להתחבר אליהם ולחזק ידי בוני העיר והמגדל ולא יצא אחריו."},{"passage_id":"vayikru2_05df1f2c_p8","passage_content":"ועל כך משבח הכתוב את אאע\"ה אשרי האיש אשר לא הלך בעצת רשעים הם אנשי דור הפלגה, כי אמנם שבח גדול הוא לו, אשר לא נתפתה להם להיות נמשך אחרי כזביהם ורשעתם, ולא אבה הלוך בעצתם, יהיה באיזה כסות עינים אשר יהיה, כי ידע והבין אשר ערום יערימו בפיהם לומר כי לטובה כוונתם, ובחובם טמון ארבם ועיניהם לעושות ללכוד את כל העולם ברשתם. כי זה כלל גדול הוא אשר מרשעים ומן המתחברים אליהם ומשתתפים עמהם יצא רשת ואף אם למראה עינים נדמה כי אדרבה רצונם להרבות כבוד שמים ולעשות פעלים לתורה ולתעודה אין זו אלא אחיזת עינים, ותחתיה תעמוד הבהרת צרעת הכפירה הממארת, וכל הירא את ה' באמת צא טמא יאמר להם ואל יקרב אל פתח ביתם."},{"passage_id":"vayikru2_05df1f2c_p9","passage_content":"ועל כן התרחק אאע\"ה מעצת אנשי דור הפלגה למפלגותיהם ולכתותיהם השונות הרחק כמטחוי קשת, והיא תוקף תהלתו ותפארתו, ועל זאת שבחו והללו נעים זמירות ישראל בשיריו, אשרי האיש אשר לא הלך בעצת רשעים, על אף שהתחכמו בתחבולות רשע להסתיר כוונתם האמיתית, כדי לגנוב את לבבו ולהעות דעתו אליהם, לא שעה אליהם ולא פנה אל רהבים ושטי כזב."},{"passage_id":"vayikru2_05df1f2c_p10","passage_content":"וכיו\"ב יתבאר מה שהכתוב משבחו ובדרך חטאים לא עמד, ודרשו חז\"ל אלו אנשי סדום שנאמר בהם רעים וחטאים לה' מאד. דהנה אנשי סדום לא היו מכסים פשעיהם בערמה ובמרמה, אלא היו רעים וחטאים בפרהסיא לעין כל, בחקקם להם חוקי און ומשפטי רשע, ועל פיהם דנו דייני סדום כל ריב וכל נגע במשפע מעוקל ומסולף. ולכאורה לא היתה הסכנה גדולה כ\"כ אילו היה אאע\"ה הולך בין אנשי סדום פן ילכד ברשעתם ח\"ו, כי לפי שזדון רשעם לכל גלוי אין מקום לטעות אחריהם. וא\"כ יש לשאול מדוע לא הלך אאע\"ה לסדום ולבנותיה כדי להחזירן בתשובה, הלא זה היה דרכו של אאע\"ה לעשות נפשות לתורה להכניסן תחת כנפי השכינה, כאשר הכתוב מעיד ואת הנפש אשר עשו בחרן, ובלי ספק כי בכוחו ובזכותו הגדולה של אאע\"ה היה עולה בידו להכניס בקרבם הרהורי תשובת ולעוררם לעזוב דרכם הרעה. ותגדל התמיהה אחרי רואינו כמה התעצם אאע\"ה בתפלתו על אנשי סדום, והרבה להעתיר בעבורם אולי יש חמשים צדיקים וכו' עד עשרה. ואם היה בכח עשרה צדיקים מצדיקי סדום אשר ודאי לא היו מופלגים כ\"כ בצדקם להגין על העיר כולה, כאשר הבטיחו הקב\"ה לא אשחית בעבור העשרה, עאכו\"כ שהיתה מועלת זכותו הגדולה של אברהם אע\"ה להגין בעדם. ומצינו שהכתוב משבחו ומאשרו אשר טוב עשה במה שנמנע מלעמוד בעמידת הסדומיים וטעמא בעי."},{"passage_id":"vayikru2_05df1f2c_p11","passage_content":"אמנם הנה אברהה אע\"ה היה ירא כי אה ילך לסדום כדי להטותה לתשובה, פן ואולי ישפיעו אנשי המקום מדרכיהם הרעים עליו ועל האנשים אשר אתו עמו, הה כל אותה הנפשות אשר גייר והכניס תחת כנפי השכינה. כי אם רוצים להשפיע על רשעים יש צורך שיתאים עצמו אל דרכיהם ותהלוכותיהם ומנהגיהם, ולוותר על קצת מנהגים ודינים דרכים והנהגות המקובלות והמסורות לנו, כדי שימצא חן בעיניהם ויעשו דבריו רושם בלבבם. ובהעלותו כ\"ז אל לבו החליט כי מוטב לו שלא יעמוד בעמידת הסדומיים, על אף כל התועליות שיצאו מזה. ואף אם אולי לו לעצמו לא תזיק התקרבותו אליום, מורא עלה על ראשו כי צדיקי סדום אשר ודאי הולכים בדרך הפשרות והוויתורים יזיקו לאנשים אשר עמו, אשר ילמדו מדרכיהם. ויותר מזה חשש פן ייפוק מיניה חורבא שתתפשט שיטת הפשרות והוויתורים בקרב ישראל בדורות הבאים."},{"passage_id":"vayikru2_05df1f2c_p12","passage_content":"ובדרך זו יבואר גה המד\"ר בפרשתן הה\"ד חשבתי דרכי ואשיבה רגלי אל עדותיך וכו' כי הנה דוד המע\"ה היה משתוקק ומתאוה להשפיע תורה וקדושה בכל העולם, וחשב מחשבות לבל ידח ממנו נדח, ולפיכך היה חפץ להמשיך אל הקדושה אף את האנשים שכבר סרו מדרך התורה, והלכו בעצת רשעים. ולכוונה זו הי' חושב ואומר בכל יום למקום פלוני ולבית דירה פלונית אני הולך, כדי לקרב את הנשמות הנדחות שנטמעו ונשתקעו במקומות הטומאה. אמנם חזר והתבונן כי כדי שיוכל למשוך לבות האנשיה החטאים בנפשותם לתורה ולקדושה, חייב הוא להתדמות אליהם במקצת, ולנהוג בנימוסיהם ובהרגליהם, כדי שתהיה לו איזה שייכות וקירבה עמהם, ורק באופן כזה ימצא מסילות ללבבם לעוררם בתשובה. ובראותו זאת חזר וניחם על מחשבתו הקודמת, והיו רגליו מוליכות אותו לביהמ\"ד כי אם יש הכרח לוותר על הדרך הישן והמקובל אף במקצת מן המקצת, ולהתדמות אליהם לנהוג כמותם, אזי ההפסד מרובה מן הריוח, ומוטב ללכת לביהמ\"ד ללמוד תורה, ולהחזיק בדרך אשר הלכו ראשונים כמלאכים, ומיניה לא יזוע. ומ\"י לימוד התורה בבית המדרש בקדושה ובטהרה יתגבר כח הקדושה על כוחות הטומאה, וימשכו אותם הנשמות מעצמם אל התורה, ואז יש ריוח אל הקדושה שנתוספו אליה נשמות יקרות שהיו עשוקות בעמקי הקליפות."},{"passage_id":"vayikru2_05df1f2c_p13","passage_content":"ובדרך זו נלך לפרש כוונת הכתוב אם בחקתי תלכו, עפ\"י דאיתא במד\"ר פרשת שמות עה\"פ וילך איש מבית לוי, שהלך בעצת בתו. כי מה שהאדם מתנהג מפ\"י עצה הניתנת לו קרוי הליכה. וכן מצינו בדברי הכתוב והלכת בדרכיו, שהוא ציווי להתנהג עפ\"י דרכי התורה. וז\"ש הכתוב אם בחקתי \"תלכו\", פירוש שכל התנהגותכם ודרכיכם יהיו מפ\"י התורה, ולא תעלה על לבכם עצה המתנגדת אף במשהו לדרך התורה, ורק באופן זה שיהיו כל עצותיכם ודרכיכם עפ\"י התורה ואת מצותי תשמרו ועשיתם אותם בשלימות. וכאשר מצינו בדוד המע\"ה שמנע עצמו מלילך לאותם מקומות שאינם מתנהגים בדרך התורה כדי לקרבם לעבודת הבוי\"ת, כי התבונן שלא זו הדרך הראויה עפ\"י התורה, מכיון שצריך לשנות מעט מדרך אבותינו ורבותינו כדי שתהיה לו התקרבות עמהם. ועד\"ז פירש הגה\"ק בעל חתם סופר זלה\"ה מאה\"כ לנפש לא יטמא בעמיו, פירוש בשביל הצלת נפש ישראל אין לטמא את מי שמושה ממשה עמיו."},{"passage_id":"vayikru2_05df1f2c_p14","passage_content":"וא\"ש שסמוך המדרש דרשה זו למאה\"כ אם בחקתי תלכו, שממנו נשמע אזהרה שיתנהג האדם בכל דרכיו ומעשיו עפ\"י התורה, והיא תנחהו כאורח סלולה, ורק אם תהיה עצתו אמונה על פי התורה יעשה מעשהו, וכאשר עשה דהמע\"ה שחשב מחשבות למקום פלוני אני הולך וכו', ואח\"כ חזר בו. וזהו שאמר חשבתי דרכי, שחישב אם דרכו נכונה עפ\"י התורה, ואשיבה רגלי אל עדותיך, שהיו רגליו מוליכות אותו לביהמ\"ד, ולא הלך בחוץ בשוקים וברחובות לבקש ולמצוא שם אנשים שסרו מן הדרך, כי אין דרכה של תורה בכך."},{"passage_id":"vayikru2_05df1f2c_p15","passage_content":"ובזה יש לבאר גם כוונת המדרש (קושיא ג') אם בחקתי תלכו חקים שחקקתי בהם שמים וארץ והכוונה כלפי שאמרה תורה אם בחקתי תלכו, שאין לאדם לקחת עצות והדרכות הזרות לרוח התורה, ומינה נלמד שאין להניח אף זיז כלשהי מדרך התורה בעבור קירוב אינשי דלא מעלי לעבודת ה', כי אם העצה היעוצה היא לעסוק בתורה בבתי מדרשות, וכח התורה יזריח בלבות הפושעים להחזירם בתשובה. וכאשר כן עשה דהמע\"ה שרגליו היו מוליכות אותו לביהמ\"ד, ואותם הראויים לעשות תשובה באו ונתקרבו מאליהם, כי האיר עליהם אור תורתו וקדושתו של אדונינו המלך דוד, על כן סמך המדרש הך דרשה להכא להודיע כמה גדול כחה של תורה, שעל ידה ברא הקב\"ה יש מאין, כאמרו חקים שבהם חקקתי שמים וארן שמש וירח וכו', ובה ממונים ונרמזים כל הכוחות הנמצאים בכל עניני העולם. ולכן עיקר הכל הוא להחזיק כח התורה בבתי כנסיות ובבתי מדרשות, ונוגה אור קדושתה ישפיע גם בחוצות וברחובות, לקרב לבבות התועים לתורה ולקדושה."}]},{"dvar_torah_id":"vayikru2_03e53c16","title":"תועלת הגלות לברור ניצוצות קדושה","summary":"המדרש מלמד שהמקום מתאווה לעמל ישראל בתורה, וצריך לגלות ממקום למקום כדי לברר ניצוצות קדושה. דוד המלך חשב לכתת רגליו למקומות אלו, אך בסופו של דבר רגליו הביאו אותו לבית המדרש, הודות לכוח קדושתו.","contents":[{"passage_id":"vayikru2_03e53c16_p1","passage_content":"אם בחקתי תלכו וגו', במד\"ר הה\"ד חשבתי דרכי ואשיבה רגלי אל עדותיך אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות הה\"ד ואשיבה רגלי אל עדותיך, וצ\"ב."},{"passage_id":"vayikru2_03e53c16_p2","passage_content":"ב) בתורת כהנים (הובא בילקוט רמז תרע\"א) איתא אם בחקתי וכו', מלמד שהמקום מתאווה שיהיו ישראל עמלים בתורה, וכה\"א (תהלים פ\"א) לו עמי שומע לי ישראל בדרכי יהלכו וגו'. ויש להתבונן בטעם שהמדרש קורא את הקב\"ה כאן בכינוי המקום, ואף שמצינו במקומות רבים בדבריהם ז\"ל שהקב\"ה מכונה המקום, ע\"ש שהוא מקומו של עולם ואין העולם מקומו, אפ\"ה טעמא בעי כל היכא שהקב\"ה קרוי כן, דידוע ששמותיו יתברך והתוארים הנאמרים בו הם לפי המדה שהוא נוהג בה עולמו, אבל עצם כבודו יתברך אין שייך בו שם דלית מחשבה תפיסא ביה כלל, אלא שהוא נקרא בשמות ובכינויים לפי מדותיו ית', כגון בשעה שהדין שולט בעולם הוא נקרא בשם אלקים, וכיוצא בזה שאר השמות. וכמבואר במד\"ר פרשת שמות (פ\"ג ו') א\"ל הקב\"ה למשה שמי אתה מבקש לידע לפי מעשי אני נקרא וכו' כשאני דן את הבריות אני נקרא אלקים וכו', עיי\"ש. (ועיין בזה\"ק פנחס רנ\"ז ע\"ב). וא\"כ צריך טעם מדוע נקט התורת כהנים כאן כינוי \"מקום\" דייקא."},{"passage_id":"vayikru2_03e53c16_p3","passage_content":"ונראה בהקדם מה דאיתא בפסחים (דף פ\"ז ע\"ב) ואמר ר\"א לא הגלה הקב\"ה את ישראל לבין האומות אלא כדי שיתוספו עליהם גרים. ופירשו חכמי האמת דכוונת אומרם ז\"ל שיתוספו עליהם גרים על הנשמות הקדושות שנטמעו בין האומות הקרויים גרים, וע\"י שישראל דרים ביניהם הרי הם מבררים אותם ומחזירים אותם אל הקדושה, ואף לפי המובן הפשוט דקאי על גרים ממש א\"ש, דנשמות הגרים מינן הוו ואידחו, כידוע מדברי המקובלים, וע\"כ עלינו להחזירם אל הקדושה. וידוע מה שכתב האה\"ח הק' בפרשת בהר עה\"פ וכי ימוך אחיך שהקשה שהרי הגלות הוא רק בסיבת החטא, ואילו לא היו ישראל חוטאים וגולים כיצד היו מתבררים הנצה\"ק הפזורים בין האומות, ותירץ כי אם לא היו ישראל חוטאים היה בכוחם לברר ניצוצות הקדושה במקום שהם מכל המקומות אשר נתפזרו שם, משא\"כ אחר חטאם דחלש כחם ולואי שתשיג ידם במקום עצמו אשר שם הניצוצות וכו', עכדה\"ק."},{"passage_id":"vayikru2_03e53c16_p4","passage_content":"ובדברי קדשו אלו ארווחנא להבין גם מה שכתב הוא ז\"ל בפרשה זו עה\"פ אם בחקתי תלכו (באופן הז'), ע\"ד אמרם ז\"ל (אבות פ\"ד מי\"ד) הוי גולה למקום תורת שצריך לכתת רגליו ממקום למקום ללמוד תורה. וצא ולמד מדבריהם ז\"ל בגמרא כי כולן היו גולין ללמוד, ויש שהיה הולך ששה חדשים וחוזר כמו כן כדי ללמוד יום אחד. והוא אומרו אם בחקתי, שהוא עסק התורה, צריכים אתם שתלכו ממקומכם אחריה וכו', עכ\"ד הקדושים. ולכאורה אם גם במקומו הוא יכול ללמוד תורת מה לו לגלות ממקומו ולכתת רגליו למרחקים כדי לעסוק בתורה. ובפשטות י\"ל הטעם דלאו מכל אדם זוכים ללמוד תורת ולזאת צריך ללכת ממקום למקום, עדי ימצא את שאהבה נפשו, ותורה יבקש מפיהו. אכן עפ\"י דברי האה\"ח הקדוש יובן הטעם שצריך ללכת ממקום למקום ללמוד תורת דבכנ מקום נמצאים נצה\"ק הפזורים בעמקי הקליפות, וצריכים לבררם ולהעלותם ע\"י עסק התורה, וכל אדם מוטל עליו לברר את הנצה\"ק השייכים לחלק נשמתו, וזה היה גם ענין המ\"ב מסעות שנסעו בני ישראל במדבר כדי לברר כל הנצה\"ק שבאותם מקומות, וכמ\"ש האה\"ח הקדוש בר\"פ מסעי, ומטעם זה עצמו אמרו חכמים שצריך ללכת ממקום למקום ללמוד תורה, כדי שיברר כ\"א את הנצה\"ק השייכים לחלקו מכל אותם מקומות, ולא סגי שילמוד תורה במקום מגוריו, שהרי מחמת החטא נחלש כח הקדושה, ואין בכוחו של אדם לברר כל חלקי הקדושה ממקומו, עד שיגלה הוא עצמו לאותם מקומות כמ\"ש האה\"ח הק', וכולי האי ואולי יעלה בידו שיוכל לבררם."},{"passage_id":"vayikru2_03e53c16_p5","passage_content":"ועתה יבוארו היטב דברי הת\"כ (קושיא ב') מלמד שהמקום מתאוה שיהיו ישראל עמלים בתורה, כי הנה מדכתיב אם בחקתי תלכו ילפינן שצריך האדם להיות גולה ממקום למקום כדי ללמוד תורה, כמו שפירש האור החיים הקדוש, וכמו שביארנו בטעמא דמילתא שצריך לגלות ממקום למקום בעבור הנצה\"ק הפזורים בכל המקומות וצריך להעלותם למקורם ושרשם. וכלפי זה נתכוון הת\"כ במה שכינה את הקב\"ה בכינוי המקום, באמרו מלמד שהמקום מתאוה שיהיו ישראל עמלים בתורת פירוש דממה שצוה הכתוב אם בחקתי \"תלכו\" שצריך לכתת רגליו ממקום למקום ללמוד תורה, למדנו שכל מקום ומקום שבו הנצה\"ק שבויים מתאוה ומשתוקק שיבררו אותם ישראל באמצעות עסקם בתורה באותו מקום, ולרמוז לזה נקט כאן מלמד \"שהמקום\" מתאוה וכו', והבן."},{"passage_id":"vayikru2_03e53c16_p6","passage_content":"ובזה נבא אל הביאור בדברי המד\"ר אמר דוד רבש\"ע בכל יום ויום הייתי מחשב למקום פלוני וכו' אני הולך. כי הנה דוד המלך ע\"ה היה סבור דמאחר שצוותה תורה לגלות ממקום למקום ללמוד תורה, כדכתיב אם בחקתי תלכו, והטעם כדי ללקוט את נצה\"ק הפזורים בין הקליפות, א\"כ גם עליה רמיא ללכת אל אותם מקומות ששם פזורים נצה\"ק, כי בגודל ענותנותו ושפלות רוחו חשב כי אין בכוחו לשאוב את הנצה\"ק השייכים לנשמתו ממקום שהוא נמצא, משום שנחלש כח הקדושה, ולפיכך עליו לכתת רגליו ממקום למקום. אבל בסופו של דבר היו רגליו מביאות אותו לביהמ\"ד, כי כח קדושתו של דהמע\"ה רב ועצום להמשיך את נצוצות הקדושה בכל מקום שהם מפוזרים ממקום מעמדו בבית מדרשו, כשם שהיו ישראל במדרגה זו קודם החטא, וע\"כ היו רגליו מביאות אותו לבית המדרש, שלא הוצרך לגלות ממקום למקום בעבור כן."}]},{"dvar_torah_id":"vayikru2_c033cf47","title":"תיקון חצות ותקוות הגאולה","summary":"דוד המלך עה\"ש מתאר את מחשבותיו על הגאולה, כאשר רגליו מוליכות אותו לבתי מדרשות. הוא מתפלל על חזרת ישראל בתשובה, ומבין כי עתיד לבוא זמן שבו יוכלו ללמוד תורה גם במקומות טמאים. התקווה לגאולה מחזקת את רוחו בתקופת הגלות.","contents":[{"passage_id":"vayikru2_c033cf47_p1","passage_content":"באופן אחר יתבאר המד\"ר (ריש פרשה זו) הה\"ד (תהלים קי\"ט) חשבתי דרכי ואשיבה רגלי אל עדותיך, אמר דוד רבש\"ע בכל יום ויום הייתי חושב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות הה\"ד ואשיבה רגלי אל עדותיך. וצריך ביאור."},{"passage_id":"vayikru2_c033cf47_p2","passage_content":"ונראה עפ\"י מה דאיתא במסכת מגילה (דף ו' ע\"א) עה\"פ (זכריה ע') והיה כאלוף ביהודה ועקרון כיבוסי, אלו תראטריות וקרקסיאות שבאדום שעתידין שרי יהודה ללמד בהן תורה ברבים. והתוס' שם הביאו יש מפרשים שהה בתי ע\"ז ומכנה אותם טראטריות לשון חרפה וכו'. ונחלקו התוספות על פירוש זה, כי קשה לומר שאותם מקומות מטונפות יוכלו ללמד שם תורה אלא ודאי לשממה יהיו במהרה בימינו, וכוונת הגמרא על בתים שמתאספים בהם לועד ע\"ז, עכ\"ד התוספות. וכבר כתבנו לעיל (עיין בדברינו לעיל פרשת שמיני עמוד רנ\"ג) מ\"ש המפרשים שגם הי\"מ המובא בתוספות אין כוונתם לומר דבזה\"ז ילמדו תורה בבתי עבודה זרה, דבמקום מאוס כ\"כ שנעבדה ע\"ז פשיטא שא\"א ללמוד תורה, אלא דאינהו מפרשי לה על לעתיד לבא, כאשר רוח הטומאה יעבור מן הארץ והאלילים כרות יכרתון, ויאבד מארץ זכרם עד בלי הותיר בעולם שם ושארית לע\"ז, אזי יהיה מותר ללמוד תורה באותם מקומות, מאחר שנעקר מהם כל שמץ תיטוב טינוף וגיעול ע\"ז. ועל אותה העת נאמר היעוד הנבואי והיה כאלוף ביהודה ועקרון כיבוסי."},{"passage_id":"vayikru2_c033cf47_p3","passage_content":"ובדרך זו נבא אל הביאור, כי הנה בדברי נעים זמירות ישראל נמצאים הרבה תחנות ובקשות על כבוד שמים המחולל, ונפשו ערגה והשתוקקה לראות בישועתן השלימה של ישראל, בתיקון עולם במלכות שדי, ובהתגלות כבוד מלכותו יתברך על כל יושבי תבל. ובקומו בחצות לילה להתדבק ביוצר הכל ית\"ש בשירות ובתשבחות כמאה\"כ חצות לילה אקום וגו' נכספה וגם כלתה נפשו לחצרות ה', ובראותו כי עדיין לא אתא זמן התיקון השלם, והבית העומד להבנות עתיד להיות נחרב, ובני ישראל ילכו שבי לפני צר, היתה נפשו מרה עליו, וערך תיקון חצות בקוננו במרירות גדולה על שבר בת עמי. והנה כאשר הצדיקים מתאוננים כ\"כ על החרבן, ולבם נשבר בקרבם בראותם אריכות הגלות הנורא, מנחמים אותם מן השמים כי כבר קרב ובא זמן הישועה, ותהי זאת נחמתם בעניים, שהם סוברים תדיר אולי כבר הגיע הזמן, ובתקוה זו המה מתעודדים ומתחזקים לסבול את אורך הגלות. וכאשר ידוע מק\"ז זלה\"ה הישמח משה אשר כל ימיו השתוקק בכמיהה עצומה לביאת המשיח, ובכל פעם שהיה שומע קול המולה מן החוץ היה סובר כי הקול נשמע מביאת הגואל."},{"passage_id":"vayikru2_c033cf47_p4","passage_content":"וכמו כן היה גבי דוד המלך ע\"ה בעת אשר התמרמר והתאונן על השבר הנורא העתיד לבא על כלל ישראל, היה עולה במחשבתו תמיד אולי כבר הגיע זמן קץ הגאולה, ואז עתידים כל ישראל לחזור בתשובה ולעבוד את השי\"ת באמת ובלב שלם, וע\"כ התחנן לפני הקב\"ה השיבה לי ששון ישעך וגו', אלמדה פושעים דרכיך וחטאים אליך ישובו. ובחזונו ראה גם כי בעת התיקון השלם עתיד רוח הטומאה לעבור מן הארץ, ולא יוותר ממנו שריד, ולפי שהיה דבוק מאד במחשבתו באותה שעה בתקות הגאולה הקרובה היה נראה בעיניו כי אכן כבר חלף עבר רוח הטומאה מן הארץ, וממילא עומד להתקיים היעוד שעתידין בתי טראטריות וקרקסיאות לההפך לבתי כנסיות ומדרשות. וכיון שאותם מקומות מיועדים ללמוד בהם תורה, צריך לחנכם ולהכניסם אל הקדושה, ולפיכך היתה מחשבתו של דוד המלך עליו השלום בחצות הלילה כאשר היה מקונן על שאין שמו יתברך שלם ואין כסאו שלם, ומתנחם בתקות הגאולה הקרובה, ללכת לבית פלוני ולמקום פלוני, הלא הם מקומות הטומאה שעבדו בהם ע\"ז מקדם, ועתידין ללמד בהם תורה ברבים. כי לפי דעתו שכבר עומד להגיע זמן הגאולה הרי נתבערו משם כל כוחות הטומאה, והם ראויים ללמוד תורה. אבל כאשר עלה השחר והתבונן כי עדיין לא הגיע זמן הגאולה, אראנו ולא עתה אשורנו ולא קרוב, וכוחות הטומאה עדיין בתקפם עומדין, היו רגליו מוליכות אותו לבית המדרש ללמוד תורת ושם קבע משכנו, כי בית המדרש הוא מגן ומחסה מפני כוחות הטומאה, ואם יוצאים מן הביהמ\"ד החוצה עלולים להתפס ברוח הזמן אשר בלתי טהור הוא."},{"passage_id":"vayikru2_c033cf47_p5","passage_content":"ואפ\"ל מה דנקט והיו \"רגלי\" מוליכות וכו',  דהנה ידוע מה שכתבו חכמי האמת משמיה דמרן האר\"י ז\"ל בטעם שהזמן שטרם ביאת המשיח קרוי בדברי חז\"ל עיקבתא דמשיחא, עפ\"י מה שאמרו ז\"ל (נדה י\"ג ע\"ב) אין בן דוד בא עד שיכלו כל הנשמות מן שבגוף ופירש\"י ז\"ל חדר כי גוף שם מקום המיוחד לנשמות העתידין להיות נולדים. והנה כל הנשמות שהיו עתידין להבראות תלויים בקומתו השלימה של אדם הראשון, יש נשמות שהיו תלויות בראשו, ויש בלבו, וכן בכל אבר ואבר כאמרם ז\"ל (שמו\"ר פ\"מ ג'), והנשמות ירדו לעולם הזה לפי סדר אבריו מלמעלה למטה, ובדורות האחרונים הסמוכים לביאת המשיח שאז צריכים להתברר כל הנשמות שלא ירדו לעולת באים הנשמות התלויות בעקבי רגליו של אדה\"ר, ולפיכך נקראים דורות אלו עקבתא דמשיחא, ע\"ש שבאו לעולם הנשמות השפלות התלויות בעקבי רגליו. וע\"כ קשה מאד להגיע לתנועה של אמת בזמנים אלו מגודל השפלות. וזה אפ\"ל שאמר דוד והיו \"רגלי\" מוליכות אותי לבית המדרש, כלומר אלו הנשמות שברגלים בעיקבתא דמשיחא, המה ינחוני יביאוני אל ביהמ\"ד, דמחמתם מוכרח אני להיות בין כותלי בית המדרש, שעדיין א\"א לעזוב את ביהמ\"ד מגודל השפלות. ואנו כבר עומדים עתה בעיקבתא דמשיחא הם הדורות התלויים בעקבים, והמצב קשה מאד, השי\"ת יעזור שנזכה בקרוב לישועה השלימה, ולא נדחה ע\"י העוונות ח\"ו, כ\"א נהיה בין אלו שיזכו לראות ישועתו של הקב\"ה וישועת ישראל, ישמחו השמים ותגל הארץ, ובמהרה נוושע בכל מיני ישועות טובות ונזכה לראות בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו בב\"א."}]},{"dvar_torah_id":"vayikru2_9c71195c","title":"מחשבות דוד והכוח בתורה","summary":"דוד המלך היה מחשב מחשבות להחזיר את הריקים בתשובה, אך רגליו הביאו אותו לבתי מדרשות. המלחמה היא בזכות התורה, והחיילים צריכים להיות צדיקים כדי לנצח את אויבי ה'.","contents":[{"passage_id":"vayikru2_9c71195c_p1","passage_content":"אם בחקותי תלכו ואת מצוותי תשמרו ועשיתם אותם. במד\"ר (ריש פרשה זו) איתא הה\"ד (תהלים קי\"ט) חשבתי דרכי ואשיבה רגלי אל עדותיך אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות הה\"ד ואשיבה רגלי אל עדותיך, ע\"כ. והענין תמוה מאד מאין בא לו לדוד המלך ע\"ה לחשוב מחשבות ולומר למקום פלוני ולבית דירה פלונית אני הולך, והרי לגודל דביקותו בהשי\"ת בכל עת ועונה היה ראוי שלא יבואו מחשבות זרות כאלו בלבו כלל, שהרי אף אותם אנשים ההולכים למקומות ההם אינם מעלים כזאת על לבם מראש, אלא בשעת מעשה בא השטן לפתותם, והוא בקרבם כאש בוערת ולא יכלו לעמוד כנגדו, ונלכדו ברשתו ללכת למקום פלוני ולבית דירה פלונית."},{"passage_id":"vayikru2_9c71195c_p2","passage_content":"ב) להלן בפרשה ונתתי שלום בארץ וגו' וחרב לא תעבור בארצכם. אונקלוס תרגם על מאה\"כ וחרב לא תעבור בארצכם, ודקטלין בחרבא לא יעידון בארעכון. ונתקשו המפרשים שהרי יעידון הוא תרגום לתיבת הסרה, וכמאה\"כ לא יסור שבט מיהודה ותרגומו לא יעדי עביד שלטן מדבית יהודה, וכאן ע\"כ לא יתכן לומר שלא תסור חרב מן הארץ, שא\"כ אין זו ברכה אלא קללה ח\"ו. ובספר קרבן נתנאל כתב דהוא ט\"ס, שהוא לשון קללת וצ\"ל לא יעירון. אך בספר פנים יפות דחה דבריו, דאין זה נכון לשבש הספרים, וכתב הוא ז\"ל לפרש דברי התרגום מלשון המקרא בדניאל וריח נור לא עדת בהון פירש\"י לא סרה לתוכן, עיי\"ש, וצ\"ב."},{"passage_id":"vayikru2_9c71195c_p3","passage_content":"ג) ורדפו מכם חמשה מאה ומאה מכם רבבה ירדופו ונפלו אויביכם לפניכם לחרב. פירש\"י (מתורת כהנים) וכי כך הוא החשבון והלא לא היה צריך לומר אלא מאה מכם שני אלפים ירדופו אלא אינו דומה מועטין העושין את התורה למרובים העושין את התורה. והקשה הרא\"ם ז\"ל דכמו כן יש לתמוה על האמור בתוכחה (דברים ל\"ב) איכה ירדוף אחד אלף ושנים יניסו רבבה, שלא היה צריך לומר אלא שנים יניסו שני אלפים, והתם לא שייך לומר כתירוץ רש\"י ז\"ל הכא, דאינו דומה מועטים וכו' דשם מיירי בעכו\"ם הרודפים. ובספר פנים יפות נדחק לתרץ דכל מה שיש כח באומות לשלוט על ישראל ולנצחם, אין זה אלא מחמת שישראל נותנים להם כת דע\"י עוונותיהם של ישראל נופלים נצה\"ק אל הקליפות, ובכח הנצה\"ק השבויים לוחמים האומות נגד ישראל, וע\"כ בהצטרף ב' רודפים יניסו רבבה. ברם אכתי קשה דסוף סוף הנם בעלי עבירה, וכל כוונתם להרע לישראל, ואם כן איפכא מסתברא כי כאשר מתאספים יחד בעלי עבירה רבים אזי גם חטאם גדול יותר, וראוי להיות שהתקבצם יחד ימעט כחם."},{"passage_id":"vayikru2_9c71195c_p4","passage_content":"ונראה לבאר הענין בהקדם הא דאיתא בגמרא סוטה (י\"א ע\"א) ולעולם מרה טובה מרובה ממדת פורעניות, והקשו התוס' בד\"ה ולעולם וז\"ל, וא\"ת והא מצינו פורעניות גדולה ממדה טובה דכתיב איכה ירדוף אלף אחד ושנים יניסו רבבה (דברים ל\"ב) גבי מדת פורעניות, וגבי מדה טובה כתיב ורדפו מכם חמשה מאה, וי\"ל דעדיין גבי מדת פורעניות מיירי ברדיפה ולא בהריגה, אבל הכא דכתיב ורדפו מכם חמשה מאה סיפא דקרא ונפלו אויביכם לפניכם לחרב, עכ\"ד התוספות. והקשה האור החיים הקדוש על תירוצם מהא דאיתא במו\"ק (ט\"ז ע\"ב) אלה שמות הגבורים אשר לדוד וגו' (שמואל ב' כ\"ג) וכו', וכשהיה יוצא למלחמה היה מקשה עצמו כעץ על שמנה מאות חלל בפעם אחת, שהיה זורק חץ ומפיל ח' מאות חלל בפעם אחת, והיה מתאנח על מאתים דכתיב איכה ירדוף אחד אלף, יצתה בת קול ואמרה רק בדבר אוריה החתי, ע\"כ. ולפי דברי התוס' דמאמר הכחוב איכה ירדוף אחד אלף מדבר ברדיפה בלא הריגה למה היה דוד מתאנח על שלא היה הורג אלף בפעם אחת משום דכתיב איכה ירדוף אחד אלף, הלא הך קרא אינו מדבר בהריגה. אשר ע\"כ נראה דבין פסוק ורדפו מכם חמשה מאה ובין פסוק איכה ירדוף אחד אלף אינו מדבר אלא בהריגה, ומה שהקשו ז\"ל נראה לתרץ עפ\"י מה שאמרו בת\"כ וז\"ל מן החלשים שבכת ולא מן הגבורים שבכם. ובזה מיושב דהך קרא ורדפו מכם חמשה מאה מיירי בחלשים שבישראל, שכיוצא בהם בין האומות אין בכוחם לערוך מלחמה, ומ\"ש הכתוב איכה ירדוף אחד אלף מדבר בגבורים וכו'. ולזה היה דוד מתאנח על תשלום האלף שלא תהיה מדת פורעניות מרובה, כי דוד היה האחד המיותר, עכ\"ד האוה\"ח הקדוש. וכעין זה כתב גם הפנים יפות. ולפי דבריהם נדחה תירוצם של התוספות. ולי נראה לקיים תירוץ התוספות ז\"ל, דלק\"מ מהא דאמרו ז\"ל גבי דוד שהיה מתאנח על מאתים דכתיב איכה ירדוף אחד אלף והוא לא הכה כי אם ח' מאות בבת אחת. והדבר יתבאר עפ\"י מה דאיתא בירושלמי פ\"ק דפאה הביאו התוספות בסופ\"ק דקידושין (דף ל\"ט ע\"ב ד\"ה מחשבה) דבעכו\"ם הקב\"ה מצרף מחשבה רעה למעשה, ויליף לה מקרא עיי\"ש. והנה כאשר עכו\"ם רודף אחרי ישראל מסתמא מחשבתו היא להכותו נפש, ואם לא עלתה בידו לבצע זממו אין זאת אלא שמן השמים עכבוהו, אך לו היה בידו ודאי שלא היה חומל ומרחם עליו לתת לו נפשו לשלל. וכאשר יסד בעל ההגדה שלא אחד בלבד עמד עלינו לכלותינו אלא שבכל דור ודור עומדים עלינו לכלותינו והקב\"ה מצילנו מידם. הרי כי אילו היה בכוחם כלה היו עושים לשארית השביה, אלא שהקב\"ה מפליא חסדיו עמנו בדרך נס לתת לנו שארית בארץ, ומפלטנו מיד אויבינו הקמים עלינו. והגם שלמראית העין נדמה שהצלתני היא בדרך הטבע, מ\"מ זהו נס נסתר המלובש בטבע. ונמצא לפי זה כי כל עכו\"ם הרודף אחרי ישראל ה' יחשוב לו עוון כאילו רצחו נפש, דכלפי שמיא גליא כי לזאת מחשבתו, ואף אם לא עלתה בידו להוציא מחשבתו אל הפועל הקב\"ה מצרפה למעשה כמבואר בירושלמי."},{"passage_id":"vayikru2_9c71195c_p5","passage_content":"ובדרך זה פירשנו מאה\"כ בפרשת עקב והסיר ה' ממך כל חולי וכל מדוי מצרים הרעים אשר ידעת לא ישימם בך ונתנם בכל שונאיך. ויל\"ד דתיבות אתה ידעת יתירי נינהו, דמה לנו אם המדוים הללו הם ידועים או בלתי ידועים לנו, והיה די שיאמר הכתוב וכל מדוי מצרים הרעים לא ישימם בך וגו',  וממילא ממוטעים ישראל מכל מיני חולאים, הנגלים להם וגם הנסתרים שלא ידעום. אכן אפ\"ל כי הנה המצריים הרשעים התחכמו בתחבולותיהם להרע לישראל בכל מה שהיה ביכלתם, אך לא עלתה בידם להפיק זממם, כי לא נתנם אלקים להרע עמנו. וכמו שביארנו בדברי המדרש ילקוט פרשת בשלח (רמז רמ\"א) התמוהים לכאורה וז\"ל, בשעה שביקש הקב\"ה להשביע את מצרים עמד עוזא שר של מצרים לפני הקב\"ת ואמר לפניו רבש\"ע נקראת צדיק וישר ואין לפניך עולה וכו', למה אתה רוצה להטביע מצרים, כלום הטביעו בני מבניך או הרגו מהם וכו', ע\"כ."},{"passage_id":"vayikru2_9c71195c_p6","passage_content":"וכל רואה דברים אלו ישתאה וישתומם, איך העיז שר של מצרים לדבר שקרים וכזבים לפני הקב\"ה כי לא הטביעו המצרים מבני בישראל, והלא מקרא כתוב הוא שגזרו כל הבן הילוד היאורה תשליכוהו. אמנם קושטא דמילתא הוא דאף שהמצרים השליכו מילדי ישראל ליאור ניצולו כולם בדרך נס, וכדאיתא בילקוט פרשת שמות (רמז קס\"ה) ר' שילא אמר כל הילדים שהשליכו היה היאור פולט אותם במדבר והיה הקב\"ה מביא סלע בפי כל אחד וכו' שנאמר ויניקהו דבש מסלע וכו', ע\"כ. ובסוטה (דף י\"ב ע\"ב) איתא כי כאשר הושלך משה ליאור בעלה גזרתם ואמר להם משה לישראל בשבילי נצלתם כולכם, וכתבו התוספות שם כי הוא היה הראשון שהושלך ליאור. מכל הלין שמעינן שלא נתקיימה מחשבתם הרעה אשר חשבו על ישראל לטבעם במים. וזו היתה טענת שר של מצרים כלום הטביעו בני מבניך, כי רצה לזקוף דבר זה לזכות מצרים שלא הרעו לישראל בהיותם גרים ותושבים בארצם, ולא הטביעו מהם גם אחד, כאשר באמת כן היה שלא עלתה בידם לבצע זממם, וא\"כ מה פשעם ומה חטאתם להציף מי ים סוף על פניהם. אמנם הקב\"ה השיבו כי בדין הוא לענשם על מחשבתם הרעה אשר זממו לעשות, כאילו עשאוה בפועל, דבעכו\"ם הקב\"ה מצרף מחשבה רעה למעשה."},{"passage_id":"vayikru2_9c71195c_p7","passage_content":"וזאת אפשר לרמוז בדברי הכתוב הזה וכל מדוי מצרים הרעים, כלומר היסורים והצרות אשר זממו המצרים לעשות לכם, ואף שלא הוציאו זממם מכח אל הפועל, כי מן השמים עכבום, מ\"מ \"אשר ידעת\", כלומר הלא לפניכם גלוי וידוע שחרשו עליכם מזמות רעות, ואילו היה לאל ידם לעשות עמכם רע היו עושים, ולפיכך אף כי בחסדי המקום עליכם לא ישימם בך, כלומר שלא באו לכלל שימה לפי שלא נתנם ה' להרע עמכם, מ\"מ נחשב להם כאילו היו מצירים לכם בפועל ממש, ולכן יענישם הקב\"ה במדה כנגד מדה, \"ונתנם בכל שונאיך\", פירוש שיביא הקב\"ה עליהם רעה פרי מחשבותם, ואותם המכות והעונשים שרצו להביא על ישראל ילקה הקב\"ה אותם בהם."},{"passage_id":"vayikru2_9c71195c_p8","passage_content":"ועפ\"י זה יתיישבו דברי התוספות שתירצו דקרא דאיכה ירדוף אחד אלף לא מיירי בהריגה אלא ברדיפה, ולא קשה מה שהשיב האה\"ח הקדוש עליהם מדברי הגמרא במו\"ק שהיה דוד מתאנח על מאתים. דהנה אף דקרא דאיכה ירדוף וגו' מיירי ברדיפה בלא הריגה, מ\"מ כיון דכלפי שמיא גליא דמחשבת העכו\"ם להרוג את ישראל, בדין הוא שיהיה נחשב להם כאילו הוציאו מחשבתם הרעה אל הפועל, ומדה כנגד מדה יהא עונשם אשר בזמן שרודפים אחריהם ישראל יהרוג אחד מישראל אלף מהם, וגמולם ישיבו להם בראשם על מחשבתם הרעה אשר חשבו על היהודים. ולזאת היה דוד מתאנח על שתי מאות חלל, שלא זכה להרוג מהם כי אם ח' מאות בפעם אחת, ולמספר אלף לא הגיע, כאשר היה ראוי להיות נמדד להם במדה כנגד מדה, על שהיו רודפים את ישראל ומתנכלים להמיתם."},{"passage_id":"vayikru2_9c71195c_p9","passage_content":"ואל תתמה לומר כי אין ראוי להעניש את האומות על מה שהם רודפים את ישראל, כי לא מלבם עינו, אלא ה' צוה להם זאת, ושלוחי דרחמנא נינהו לייסר את ישראל על עוונותיהם, כמאה\"כ (דברים ל\"ב) איכה ירדוף אחד אלף וגו' אה לא כי צורם מכרם וה' הסגירם. ולא עוד אלא אף אם האומות חורשים רע על ישראל ובקרבם ישימו ארבם ולכלל מעשה לא באו, כי הופרה עצתם, מ\"מ אף גם מחשבת הרדיפה בלבד לא משלהם היא, אלא גזרת המקום היא לשום בלבם מחשבת רשע לצרור את ישראל, וכהא דאיתא בגמ' (מגילה י\"ב ע\"א) שאלו תלמידיו את רשב\"י מפני מה נתחייבו שונאיהן של ישראל שבאותו הדור כלייה וכו' מפני שהשתחוו לצלם אמרו לו וכי משוא פנים יש בדבר אמר להם הם לא עשו אלא לפנים אף הקב\"ה לא עשה עמהם אלא לפנים וכו', ע\"כ. מבואר מזה כי מתחלתה היתה גזרה זו מיועדת רק לעשות עמהם לפנים, מדה כנגד מדה על שהשתחוו לצלם למראית העין ולבם בל עמם, על כן נתן הקב\"ה בלבם לגזור גזרת כלייה על ישראל ח\"ו, כדי להעיל עליהם אימה ופחד ויתכפר להם בזה על חטאם."},{"passage_id":"vayikru2_9c71195c_p10","passage_content":"הרי לנו כי גם מה שהאומות יועצים עלינו מזימות רעות מאת ה' היתה זאת, ועל אחת כו\"כ אם האומות מריעים בפועל לישראל ורודפים אותם, ודאי כי גזרה היא שנגזרה ממרומים, וכדאיתא (תנחומא פ' שמות ס\"ה) עה\"פ (תהלים ק\"ה) הפך לבם לשנוא עמו וגו' כי הקב\"ה הפך את לבבם של מצרים לשנוא את ישראל בעבור שהפירו ברית מילה. אעפ\"כ לא משום כך יפערו העכו\"ם מעונש על מה שהרעו לישראל, אלא ענוש יענשו, והקב\"ה ישיב להם גמול, כי אף שבאמצעותם הקב\"ה מעניש את ישראל, מ\"מ המה מחשבותם לרע, דלא לצד שרצונם לקיים מצות הבורא יתברך המה מריעים לישראל כי אם לשנאתם אותם, ואילו היה בידם היו מכלים אותם, על כן בדין הוא להענישם. וכמבואר ענין זה באורך בדברי הראשונים (עיין ברמב\"ם הלכות תשובה פ\"ו ה\"ה ובהשגות הראב\"ד ז\"ל שם והאריך בענין זה הרמב\"ן ז\"ל בפירושו על התורה פ' לך לך ושאר מפרשים ז\"ל הלא בספרתם)."},{"passage_id":"vayikru2_9c71195c_p11","passage_content":"ועתה נבא ליישב קושיית המזרחי ז\"ל (קושיא ג'), דלדברי רש\"י שתמה שאין החשבון מדוקדק תקשי נמי מה יענה במאה\"כ איכה ירדוף אחד אלף ושנים יניסו רבבה, דהתם אין לומר כמו שפירש\"י ז\"ל הכא אינו דומה מוטעים וכו', דהתם מיירי בעכו\"ם הרודפים את ישראל, ומדוע יתעצם כחם חמשת מונים בהקבצם יחד, אדרבה בהתחבר הרשעים יחד יעצמו פשעיהם כעבות העגלה, והיה ראוי שיחלש כוחם ולא יוכלו לרדוף. אכן לפי מה שנתבאר כי מה שהעכו\"ם רודפים את ישראל היא גזרת המקום לייסר את ישראל על עוונותיהם, א\"כ לא ידמו חטאיהם של אלף מישראל לחטאם של עשרת אלפים, כי אין לדמות יחיד החוטא לעצמו אל רבים החוטאים יחד בחבורה מאוחדת ובעצה אחת, וככל מה שיגדל רבוי העם ויתחזק איחודם והתחברותם יגדל הניאוץ כלפי שמים. וכמ\"ש לבאר מה שאמרו בנות צלפחד למשרע\"ה (במדבר כ\"ז) אבינו מת במדבר והוא לא היה בתוך העדה הנועדים על ה' כי בחטאו מת. ולכאורה נראה כי אמריהם היו להקטין את חטא אביהם, ולפיכך אמרו כמתנצלים כי הוא לא היה בתוך העדה הנועדים על ה' אלא בחטאו מת. ואכתי אין מובן מה התנצלות היא זו שמת בחטאו. אכן הוא הדבר אשר דברנו, כי אמרו שאביהם לא השתתף בחבורת העם אשר נוסדו יחד בשפה אחת ובדברים אחדים למרוד בה', כי אם בחטאו הפרטי מת, ואינו דומה חטאו של יחיד לחטא רבים המתחברים למטרה אחת לחטוא ולמרוד במקום."},{"passage_id":"vayikru2_9c71195c_p12","passage_content":"ועפ\"י זה מבואר כי ככל שיתרבה קבוץ החוטאים ויתחזק איחודם תגדל מדורת החטא, ואז יעשן בהם אף ה' וקנאתו. ולפיכך בזמן שאומות העולם רודפים אחר ישראל, כי כך נגזרה גזרה בשמים על פשעי ישראל, אזי כאשר אחד מהאומות רודף אלף מישראל יניסו שנים מהם רבבה, כי לפי שהרדיפה באה לצד עוונות ישראל, א\"כ ככל שיגדל ריבוי העם וקיבוצם יחד, תגדל אשמתם. ומובן כי כאשר יהיו עשרת אלפים מישראל מאוחדים יחד לחטוא לפני השי\"ת יגדל חרון האף, ויתחזק כח האומות הרודפים אחריהם, עד ששנים מן האומות בכוחם לרדוף עשרה אלפים."},{"passage_id":"vayikru2_9c71195c_p13","passage_content":"ועוד יש לתרץ קושית התוספות על אמרם ז\"ל לעולם מדה טובה מרובה ממדת פורעניות, שהרי מצינו במדת פורעניות איכה ירדוף אחד אלף וגו' ואילו במדה טובה כתיב ורדפו מכם חמשה מאה ותו לא. ויתיישב גם מה שהקשה רש\"י ז\"ל שאין החשבון מכוון שאם חמשה רודפים מאה אזי מאה שני אלפים ירדופו. ונראה בהקדם לבאר דברי התרגום (קושיא ב') ודקטלין בחרבא לא יעידון בארעכון, ואפ\"ל כי בעל התרגום לשיטתיה אזיל שכתב בפרשת ויחי עה\"פ אשר לקחתי מיד האמורי בחרבי ובקשתי בצלותי ובבעותי. הרי כי דעת התרגום דיתכן לפרש חרב האמור במקרא מענין תפלה. כמו כן אפ\"ל שכוונתו באמרו ודקטלין בחרבא לא יעידון בארעכון שהכתוב מבשר שלא יסור ולא יתבטל מישראל כח התפלה, כי רב הוא, ועל ידו ינצחו שונאיהם ברוממות א-ל שבגרונם, כאילו היו אוחזים חרב פיפיות בידם. דעל כרחך לומר שאין דברי התרגום כפשוטן דקאי על חרב ממש שלא תסור מארצם, דאין זו ברכה אלא להיפך, אמנם לפי דברינו א\"ש כי ברכה גדולה היא להם, שיהיה כח התפלה בישראל ולא יתבטל מהם."},{"passage_id":"vayikru2_9c71195c_p14","passage_content":"ועל פי האמור כי הכתוב מדבר בנצחון ישראל על אויביהם שלא בדרך מלחמה, הנה מקום אתי לבאר גם דברי הכתוב ורדפו מכם חמשה מאה בדרך זו, בהקדם מה שכתב הכלי יקר ז\"ל בפרשת בשלח על דרשת חז\"ל בילקוט עה\"פ וחמושים עלו בני ישראל מארץ מצרים אין חמושים אלא מזויינים בחמשה כלי זיין, והקשה וכי מלחמתם של ישראל תלויה בכלי זיין, והלא השי\"ת מגן בעדם, והתורה והתפלה הם כלי זיינם של ישראל. ואף אם נאמר שחייב אדם לעשות בדרך הטבע כל אשר ימצא בכוחו לעשות, ומה שיחסר הטבע ישלים הנס, מ\"מ על מה זה הגיד הכתוב לנו שהיה לכל אחד ה' כלי זיין, ומניינא למה לי. ועוד וכי בדרך נס או במקרה היה, שנמצאו ביד כל אחד חמשה לא פחות ולא יותר. ופירש שבא הכתוב להודיענו שלא היה בידם שום כלי זיין כי אם חמשה חומשי תורה וכו',  וז\"ש חמושים היינו מזויינים הכל רמז לתורה וכו', עיי\"ש וינעם לך."},{"passage_id":"vayikru2_9c71195c_p15","passage_content":"ובדרך זו יתבאר מאה\"כ ורדפו מכם חמשה מאה, דלא מיירי בחמשה אנשים מלומדי מלחמה אשר בכח גבורתם ירדפו מאה, אלא קרא מיירי באחד מישראל שירדוף אחרי מאה אויבים בזכות חמשה חומשי תורה שהם כלי זיינם של ישראל. ולפי זה מכוון החשבון שאם אחד ירדוף מאה, אזי מאה רבבה ירדופו, ומיושב מה שהקשה רש\"י ז\"ל והבן. ובזה תתבאר דרשת הת\"כ עה\"פ ורדפו מכם מן החלשים שבכם ולא מן הגבורים שבכם. והכוונה כי מה שיש צורך בהצטרפות כח התורה של מאה מישראל כדי לרדוף אחרי רבבה מן האויבים, הוא רק בחלשים שבהם, כלומר אותם שאין תורתם בשלימות, ולא כן בגבורים שבהה הה הצדיקים גבורי כח עושי דברו, שאין צורך במספר מרובה מהם לרדוף ולנצח את האויבים, שהרי אף צדיק אחד דיה זכותו להגין על העולם כולו, כמאה\"כ (משלי פ\"י) וצדיק יסוד עולם. ואיתא בספר הזה\"ק (ח\"א פ\"ב ע\"א) עלמא כוליה קאים על סמכא חד וצדיק שמיה. (ועי' חגיגה י\"ב ע\"ב)."},{"passage_id":"vayikru2_9c71195c_p16","passage_content":"ועתה נחזור ליישב קושיית התוספות הנ\"ל דאין שייך להקשות ממה שמצינו במדת פורעניות איכה ירדוף אחד אלף ובמדה טובה כתיב ורדפו מכם חמשה מאה, דלא קרב זה אל זה כלל, שלא הרי רדיפת ישראל אחרי האויבים כרדיפת אוה\"ע אחרי ישראל, כאשר נתבאר דהך קרא ורדפו מכם חמשה מאה לא מיירי ברדיפה במלחמה בדרך הטבע, אלא שישראל מנצחים את אויביהם בזכות התורה שבידם, וא\"כ מה שייך להקשות מן הכתוב איכה ירדוף אחד אלף דמיירי ברדיפה בכת החרב, לדברי הכתוב ורדפו מכם חמשה מאה דמיירי בנצחון בכח התורה דלא שייכי זה לזה כלל. ועוד דאין כל גריעותא בדבר זה שבכח התורה נחוץ אנשים מרובים יותר, ואדרבה דבר זה הוא תוספת ברכה שהבטיחה תורה שיהיו מרובים בישראל ת\"ח העוסקים בתורה, ובהצטרף זכות תורתה יחד ינצחו את אויביהם, וברכה גדולה זו שיהיו העוסקים רבים וכן שלמים, ויהיה בכח תורתם לנצח שונאיהם. ואין זה דומה לנצחון במלחמה בזרוע בשר ששה שבח הוא לומר כי נצחו המעטים את המרובים, מה שאין כן בתורה, והבן."},{"passage_id":"vayikru2_9c71195c_p17","passage_content":"ויש להביא ראיה למה שפירשנו דברי הכתוב דלא מיירי בנצחון ישראל על האויבים בדרך מלחמה, בי אה בכח תורתם ותפלתם, מדברי הת\"כ (הובא ברש\"י ז\"ל) עה\"פ ורדפתם את אויביכם ונפלו לפניכם בחרב, איש בחרב רעהו, ע\"כ. ולכאורה לפי דרשה זו שתכנס בם רוח תעתועים להכות איש את רעהו לפי חרב, א\"כ מה רבותא משמיענו הכתוב כמה יהיה מספר הרודפים, באמרו ורדפו מכם חמשה מאה וגו', הלא בין אם מעט או הרבה יהיו אין זו רבותא, כי לא בחרבם יפלו אויביהם אלא איש בחרב רעהו יפלו שדודים. אך לדרכנו יתבארו דברי הת\"כ על נכון, כי אף שתהיה חרב איש ברעהו ולא יצטרכו ישראל להלחם נגדם בכלי זיין, מ\"מ הרי כל זה הוא בכח תורתם של ישראל, ועל כן מודיענו הכתוב מניינא, להשמיענו כי בצירוף זכות תורתם של מאה מישראל יפלו רבבה מן האויבים, איש בחרב רעהו, והבן."},{"passage_id":"vayikru2_9c71195c_p18","passage_content":"ועתה נבא לביאור המד\"ר המוצג בפתח דברינו, שאמר דוד בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות וכו'. כי הנה דוד המלך ע\"ה לחם כל ימיו מלחמות גדולות עם האומות, וכל מלחמתו היתה להכרית זרע רשעים ולקדש שם שמים בעולם, והיו מעשיו רצויים ומקובלים וחביבים מאד לפני הבוי\"ת, כי את מלחמת ה' הוא נלחם, וכדאיתא במדרש ילקוט (שמואל ב' רמז קמ\"ה) האתה תבנה לי בית (שמואל ב' ז') וכתיב לא תבנה בית לשמי כי דמים רבים שפכת (מלכים א' כ\"ח), כיון ששמע דוד כך נתיירא אמר הרי נפסלתי מלבנות ביהמ\"ק אמר ר' יהודה בר אילעי א\"ל הקב\"ה דוד אל תירא חייך הם לפני כצבי וכאיל וכו', ד\"א הם לפני כקרבנות. ולפי שהיו כל מלחמותיו לשם שמים היה דוד זהיר מאד שלא ימצא שמץ פסול בין אנשי הצבא היוצאים לשדה המלחמה, ומלבד שהי' נזהר בכל האזהרות הכתובות בחלוצי צבא, כגון הא דאמרו ז\"ל שח בין תפלה לתפלה חוזר עליה מעורכי המלחמה, עוד היה מדקדק שיהיו כל אנשי המלחמה מיוחסים ולא ימצא בהם שמץ פסול יוחסין, כדתנן במתניתין פ' עשרה יוחסין (דף ע\"ו ע\"א) אין בודקין וכו' מי שהיה מוכתב באסטרטיא של מלך (הנושא אשה ובודק ביחוס אבותיה ואם התחיל לבדוק באבותיה ומצא שאחד מהם היה מוכתב באסטרטיא של מלך אין צריך לבדוק יותר), ואיתא בגמרא עלה א\"ר יהודה אמר שמואל בחיילותיו של בית דוד שנו (שהיו זהירין ליחשם מכל מום כדמפרש) מאי קרא (דה\"י א' ז') והתיחשם בצבא המלחמה, וטעמא מאי אר\"י א\"ר כדי שתהא זכותן וזכות אבותן מסייעתם, ע\"כ. ולפי זה נמצא כי לא רבים זכו להמנות בחיילותיו של דוד, כי זעירין אינון שיש בהם כל המעלות הללו, וודאי שלא היתה מלחמתו בדרך הטבע כי אם בכח ובזכות התורה גבר על שונאיו. וכמו שנתבאר גם במאה\"כ ורדפו מכם חמשה מאה דקאי על זכות חמשה חומשי תורה."},{"passage_id":"vayikru2_9c71195c_p19","passage_content":"והנה דהע\"ה היה אדיר חפצו להדביר עמים תחתיו ולאומים תחת רגליו, שלא תהא להם תקומה כלל, ובזה יתגדל ויתקדש שמו ית' בעולם, כי המון גוים רבים נוסדו יחד על ה' ועל משיחו, מגודל שנאתם וקנאתם בעם ה', ובהיות להם מפלה נצחת יכירו וידעו הכל כי אמת מלכנו אפס זולתו, וכל הגוים כאין נחשבו נגדו. ולפיכך היה דוד המלך ע\"ה חושב מחשבות להרבות מספר גדודי צבאותיו, כי ככל שיהיו מרובים במנינם יגדל כח תורתם, ויהיה זכותם גדול יותר לנצח את אויביהם במערכות המלחמה, ועלתה בדעתו כי מן הראוי הוא שילך למקומות מושבותיהם של הריקים והפוחזים, ובכח קדושתו ישפיע עליהם לחזור בתשובה, וללכת בדרך התורה, וע\"י כן יתוספו אל צבאו הרבה אנשים כשרים הראויים למלחמה, ותצטרף גם זכות תורתם ותפלתם למגר את אויבי ה', ולהכרית מארץ זכרם."},{"passage_id":"vayikru2_9c71195c_p20","passage_content":"וזה שאמר דוד בכל יום הייתי מחשב למקום פלוני וכו' ולבית דירה פלונית אני הולך, שביקש ללכת אליהם להחזירם בתשובה, ולקרבם לתורה, כדי שיהיו לו לעזר במלחמתו בזכות תורתם ותפלתם. אמנם אח\"כ חזר בו ממחשבתו זו והיו רגליו מוליכות אותו לביהמ\"ד, כי התבונן שלא יראה ולא ימצא במקומות ההם מי שראוי לקרבו ולצרפו אל אנשי הצבא היוצאים למלחמה, והחליט שלא יזוז מבין כותלי בית המדרש, כי רק שם יתכן למצוא אנשים צדיקים שלא פגמו אפילו באיסור דרבנן, וראויים הם להיות נמנים בחיילותיו, ולא בין הריקים והפוחזים, כי אם יתערב בין אנשי הצבא בעל עבירה ח\"ו לא תצמח מכך טובה, כאשר הזהירה תורה באיש הירא מעבירות שבידו ולא ימס לבב אחיו כלבבו. וכ' הרמב\"ן ז\"ל בהשגותיו לס' המצות להרמב\"ם במצוות ל\"ת שלדעתו השמיטן הרמב\"ם ז\"ל (מצוה י\"א) כי העובר עבירה בשעת מלחמה שני לאוין בידו, חדא העבירה גופא ועוד עבר על ונשמרת מכל דבר רעי כי העובר עבירה בשעת מלחמה גורם בחטאו להפיל עם ה' ביד גויים. על כן החליט דהע\"ה שלא לבחור ולקרב אליו כי אם מיושבי ביהמ\"ד המשכימים ומעריבים לביהמ\"ד, שבכח תורתם ותפלתם שונאי ישראל כלים מאליהם."}]},{"dvar_torah_id":"vayikru2_10435cd1","title":"מעלת הלימוד בבתי מדרשות","summary":"דוד המלך ע'ה חשב על מתן שכר מצוות, אך בסופו של דבר רגליו הביאו אותו לבתי מדרשות. המדרש מדגיש את חשיבות הלימוד בתורה בסתר, וכיצד השפעתה יוצאת החוצה, מבלי צורך לצאת לרחובות.","contents":[{"passage_id":"vayikru2_10435cd1_p1","passage_content":"אם בחקתי תלכו וגו' במד\"ר איתא הה\"ד (תהלים קי\"ט) חשבתי דרכי ואשיבה רגלי אל עדותיך, אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות, הה\"ד ואשיבה רגלי אל עדותיך. והקושיא מפורסמת כיצד יתכן לומר כזאת על דוד המלך ע\"ה, שהיה מעלה במחשבתו מדי יום ביומו ללכת למקומות אחרים ולא לבית המדרש."},{"passage_id":"vayikru2_10435cd1_p2","passage_content":"ב) עוד איתא במד\"ר עה\"פ חשבתי דרכי וז\"ל, ר' הונא בשם ר' אחא אמר חשבתי מתן שכרן של מצוות והפסדן של עבירות ואשיבה רגלי אל עדותיך. וראה גם זה פלאי כיצד אפ\"ל כן על דהמע\"ה, שחשב מתן שכרן של מצוות ובעבור כן החליט בדעתו ואשיבה רגלי אל עדותיך דמשמע מזה כי עבודתו היתה בעבור תקות השכר אשר יגיעהו מעשיית המצוות, וקשה שהרי בשירי דוד המלך ע\"ה מפורש אשרי איש ירא את ה' במצוותיו חפץ מאד, ודרשו ז\"ל במסכת ע\"ז (דף י\"ט ע\"א) א\"ר אלעזר במצוותיו ולא בשכר מצוותיו, והיינו דתנן (אבות פ\"א מ\"ג) הוא היה אומר אל תהיו כעבדים המשמשים את הרב על מנת לקבל פרס אלא הוו כעבדים המשמשים את הרב שלא על מנת לקבל פרס, ע\"כ. וא\"כ כיון דאיהו גופיה קא משבח מעלת העובדים שלא על מנת לקבל פרס ודאי שלא עשה מאהבת השכר, וכיצד אמר חשבתי מתן שכרן של מצוות וכו' ולפיכך ואשיבה רגלי אל עדותיך"},{"passage_id":"vayikru2_10435cd1_p3","passage_content":"ג) עוד איתא במד\"ר (פל\"ה ד') אם בחקתי וגו' חקים שבהם חקקתי את השמים ואת הארץ שנא' (ירמיה ל\"ג) אם לא בריתי יומם ולילה חקות שמים וארץ לא שמתי חקים שבהם חקקתי את השמש ואת הירח שנאמר וכו', חקות שבהם חקקתי את הים וכו' את החול, חוקים שבהם חקקתי את התהום וכו',  עכ\"ד המדרש. וצ\"ב שייכות דרשה זו להכא, דהלא כאן הכתוב מזרז על העסק והעמל בתורה הקדושה כמו שפירש\"י ז\"ל אם בחקתי תלכו שתהיו עמלים בתורה, ומאי נפקא מינה להכא שהקב\"ה ברא תבל ומלואה בחקי התורה."},{"passage_id":"vayikru2_10435cd1_p4","passage_content":"ד) בתנחומא ר\"פ זו איתא אם בחקתי תלכו זש\"ה (משלי ח') חכמות בחוץ תרונה ברחובות תתן קולה שאל ר' שמואל בר נחמני את ר' יוחנן בר' אלעזר שהיה עומד בשוק א\"ל שנה לי פרק אחד, א\"ל יודע אתה לקרות ואין אתה יודע לשנות, מהו חכמות בחוץ תרונה בחוצה של תורה א\"ל המרגלית היכן נמכרת היא לא בחוץ אבנים טובות ומרגליות וכו', אין מוליכין אותן לא לבעלי ירקות ובצלים ושומים אלא במקום סוחרים וכו', כך התורה בחוץ היא נאמרת שנאמר חכמות בחוץ תרונה ברחובות. מהו ברחובות במקום שמרחיבין, והיכן מרחיבין לה בבתי כנסיות ובבתי מדרשות וכו', עכ\"ד המדרש. וצ\"ב שייכות עובדא זו להכא. גם צריך להבין דרשתם ז\"ל, שאם כוונת הכתוב לומר שחכמת התורה תהיה נלמדת בבתי כנסיות ובתי מדרשות, א\"כ מדוע נקט לה קרא בלישניה בחוץ וברחובות, דאיכא למטעי שכוונתו לשווקים ורחובות ממש, ואיצטריך למידרש מיניה בחוץ בחוצה של תורה וברחובות במקום שמרחיבין לה, יותר הוה ליה למימר בהדיא חכמות תרונה בבתי כנסיות ובבתי מדרשות, ושוב לא היה מקום לטעות בכוונת הכתוב."},{"passage_id":"vayikru2_10435cd1_p5","passage_content":"ונראה שכל המדרשים הללו על קוטב אחד סובבים, והכל הולך אל כוונה אחת, ומה שחסר זה יגיד עליו ריעו. דהנה במסכת מועד קטן (דף ט\"ז ע\"ב) איתא כהך עובדא דמייתי בתנחומא אך באופן אחר קצת. דהכי גרסינן התם גזר רבי שלא ישנו לתלמידים בשוק, מאי דרש חמוקי ירכיך כמו חלאים (שה\"ש פ\"ז) מה ירך בסתר אף ד\"ת בסתר (פירש\"י דכתיב בסיפא דקרא מעשי ידי אמן התורה מעשי אומנתו של הקב\"ה) יצא ר' חייא ושנה לשני בני אחיו בשוק וכו', שמע רבי איקפד, אתא ר' חייא וכו' נהג נזיפותא בנפשיה תלתין יומין, ביום תלתין שלח ליה ליה תא, הדר שלח ליה וכו', מ\"ע עביד מר הכי א\"ל דכתיב חכמות בחוץ תרונה. א\"ל אם קרית לא שנית ואם שנית לא שלשת ואם שלשת לא פירשו לך, חכמות בחוץ תרונה וכו' כל העוסק בתורה מבפנים תורתו מכרזת עליו מבחוץ, עכ\"ד הגמרא."},{"passage_id":"vayikru2_10435cd1_p6","passage_content":"היוצא מזה כי באמת תורה צריך ללמוד אך ורק בבית המדרש כי שם מקומה של תורה, וכך היא דרכה של תורה שתהא נלמדת בסתר, וכמו שפירש\"י ז\"ל שם כי התוה\"ק נקראת מעשי ידי אמן משום שהיא אומנתו של הקב\"ה שנסתכל בה וברא עולמו, והקב\"ה ברא עולמו בסתרי סתרים בטרם כל יציר נברא, וכמו שפירש\"י ז\"ל בפרשת בראשית עה\"פ ויהי ערב ויהי בקר יום אחד למה כתב אחד לפי שהיה הקב\"ה יחיד בעולמו שלא נבראו המלאכים עד יום שני. והכי איתא בבראשית רבה (פ\"ג י\"א) שלא תאמר מיכאל היה מותח בדרומו של רקיע וגבריאל בצפונו וכו' אלא אנכי ה' עושה כל נוטה שמים לבדי רוקע הארץ מאתי מי אתי כתיב מי היה שותף עמי בברייתו של עולם. כי כל מעשי הבריאה צפונים וטמונים מכל חי, ואפילו מה שטמון בסתרי טבע העולם עמוק הוא מני ים, וכל מה שהשיגו החכמים הוא רק כטפה מן הים, ועאכו\"כ הפנימיות שבו הוא עד אין חקר, גבוה מעל גבוה, והרבה ענינים לא השיגם אדם מעולם זולת מרע\"ה אדון הנביאים, ורק לעת\"ל יהיו מושגים לנו, וישנם ענינים שאין להשיגם כלל בשכל אנושי, כי הכל נסתר ונעלם בסתרי סתרים. וזהו גם מה שאמר הכתוב על פלאי הבריאה (תהלים ל\"ג) אין אומר ואין דברים בלי נשמע קולם דהיינו שכל ענינם צפון ונעלם ואין יודע לעמוד על חקר תכונתם, ואפילו הכי בכל הארץ יצא קום ובקצה תבל מליהם, שמכרזת עליהם מבחוץ. וכמ\"ש בברכת יוצר אור מלאה הארץ קניניך. וזהו שדרשו מדברי הכתוב חמוקי ירכיך וגו' מעשי ידי אמן מה ירך בסתר אף דברי תורה בסתר, דלימוד התורה צריך שיהיה בסתר משום שהתורה היא מעשה אומנותו של הקב\"ה, כמאה\"כ מעשי ידי אמן, ובה ברא עולמו בסתרי סתרים, ובכל זאת השמים ושמי השמים הארץ וכל אשר עליה מכריזים ומגלים קבל העולם כולו כי אני ה' לבדי נוטה שמים לבדי רוקע הארץ מאתי, וכמו כן צריך להיות בלימוד התורה שהתורה שלמד בביהמ\"ד בפנים תהא מכרזת עליו בחוצות וברחובות."},{"passage_id":"vayikru2_10435cd1_p7","passage_content":"ובזה יבואר המדרש שאמר דוד המע\"ה בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך וכו',  דמתחלה היה מחשב בדעתו כדהוה ס\"ל לר' חייא, שיהיה מסתובב בחוצות וברחובות לבית פלוני ולמקום פלוני, שהם מקומות שאין בהם תורה, למען ישפיע בהם קצת תורה וקדושה, כי עזה היתה השתוקקותו להפיץ בכל מקום כח התורה וכח הקדושה, וכמאה\"כ (משלי פ\"ל) יפוצו מעינותיך חוצה, אך בסופו של דבר בא לידי מסקנא כדעת רבי שאין לו לצאת ברחובות כדי להפיץ מעינות תורתו, אלא היו רגליו מביאות אותו לבתי כנסיות ולבתי מדרשות ללמוד תורה, והתורה שלמד בפנים בביהמ\"ד בקדושה ובטהרה השפיעה הרחק מחוץ לכתלי ביהמ\"ד ומאליהם יפוצו מעינות קדושתו להאיר מ\"פ תבל. וזהו כוונת הכתוב חכמות בחוץ תרונה, דע\"י לימוד תוה\"ק בביהמ\"ד משפיעים תורה וקדושה בחוצות וברחובות, מבלי שיהיה צורך בהליכה לשם. ומה נמלצו לפי זה דברי המדרש (קושיא ג') אם בחקתי וגו' חקים שבהם חקקתי את השמים ואת הארץ וכו'. דהנה במאה\"כ אם בחקתי תלכו פירש\"י ז\"ל שתהיו עמלים בתורה, ולכאורה היתה הדעת נותנת דמהאי טעמא אפקיה קרא לעמל התורה בלשון הליכה כאמרו תלכו, כדי להורות שכך הוא דרכה של תורה להיות מתהלך בחוץ בשווקים וברחובות ללמוד תורה בפרהסיא לעין כל, וכסברת ר\"ח במאה\"כ חכמות בחוץ תרונה, דאל\"כ הו\"ל לקרא למימר אם בחקתי תלמדו או תתעסקו. לזאת משמיענו המדרש חקים שבהם חקקתי שמים וארץ וכו', כלומר שהתה\"ק הרי הוא מעשה אומנתו של הקב\"ה שבה ברא את עולמו, וכשם שבריאת העולם ע\"י התוה\"ק היתה בסתרי סתרים נעלם מכל ונסתר מכל, ואעפ\"כ בקצה תבל מליהם שמכרזת עליו מבחוץ, כן צריך להיות בלימוד התורה, שיהיו עמלים בה בבית המדרש, והתורה תהא מכרזת עליו בחוץ, מבלי אשר הוא יתהלך ברחובות ובחוצות. כי כח השפעתה של התורה הקדושה רב ועצום הוא, להשפיע למרחקים ולהוציא ממעמקים נשמות הטבועות בעמקי מצולות הקליפות, ושפלים ומשתוקקים להתדבק בתורה ובקדושה. ודרשה זו הרי היא כמסייעת ומגלה על דברי המדרש בריש הפרשה שהיו רגליו של דהמע\"ה מוליכות אותו לבתי כנסיות ולבתי מדרשות לעסוק בתורה, והיתה תורתו מכרזת עניו בחוץ, להלהיב לבבות לתורה ולקדושה, ולקרב את הכמהים ומשתוקקים לשוב ולהתדבק באור החיים. ולטעם זה כינה הכתוב את לימוד התורה בלשון הליכה, כי כח התורה הקדושה מאליה תתהלך בחוצות ותתן קולה בשווקים וברחובות, להכריז ולעורר את העם המתאווים לשתות מבארה באר מים חיים."},{"passage_id":"vayikru2_10435cd1_p8","passage_content":"ובזה מובן היטב גם מה שהביא התנחומא להכא עובדא דר' יונתן ור\"ש בר נחמני, ופירושא דהך קרא חכמות בחוץ תרונה, דבא להעמידנו על אמיתות פירוש הכתוב אם בחקתי תלכו, שאין המכוון שצריכין להתהלך בחוצות לצודד לפשות לתורה, כי במקום שאין מועלת השפעת התורה מביהמ\"ד, אין תועלת גם בהליכה לשם, דאם עדיין יש מקום שתכנס בהם השפעת התורה, תשפיע עליהם התורה אף מבית המדרש. אלא דכוונת הכתוב באמרו אם בחקתי תלכו כדאמרן, שיהיו עמלים בתורה בביהמ\"ד, דלימוד התורה צריך שיהיה בסתר כשם שהקב\"ה ברא עולמו ע\"י התוה\"ק בסתר, והתוה\"ק תלך מעצמה בחוצות וברחובות להכריז עליו ולהשפיע תורה וקדושה מקצה חבל ועד קצהו, להרחיב גבולות הקדושה במדה גדושה."},{"passage_id":"vayikru2_10435cd1_p9","passage_content":"ובדרך זו נלך גם לבאר המדרש (קושיא ב') חשבתי מתן שכרן של מצוות ועונשן של עבירות וכו', בהקדם עוד מה שפירש ק\"ז זלה\"ה בייטב לב פרשת שופטים מה שאמר הכתוב באברהם (בראשית י\"ח) כי ידעתיו למען אשר יצוה את בניו ואת ביתו אחריו ושמרו דרך ה' וגו' למען הביא ה' על אברהם ונו', דלכאורה נראה שזוהי עבודה פחותה על מנת לקבל פרס. אבל הענין מבואר בספה\"ק כי אברהם בעצמותו עבד מאהבת ויראת רוממותו יתעלה, ולפי מדריגתו היה גבוה מכל עם מרוב דביקותו בה' אלקיו, ולא היה באפשרי לו לקרב הרחוקים ופחותי ערך אל עבודתו יתברך בלתי ע\"י שהשפיל עצמו ממדרגתו למדרגה פחותה לפי ערכו, שהיה מעורר לבבם לעבודת ה' מכח אהבת שכר ויראת עונש, ואח\"ז העלה אותם מעלה מעלה ללמדם אהבת ויראת רוממותו יתעלה. וכמ\"ש הרמב\"ם סוף הלכות תשובה (פ\"י ה\"ה) אמרו חכמים לעולם יעסוק אדם בתורה אפילו שלא לשמה שמתוך וכו', לפיכך כשמלמדין את הקטנים ואת הנשים ועמי הארץ אין מלמדין אותם אלא לעבוד מיראה, וכדי לקבל שכר, עד שתרבה דעתם וישיגוהו וידעוהו ויעבדו מאהבה, עכ\"ל. וזש\"ה כי ידעתיו למען (שהוא משפיל עצמו מבחינתו הרמה) אשר יצוה את בניו וגר ושמרו דרך ה' וגו', למען הביא ה' על אברהם וגו', דהיינו בשביל קבלת פרס והפכו יראת העונש, וזה עצמו מה שאמרו ז\"ל לעולם יעסוק אדם בתומ\"צ שלא לשמה וכו', עיי\"ש."},{"passage_id":"vayikru2_10435cd1_p10","passage_content":"וזה יהיה ביאור המדרש שאמר דוד חשבתי מתן שכרן של מצוות ועונשן של עבירות וכו' דזה המשך וביאור אל הדרשה הקודמת בהך קרא שאמר דוד בכל יום הייתי מחשב ואומר למקום פלוני וכו' אני הולך וכו', וכמו שנתבאר שהיה רוצה לצאת לחוצות ולשווקים להשפיע תורה וקדושה במקומות המרוחקים מדרך התורה, וכלפי זאת אמר המדרש חשבתי מתן שכרן של מצוות ועונשן של עבירות, כי למען יקרב את המון העם לדרך התורה היה לו צורך להשפיל עצמו ממדרגתו ולעורר לבם לעבודת ה' מאהבת השכר ומיראת העונש. אבל כאשר התבונן דהמע\"ה כי לא זו הדרך, אלא ואשיבה רגלי אל עדותיך לעסוק בתורה, ושם כבר אין לו צורך בחישוב מתן שכרן של מצוות וענשן של עבירות, דאם השפעת התורה להמונים פשוטי העם באה מבית המדרש ממילא יוודע להם שיש שכר ועונש, שהרי כל זה מפורש באר היטב בתורה הקדושה."}]},{"dvar_torah_id":"vayikru2_afdf8bfb","title":"שלום בארץ ותפקיד היצה\"ר","summary":"דוד המלך מחשב דרכיו ומגיע לבתי כנסיות. המדרש מדגיש את הקשר בין שפע המאכל לשלום, ומבאר שהיצה\"ר שונא שלום. הבטחת ה' לשלום בארץ נוגעת לעתיד שבו ייכחד היצה\"ר, והעבודה להילחם בו היא עיקרית.","contents":[{"passage_id":"vayikru2_afdf8bfb_p1","passage_content":"אם בחקתי תלכו וגו' במד\"ר ריש פרשתן איתא הה\"ד (תהלים קי\"ט) חשבתי דרכי ואשיבה רגלי אל עדותיך, אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות וכו'. רבי מנחם חתנא דרבי אלעזר בר אבינא אמר חשבתי מה שכתבת לנו בתורה אם בחקתי תלכו ומה כתיב תמן ונתתי שלום בארץ וכו',  וצריך ביאור."},{"passage_id":"vayikru2_afdf8bfb_p2","passage_content":"ב) להלן בפרשה ונתתי שלום בארץ וגו',  פירש\"י ז\"ל שמא תאמרו הרי מאכל הרי משתה אם אין שלום אין כלום ת\"ל אחר כל זאת ונתתי שלום בארץ, ע\"כ. ולכאורה נראה מסגנון דברי רש\"י ז\"ל כי היא הנותנת דמחמת ריבוי מאכל ומשתה אין שלום בארץ, עד שמבטיח הקב\"ה דעל אף ריבוי המאכל והמשתה יפרוש סוכת שלומו על ישראל. וצריך להבין על מה ולמה יהיה שפע המאכל והמשתה גרמא לביטול השלום מן הארץ."},{"passage_id":"vayikru2_afdf8bfb_p3","passage_content":"ג) בילקוט ראובני פרשה זו מייתי בשם מדרש (שוחר טוב על תהלים מזמור ק\"כ) עה\"פ רבת שכנה לה נפשי עם שונא שלום וכי יש אדם שונא שלום אלא זה עשיו ששונא שלום שנאמר ונתתי שלום בארץ אימתי כן והשבתי חיה רעה מן הארץ ואין חיה רעה אלא חזיר שנאמר (תהלים פ') יכרסמנה חזיר מיער זה עשיו הרשע, ע\"כ. וצריך ביאור האם רק עשיו הנו שונא שלום, והלא כמה רשעים ישנם בעולם שהם בעלי מחלוקת ושונאי שלום. וכדאיתא במד\"ר (בראשית פ\"ח ה') בשעה שבא הקב\"ה לבראות את אדה\"ר נעשו מלה\"ש כתים כתים מהם אומרים אל יברא ומהם אומרים יברא וכו', שלום אומר אל יברא דכוליה קטטה וכו'. כי כך דרכם של סתם בני אדם שרצונם בשלום אך בתנאי שחבירו יכנע אליו וישלים עמו כרצונו, ואם לאו עושה עמו קטטה ומחלוקת. וא\"כ מאי קא מתמה המדרש וכי יש אדם שונא שלום, ופשפש ולא מצא אלא עשיו בלבד."},{"passage_id":"vayikru2_afdf8bfb_p4","passage_content":"ונראה בהקדם הא דאיתא במדרש ילקוט (מלכים רמז רי\"ד) ומקורו בתנחומא פרשת מסעי (סימן ח') שבשעה שאמר אליהו לעובדי הבעל בחרו לכם הפר האחד ועשו ראשונה וכו', והביאו שני פרים תאומים וכו',  והטילו עליהם גורלות אחד לשם שמים ואחד לשם הבעל, ובחרו להם הפר האחד וכו', הפר שענה לשם הבעל נתקבצו אותם נביאי הבעל ונביאי אשירה לזוז עמם ולא יכלו וכו', השיב הפר ואמר לאליהו וכו' אני וחבירי יצאנו מרחם אחד וגדלנו וכו' על אבוס אחד, והוא עלה לחלקו של מקום ושמו של הקב\"ה מתקדש עליו, ואני עליתי נחנק הבעל להכעיס את בוראי. א\"ל אליהו לך עמהם וכו', שכשם ששמו של הקב\"ה מתקדש על זה שעמי כך מתקדש עליך וכו', עיי\"ש. והקשה הרדב\"ז ז\"ל בתשובותיו (סי' תרמ\"א) דלפי הך מדרשא נמצא שהיה כאן נס היוצא מדרך הטבע, שפתח הפר את פיו ודבר בלשון בני אדם, וא\"כ מדוע לא נזכר נס זה בדברי הכתוב, דהוה ליה לקרא להזכיר נס גדול זה, כשם שכתוב באתונו של בלעם ויפתח ה' את פי האתון, ותירץ דאליהו הנביא לא עם הפר עצמו דבר, אלא עם שרו של הפר בשמי מעלה, ואין הדבר בגדר נס עד שיוצרך הכתוב לספר עליו, ע\"כ."},{"passage_id":"vayikru2_afdf8bfb_p5","passage_content":"ולפי זה אפ\"ל גם בכוונת המדרש שוחר טוב הנ\"ל (קושיא ג') שדרש דשונא שלום קאי על עשיו דכוונתו על הס\"מ שרו של עשיו בשמים, שהוא שונא שלום. ויתבאר עפ\"י דברי ק\"ז זלה\"ה בתפלה למשה (תהלים מזמור ק\"כ) לפרש מאה\"כ אני שלום וכי אדבר המה למלחמה, דאלו הם דברי היצה\"ר הטוען כי באמת כוונתו לטובה במה שהוא מסית את הבריות לחטוא, כי ע\"י שלא יאבו לו ולא ישמעו אליו יוצמח השלום הגמור, ומה הוא חייב בזה ששומעים אליו וכו', עיי\"ש בדבריו. היוצא מזה כי היצה\"ר עצמו אינו חפץ שבני אדם יעשו עמו שלום ויקבלו הסתותיו ופיתוייו, אדרבה עז רצונו שילחמו עמו תמיד, וכמו שהזהירו חז\"ל (ברכות ה' ע\"א) לעולם ירגיז אדם יצ\"ט על יצה\"ר. כי האדם מצווה לעמוד עם היצה\"ר בקשרי המלחמה תדיר, והיצה\"ר עצמו שונא לאותם בני אדם העושים עמו שלום. והיינו דמקשה המדרש וכי יש לך אדם שונא שלום, כלומר איה איפה תמצא בני אדם השונאים למי שנכנע אליהם ומשלים עמהם ללכת אחרי דעתם ופקודתם. ועל כן אמר דשונא שלום קאי על עשיו דהיינו הס\"מ שרו של עשיו השונא לאותם בני אדם המשלימים עמו, ומתפתים לשמוע בקול דברו, ומייתי מקרא שנאמר ונתתי שלום בארץ, אימתי כשיתקיים והשבתי חיה רעה מן הארץ וגו',  כלומר כאשר רוח הטומאה יעבור מן הארץ, אזי יהיה שלום אמיתי ממלחמת היצה\"ר."},{"passage_id":"vayikru2_afdf8bfb_p6","passage_content":"ובבחינה זו ביארנו מאמר תמוה במסכת זבחים (דף קט\"ז ע\"א) וז\"ל בשעת מתן תורה נתקבצו האומות אצל בלעם הרשע ואמרו לו מה קול ההמון הזה וכו' א\"ל חמדה טובה יש בבית גנזיו וכו', וביקש ליתנה לבניו מיד פתחו כולם ואמרו ה' יברך את עמו בשלום. ולכאורה מה זאת היתה להם לאוה\"ע שנעשו לפתע פתאום אוהבי ישראל ודורשי טובתם, עד שאצלו להם ברכת השלום. אמנם לדברינו יובן שפיר, כי האומות אמרו כן מגודל שנאתם לישראל, כי בשעה שנודע להם שישראל קבלו את התורה בירכו את ישראל שיהיה להם שלום עם היצה\"ר, ולא ילחמו כנגדו וע\"י כך ממילא תפוג תורה, כי רק כל זמן שישראל נלחמין עם יצרן בכל עת יהיה קיום לתורה דזהו עיקר קיומה של תורה."},{"passage_id":"vayikru2_afdf8bfb_p7","passage_content":"ועל פי אמרנו נבא לבאר גם כוונת רש\"י ז\"ל (קושיא ב') שמא תאמרו הרי מאכל הרי משתה אם אין שלום אין כלום דהנה לדרכנו הכתוב מדבר מן השלום האמיתי ממלחמת היצה\"ר שיהיה לישראל לעת\"ל כמו שדרשו ז\"ל מדכתיב והשבתי חיה רעה מן הארץ. והנה בזמן שיש לאדם הרחבה גדולה ונפשו מליאה כל טוב אזי יצרו מתגבר עליו ביותר כמאה\"כ (דברים ח') פן תאכל ושבעת ובתים טובים תבנה וישבת וגו' ורם לבבך ושכחת וגו' (ועיין ברכות ל\"ב ע\"א אין ארי נוהם וכו' עיי\"ש באורך). ולזאת כיון שהבטיח הכתוב שיריק על ישראל שפע ברכה עד בלי די, יש לחוש פן יאמר נא ישראל, הרי מאכל הרי משתה ודין גרמא שאין שלום ממלחמת היצה\"ר, שהרי היצה\"ר מתגבר מחמת ריבוי מאכל ומשתה. לפיכך הבטיח הכתוב ונתתי שלום בארץ, דאף שיהיה לישראל שפע ברכה והרוחה בלי גבול ומדה, יהיה להם השלום האמיתי ממלחמת היצה\"ר, כי רוח הטומאה יעבור מן הארץ, ולא יוסיף עוד היצה\"ר להתגרות בהם כלל ועיקר."},{"passage_id":"vayikru2_afdf8bfb_p8","passage_content":"ועתה נבא אל ביאור המדרש המוצג בפתח הדבור, דהנה האה\"ח כתב (באופן הח') לפרש הפסוק אם בחקתי תלכו וזלה\"ק, להיות שיש שני סברות א' של ר' יוחנן וא' של ר' יונתן א' אמר נחלף אפיתחא דע\"ז דנכיס יצריה, וא' אמר נחלף אפיתחא דזונות כי היכי דנכפייה ליצרן ונקבל אגרא (עבודה זרה דף י\"ז רע\"ב) ובא הכתוב כאן והכריע עם האומר נחלף אפיתחא דזונות, והוא אומרו אם בחקתי תלכו, פירוש יכולים אתם לילך ואני מבטיחכם שאת מצוותי תשמרו, שתהיו כופין יצרכם וכו', ע\"כ. ועפ\"י זה אף אנו נאמר בביאור המד\"ר אמר דוד בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך, פירוש שרצונו היה לחלוף על פני מקומות הללו שיש בהם התגברות גדולה של היצה\"ר כדי שיכפה את יצרו, וכסברת האומר נחלף אפיתחא דזונות כי היכי דנכפייה ליצרן, אבל היו רגלי מביאות אותי לבתי כנסיות וכר. דהנה ידוע מה שנחלקו הקדמונים ז\"ל אם עדיף יותר מי שיש לו נטיה לרע והוא מתגבר עליה, או מעולה ממנו מי שאין לו נטיה לרע כלל. דדעת הרמב\"ם דמי שאינו מתאוה ואין לו נטיה לרע הוא עדיף, ודעת החולקים כי אדרבה המתגבר עדיף שעושה לכבוד קונו, משא\"כ מי שטבעו כך במה עובד אדונו, והכריע ק\"ז זלה\"ה בישמח משה (פרשת ראה ד\"ה בהפטרה) דאלו ואלו דא\"ח, דהתחלת האדם ודאי העיקר כהחולקים, שתהיה לאדם נטיה לרע ויתגבר עליה, אבל אח\"כ טוב יותר שיתעצם בעבודתו עד שיהפך את יצרו לטוב, ולא תהיה לו נטיה לרע כלל. וביאר בזה מאה\"כ (קהלת י\"ב) סוף דבר הכל נשמע את האלקים ירא וגו', עיי\"ש."},{"passage_id":"vayikru2_afdf8bfb_p9","passage_content":"והנה בדוד המלך עליו השלום אמרו ז\"ל (בבא בתרא י\"ז ע\"א) שהרגו ליצרו דכתיב (תהלים ק\"ט) ולבי חלל בקרבי, וא\"כ כיון שכבר התעצם בעבודתו הקדושה עד שלא נותרה בו כל נטיה לרע, שוב לא היה מן הצורך שילך אפיתחא דבי זונות כי היכא דנכפייה ליצריה, שהרי כבר נתבטל ממנו ענין התגברות היצה\"ר כלל, ולא היה הדבר אצלו בגדר נסיון, ועל כן התנחם על מחשבתו הראשונה אשר חשב, והיו רגליו מביאות אותו לבתי כנסיות ולבתי מדרשות."},{"passage_id":"vayikru2_afdf8bfb_p10","passage_content":"ולדרכנו יתבאר גם הא דאיתא במדרש הנ\"ל (קושיא א') חשבתי דרכי חשבתי מה שכתבת לנו בתורה אם בחקתי תלכו ומה כתיב תמן ונתתי שלום בארץ, דדרשה זו תואמת ומשלימה אל הדרשה הקודמת, שאמר דוד בכל יום הייתי מחשב למקום פלוני אני הולך. דהנה לכאורה מדכתיב אם בחקתי תלכו מוכח כדעת הסוברים דמי שיש בו נטיה לרע ומתגבר על יצרו עדיף, וכדברי האה\"ח הקדוש שהכריע מכאן כדעת האומר נחלף אפיתחא דזונות דנכפייה ליצרן. ולכאורה לפי זה גריעותא היא לגבי דוד מה שבטל הימנו יצרו לגמרי, שהרי מי שיש בו נטיה לרע עדיף, שהוא כופה את יצרו לעשות נחת רוח ליוצרו. וזהו שאמר חשבתי מה שכתבת בתורה אם בחקתי תלכו, דמיניה מוכח לכאורה דמי שיש בו נטיה לרע עדיף, אמנם מה כתיב תמן ונתתי שלום בארץ, שהיא הבטחה לישאל שיתבטל יצרם מהם לגמרי, ולא יצטרכו עוד ללחום עמו, הרי מזה דמעליותא היא שיהיה לאדם שלום ושלוה והשקט ובטח ממלחמת יצרו דהבטחה זו היא מן היעודים הטובים שהבטיח הקב\"ה לישראל כאשר ישמרו מצוותיו, אלא דבתחלת העבודה עדיף שתהיה לאדם נטיה לרע. ועל כן כיון שדוד המע\"ה בעבודתו הקדושה ובשברון לבו הרגו ליצרו, היו רגליו מוליכות אותו לביהמ\"ד, דשוב לא היה זקוק ללכת לאותם מקומות, ומעליותא היא לגביה שאחרי עמלו ויגיעתו זכה לעקור ממנו כל נטיה לרע, דזה כל האדם, והוא התכלית המכוון בבריאה."}]},{"dvar_torah_id":"vayikru2_c8523b86","title":"תפילה ותורה לקרב גאולה","summary":"דוד המלך חישב כיצד לקרב את קץ הגאולה, והבין כי הדרך היא בתפילה ובתורה בבתי מדרשות, ולא בפעולות גשמיות. יש להתרכז בהרחבת גבולות הקדושה ולהעתיר לפני ה' שיגאלנו במהרה.","contents":[{"passage_id":"vayikru2_c8523b86_p1","passage_content":"עוד יאמר לבאר המדרש אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מוליכות אותי לבתי כנסיות ולבתי מדרשות. דהנה בסמוך ביארנו כוונת אומרו למקום פלוני ולבית דירה פלונית אני הולך עפ\"י הגמרא מגילה שעתידין בתי טראטריות וכו' ללמד בהם שרי יהודה תורה ברבים, וכמבואר באורך שבעת הגאולה כאשר יתבערו כוחות הטומאה מן העולם יהיו מותרים ללמוד בהם תורה. ולפיכך היה דוד חפץ ללכת לאותם מקומות, משום שסבר כי כבר קרב ובא קץ הגאולה."},{"passage_id":"vayikru2_c8523b86_p2","passage_content":"ובבחינה זו אף אנו נאמר עתה לבאר דברי המדרש אך באופן אחר, דהנה דוד המלך עליו השלום בעוצם תשוקתו לראות קץ הישועה חשב מחשבות כדת מה לעשות כדי לקרב את הקץ, ואחרי שהתבונן בדבר החליט כי אסור לעשות שום פעולות גשמיות כדי לדחוק את הקץ, דאין לנו אלא לשפוך שיח בתפלה ובתחנונים ולעסוק בתורת ה' תמימה בבתי מדרשות, עדי יעתר ה' לנו ויקשיב לקול שועתינו, וישלח לנו משיח צדקנו לגאלנו גאולה נצחית. וכאמרם ז\"ל (ויק\"ר פ\"ז ג') אין הגליות מתכנסות אלא בזכות משניות וכו'. ואף שמצינו בדברי רז\"ל בסוף מסכת כתובות דאחת מן שלש השבועות שהשביע הקב\"ה את ישראל היא שלא ידחקו את הקץ, ופירש\"י ז\"ל שלא ירבו בתחנונים יותר מדאי, הלא כבר ביארנו בספר ויואל משה (מאמר שלש שבועות סימן כ\"ט) מה שנלפע\"ד בפירוש דברי רש\"י ז\"ל דדוקא תפלות ותחנונים שבכחם להכריח ביאת המשיח בטרם זמנו, כגון תפלת רבי חייא ובניו המבואר בהשוכר את הפועלים (דף פ\"ה ע\"ב), הרי הם כדחיקת הקץ, אבל שאר תפלות ותחנונים אין להם גדר וגבול."},{"passage_id":"vayikru2_c8523b86_p3","passage_content":"וזה יהיה ביאור המדרש אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך, כלומר שהיה מחשב בדעתו מה הן אופני הפעולות שעליו לעשות לקרב קץ הגאולה, שאז יהיה מהלך לאותם מקומות שהיו מלפנים בתי טראטריות וקרקסאות כדי להכינם ולהזמינם לתלמוד תורה כמבואר לעיל, אבל היו רגלי מוליכות אותי לבית המדרש, כי אחרי ההתבוננות נחמתי על מחשבתי הקודמת, והחלטתי בדעתי כי דרך אחרת ליכא לקרב קץ הגאולה כי אם ללכת לבתי מדרשות ולהרבות בתפלה ובתחנונים לפניו יתברך ולהרביץ תורה ויראה ומע\"ט ולהרחיב גבולות הקדושה, שזהו הדרך היחידי שעל ידו נזכה לגאולה שלימה, ואז יתקיימו יעודי הנביאים שעתידין בתי טראטריות וקרקסיות להפך לבתים שמרביצין בהם תורה. אבל כל דרך אחרת זולת זה דהיינו עשיית פעולה גשמית בידים לדחוק את הקץ ולקרב ביאת המשיח נאסר עלינו מאת השי\"ת בשבועה חמורה. ואין לנו עצה אחרת רק להרבות בתפלות, ולהעתיר לפניו יתברך שיחוס וירחם עלינו, ויגאלנו במהרה גאולת עולם."}]},{"dvar_torah_id":"vayikru2_df7c0571","title":"","summary":"","contents":[{"passage_id":"vayikru2_df7c0571_p1","passage_content":"בפתיחה לתלמידי הישיבה וסיום מסכת פסחים שנת התשכ\"ד לפ\"ג"}]},{"dvar_torah_id":"vayikru2_44ba0578","title":"לימוד תורה לשמה והכשר מצוה","summary":"הדבר תורה עוסק בחשיבות לימוד התורה לשמה, ובספקות בברכת שהחיינו בפדיון הבן. נידונה השפעת הכוונה בלימוד על קיום המצוות, והקשר בין תורה לשמה לבין הצלת האדם מיצהר רע. יש להקפיד על מדות טובות ולשמור על כבוד שמים.","contents":[{"passage_id":"vayikru2_44ba0578_p1","passage_content":"אם בחוקותי תלכו ואת מצוותי תשמרו ועשיתם אותם. בתנחומא (סימן א') איתא זש\"ה (איוב י\"ד) אם חרוצים ימיו כשברא הקב\"ה את העולם חרץ ימיו של כל אחד ואחד וכו', אמר הקב\"ה לישראל אם עשיתם חוקי אין השטן נוגע בכם וכו', אדם הראשון אלו שמר את התורה ואת המצוה שנתתי לו לא מת, לפיכך כתיב אם בחוקותי תלכו. וצ\"ב להבין כוונת המדרש הלזה, ומה שייכא הך דרשה לפסוק אם בחקותי."},{"passage_id":"vayikru2_44ba0578_p2","passage_content":"ב) בסיומא דמסכת פסחים איתא, רבי שמלאי איקלע לפדיון הבן בעו מיניה פשיטא על פדיון הבן אשר קדשנו במצוותיו וציוונו על פדיון הבן אבי הבן מברך. ברוך שהחיינו וקיימנו והגיענו לזמן הזה כהן מברך או אבי הבן מברך, כהן מברך דקמטי הנאה לידיה, או אבי הבן מברך דקא עביד מצוה. לא הוה בידיה אתא שאיל בי מדרשא, אמרו ליה אבי הבן מברך שתים, והילכתא אבי הבן מברך שתים, ע\"כ. ויש לדקדק דמבואר מהכא שהי' הדבר ספק אם האב יברך שהחיינו או הכהן. ולכאורה היאך הוה ס\"ד לומר שהכהן יברך שהחיינו, והרי איהו לא מידי עביד. דאין מצות פדיון הבן מוטלת כ\"א על האב, אלא שהאב מצווה לפדות בנו אצל הכהן, והכהן מקבל את מעות הפדיון ממנו, ולמה יברך הכהן שהחיינו משום שבא לידו ריוח ממון, האם בכל עת שהאדם מרויח כסף או שוה כסף עליו לברך שהחיינו."},{"passage_id":"vayikru2_44ba0578_p3","passage_content":"ואחשבה לדעת זאת דאולי ספיקא דגמרא הוא דכיון שהכהן מסייע לקיום המצוה, שע\"י שהוא מקבל המעות מיד האב נעשית המצוה, ובלעדיו לא יתכן לקיים מצוה זו, הוה כמו תשמישי מצוה, ולפיכך מספקא להו אי כהן מברך. שוב ראיתי כי קושיא זו הלא כתובה על ספר הצל\"ח, ותירץ כעין מה שכתבנו. וז\"ל עפ\"י מה שהשיב הריב\"ש לשואל למה נוסח הברכה של פדיון הבן היא על פדיון הבן, לפי שמצוה זו לא נעשית ע\"י אבי הבן לחודיה, כמו ציצית ותפילין וסוכה שהמצוה נעשית ע\"י עצמו בלבד, אבל מצוה זו נעשית בסיוע הכהן שמקבל הפדיון, וא\"כ אפשר דמשום דמעי הנאה לחודיה לא היה מספקא ליה כלל שיברך שהחיינו, דאם כן כל המקבל מתנה מחבירו יברך שהחיינו, ובאמת לא שייך שהחיינו בזה, כי אם בהגיע לו כלים חדשים שהוא חשוב, אבל לא בשביל זוזי, אבל עיקר הספק הוא כיון שגם הכהן מסייע במצוה לכך עליו לברך שהחיינו. ואפשר שזה כוונת הגמרא דקא מטי הנאה לידיה, דה\"פ פשיטא דאבי הבן מברך אשר קדשנו במצוותיו וצוונו \"על\" פדיון הבן, וצריך לומר הטעם משום דאין המצוה נגמרת ע\"י האב לחודיה, לכך מספקא ליה מי מברך שהחיינו, עכ\"ד הצל\"ח."},{"passage_id":"vayikru2_44ba0578_p4","passage_content":"אמנם אכתי לא הונח לן בהך תירוצא, דלפי זה עיקר חסר מן הספר, שהרי לפירוש זה טעם הספק אם הכהן מברך הוא משום שהוא המסייע לקיום המצוה, שבאמצעות לקיחתו את כסף הפדיון מן האב נגמרת המצוה, ודבר זה אין לו רמז ורמיזא בגמרא, דלא קאמר אלא הטעם משום דקמטי הנאה לידיה. ועוד אפילו אם נתפוס כפירוש זה, שהספק הוא משום שהכהן מסייע למצוה להתקיים, אכתי אין מובן מאי מספקא ליה, שהרי הא פשיטא שעיקר המצוה מוטלת על האב לפדות את בנו, ואם כן מדוע נימא שהכהן שהוא אינו אלא מסייע בלבד יברך שהחיינו ולא האב הפודה."},{"passage_id":"vayikru2_44ba0578_p5","passage_content":"ובטרם נבא לביאור הענין נקדים מאמר הגמרא (פסחים נ' ע\"ב) אמר רב יהודה אמר רב לעולם יעסוק אדם בתורה ובמצוות אעפ\"י שלא לשמה שמתוך שלא לשמה בא לשמה, והקשו התוספות (ד\"ה וכאן) תימה דרבא גופיה אמר בפ\"ב דברכות (דף י\"ז ע\"א) כל העוסק בתורה שלא לשמה נוח לו שלא נברא, ואור\"י דהתם מיירי כגון שלומד כדי להתייהר ולקנטר ולקפח את חביריו בהלכה ואינו לומד על מנת לעשות, עכ\"ד התוספות. והנה מאמר זה נמצא גם במסכת סופה (דף כ\"ב ע\"ב), ושם האריכו התוס' ליישב סתירה זו וז\"ל, ואי קשיא הא אמרינן בפ\"ק דתענית (דף י\"ז ע\"א) כל העוסק בתורה שלא לשמה נעשית לו סם המות, ובשלהי פרק היה קורא בברכות כל העוסק בתורה שלא לשמה נוח לו שלא נברא, נראה לתרץ עוסק שלא לשמה כגון מיראת היסורין כי הכא ומאהבת קבול פרס שאינו מתכוון להשלים רצון יוצרו שציוהו על כך אנא להנאתו, אבל ההיא שלא לשמה דתענית ומסכת ברכות אינו עוסק בתורה כדי לקיים לא מאהבה ולא מיראה, אנא להוסיף על חטאתו פשע, שעתה שגגות נעשו לו זדונות, שאע\"פ שידע שעובר לא מנע מכל תאות לבו, כדמפרש התם תכלית חכמה תשובה ומעשים טובים, שנא יהא אדם קורא ושונה ומשמש ת\"ח ובועט באביו ובאמו וברבו או במי שגדול ממנו שנאמר ראשית חכמה יראת ה' שכל טוב לכל עושיהם ללומדיהם לא נאמר אלא לעושיהם לעושים לשמה, עכ\"ל התוס'. ומדבריהם נלמד כי מה שאמרו ז\"ל לעולם יעסוק אדם בתורה ומצות שלא לשמת היינו דוקא בלומד מיראת העונש או מאהבת השכר, אבל הלומד ע\"מ שיכבדוהו בני אדם הריהו בכלל אותם שעליהם אמרו ז\"ל נוח לו שלא נברא."},{"passage_id":"vayikru2_44ba0578_p6","passage_content":"אמנם במסכת תענית ובברכות כתבו התוספות באופן אחר, דמה שאמרו נוח לו שלא נברא אינו אלא בלומד לקנטר שלימודו בעבירה, אבל הלומד כדי שיקרא רבי או שיכבדוהו, הרי הוא בכלל אותם שעליהם אמרו לעולם יעסוק אדם בתורה ובמצוות שלא לשמה וכו'. ודברי התוספות בפסחים המובאים בדברינו לעיל לא ברירא לגמרי היאך ס\"ל כי אפשר לפרשו לכאן או לכאן. ולכאורה יש מקום להביא סייעתא לשעת התוספות במס' סוטה, שהלומד ע\"מ שיכבדוהו נוח לו שלא נברא, מדברי התורת כהנים בפרשתן וז\"ל, אם בחקותי תלכו יכול אלו המצוות כשהוא אומר ואת מצוותי תשמורו ועשיתם אותם הרי מצוות אמורות, הא מה אני מקיים אם בחקותי תלכו להיות עמלים בתורה. ועשיתם אותם הלמד לעשות לא הלמד שלא לעשות, שהלומד שלא לעשות נוח לו שלא נברא. הרי להדיא כשיטת התוס' בסוטה שהלומד ע\"מ שיכבדוהו נוח לו שלא נברא, שהרי אינו לומד ע\"מ לעשות, אלא לתקות הכבוד שיגיעו ע\"י לימודו."},{"passage_id":"vayikru2_44ba0578_p7","passage_content":"איברא יש לפרש דברי הת\"כ באמרו הלומד שלא לעשות, דהיינו הלומד ע\"מ לקנטר, כי ודאי מי שלומד כדי לדעת דרך האמת ולהתנהג במדות טובות אינו בא ח\"ו לידי קינטור, אפילו אם כוונתו כדי שיכבדוהו בני אדם. ורק הלומד שלא לעשות, היינו שלא יעשה פרי, ואינו מתנהג בתורה ובדרך ארץ, זהו הלומד לקנטר, ועליו נאמר נוח לו שלא נברא, וכדמסיים בתוספות סוטה שם במאמר הגמרא שלא יהא אדם קורא ושונה ובועט באביו ובאמו ובמי שגדול ממנו וכו'."},{"passage_id":"vayikru2_44ba0578_p8","passage_content":"ובדברי התוספות הללו שפירשו דהא דאמרו הלומד שלא לשמה נוח לו שלא נברא היינו שאע\"פ שלמד אינו מונע כל תאות לבו ובועט באביו וברבו ובמי שגדול ממנו, ביארנו מאמר הגמרא ביומא (ע\"ב ע\"ב) אמר להו רבא לרבנן במטותא מינייכו לא תירתון תרתי גיהנם (פירש\"י תרתי גיהנם להיות יגיעים ועמלים בתורה בעולם הזה ולא תקיימוה ותרשו גיהנם במותכם ובחייכם לא נהניתם בעולמכם). ולכאורה צ\"ב דבשלמא מה שהזהירם שלא יירשו גיהנם לעוה\"ב מובן שפיר, כי אם ילמדו ולא יקיימו סופם לרדת לבאר שחת, אך מה גיהנם יש להם בלמודם בעוה\"ז, האם על יגיעת התורה ולו גם בעוסקים בה שלא לשמה שייך לומר שהוא מר כגיהנם, אתמהה."},{"passage_id":"vayikru2_44ba0578_p9","passage_content":"אכן עפ\"י דברי התוספות הנ\"ל דהעוסק שלא לשמה היינו שאינו נוהג כשורה אלא בועט באביו וברבו ובמי שגדול ממנו מובן היטב, כי זה האיש יש לו גיהנם גם בעוה\"ז, כי לפי שאינו מתנהג כשורה ועוד לו זאת שהוא עוסק בתורת הבריות מבקרים את מומיו, וכדאיתא בגמרא ברכות שם שאומרים ארור שזה ילד ארור שזה גדל, ומתחלל שם שמים על ידו. ולא עוד אלא שהבריות מתקוטטים עמו על רוע מעלליו, כי כך דרכו של עולם לחפש חסרונות דוקא אצל לומדי תורה, ולהטיל מום בחובשי ביהמ\"ד. ואף הוא לא ישתוק לדבריהם אלא ישיב אמריו להם ויתקוטט עמהם, ונמצא כי חייו בעוה\"ז הם חיי גיהנם, כי הוא שבע רוגז וקלון, ולא ימצא מנוח לכף רגלו, וימררוהו ויריבו עמו וישטמהו בעלי חצית על התנהגותו הרעה. וגם בעוה\"ב יירש גיהנם על דרכו הרעת ובפרט אם אינו שומר פיו ולשונו, ואינו מתנהג כראוי לבן תורה במדות טובות להיות נוח לשמים ולבריות, בדרכי התורה והחסידות, הרי מתחלל שם שמים על ידו ויורש תרתי גיהנם. ובבחינה זו רגיל אני לבאר מאמר המשנה באבות (פ\"ה מי\"ד) ארבע מדות בהולכי ביהמ\"ד, הולך ואינו עושה שכר הליכה בידו, עושה ואינו הולך שכר מעשה בידו, הולך ועושה חסיד, לא הולך ולא עושה רשע. והקושיא ידועה דפתח ארבע מדות בהולכי ביהמ\"ד, ומנה ביניהם אינו הולך ואינו עושה, ולכאו' הרי אינו מהולכי ביהמ\"ד כלל. ונראה דהנה לשון הליכה מתפרש בכמה אופנים, כגון הא דאמר קרא אם בחקותי תלכו, שפירושו הוא שיתנהג בדרך התורה. וכמו כן מצינו לשון הליכה על המושפע מעצת זולתו כמאה\"כ וילך איש מבית לוי ואמרו ז\"ל (שמות רבה פ\"א כ\"ג) שהלך בעצת בתו. והרמב\"ן ז\"ל שם כ' כי בעבור שלא חשש לגזרת פרעה ולקח לו אשה להוליד ממנה בנים אמר הכתוב כן, כי בכל מזדרז לעשות ענין חדש יאמר כן וכו', וכן זה נזדרז ולקח את בת לוי, ע\"כ. ועפ\"י זה נבא לביאור המשנה הנ\"ל דהנה האדם הוא בבחינת הולך, כי זה תפקידו בכל ימי חיי הבלו להיות עולה ממדרגה למדרגה וע\"כ הוא קרוי הולך וכמאה\"כ (זכרי' ג') ונתתי לך מהלכים בין העומדים האלה. ולא יתכן שיהיה האדם עומד במקום א' אלא או יעלה ממדרגה למדרגה או להיפך ח\"ו ירד מטה מטה. נמצא לפי\"ז כי לשון הולך יתכן לפרשו על התעלות ממדרגה למדרגה."},{"passage_id":"vayikru2_44ba0578_p10","passage_content":"והנה התנא בא להשמיענו כי ד' מדות יש באנשים הבאים לביהמ\"ד, דיש אדם שהוא נכנס לבית המדרש והוא מתפעל מקדושת המקום, ונפשו מתלהבת ומשתוקקת לקיים מצוות ומעשים טובים, ולהתעלות במדרגות הקדושה. אך לכלל מעשה אינו בא, כי אינו מוציא מחשבתו הטובה אל הפועל, לצד שאין בו הכח והעוז להתגבר על יצרו כאיש, ולסלק כל המכשולים והסבות המונעים אותו מעבודת ה'. ועל האיש הלזה יאמר כי הוא הולך ואינו עושה, כי אמנם התעלה במדרגה כי קדושת ביהמ\"ד עשתה בנפשו רושם לטובה, אך לכלל מעשה לא הגיע. ויש אנשים אשר לומדים בביהמ\"ד, אמנם כל תורתן היא מן השפה ולחוץ ולבם אפום וסתום מלקבל התפעלות ורגשי קדושה, וכקודם למודם כן אחר למודם הם באותו מעמד ומצב, ולא חל בהם שינוי לטובה, לשום על לבם לתקן דרכיהם ומדותיהם. אדם בזה הוא עושה ואינו הולך כי לא הלך מדרגה לדרגה, ועדיין על עמדו יתייצב. והמעולה שבכולם הוא ההולך והעושה, שהוא לומד תוה\"ק בביהמ\"ד, והלימוד עושה בקרבו רושם לטובה, ומלהיב לבו לעבודת ה', ומחשבתו הטובה מביאתו לידי מעשה, והוא מטפס ועולה ממדרגה למדרגה במעלות התורה והחסידות. ולעומתו יש בני אדם הבאים לביהמ\"ד והם בבחינת אינו הולך ואינו עושה, כי אינו עולה ממדרגה למדרגה, ולבו אינו מתעורר ליראה את ה', וגם אינו עושה שום פעולה לטובה בהיותו בביהמ\"ד, וכאשר בא בן ילך ערום בלא מצות ומעש\"ט, ואין ניכר בו רישומא דקדושה. ובזה מובן הא דתנן ארבע מדות בהולכי ביהמ\"ד, בי אמנם כל ארבע הסוגים שמנה כאן הם נכנסין בשערי ביהמ\"ד, ואף אותו שאינו הולך ואינו עושה, בא לביהמ\"ד אלא שאינו הולך ממדרגה למדרגה כמבואר."},{"passage_id":"vayikru2_44ba0578_p11","passage_content":"ומה מאד צריך כל בר ישראל להשתדל שיהיה בבחי' הולך ועושה, ובפרט בני הישיבה שהם הולכי ביהמ\"ד, עליהם להיות בבחי' הולך ועושה, ללמוד וללמד לשמור ולעשות, ולעלות ממדרגה למדרגה, להיטיב דרכיו ומעלליו ולתקן מדותיו, ומאד מאד צריך להזהר שלא לבעל זמן כל דהו, כי אם תעזבני יום יומים אעזבך (ירושלמי סוף ברכות). ושימו נא כלל זה נגד פניכם כי האדם הוא תמיד בבחינת הולך, ואם אינו הולך למעלה אזי ח\"ו יורד למטה."},{"passage_id":"vayikru2_44ba0578_p12","passage_content":"עוד אפשר לבאר מאמר משנת חסידים הנ\"ל, עפ\"י מה דאיתא בברכות (י\"ז ע\"א) בסוף דברי רבא המובאים לעיל תכלית חכמה תשובה ומעשים טובים וכו' שנאמר (תהלים קי\"א) ראשית חכמה יראת ה' שכל טוב לכל עושיהם ללומדיהם לא נאמר אלא לעושיהם, לעושיהם לשמה ולא לעושים שלא לשמה."},{"passage_id":"vayikru2_44ba0578_p13","passage_content":"וביאר המהרש\"א ז\"ל דעושיהם קאי על הלימוד גופי', וקרי הלימוד עשיה, דהיינו כשלומד לשמה דמקיים מצות בוראו ית\"ש. אבל בלימוד שלא לשמה לא הוה קרי ליה עשיה, דאין זה קיום מצות בוראו ית\"ש, שצוה ללומדה לשמה. עכ\"ד המהרש\"א ז\"ל. מדבריו נמצינו למדים דהלימוד לשמה קרוי עשיה, ואפ\"ל טעם לדבריו דבפרשת בא כתיב וילכו ויעשו בני ישראל וגו' ופירש\"י ז\"ל (והוא מדברי המכילתא שם) וכי כבר עשו והלא מראש חדש נאמר להם אלא מכיון שקבלו עליהם מעלה עליהם הכתוב כאילו עשו. הרי מבואר להדיא דאם מקבלים ע\"ע לשמור ולעשות מעלה עליהם הכתוב כאילו כבר עשאוהו בפועל, אבל אם מתחלה לומדים שלא ע\"מ לעשות אין זה חשוב כעשיה כמובן. ומובנים היטב דברי המהרש\"א ז\"ל שהלומד לשמה הרי הוא כאילו עשאו, שהרי כוונתו בלימוד כדי שידע לקיים המצוה בפועל. ולפיכך קראם הכתוב לעושיהם משום שהוא לומד לשמה."},{"passage_id":"vayikru2_44ba0578_p14","passage_content":"וראיה גדולה לפירוש המהרש\"א ז\"ל מדברי הת\"כ המובאים לעיל, שדרש מדכתיב ועשיתם אותם הלמד לעשות לא הלמד שלא לעשות, הרי דמיירי בלומד ואעפי\"כ קראו הכתוב בלשון עשיה, כאילו כבר עשאה, משום שהוא לומד ע\"מ לעשות. ובדרך זה יש לבאר מתני' דארבע מדות בהולכי ביהמ\"ד, יש מי שהולך ואינו עושה, דהנה למוד התורה קרוי הליכה, כפירש\"י בר\"פ זו עה\"כ אם בחקותי תלכו שתהיו עמלים בתורה. וזהו שאמר הולך ואינו עושה, כלומר שהוא לומד תורה ואינו מקבל על עצמו לשמור ולעשות ולקיים מה שלמד, ולכן אין שייך לכנות למודו בלשון עשייה, כמבואר בדברי המהרש\"א ז\"ל. ויש מי שעושה ואינו הולך, כי יש לו רצון טוב ומקבל על עצמו לשמור ולעשות, אך אינו לומד כדי שידע מה החוקים והמשפטים אשר ישמור לעשות. ויש מי שהולך ועושה, והיינו שהוא לומד תוה\"ק ומקבל על עצמו לשמור ולעשות ולקיים, ותרתי למעליותא יש בלימוד זה, כי הוא הולך שמתעמל בתורה, ונחשב לו הלימוד למעשה, משום שמקבל עליו לעשות. ויש מדה רביעית בהולכי ביהמ\"ד והוא שאינו הולך ואינו עושה, כלומר שאינו עמל בתוה\"ק, ומאבד זמנו לריק ושנותיו בבהלה, וגם אינו מקבל על עצמו לתקן ולשמור ולקיים את מצוות ה'. וא\"ש דאמנם כל הארבע מדות מיירי בהולכים לביהמ\"ד, אלא דהא דקאמר אינו הולך ואינו עושה היינו שאינו עוסק בתורה הקרוי הליכה."},{"passage_id":"vayikru2_44ba0578_p15","passage_content":"ובאופן אחר קצת יש לבאר מאמר רבא לתלמידיו במטותא מינייכו דלא תירתו תרתי גיהנם, ודרך שם נבא לביאור הגמרא בסוף מסכת פסחים דמספקא להו אי כהן מברך שהחיינו או אבי הבן. דהנה בגמ' (קידושין ל\"ט ע\"ב) אמרינן שכר מצוה בהאי עלמא ליכא, ולכאורה איזה הדרך יתפרנסו ישראל בעוה\"ז, והרי צריכים אנו להשפעות גשמיות לכלכל עצמינו, וגם לקיום התורה והמצוות נחוצה השפעת הפרנסה, ועוד שנוכל לקיים מאה\"כ (משלי ג') כבד את ה' מהונך, ואם הקב\"ה אינו משלם שכר מצוות בעוה\"ז, באיזה זכות נתברך בברכות שמים מעל בעוה\"ז. אמנם ידוע מה שכתבו המפרשים ז\"ל כי שכר מצוה בהאי עלמא ליכא היינו דוקא על גוף המצוה, אבל ההכנות שאדם עושה לקיום המצוה שהוא הכשר מצוה בדין הוא שיטול שכרו בעוה\"ז וכעי\"ז כתב המהרש\"א ז\"ל בסוטה (דף י\"ד) כי על המצוות שאין האדם חייב בהם אלא שמחזר אחריהם ומביא עצמו לידי חיוב מגיע לו שכר בעוה\"ז, עיי\"ש. והש\"ך עה\"ת בפ' עקב כתב לפרש מאה\"כ והיה עקב תשמעון וגו' וז\"ל, יאמר אם יש לך שכר בעוה\"ז הוא על השמיעה לבד, כמו שכתבנו על הפ' יען אשר עשית את הדבר הזה, שאמר לו הקב\"ה על העשיה אין לך לא ערך ולא שכר, כי שכר מצוה בהאי עלמא ליכא, כי ברך אברכך והרבה ארבה את זרעך עקב אשר שמעת בקולי, כלומר אם יש לך שכר בעוה\"ז הוא על שדשת בעקבך ושמעת בקולי, לזה אמר ברך אברכך והרבה ארבה וכו', עיי\"ש דבריו באורך."},{"passage_id":"vayikru2_44ba0578_p16","passage_content":"והנה כל מה שהתירו חז\"ל לעסוק בתורה שלא לשמה הוא רק משום דמתוך שלא לשמה יבא לשמה, אבל אם אינו לומד לכוונה זו, שיעלה ויבא ויגיע למדרגת לימוד התורה לשמה, פשיטא דאין שום היתר בעולם ללמוד שלא לשמה. וא\"כ נמצא דלימוד התורה שלא לשמה הויא הכנה והכשר אל הלימוד לשמה, ובאמת כבר דקדקו המפרשים במאמרם ז\"ל \"לעולם\" יעסוק אדם בתורה ובמצוות שלא לשמה, דכיצד הותר לו לעסוק בתורה שלא לשמה לעד לעולם, והרי כל טעמא דהותר לו ללמוד שלא לשמה משום שעל ידה יגיע לבחינת לשמה. ופירשו הכוונה דהנה מדרך בני אדם הוא שאם ברצונם לעשות איזה דבר ומשתדלים בו פעמים מספר ואין הדבר עולה בידם המה מתיאשים ממנו, ומרפים ידם לגמרי מלעסוק בו, כי כסבורים הם שמאחר שכבר ניסו ולא יכלו לעשותו שוב לא תעלה בידם. ולזה הורו לנו חז\"ל שבל יחשוב האדם בלבו הלא זה זמן זמנים טובא שאני משתדל בלימוד התורה שלא לשמה, כדי לזכות להגיע למדרגת לשמה, והלום ראיתי אחרי רואי כי לא עלתה בידי, ויתייאש לגמרי מלעסוק בתורה, באמרו אין תקוה לאחריתי, ומאחר שלא הצלחתי להגיע לבחי' לשמה עד הנה שוב לא אזכה בה, לפיכך אמרו חז\"ל \"לעולם\" יעסוק אדם בתורה ומצוות שלא לשמה, פירוש שלא יתרפה מלעסוק בתורה אף שכבר עידן ועידנים שהוא עוסק בה שלא לשמה, כי אין לך אדם שאין לו שעה, ובסופו של דבר יזכהו ה' שמתוך שלא לשמה יבא לשמה. וכמו שכתב הרמב\"ם ז\"ל בסוף הלכות תשובה (פ\"י ה\"ה) אמרו חכמים לעולם יעסוק אדם בתורה ואפילו שלא לשמה שמתוך שלא לשמה בא לשמה, לפיכך כשמלמדין את הקטנים ואת הנשים וכלל עמי הארץ אין מלמדין אותם אלא לעבוד מיראה וכדי לקבל שכר, עד שקרבה דעתן, ויתחכמו חכמה יתירה, מגלים להם רז זה מעט מעט וכו', ע\"כ."},{"passage_id":"vayikru2_44ba0578_p17","passage_content":"ולפי זה נמצא כי כל מה שהאדם עוסק בתורה שלא לשמה הוא רק הכשר מצוה אל העסק המעולה בבחי' לשמה, כי מה שהוא לומד שלא לשמה, מביאו לבסוף לידי הלימוד לשמה. וא\"כ בדין הוא שיעול שכרו בעולם הזה על מה שעסק בתורה שלא לשמה, כאשר נתבאר, דעל הכשר מצוה מגיע שכר בעוה\"ז (ודבר זה מפורש בגמרא בשמאלה עושר וכבוד ודרשו ז\"ל על העוסקים בה שלא לשמה). אמנם כל זה הוא דוקא במי שהוא עוסק בתורה של\"ש לכוונה זו שיגיע על ידה למדרגת לשמה, אבל מי שאינו לומד על כוונה זו, כי אם כל למודו הוא בבחי' שלא לשמה, א\"כ לא די שלא יקבל שכר בעוה\"ב על עסקו בתורה, כי אין חפץ לה' בלימוד התורה שלא לשמה, אלא אף בעוה\"ז לא ישולם לו שכר, שהרי לא עסק בתורה כהכנה ללימוד לשמה, וא\"כ נמצא דיורש תרתי גיהנם."},{"passage_id":"vayikru2_44ba0578_p18","passage_content":"ועפ\"י דברנו יתבאר טעמא דהך מילתא דהוה מספקא לרבנן אם כהן מברך שהחיינו על פדיון הבן או האב מברך, כי הנה מצות הפדיון מועלת על האב, דעליה דידיה רמיא לפדות בנו בכורו, והכהן הוה רק כגורם למצוה שתתקיים, ע\"י שהוא לוקח את כסף הפדיון, ופעולת הכהן היא כהכשר מצוה. ולפי הך כלל דאמרן כי שכר מצוה בהאי עלמא ליכא, אבל שכר הכשר מצוה ישנו גם בעוה\"ז, א\"כ נמצא כי הכהן מקבל שכר הכשר המצוה בעוה\"ז, אבל אבי הבן אינו נועל שכר מצות הפדיון בעוה\"ז, אלא שכרו צפון לו לעוה\"ב. והיינו דקא מספקא להו אי כהן מברך דקא מעי הנאה לידיה, כלומר שע\"י שהוא הגורם והמכשיר למצוה שתתקיים באה הנאה לידו בעוה\"ז, כי הן שכרו בארץ ישולם, וא\"כ הוי כבונה בית חדש או קונה כלים חדשים שמברך שהחיינו, ועאכ\"ו הכא שתבא לידו השפעת הברכה מן השמים ויתברך ברב טוב ראוי לו לברך שהחיינו."},{"passage_id":"vayikru2_44ba0578_p19","passage_content":"אמנם כד אתא רבי שמלאי לבי מדרשא פשעו לו דאבי הבן מברך, ויתבאר עפ\"י מה שכתב הרמב\"ם בפיה\"מ ריש פאה על המשנה אלו דברים שאדם אוכל פירותיהן בעוה\"ז והקרן קיימת לו לעולם הבא וז\"ל, וזה ענין מה שאמר אוכל שירותיהן והקרן קיימת לו, מה שאומר לך כי המצוות כולן נחלקין בתחלה על שני חלקים, החלק האחד במצוות המיוחדות לאדם בנפשו מה שיש בינו ובין הקב\"ה, כגון ציצית ותפילין ושבת וע\"ז. והחלק השני במצוות התלויות בתועלת בני אדם קצתם עם קצתם, כגון האזהרה על הגנבה והאונאה והאיבה והנטירה, וכגון הציווי באהבת איש את חבירו, ושלא יסית אדם להזיק לחבירו, ולא יעמוד על דם רעהו, וכבוד אבות והחכמים שהם אבות הכל. וכשיעשה האדם המצוות המיוחדות לנפשו מה שיש בינו לבין בוראו, תחשב לו לצדקה, ויגמלהו הקב\"ה עליה לעוה\"ב. וכשיעשה האדם המצוות התלויות בתועלת בני אדם זה עם זה, תחשב לו לצדקה לעולם הבא, לפי שעשה המצוה, וימצא טובה בעוה\"ז בעבור שנהג מנהג טוב בין בני אדם וכו', עכ\"ד ז\"ל."},{"passage_id":"vayikru2_44ba0578_p20","passage_content":"היוצא מזה כי במצוות שיש בהם טובה לבני אדם מקבל האדם שכר גם בעוה\"ז, וא\"כ ה\"נ בנידון דידן שאבי הבן מהנה את הכהן, מקבל גם אבי הבן שכר בעוה\"ז, ושפיר מברך אבי הבן שהחיינו. ועפ\"י דברנו יש לקשר סיום מסכת פסחים לתחלתה, דתנן במתני' אור לי\"ד בודקין את החמץ לאור הנר, ובגמרא מאי אור ר\"ה אמר נגהי ורב יהודה אמר ליליא, ומסיק דכ\"ע אור פירושו לילה אלא דבאתריה דמר קרי ללילה נגהי (מלשון נוגה והוא ע\"ד סגי נהור) ובאתריה דמר קרי ליה ליליא, עיי\"ש. ואפשר לומר בדרך רמז עפ\"י מה שביארנו כי לא הותר ללמוד שלא לשמה אלא באופן שמתוד כך יבא לשמה, נמצא דבלימוד שלא לשמה יש ב' בחינות, הבחינה הרצויה והמקובלת היא אם הוא לומד שלא לשמה על מנת שיבא לשמה. והאופן הב' הוא אם תכלית לימודו הוא שלא לשמה, ולימוד כזה לא יעלה לרצון לפני השי\"ת. והנה התוה\"ק קרויה אור דכתיב (משלי ו') כי נר מצוה ותורה אור. ולפי דברי הגמרא דפליגי אי אור נגהי או אור לילה, י\"ל דרמז בזה על ב' גווני אור שיש בלימוד תוה\"ק שלא לשמה שהיא בחינת לילה, יש אור נגהי כלומר דאף שהיא לילה דהיינו שעוסק בה שלא לשמה מ\"מ יש בה קרן אורה, שעל ידה יבא לשמה. ויש אור שהוא לילה, והוא שתכלית הלימוד הוא שלא לשמה. ולזה צריך האדם לבדוק בחורין ובסדקין בפנימיות לבו איזה הדרך ישכון \"אור\", שיהיה לימודו על מנת להגיע לבחינת לשמה. ובזה יתקשר סיום המסכת לתחלתה, דהנה בסוף המסכת מספקא ליה אם הכהן מברך שהחיינו, ועל כרחך מטעמא דהכשר מצוה שעל ידה מגיע לו שכר בעוה\"ז, ולכך תרמוז גם המשנה דאור לארבעה עשר, שאור התורה שלו יהיה בבחינת הכשר מצוה, להגיע על ידה למדרגת לשמה ולא שיהיה תכלית הלימוד שלא לשמה והבן."},{"passage_id":"vayikru2_44ba0578_p21","passage_content":"ועפ\"י דברנו יש לפרש מאה\"כ בריש פרשתן אם בחקותי תלכו ואת מצוותי תשמרו ועשיתם אותם, דהנה ביארנו לעיל דלשון הליכה מורה על התעלות ממדרגה למדרגה, ודבר זה שייך אף בלימוד שלא לשמה, אם תכלית לימודו הוא ע\"מ לעשות, וכמו שדרש בתורת כהנים מקרא זה הלומד ע\"מ לעשות ולא הלומד שלא לעשות, שהלומד שלא לעשות נוח לו שלא נברא, ע\"כ. ולכן אף שהלימוד הוא שלא לשמה, מ\"מ סופו להגיע על ידו למדרגת לשמה, ושפיר שייך ביה לשון הליכה. ועל הליכה זו מגיע לו שכר בעולם הזה. אף דקיי\"ל שכר מצוה בהאי עלמא ליכא, היינו דוקא על המצוה גופה, אבל על הכשר מצוה מגיע שכר בעוה\"ז, ולימוד שלא לשמה הוא הכשר להגיע על ידו לבחי' לשמה. ועל כן הכתוב מבשרנו ונתתי גשמיכם בעתם ונתנה הארץ יבולה וגו', שהם ההשפעות הגשמיות שיתברכו בהם בעולם הזה, כי שכר הוא להם חלף עבודת שלא לשמה, שהוא המביא לידי לשמה, ונוסף לזה צפון להם רב טוב לעוה\"ב, כמ\"ש השלה\"ק דהברכות הללו כוללות גם שכר עוה\"ב הקיים והנצחי, אלא שלא גלה אותם הכתוב וטמנם ברמז."},{"passage_id":"vayikru2_44ba0578_p22","passage_content":"ולבאר דברי המד\"ת הנ\"ל המוצגים בפתח הדרוש וז\"ל, אדם הראשון אלו שמר את התורה ואת המצוה שנתתי לו לא היה מת לפיכך כתיב אם בחקותי תלכו, נקדים עוד דברי האוה\"ח הק' בפרשתנו (אופן הז') לפרש הך קרא עפ\"י מאמרם ז\"ל הנ\"ל הלומד שלא לשמה נוח לו שלא נברא, והקשו התוס' מאותה שאמרו לעולם יעסוק אדם בתורה אפילו שלא לשמה שמתוך שלא לשמה בא לשמה, ותירצו כי הם ב' אופנים שלא לשמה א' לקנטר וא' להתכבד, לקנטר נוח לו שלא נברא, להתכבד יעסוק שמתוך שלא לשמה בא לשמה. והוא מאמר ה' אם בחקותי תלכו, ותנאי הוא הדבר ואת מצוותי ב' מצוות הצריכים בלימודה, שלא ילמדו לא לקנער ולא להתכבד, אז תשמרו ועשיתם אותם, מבטיח הכתוב שהגם שתבוא עבירה לידו יהיה ניצול ממנה, וכאומרם תורה מגינא ומצלא מיצה\"ר וכו'. והלומד שלא לשמה אלא להתכבד, לא שיש רצון הבורא בלימוד זה, אלא לתכלית היוצא ממנו שיבא ללמוד לשמה, ותורה זו אין בסגולתה להציל מיצר הרע בבא עבירה לידו, עכ\"ל האה\"ח הק'. מבואר בדבריו דאך ורק תורה לשמה מגינא ומצלא מיצה\"ר. והשתא יבואר על נכון מאמר התנחומא, כי אדם הראשון נתפתה מן הנחש הוא היצר הרע הוא הס\"מ, ובאמת קצרה דעתינו מהשכיל בענינים נשגבים אלו, אבל אלמלי היה שומר את התורה ואת המצוות לשמה, אותו כח התורה היה מציל אותו מיצה\"ר, ולא היה מת. ואסמכוה אקרא דאם בחקותי תלכו וגו' כפי' האה\"ח הק' דדרשינן מפסוק זה שרק תורה לשמה מצלת מיצה\"ר, ואתי שפיר דברי המדרש. תוכן הדברים שצריך להתאמץ מאוד ללמוד התורה הקדושה לשמה, וכל תלמיד ובן ישיבה יתן אל לבו גודל האחריות המועל עליו, כי מי שעוסק בתורה מחוייב להזהר בזהירות יתירה להתנהג כשורה במדות ובדרך ארן ובדרכי החסידות, ולהיות זהיר בתכלית הזהירות שלא יתחלל שם שמים על ידו, ועליו להשתדל בכל מאמצי כוחותיו להיעיב דרכיו ופעולתו לשם ולתפארת, ואז יכירו וידעו כי זרע ברך ה' המה, ויאמרו אשרי שזה ילד אשרי שזה גדל, ובזה יעשה נחת רוח לפניו יתברך. וזה כל עיקר תשוקתינו ותקוותינו להרבות כבוד שמים, ולהעמיד דורות קדושים מושרשים בתורה וביראה ובמדות טובות בקדושה ובטהרה, כדי שנזכה לקבל פני משיח צדקינו באנפין נהירין, בנחת ובשמחה, בנערינו ובזקנינו, בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru2_b8daba4d","title":"חובת ההמתנה לזמן המיועד","summary":"הדבר תורה עוסק בחובת האדם להמתין לזמנים שנקבעו על ידי הקב\"ה, כפי שמלמדים חקירות השמים והארץ. חטאו של אדה\"ר היה במיהורו לאכול מעץ הדעת לפני הזמן, ובכך נלמד להיזהר מלהקדים את הקץ.","contents":[{"passage_id":"vayikru2_b8daba4d_p1","passage_content":"אם בחקתי תלכו וגו', במד\"ר (פל\"ה ד') איתא חקים שבהם חקקתי את השמים ואת הארץ שנא' (ירמיה ל\"ג) אם לא בריתי יומם ולילה חקות שמים וארץ לא שמתי חקים שבהם חקקתי את השמש ואת הירח וכו',  ומונה והולך שם את עניני הבריאה שכולם חקק יוצר בראשית ית\"ש בחוקי התורה הקדושה עיי\"ש, וצ\"ב."},{"passage_id":"vayikru2_b8daba4d_p2","passage_content":"ב) בתנחומא ר\"פ זו איתא זש\"ה (איוב י\"ד) אם חרוצים ימיו וגו' כשברא הקב\"ה את העולם חרץ ימיו של כל אחד ואחד, שנאמר (בראשית א') והיו לאותות ולמועדים, ולמי נתנם לישראל וכו', אמר הקב\"ה לישראל אם עשיתם חקי אין השטן נוגע בכם וכו'. אדה\"ר אילו שמר את התורה ואת המצוה שנתתי לו לא מת, לפיכך כתיב אם בחקותי תלכו, ע\"כ וצ\"ב."},{"passage_id":"vayikru2_b8daba4d_p3","passage_content":"ונראה בהקדם דברי האה\"ח הקדוש (באופן כ\"ט) בביאור הכתוב אם בחקתי חלכו וזלה\"ק עוד יתבאר ע\"ד אומרם ז\"ל (ספרי פרשת האזינו) שצריך האדם ללמוד מוסר מחקות השמים שאין משנים את תפקידם, וששים ושמחים לעשות רצון הבורא. והוא אומרו אם תלכו בדרך חקותי, שהם חקות שמים וארץ המתמידים לעשות רצון קונם בשמחה בלא שינוי, בזה גם אתם מצותי תשמרו שלא תעברו עליהם וכו', ע\"כ והנה כבר נתבאר בדברנו לעיל בסמוך ענין חטאו של אדה\"ר שמיהר לאכול מפרי עץ הדעת בטרם זמן התירו, כי נאסר עליו לאכול ממנו עד כניסת השבת, והוא אץ לאכול ממנו בעוד יום, ולא המתין עד ששקעה חמה. וכענין זה הוא גם בישועתן של ישראל העתידה בביאת משיח צדקנו במהרה, שזמן הגאולה נקבע ע\"י הקב\"ה אימתי יהיה, וחייבים ישראל לצפות ולהמתין עדי יגיע הזמן שיעד הקב\"ה לקץ הפלאות וח\"ו לא ימהרו לדחוק את הקץ בטרם עת. אכן כבר הבאנו כמה פעמים את דברי הנזה\"ק פרשת ויחי כי אף שזמן הגאולה קבוע ממרומים, מ\"מ אם חפץ ה' בנו לגאלינו מן הגלות המר בטרם הגיע אותו זמן, יחליף הקב\"ה את סדר הזמנים, וישנה את מערכות המזלות, ויקדים להביא את הכוכב והמזל המיועד לגאולה. ודבר זה מסור ביד הקב\"ה לבדו המשנה עתים ומחליף זמנים כרצונו, אבל לא יתכן כזאת שיהיה בידי בני אדם להקדים ולדחוק את הקץ."},{"passage_id":"vayikru2_b8daba4d_p4","passage_content":"ובדברים אלו פירשנו מ\"ש משרע\"ה אל קרח ועדתו (במדבר ט\"ז) בקר ויודע ה' את אשר לו, ופי' רש\"י מדרשו בקר א\"ל משה גבולות חלק הקב\"ה בעולמו יכולים אתם להפוך בקר לערב כן תוכלו לבטל את זו, שנאמר ויהי ערב ויהי בקר, כך ויבדל אהרן להקדישו. וצ\"ב מה טעם נקט רש\"י משל זה דוקא מהפיכת בקר לערב, למחלוקתו של קרח על כהונת אהרן. ונראה דהנה איתא בכתבי האריז\"ל, כי טעותו של קרח היתה כי צפה אשר לעתיד לבא יהיו הלוים כהנים, והוא עתיד להיות כהן גדול, וסבר כי כבר הגיע זמן התיקון השלם, ומשו\"ה חלק על כהונת אהרן, כי לדעתו כבר היה נזר הכהונה הולמו, והוא ראוי לאותה איצטלא לעמוד לשרת בקדש. והשיב משה לקרח כי טעות היא בידו, דאכתי לא מטא זמניה להיות כהן גדול, משום שעדיין לא הגיע זמן התיקון השלם, כי זמנו נקבע בגזירת מלך מלכי המלכים הקב\"ה, ואין יכולת ביד אדם לשנותו ולהקדימו. וזהו שהשיב להם יכולים אתם להפוך בקר לערב, כלומר שאינכם יכולים להחליף סדר זמנים ולהפוך בקר לערב, כי הקב\"ה בדברו קבע והעמיד סדרי השמש והירח, בורא יום ולילה גולל אור מפני חשך וחושך מפני אור, חוק וזמן נתן להם שלא ישנו את תפקידם, ואם אין בידכם להחליף מבקר לערב, עאכו\"כ שלא תוכלו להקדים את המזל והכוכב אשר קבע הקב\"ה שבו תהיה הגאולה, ואין הדבר מסור אלא ביד הקב\"ה לבדו. ובעינינו ראינו בעוה\"ר בזמנינו שע\"י.שהקדימו לדחוק את הקץ נעשה מה שנעשה, שבא על ישראל האסון הנורא רח\"ל."},{"passage_id":"vayikru2_b8daba4d_p5","passage_content":"ובזה יבואר המד\"ר שדרש אם בחקתי חקים שבהם חקקתי את השמים ואת הארץ וכו', חקים שבהם חקקתי את השמש ואת הירח וכו'. ולדרכנו הכוונה דבא הכתוב להזהיר לבל ימהר האדם ויחיש זמנו בטרם העת המיועד, כי לכל זמן ועת לכל חפץ, וע\"ד שכתב האוה\"ח הקדוש הנ\"ל שראוי לאדם לקחת מוסר השכל מן השמים והארץ השמש והירח וכל מעשה בראשית, שחקקם צור עולמים, וקבע זמנם מקומם ושעתם, ולא יעבורו לשנות תפקידם, כמו כן יזהר הוא להמתין עד הזמן המיועד."},{"passage_id":"vayikru2_b8daba4d_p6","passage_content":"ובדרך זו מבואר גם התנחומא (קושיא ב') זש\"ה אם חרוצים ימיו וגו' כשברא הקב\"ה את העולם חרץ ימיו של כל אחד ואחד שנאמר והיו לאותות ולמועדים וגו'. והכונה דהכל קבוע וקיים בגזירת הקב\"ה, שחרץ זמן לכל אחד ואחד, ואין לשנות את הזמן שקבע הקב\"ה. וזהו שמסיים המד\"ת אדה\"ר אילו שמר את התורה ואת המצוה שנתתי לו לא מת, לפיכך כתיב אם בחקתי תלכו. פירוש דזה היה חטאו של אדה\"ר שנחפז לאכול מעץ הדעת לפני זמנו, לפיכך אמר הכתוב אם בחקתי תלכו, כנ\"ל חקים שחקקתי בהם שמים וארץ שמש וירח וכו',  וכשם שלכל אלו יש זמן קבוע ולא יחליפנו ולא ימיר אותו, כמו כן יש לעבודת האדם ומשפטו ומעשהו זמן מתי ינהג בעבודה זו ומתי באחרת. וכאשר פי' הרה\"ק ר\"ר מנחם מענדל זלה\"ה מרימאנוב עה\"פ (שמות ע\"ז) ויצא העם ולקטו דבר יום ביומו, שהחידושים שמחדשים בתוה\"ק יש זמן לכולם מתי יתגלו, וזהו דבר יום ביומו. והשתא מובן היטב מה שהביא המדרש להכא קרא דאיוב אם חרוצים ימיו, שהקב\"ה חרץ מעשי עבודתו של אדם והחידושים שיתגלו על ידו בכל יום. והיינו נמי טעמא דקרא אם בחקתי תלכו, שילך האדם בחק שנחרץ עליו בגזירת יוצר בראשית, כשם שמעשי שמים וארץ ממלאים תפקידם ללא שינוי."}]},{"dvar_torah_id":"vayikru2_88ad2f1a","title":"חומרות והגבלות בתורה ובמצוות","summary":"הדרשה עוסקת בחשיבות לימוד התורה והזהירות בהוספת גזירות. אדה\"ר חטא מחמת שהחמיר על עצמו, ובכך נכשל. התורה מצווה על שמירת מצוות, אך יש להיזהר שלא לחרוג מגבולות ההלכה כדי לא להביא לידי מכשול.","contents":[{"passage_id":"vayikru2_88ad2f1a_p1","passage_content":"אם בחקתי תלכו וגו'. בתנחומא ר\"פ זו איתא זש\"ה (איוב י\"ד) אם חרוצים ימיו מספר חדשיו אתך חקיו עשית ולא יעבור, מהו אם חרוצים ימיו כשברא הקב\"ה עולמו חרץ ימיו של כל אחד ואחד וכו', מספר חדשיו אתך חקיו עשית ולא יעבור, אמר הקב\"ה לישראל אם עשיתם חקי אין השטן נוגע בכם שנאמר ולא יעבור וכו', אדם הראשון אילו שמר את התורה ואת המצוה שנתתי לו לא היה מת, לפיכך כתיב אם בחקתי תלכו, ע\"כ. וצ\"ב שייכות דרשה זו לפרשת אם בחקתי. גם צריך להבין אומרו אדה\"ר אילו שמר את \"התורה\" ואת המצוה שנתתי לו לא היה מת, דמשמע שמלבד המצוה עוד היה לו לשמור את התורה. וקשה שהרי לא נצעווה כי אם במצוה אחת, שלא לאכול מעץ הדעת."},{"passage_id":"vayikru2_88ad2f1a_p2","passage_content":"ב) גם בילקוט ראובני פרשת בראשית מביא בשם מדרש דרשה זו בשינוי קצת, וז\"ל אלמלי למד אדה\"ר תורה לא היה מת לפיכך כתיב אם בחקתי תלכו, וצ\"ב."},{"passage_id":"vayikru2_88ad2f1a_p3","passage_content":"ונראה דהנה התורה הקדושה נתנה רשות לחכמי ישראל לגזור גזירות ולעשות גדר וסייג לתורה כפי ראות עיניהם, כדי לחזק בדקה, לבל יבואו לפרוץ פרץ בגופי תורה. וכמו שדרשו ז\"ל (מועד קטן ה' ע\"א) מדכתיב (ויקרא י\"ח) ושמרתם את משמרתי עשו משמרת למשמרתי. והנה רש\"י ז\"ל כתב בריש מסכת ביצה (דף ב' ע\"ב ד\"ה והתניא) דהא דאמרינן בכולי הש\"ס דאין גוזרין גזרה לגזרה מהאי קרא נפקא ושמרתם את משמרתי עשו משמרת כלומר גזירה למשמרתי לתורתי ולא משמרת למשמרת שלא יעשו גזירה לגזירה, ע\"כ. ולכאורה כיצד איכא למילף מדכתיב ושמרתם את משמרתי דאין גוזרין גזירה לגזירה, והלא קרא איצטריך לגופיה לדרוש עשו משמרת למשמרתי, דעל החכמים הקדושים מוטל לעשות גדר וסייג לתורה, ומנא לן למידרש מיניה מיעועא ולא משמרת למשמרתי, דהיינו שלא יעשו גזירה לגזירה, דלמא גזירה אחת נתחייבנו מן התורה לעשות, משא\"כ גזירה לגזירה ליכא חיובא, אבל אכתי לא שמענו דאסור לנו לגזור גזירה לגזירה, דילמא הרשות נתונה לחז\"ל לגזור כמה גזירות כפי ראות עיניהם, אלא דליכא חיובא."},{"passage_id":"vayikru2_88ad2f1a_p4","passage_content":"אכן כבר כתבנו לבאר דברי רש\"י ז\"ל (לעיל פרשת תזריע עמוד שמ\"ז), דהנה האמת הוא דאם לא היתה התורה מצוה עלינו לגזור גזירות. היה אסור עלינו להוסיף אף גזירה אחת למצוותיה של תורה, כי ע\"י ריבוי גזירות וסייגים אפשר ח\"ו לבא לידי מכשול באיסורי תורה. וכמו שמפרש האה\"ח הקדוש עה\"פ אם בחקתי תלכו (באופן הו') וזלה\"ק יתבאר ע\"ד אומרם (אבות פ\"ב מ\"ה) ולא ע\"ה חסיד, פירוש שאסור לע\"ה להתנהג בחסידות שיעשה חומרות וגדרים כמנהג החסידים, כי לפעמים יעשה חומרא בדבר שהוא אדרבה עבריין, כי ימצא חסיד שירצה לגדור עצמו לקיים מצות עונה בימים המקודשים, ותהיה בעיניו מצוה גדולה וכו' ביום כיפור, כמו ששמענו שהיה מעשה כן, וכדומה לזה ציוו חז\"ל שאין לע\"ה להתנהג במדת חסידות. והוא מאמר ה' כאן אם בחקתי תלכו שהוא עסק התורה, אזי ואת מצוותי תשמרו, פירוש תעשו לכם משמרת כדי לקיימם וגדרים וסייגים, לא זולת, עכלה\"ק."},{"passage_id":"vayikru2_88ad2f1a_p5","passage_content":"וגדולה מזו כתב בספה\"ק אגרא דכלה פרשת קרח וז\"ל, עפ\"י מה ששמעתי דרך דרוש עה\"פ שאמר דוד שמרה נפשי כי חסיד אני, הנה הקושיא מפורסמת ממ\"נ אם הוא ראוי לשמירה מצד חסידותו בודאי השי\"ת לא יקפח שכרו, ובאם וכו'. ושמעתי שהוא ע\"ד מאמרם ז\"ל (קידושין ל\"א ע\"א) אם פגע בך מנוול זה משכהו לביהמ\"ד, והנה למה אמר משכהו ולא אמר כפשוטו למוד תורה, אך הוא דהיצר מסיתו לדבר עבירה באומרו לו בפיתוייו שהוא מצוה, וע\"כ עצה היעוצה מרז\"ל אם יפתה אותך באומרו שהוא מצוה משכהו לביהמ\"ד, ששם מרחיבין התורה ותלמוד מפי סופרים ומפי ספרים, אם הוא מכלל התרי\"ג מצוות וענפיהם, ותראה שזה פיתוי היצר אזי לא יוכל לך. אך אם המתפתה הוא איש חסיד אין תקנה במשיכה לביהמ\"ד, כי יאמר לו הגם שאין הענין הזה מבואר בתורה, הלא חסיד אתה מתנהג בחסידות לפנים משוה\"ד, והענין שאני מצוך לעשות הוא מכלל חסידות דלפנים משורת הדין, הגם שאינו מבואר בתנ\"ך ובדברי חז\"ל. ולזה אמר דוד שמרה נפשי כי חסיד אני, ולא מהני נגד היצר המשיכה לביהמ\"ד, באמור לו הלא חסיד אתה עשה לפנים משוה\"ד וכו'."},{"passage_id":"vayikru2_88ad2f1a_p6","passage_content":"ועפי\"ז י\"ל גם בכאן ויקח קרח לקח לעצמו סברא שהוא בן יצהר בן וכו', להיות שפיתהו היצר להתעסק במצוה וחשב לעשות נח\"ר דוקא בעבודת הקרבנות, ודימה בעיניו ענין המחלוקת למצוה רבה וכו', הגם שלא יתענש על ביטול העבודה כיון שהוא אנוס, עכ\"ז מצד החסידות ראוי לו לרדוף בכל מאמצי כחו לעשות נח\"ר בעבודת הקרבנות, עכדה\"ק. מכל אלו למדנו כי בעשיית גדרים וסייגים מחוץ לשוה\"ד בקל אפשר לבוא לידי טעות, ולהכשל באיסור עצמו, וא\"כ לכאורה מוטב היה שלא לעשות גדרים וסייגים כלל ועיקר. אכן מאחר שהתורה ציותה אותנו ושמרתם את משמרתי, מוטל עלינו לעשות גדרים וסייגים כדי לעשות משמרת למצוותיה של תורה. ברם באמת צריכים זהירות יתירה להשגיח בעינא פקיחא שלא לטעות ולעשות חומרות בדברים אשר ע\"י החומרא, הוא נעשה עבריין כנ\"ל, ומינה דאין לנו אלא מה שצוותה תורה, דהיינו לעשות חדא גזירה, וממילא ידעינן דאין לעשות גזירה לגזירה, שהרי מודעת זאת שריבוי חומרות וגזירות עלול להביא לידי מכשול ועבירה."},{"passage_id":"vayikru2_88ad2f1a_p7","passage_content":"ובזה עלו כהוגן דברי רש\"י ז\"ל בריש ביצה, דמהך קרא גופיה שאמרה תורה עשו משמרת למשמרתי, ידעינן דלא משמרת למשמרת, דלא איצטריך להכי מיעוע בפני עצמו, דממילא שמעינן ליה, דמכיון שלא צוה הכתוב אלא לעשות גזירה אחת, אין לנו אלא מה שאמרה תורה, ויותר מכך נאסר עלינו לעשות משום דמחמת ריבוי גזירות וחומרות עלולים ביותר להלכד במצודת היצה\"ר, ולבא לידי מכשול באיסורי תורה."},{"passage_id":"vayikru2_88ad2f1a_p8","passage_content":"היוצא לנו מזה כי זהירות יתירה צריך בעשיית גזירות וסייגים, לבל יפוק מינייהו מכשול, ועל כן דוקא מי שדבוק בתורה הקדושה ועל פיה כל הנהגתו אפשר לו להתנהג בחומרות, ולעשות לעצמו גדרים וסייגים לפנים משורת הדין. והנה חטאו של אדה\"ר בא לו ממה שהחמיר על עצמו לעשות יותר מן המצווה עליו, שהוא לא נצטווה אלא על האכילה, ומעצמו הוסיף לאסור אף את הנגיעה, כדאיתא בסנהדרין (דף כ\"ט ע\"א) אמר חזקיה מנין שכל המוסיף גורע שנאמר (בראשית ג') ולא תגעו בו. וע\"י חומרא יתירא זו בא לידי מכשול לעבור על גופו של איסור, כדאיתא (ב\"ר פי\"ט ג') שדחפה נחש לחוה עד שנגעה בעץ אמר לה כשם שאין מיתה בנגיעה כך אין מיתה באכילה. ולכאורה מה גריעותא הוי בהוספת חומרא וסייג, הלא אדרבה הוא חפץ להרחיק מן העבירה, על כן גדר עצמו אף מן הנגיעה. אכן הוא הדבר אשר דברנו, כי כדי לעשות חומרות לפנים משורת הדין צריכים להיות עמלים בתורה, לדעת האסור והמותר, דבלא זה אי אפשר לעשות גדר וסייג כמ\"ש האה\"ח הקדוש הנ\"ל, דדוקא אם בחקתי תלכו, שתהיו עמלים בתורה, אזי ואת מצוותי \"תשמרו\" בעשיית משמרת וסייג למצוות התורה, לא זולת. וכמו שהביא האגרא דכלה משל על זה, דלפי שיש צורך בזהירות יתירא באפיית המצות שלא יבואו לידי חימוץ יגדור עצמו לגמרי שלא לאכול מצה בלילה ראשונה של פסח, ויבטל מצות עשה בערב תאכלו מצות. והיכא שע\"י ריבוי חומרות יתירות יוכל לבא לידי מכשול וטעות באיסורי דאורייתא אין לנהוג במדת חסידות."},{"passage_id":"vayikru2_88ad2f1a_p9","passage_content":"ועפ\"י זה נבא לביאור המדרש שהובא בילקוט ראובני אלמלי למד אדה\"ר תורה לא מת, דהנה קודם שניתנה תורה לא ציוה הקב\"ה לעשות גדרים וסייגים לקיום המצוות שנאמרו לפני מתן תורה, דאכתי לא בא הציווי ושמרתם את משמרתי עד שניתנה תורה. ואפילו אם נאמר דגם קודם מ\"ת היתה מצוה לעשות גדר וסייג אל המצוות דהוו שייכו בהו לפני הדיבור, מ\"מ ע\"כ לומר דאין שייך זה כי אם במי שהיה דבוק בתוה\"ק, אבל בלא\"ה לאו שפיר דמי למעבד הכי, להיות מתנהג בחסידות לפנים משורת הדין. וז\"ש אלמלי למד אדה\"ר תורה לא מת, כי אילו היה דבוק בתורה הקדושה היתה התורה מיישרת דרכו, ומאלפתו בינה להבחין אימתי לאחוז בגדר וסייג ואימתי להרחיקו. ולפי שלא למד אדה\"ר תורה לא היה לו לעשות גדר וסייג ולהחמיר יתר על המצוה עליו, ודין גרמא שנכשל לעבור על מצות ה', ונקנסה עליו מיתה."},{"passage_id":"vayikru2_88ad2f1a_p10","passage_content":"וזהו גם ביאור התנחומא (קושיא א') אדה\"ר אילו שמר את התורה ואת המצוה שנתתי לו לא מת, כדאמרן דאילו היה דבוק בתוה\"ק היה רשאי להוסיף על המצוה שניתנה. ומסיים המדרש לפיכך כתיב אם בחקתי תלכו וגו', והכוונה כמ\"ש האה\"ח הק' הנ\"ל, דדוקא אם בחקתי תלכו שתהיו עמלים בתורה אזי ואת מצוותי \"תשמרו\" בעשיית משמרת וסייג. וא\"ש שייכות דרשת התנחומא להכא."},{"passage_id":"vayikru2_88ad2f1a_p11","passage_content":"עוד יתבאר המדרש (הובא בילקוט ראובני) אלמלי למד אדה\"ר תורה לא מת, בהקדם הא דאיתא במד\"ר (בראשית פכ\"א ט') עה\"פ הן האדם, דרש רבי יהודה בן פדייה מי יגלה עפר מעיניך אדה\"ר שלא יכולת לעמוד בציוויך אפילו שעה אחת והרי בניך ממתינין לערלה ג' שנים וכו', ע\"כ. והקשה היפ\"ת דלא דמי איסור ערלה למה שנאסר לאדה\"ר לאכול מעץ הדעת, דערלה לא תקיף יצריה כולי האי, משום שיש לה היתר לאחר שלש שנים, משא\"כ עץ הדעת שלא היה זמן לאיסורו. והנזר הקדש ביאר דברי המדרש עפ\"י מש\"כ קצת חכמי האמת (עי' חסל\"א) דבאמת לא נאסר לאדה\"ר לאכול מעץ הדעת כי אם עד שבת, משום שעד שב\"ק היה בחלק הרע הנקרא ערלה, אבל אם היה ממתין עד שב\"ק היה עץ הדעת נמתק בטוב בקדושת שבת, והיה בידו לאכול ממנו כל חפצו וחי לעולם. והטעם משום דבתשיעי נצטוה ובעשירית סרח כדאיתא בפרקי דר\"א, והיה לו ג' שעות עד הלילה, והיו הג' שעות במדרגת ג' שני ערלה, ושפיר מדמהו המדרש לערלה, דה\"נ הוי היתר לאיסורו בשבת קדש, והוא לא המתין לערלה אפילו שעה אחת, עכת\"ד הנזה\"ק."},{"passage_id":"vayikru2_88ad2f1a_p12","passage_content":"והנה יתכן כי אדה\"ר טעה ונכשל מחמת חסידותו, כי החמיר על עצמו להוסיף מחול אל הקדש, וקיבל שבת כמה שעות קודם ששקעה החמת וכאשר כתבו משם האר\"י ז\"ל לקבל שבת מחצות היום, כדי שיהיה השבת עם התוספת ל\"ו שעות. ומחמת חומרא זו טעה אדה\"ר ואכל מעץ הדעת בשעה עשירית בערב שבת, כי סבר שכבר הותר לו לאכול ממנו שכבר הומתק בקדושת השבת, אבל האמת הוא דהוה ליה לאדה\"ר למישבק לחסידותיה בכגון דא, וכאשר הארכנו לעיל בזה מפי ספרים וסופרים דמדת החסידות טובה ומשובחת רק היכא דאין בה ביטול דבר מן התורה, אבל אם ע\"י החסידות יבא לידי ביטול מצוה ענוש יענש. וכיון שהוזהר אדה\"ר שלא לאכול מעץ הדעת עד ליל שבת, לא היה לו להתנהג בחסידות להקדים ולקבל שבת לפני ששקעה החמה, דע\"י כן טעה ונכשל ואכל מן העץ בטרם פנה יום. וזהו ביאור המדרש ילקוט הנ\"ל אלמלי למד אדה\"ר תורה לא מת, וע\"ד שנתבאר לעיל בדרוש הקודם דאילו היה לומד תורה היתה התורה מלמדתו איזה הדרך ישכון אור, והיה יודע להבחין מתי עליו לגדור גדר שלא יבא להכשל באיסור עצמו מחמת הגדר והחסידות."}]},{"dvar_torah_id":"vayikru2_e7afdae1","title":"עליית אדם הראשון ותכלית לימוד התורה","summary":"אדם הראשון נברא לעלות לעולם העליון, ולא לשבת בעוה\"ז לעולמי עד. החטא גרם לו להפשיט עורו. לימוד התורה מאפשר לאדם להרגיש במוות כמעבר ממקום למקום, ובכך להשיג את תכליתו הרוחנית.","contents":[{"passage_id":"vayikru2_e7afdae1_p1","passage_content":"או יאמר לבאר המדרש ילקוט אלמלי למד אדה\"ר תורה לא מת וכו', עפ\"י מ\"ש האה\"ח הקדוש (באופן הכ') עה\"פ אם בחקתי תלכו וזלה\"ק עוד ירצה ע\"ד אומרם ז\"ל כי כשברא ה' אדם הראשון לא בראו לשבת בעולם הזה לעולמי עד כשלא יחטא, שאם כן אדרבה ירידה היא לו ושפלות הוא, כי תכלית המקווה היא בעולם העליון, ששמה יקצור אשר זרע, אלא היתה הכוונה כי עלה יעלה לשמים ולאוצרות החיים בעת אשר יחפוץ, ויהיה כמי שדר בבית ועליה על גבת וכשירצה לעלות ולהשתעשע יעלת כמו שמצינו שעלה אליהו בסערה השמימה. וע\"י החטא הוצרך להפשיט עורו מעליו, וינוח הגוף בעוה\"ז. והודיע הכתוב כאן כי בהתעצמות האדם בעסק התורה, יכול להשיג באמצעותה שלא ירגיש במות אלא כאדם ההולך ממקום למקום וכו', עכדה\"ק."},{"passage_id":"vayikru2_e7afdae1_p2","passage_content":"ובזה יתבארו בדרך פשוט דברי המדרש ילקוט אלמלי למד אדה\"ר תורה לא מת, לפיכך כתיב אם בחקתי תלכו וגו'. דנתכוון בזה שלא תתמה ותאמר הלא שבתו בעוה\"ז לעולמי עד ירידה היא לו, שהרי התכלית המקווה הוא עלייתו לעולם העליון לאור באור החיית לזאת מסיים הילקוט לפיכך כתיב אם בחקתי תלכו, וכמ\"ש האוה\"ח הקדוש כי באמצעות אשר יתעצם האדם בלימוד התורה יוכל להשיג שלא ירגיש במוות, כי אם כאדם ההולך ממקום למקום. ויתירה מזו היתה מעלת אדם הראשון קודם החטא, שלא היה לו צורך בהפשעת לבוש גופו מעליו כדי לעלות השמימה, כי אם היה עולה לשמים בלבוש גופו כאדם הדר בבית ומטפס ועולה לעליה שעל גבה בעת אשר יחפוץ."}]},{"dvar_torah_id":"vayikru2_705a2778","title":"חובת דבקות בתורה בכל מעשה","summary":"בפרשת אם בחקתי תלכו, מדגיש המדרש את הצורך להיות דבוק בתורה גם בעסקי היום-יום. חכמות בחוץ תרונה מלמדת שהאדם צריך לנהוג עפ\"י התורה בכל תהלוכותיו, גם כאשר הוא עוסק בצרכים גשמיים, כדי להצליח בדרכו.","contents":[{"passage_id":"vayikru2_705a2778_p1","passage_content":"אם בחקתי תלכו וגו' במדרש תנחומא (ר\"פ זו) איתא זש\"ה (משלי א') חכמות בחוץ תרונה ברחובות תתן קולה. שאל רבי שמואל בר נחמני את ר' יונתן בר' אלעזר שהיה עומד בשוק א\"ל שנה לי פרק אחד, א\"ל לך לבית הלימוד ואני אשנה לך שם, א\"ל רבינו לא כך למדתנו חכמות בחוץ תרונת א\"ל יודע אתה לקרות ואין אחה יודע לשנות, מהו חכמות בחוץ תרונה בחוצה של תורה וכו',  ברחובות תתן קולה מהו ברחובות במקום שמרחיבין, והיכן מרחיבין לה בבתי כנסיות ובבתי מדרשות, ע\"כ. וצ\"ב שייכות מדרש זה לפרשת אם בחקתי. עוד יש לתמוה על מה ולמה הקשה ר' יונתן לענות לר' שמואל בר נחמני תלמידו יודע אתה לקרות ואין אתה יודע לשנות, הלא באמת כללא אית לן דאין מקרא יוצא מידי פשוטו, ופשטות הכתוב מורה דקאי על לימוד בחוץ ממש, ואילו הדרשה דקאי על בתי כנסיות ובתי מדרשות היא היפוך פשטות הפסוק."},{"passage_id":"vayikru2_705a2778_p2","passage_content":"ונראה לפרש עפ\"י מה שכתב האה\"ח (באופן הד') לבאר אם בחקתי תלכו, ע\"ד אומרו (משלי פ\"ג) בכל דרכיך דעהו וגו'. וכתב הרמב\"ם ז\"ל (בפ\"ג מהלכות דיעות ה\"ג) וז\"ל, ישים על לבו שיהא גופו שלם וחזק, כדי שתהא נפשו ישרה לדעת את ה', שאי אפשר שיסתכל בחכמות וכו'. נמצא המהלך בדרך זו כל ימיו עובד את ה', ואפילו בשעה שהוא נושא ונותן וכו', ע\"כ. והוא מאמר הכתוב כאן אם בחקתי תלכו בשביל עסק התורה תלכו בכל דרככם באכילה במשתה בדיבור וכו',  בכל מעשה המסובב מהטבעיות, עכ\"ד ז\"ל."},{"passage_id":"vayikru2_705a2778_p3","passage_content":"וכדברים האלו נמצינו למדים מדברי הרא\"ש בפ\"א ממסכת ברכות (סימן י\"ג) שנתן מעם לדבר שהמברך ברכות התורה אפילו הפסיק ויצא לעסקיו א\"צ לחזור ולברך כל היום, משום דלא הוי הפסק והיסח הדעת, דתמיד צריך להיות דעתו על לימודו, ות\"ח אפילו כשיוצאים לעסקיהם ממהרים לעשות צרכיהם כדי לחזור וללמוד, עכ\"ד. הרי כי הת\"ח מחשבתו דבוקה בכל עת בעסק התורה, וגם בהיותו ערוד בעסקיו לבו הומה ונפשו תערוג לשוב אל תלמודו, ולא יתמהמה כי אם ימהר יחיש מעשהו וישים לדרך פעמיו, לחזור ולהדבק בתורה הקדושה, ולהחיות נפשו בעל אורה. ובדברינו לעיל פרשת ויחי (ע' תקל\"א) הארכנו בענין זה ושם הבאנו דברי האגור שכתב דמה\"ט לא הוי מרחץ וביה\"כ הפסק לתלמוד תורה, לפי שאף שם צריך להזהר בדינים השייכים להם, ואין להסיח דעתו מזה, וטעם זה שייך אף במשא ומתן, דשייכו ביה כמה דינים גזל ורבית ודכוותייהו. היוצא לנו מזה כי בכל מקום שאדם מישראל נמצא הן בלכתו בחוץ בשוקים וברחובות ועוסק במו\"מ, הן בכל אתר ואתר, עליו להיות דבוק בתורה הקדושה, ולמדוד בפלס כל תנועה ומעשה וכל דיבור ומחשבה אם עפ\"י התורה הנהו, ואז יצליח בדרכו, ובלא\"ה אפשר בנקל לבא לידי מכשול עון ח\"ו."},{"passage_id":"vayikru2_705a2778_p4","passage_content":"וזאת אצלי כונת מאמרם ז\"ל (נדרים פ\"א ע\"א) דא\"ר יהודה אמר רב מאי דכתיב (ירמיה ע') מי האיש החכם ויבן את זאת וגו' על מה אבדה הארץ דבר זה נשאל לחכמים ולנביאים ולא פירשוהו עד שפירשה הקב\"ה בעצמו דכתיב ויאמר ה' על עזבם את תורתי וגו' היינו לא שמעו בקולי היינו לא הלכו בה, ע\"כ. וכבר האריכו הקדמונים למעניתם בביאור המאמר הלזה, כי לכאורה הוא קשה להלמו, האם בעבור שלא בירכו בתורה תחלה הגיע אליהם עונש מר זה, לגלות בין האומות והארץ תשאה שממה, נצתה כמדבר מבלי יושב."},{"passage_id":"vayikru2_705a2778_p5","passage_content":"אכן לדרכנו יתבאר ע\"נ, כי המה היו עוסקים בתורה בשבתם בביהמ\"ד, אך כאשר הפסיקו ללמוד והנכו לעסקיהם היו מסיחים דעתם מן התורה, ולא עלתה על לבם נשקול מעשיהם והנהגתם בשקל הקדש, אם דרכם ישרה עפ\"י התורה. ולפיכך בעת שפט מעסקיהם וחזרו לתלמודם היה ראוי להם לחזור ולברך ברכת התורה, דלא מהני מה שבירכו בתורה בשחרית, בעת שהחלו ללמוד, שהרי כבר היה כאן היסח הדעת גמור. ועל כן היה עונשם חמור כ\"כ משום שעזבו את התורה והסיחו דעתם ממנה לגמרי בעסקי משאם ומתנם ובכל תהלוכותיהם, והיינו דדריש לה ר\"י אמר רב מדכתיב ולא שמעו בקולי ולא הלכו בה שלא בירכו בתורה תחלה, דיליף לה מדכתיב ולא הלכו בה פירוש כי בעת שהתהלכו לדרכם ועסקו בצרכי הגוף כגון עסקי מו\"מ וכיוצא בו, לא התנהגו עפ\"י התורה, והסיחו דעתם ממנה לגמרי, וא\"כ היה להם לחזור ולברך ברה\"ת, שהרי זה כתחלת לימוד דהיסח הדעת גמור הוי הפסק. ולפי זה תהיה כוונת הגמרא שנענשו בעונש חמור זה משום שהשליכו את התורה אחרי גיום, ולא התנהגו על פיה בעת שעסקו בצרכי הגוף. והא דקאמר שלא בירכו בתורה תחלה מורה על חטא זה, שהרי מחמת שהסיחו דעתם מן התורה ולא התנהגו על פיה בכל דרכיהם, הוי היסח הדעת גמור, וזקוקים הם לחזור ולברך בה\"ת. וא\"ש דלא היה עונשם מחמת דבר זה בלבד שלא בירכו בתורה תחלה, אלא מחמת שלא התנהגו בדרכיהם עפ\"י התורה, שמזה נצמח שהיה להם לחזור ולברך והבן."},{"passage_id":"vayikru2_705a2778_p6","passage_content":"ועתה נבא לביאור המדרש זש\"ה חכמות בחוץ תרונה, דהנה מדכתיב אם בחקתי \"תלכו\" נמצינו למדים כי אף בשעה שהאדם מתהלך ועוסק בצרכי גופו עליו להתנהג בחקיה של תורה, כפירוש האה\"ח הקדוש הנ\"ל, ולפי זה יתבאר הכתוב חכמות בחוץ תרונה כפשוטו, שהכתוב מודיענו שהתורה והחכמה שקנה בהיותו בבית המדרש תנחהו ותנהלהו בהיותו בחוץ עוסק במו\"מ או שאר צרכי הגוף. ולפי זה פשטות הכתוב והדרשה תואמים זה לזה, כי אמת נכון הדבר שלימוד התורה צריך להיות בביהמ\"ד דייקא ולא בשוק כדרשת ר' יונתן בר' אלעזר חכמות בחוץ תרונה בחוצה של תורה וברחובות תתן קולה במקום שמרחיבין, הלא המה בתי כנסיות ובתי מדרשות, אכן גם לפי פשוטו של מקרא א\"ש דחכמות בחוץ תרונה וגו' קאי אחוצות ורחובות ממש, דגם בחוצות וברחובות צריך להיות דבוק ומקושר בעבותות האהבה אל התוה\"ק אשר למד בביהמ\"ד, ויהיו כל מעשיו במדה ובמשקל עפ\"י התורה וההלכה."},{"passage_id":"vayikru2_705a2778_p7","passage_content":"והשתא מובנים היטב דברי התנחומא דדריש על הפסוק אם בחקתי תלכו זש\"ה חכמות בחוץ יתרונה וגו', ומייתי עובדא דר' יונתן בר' אלעזר ותלמידו, דשפיר שייכא דרשה זו להכא, שהרי מדכתיב אם בחקתי תלכו שמענו שצריך הכתוב להיות דבוק בתורה הקדושה בכל תהלוכותיו ועניניו, לפיכך מייתי קרא דחכמות בחוץ תרונה, וכדאמרן שאף בחוץ יהיה מקושר אל התורה הקדושה, ותהיה כל הנהגתו על פיה. דע\"כ ליכא למימר דפירושיה דהאי קרא כפשוטי' שצריך ללמוד תורת בחוץ, שהרי לימוד התורה צריך ושיהיה בביהמ\"ד דוקא, וכעובדא דרבי ור' חייא במס' מו\"ק (דף ע\"ז ע\"ב), דדריש לה רבי מדכתיב חמוקי ירכיך (שה\"ש פ\"ז) מה ירך בסתר אף ד\"ת בסתר. אלא ודאי דכוונת הכתוב שתהיה הנהגתו בצרכי גופו הגשמיים עפ\"י התורה, והדרש והפשל שניהם אמת, דאם לומדים תורה בביהמ\"ד כדבעי אזי אף כאשר הולכים בחוץ דבוקים בתוה\"ק בכל עת תמיד. ונזכה להיות דבוקים בתוה\"ק תמיד, ולעבוד את הבוי\"ת באמת מתוך נחת ושמחה, והוא יצילנו מכל צרה וצוקה, ובמהרה נזכה לישועה שלימה ואמיתית, ולהתגלות כבוד שמים עלינו, במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru2_fb94bdda","title":"ללמוד ממעשי הרשעים לעבודת ה'","summary":"דוד המלך ע'ה חישב דרכיו לראות מעשי הרשעים, כדי ללמוד מהם לעבוד במסירות נפש למען התורה. הרשעים מצליחים בעבודתם לשקר, ואילו העוסקים בטוב נתקלים בקשיים. עלינו להחזיק את הכוללים והישיבות כנגד כוחות השקר.","contents":[{"passage_id":"vayikru2_fb94bdda_p1","passage_content":"במסיבה לתמיכת קופת רבי מאיר בעל הנס כולל שומרי החומות"},{"passage_id":"vayikru2_fb94bdda_p2","passage_content":"אם בחקתי תלכו ואת מצותי תשמרו ועשיתם אותם וגו'. במד\"ר ריש פרשתן איתא הה\"ד (תהלים קי\"ט) חשבתי דרכי ואשיבה רגלי אל עדותיך אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות הה\"ד ואשיבה רגלי אל עדותיך, ע\"כ. הקשו המפרשים ז\"ל כיצד יתכן לאמר כזאת על דוד מלך ישראל עליו השלום שהיתה דעתו בכל יום ויום ללכת לבתי טירטיאות וקרקסיאות, והלא אף הפחותים שבישראל המתפתים לעצת יצרם והולכים לאותם מקומות מ\"מ אין הם מחשבין מיד בבקר ללכת לשם, אלא שאח\"כ הם נשמעים ליצרם המסית אותם ורגליהם לרע ירוצו, וכ\"ש שא\"א לומר כן על דוד המע\"ה שהיתה מחשבתו נתונה בכל יום ללכת למקומות אלו."},{"passage_id":"vayikru2_fb94bdda_p3","passage_content":"והנראה לומר לענינינו דהנה מדרך הרשעים שכל מעשיהם להמרות פי העליון יתברך ולהכעיסו ברוע מעלליהם נעשים בזריזות ובחשקות גדול, ולא ינוחו ולא ישקוטו לילה ויום מלטכס עצות לחשוב מחשבות כיצד לבצע זממם הרע. וכאשר נראה היום בעליל בעוה\"ר כי דרך רשעים צלחה וכחם חזק מאד לבצע כל אשר חמו לעשות, וכל הכספים שהיו ניתנים מלפנים על ידי נדיבי עם בכל מקומות מושבותם להחזקת הכוללים והישיבות הקדושות בא\"י, עברו עתה לידיהם, ובאותו ממון שאחבנ\"י נותנים בתורת צדקה הם משתמשים לעקור את האמונה ולהעביר לשמד ולכפירה רבבות מאחינו בני ישראל. ולעומת זאת אצל העוסקים בצרכי מצוה למען דבר טוב מתנהל הכל בכבדות ובעצלות גדול בלי חשק ורצון. והטעם מפני שלאותם הכופרים העוסקים בעבירה מסייע היצה\"ר ומזרזם למעשיהם, ולהיפוך לאותן העוסקים בדבר טוב הריהו מתנגד ומעמיד מכשולות בדרכם. אמנם עם כל זאת הדברים תמוהים מדוע קשה כ\"כ להוציא אל הפועל דבר טוב, ואף דשטנא נצח בעוה\"ר והוא מתגבר בכל כוחותיו לקלקל, מ\"מ הרי כללא אית לן (שבת ק\"ד ע\"א) שקרא לא קאי קושטא קאי, א\"כ היה האמת צריך להתקיים, ולהיפוך כל מה שהכופרים עושים למען השקר לא היה ראוי שיתקיים ויעמוד, ומדוע איפוא מצליחין הרשעים כ\"כ בפעולותיהם למען השקר."},{"passage_id":"vayikru2_fb94bdda_p4","passage_content":"ואמרתי דטעם הדבר משום שהרשעים עושים למען דרך השקר שלהם באמת גמור, שעושים בכל כוחם ויכלתם למען השקר, ומשום שמפעלותיהם הם באמת הריהם מצליחים, דאף שהתכלית והמטרה היא דרך השקר, מ\"מ הפעולות והמעשים לצורך כך נעשים באמת. משא\"כ פעולותיהם של יהודים חרדים לצורך דבר טוב אינם כ\"כ באמת גמור, כאשר הרשעים עובדים למען השקר בנאמנות ובמסירות נפש גדולה. ע\"כ קשה מאד להצליח בפעולות למען דבר טוב, דאף שהתכלית הנרצה הוא האמת, אבל הפעולות והמעשים לצורך כן אינם נעשים באמת."},{"passage_id":"vayikru2_fb94bdda_p5","passage_content":"והנה דוד המלך ע\"ה היה חפץ ומשתוקק להרבות בכל כוחו בפעלים למען התוה\"ק, ולפי שראה שהרשעים פורקי עול עובדים במסירות ובנאמנות מרובה כ\"כ למען השקר, חשב מחשבות תמיד ללכת להביט במעשיהם, כדי ללמוד מהם לעבוד במסנ\"פ למען תוה\"ק. וז\"ש בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך וכו', כדי להביט במעשיהם בכמה כוחות ועמל הם עובדים למען השקר, וממנו יקח לעשות למען תוה\"ק בחשקות גדול בלי ליאות, אבל בסופו של דבר היו רגלי מוליכות אותי לבתי כנסיות ולבתי מדרשות, כי דהמע\"ה היה עושה פעלים למען התורה הקדושה בכל לבו במסירות נפש גדולה יותר ויותר ממה שעשו הם לדרכיהם הרעים, ולא היה לו צורך ללמוד מהם כלום. והיוצא לנו מזה כי ממעשי הרשעים העובדים למען השקר באמונה ובמס\"נ, נלמוד אנו לעשות פעלים למען דבר טוב באותה מדם."},{"passage_id":"vayikru2_fb94bdda_p6","passage_content":"ואפ\"ל עוד דהנה אם ברצון האדם לדעת בבירור אם הוא הולך בדרך האמת ישקול דרכיו ועניניו ויעמידם על כור המבחן באחד מב' דרכים, הא' יתבונן אם דרכו והנהגתו הוא ע\"ד אבותינו ורבותינו הקדושים נ\"ע וכמאה\"כ (שה\"ש א') אם לא תדעי לך היפה בנשים צאי לך בעקבי הצאן, ופירש\"י ז\"ל אם לא תדעי לך היפה בנשים בשאר עכו\"ם איכה תרעי ותנצלי מיד המציקים לך להיות ביניהם ולא יאבדו בניך התבונני בדרכי אבותיך הראשונים שקבלו תורתי ושמרו משמרתי ומצוותי ולכי בדרכיהם, ע\"כ. והמבחן הב' והוא הברור יותר חזק כראוי מוצק, אם הנהגתו וענינו הוא להיפוך ממש מדרכי הרשעים, אזי ידע כי תצליח ה' דרכו, והרי מעשיו והנהגתו על דרך האמת. שהרי זה ברור שכשם שהצדיקים האמיתיים הם מכוונים אל האמת, כן להיפוך הרשעים מכוונים בכל פעולותיהם אל השקר, וכל מה שהם עושים ברור הוא שבשקר יסודו, ויתירה מזו דלפעמים יתכן אצל צדיקים שיש להם סמיות עינים, ואפשר שלא יכוונו לאמת כ\"כ, אבל הרשעים לצורך השגת רשעתם אין להם סמיות עינים כלל, וכל מה שהם מתכוונים להרע הם משיגים ומכוונים אליו מיד ולא יטעו כלל, כי הסט\"א מחזק ומאמץ כחם להשיג מהר רצונם ומאויים כאשר עם לבבם. וא\"כ זהו המבחן האמיתי ליראי ה' לדעת ההצליח ה' דרכיהם אם יראו שמעשיהם הם ממש מן ההיפוך אל ההיפוך מדרכי הרשעים, וע\"ד ששמעתי מאת אבא מארי זלה\"ה עה\"פ (תהלים קי\"ט) מאויבי תחכמני מצוותיך וגו', פירוש מאויבי הם משנאי ה' תחכמני שאדע איך להתנהג במצוותיך, כי כשאתבונן במעשיהם ואראה דרכם אשכיל להתנהג היפוך דרכם. כי זה ודאי שהם אינם טועים וכל מעשיהם הם היפוך דרך התוה\"ק, וא\"כ מהם אתבונן איזהו דרך התורה האמיתי שאתנהג בו, מה שהוא הדרך ההפכי מהם."},{"passage_id":"vayikru2_fb94bdda_p7","passage_content":"וזאת אפ\"ל בדברי המד\"ר שאמר דוד בכל יום ויום הייתי מחשב למקום פלוני וכו' אני הולך, כדי לראות ולהתבונן במעשי הרשעים דרכם והתנהגותם, ומהם אקח לדעת הדרך האמיתי שהוא ממש הפכי לגמרי לדרכם, והיו רגלי מוליכות אותי לביהמ\"ד כי לא היה לו צורך לדהמע\"ה להשתמש במבחן זה לשפוט יושר דרכו עפ\"י מעשי הרשעים ותהלוכותיהם, כי בגודל כח קדושת אדוננו דהמע\"ה לא טעה בזה, אלא ידע והשיג בשבתו בביהמ\"ד את דרך התורה האמתי מבלי שיהא לו צורך להבחין זאת עפ\"י הנהגות הרשעים."},{"passage_id":"vayikru2_fb94bdda_p8","passage_content":"ולענינינו הנה בימים קדמונים היו הכוללים והישיבות הקדושות יסוד הישוב בא\"י, וכל מי שחפצה נפשו להדבק באור החיים היו רגליו מוליכות אותו לבתי מדרשות לעסוק בתורה, ואז היתה ארץ ישראל מלאה קדושה, ולא מצאו בה פושעי ישראל מנוח לכף רגלם. ובעוה\"ר היום הדברים הפוכים, דאף שישנם גם היום כוללים חשובים ובהם לומדי תורה המתפרנסים מקופות הכוללים, אבל מצבם בשפל המצב, בעבור שכל שפע הממון שהיו נותנים אחב\"י להחזקת התורה בא\"י נפסק עתה, וכל הממון ניתן למינים וכופרים המשתמשים בו להעביר את ישראל על אמונתם ודתם, ולעקור מלבם כל זיק אמונה, כאשר עשו ליהודי מארוקו ותימן שהובילום לא\"י והפכו אותם לכופרים גמורים."},{"passage_id":"vayikru2_fb94bdda_p9","passage_content":"ולדרכנו נאמר דהנה הכוללים הללו יסודתם בהררי קודש ע\"י הצדיקים הקדושים בדורות הקודמים עוד מימי האלשיך הק' והבית יוסף זיע\"א, ואח\"כ חזרו ונוסדו יחד ע\"י תלמידי הבעש\"ט הקדוש וכן תלמידי הגר\"א ז\"ל, עד שקמו האפיקורסים להשבית ולעקור את הכוללים. וכאן יש לנו ב' הבחינות לדעת ברור מענתם של הכוללים, המבחן הא' שזהו דרך הצדיקים הקדושים מדורות הקודמים. והמבחן הב' שדרך הרשעים היא להיפוך, שהם מתאמצים בכל תחבולותיהם להשפילם ולעקרם כליל. ע\"כ אנו מחוייבים להתאמץ להחזיק בכל מה דאפשר את הת\"ת הישיבות והכוללים. וכמ\"ש מרן החת\"ס זי\"ע שאנו מחוייבים להחזיק את יושבי א\"י החרדים לדבר ה' בעבור חשבון קידוש החדש ועיבור השנים שאינו אלא בארץ ישראל לדעת הרמב\"ם ז\"ל בספר המצוות."}]},{"dvar_torah_id":"vayikru2_71908b61","title":"מעלת דוד במלחמה וחשיבות התורה","summary":"דוד המלך מתאנח על חסרון ב' מאות חלל, כי רצה להראות כבוד שמים. הוא מבין ששכר מצוות בעוה\"ז מועט, אך עיקר השכר לעוה\"ב. המידה טובה מרובה על פורענות, אך יש להבין את ההבטחות בתורה בהקשר הנכון.","contents":[{"passage_id":"vayikru2_71908b61_p1","passage_content":"אם בחקתי תלכו ואת מצוותי תשמרו ועשיתם אותם וגו'. במד\"ר ריש פרשתן איתא הה\"ד (תהלים קי\"ט) חשבתי דרכי ואשיבה רגלי אל עדותיך אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות הה\"ד ואשיבה רגלי אל עדותיך, ע\"כ. והדברים מתמיהים למאד שהרי דוד המע\"ה היה דבוק ביוצרו בכל עת ורגע, ונפשו איותה לעשות רצון קונו וחפץ צורו, וא\"כ מאין באו אליו מחשבות זרות כאלו בכל יום ויום ללכת למקומות ולבתים אשר לא יאות לקרוב אל פתחם. והלא אף הדיוט שבישראל אשר נכשל בהליכה בפועל אל אותם מקומות, מסתמא אינו מחשב על כך מראש, אלא בשעת מעשה גובר עליו יצרו ומושכו ברשתו ללכת לאותם מקומות, ועל אחת כו\"כ שלא יאומן כזאת על אדונינו דוד המלך עליו השלום שיטרידוהו מחשבות זרות כאלו בכל יום ויום."},{"passage_id":"vayikru2_71908b61_p2","passage_content":"ב) ורדפו מכם חמשה מאה ומאה מכם רבבה ירדופו ונפלו אויביכם לפניכם לחרב. בגמרא (סוטה דף י\"א ע\"א) איתא ולעולם מדה טובה מרובה ממידת פורענות. והקשו התוס' (שם ד\"ה ולעולם) אם תאמר הא מצינו מידת פורענות גדולה ממדה טובה, דכתיב גבי מידת פורענות איכה ירדוף אחד אלף ושנים יניסו רבבה ואילו גבי מדה טובה כתיב ורדפו מכם חמשה מאה, וי\"ל דבמידת פורענות מיירי ברדיפה ולא בהריגה אבל הכא דכתיב ורדפו מכם חמשה מאה מיירי ברדיפה והריגה, דכתיב בסיפא דקרא ונפלו אויביכם לפניכם לחרב, עכ\"ד התוספות."},{"passage_id":"vayikru2_71908b61_p3","passage_content":"והאוה\"ח הקדוש בפרשה זו הקשה על תירוץ התוס' ממה שאמרו ז\"ל במועד קטן (דף ט\"ז ע\"ב) אלה שמות הגבורים אשר לדוד וכו' וכשהיה יוצא למלחמה היה וכו' זורק חץ ומפיל ח' מאות חלל בפעם אחת והיה מתאנח על מאתים דכתיב איכה ירדוף אחד אלף יצתה בת קול ואמרה רק בדבר אוריה החתי. והשתא לפי דברי התוס' דמה שאמר הכתוב איכה ירדוף אחד אלף מיירי ברדיפה בלא הריגה, למה היה מתאנח דוד על שלא היה הורג אלף חלל בחץ אחד, דכתיב איכה ירדוף אחד אלף, הלא פסוק זה אינו מדבר בהריגה כי אם ברדיפה בלחוד. ומכח קושיא זו דחה הוא ז\"ל דברי התוספות, וכתב אשר על כן נראה דבין פסוק ורדפו מכם חמשה מאה בין פסוק איכה ירדוף אחד אלף אינו מדבר אלא בהריגה, ומה שהקשו התוס' נראה לתרץ עפי\"מ דאיתא בת\"כ וז\"ל, מכם מן החלשים שבכם ולא מן הגבורים שבכם, ע\"כ. ויל\"ד למה כפל לומר ולא מן הגבורים, אלא הכוונה היא שבא לשלול שלא לפרש דבריו שר\"ל אפילו מן החלשים, לזאת פירש ולא מן הגבורים. והשתא לא קשה מידי קושיית התוס', כי בפסוק זה לא הזכיר אלא ברכת החלשים שבישראל שירדפו חמשה מאה וכו'. ומה שאמר הכתוב איכה ירדוף אחד אלף מדבר בגבורים, ואומרו אחד נתכוון לומר המיוחד שהוא הגבור וכו'. ולזה היה דוד מתאנח על תשלום האלף כדי שלא תהיה מדת פורענות מרובת כי דוד היה אחד המיוחד וכו', עכ\"ד האוה\"ח הקדוש עיי\"ש שהאריך."},{"passage_id":"vayikru2_71908b61_p4","passage_content":"ולכאורה קשה קצת על מה דנחית לחלק בין אם ישראל הרודפים הם גבורים או חלשים, והוציא כן מדברי הת\"כ, שהרי הבטחת ורדפו מכם חמשה מאה וגו' היא יעוד נסי שמחוץ לטבע העולם, וכיון שכן מה מקום לחלק במספר הנופלים בין אם ישראל הרודפים הם גבורים או חלשים, אם כל ענין הרדיפה הוא בעזרתו יתברך, הלא לפניו אין מעצור להושיע ברב או במעט כח, כי הוא הנותן ליעף כח ולאין אונים עצמה ירבה, ואם חפץ ה' הריהו מאמץ ידים רפות ומחזק ברכים כושלות, לנצח בשדה המלחמה כאחד הגבורים אשר מעולם אנשי השם."},{"passage_id":"vayikru2_71908b61_p5","passage_content":"ואפ\"ל בביאור כוונת האה\"ח הקדוש עפ\"י מה דאיתא בתנדב\"א רבה (פ\"ג הובא בילקוט ראובני פרשה זו) דוד הכה ח' מאות חלל בפעם אחת, אמר דוד לפני הקב\"ה רבש\"ע מפני מה אני חסר מאתים, א\"ל דוד בני לא כן כתבתי בתורתי ורדפו מכם חמשה מאה, אעפ\"י שאין בכם ד\"ת איש אחד מכם ירדוף אלף שנאמר איכה ירדוף אחד אלף, אבל אתה עשית רצוני ולא כל רצוני שנאמר רק בדבר אוריה החתי לפיכך אתה חסר מאתים וכו',  ע\"כ. מבואר מזה דהך קרא ורדפו מכם חמשה מאה וגו' מיירי כשאין בישראל דברי תורה אלא ד\"א ומקרא בלבד, אבל כשיש בהם ד\"ת ירדוף אחד מישראל אלף מן העכו\"ם. ולכוונה זו אפשר להסב גם דברי האה\"ח הקדוש שהביא דרשת הת\"כ מן החלשים שבכם ולא מן הגבורים שבכם, כלומר שהם חלשים בד\"ת שאין בהם אלא ד\"א ומקרא בלבד, על כן ברכתם מועטת שירדפו חמשה מאה בלבד, אבל גבורים שבכם הלא המה גבורי כח עושי דברו העוסקים בתורה ובמצוות באמת, ברכתם כפולה ומכופלת כמה מונים עפ\"י פעלם, ולכל הפחות ירדוף אחד מהם אלף, זה הנראה לי ליישב דברי האוה\"ח הקדוש."},{"passage_id":"vayikru2_71908b61_p6","passage_content":"ברם אכתי לא סגי לן בהכי ליישב מה שאמרו ז\"ל בדוד שהיה מתאנח על חסרון המאתים לתשלום האלף, שהרי לפי מה דאיתא בתוספתא דסוטה הביאו רש\"י ז\"ל בפרשת כי תשא במאה\"כ פוקד עון אבות על בנים על שלשים ועל רבעים וגו' נמצא שמדה טובה מרובה ממדת פורענות אחת לחמש מאות שבמדה טובה הוא אומר נוצר חסד לאלפים ואילו מדת פורענות מגעת עד ארבע דורות בלבד. א\"כ תמוה מה שאמרו ז\"ל שכל מה שהיה דוד מתאנח היה בעבור ב' מאות החסרים לו לתשלום אלף, ולפי\"ז כל אנחתו היתה על שלא הגיע למעלת האומות בעת הצלחתן שנאמר בהם איכה ירדוף אחד אלף, ואילו היה מכה אלף בחץ אחד הוה ניחא ליה, וקשה מדוע לא התאנח על שלא נתקיים בו הבטחת מדה טובה המרובה ממדת פורענות ת\"ק פעמים, להיותו אחד המיוחד בגבורים, ולפי חשבון זה היה ראוי לו לרדוף ת\"ק אלף בפעם אחת."},{"passage_id":"vayikru2_71908b61_p7","passage_content":"ואשר על כן נראה לי לומר בישוב הסתירות בענין זה בדברי חז\"ל שנדחקו בהם הקדמונים וטרחו לתרצם בפנים שונים, ובאמת בעיני יפלא דלכאורה אין כאן התחלת קושיא. דהנה כבר הזכרנו לעיל דהא דמדה טובה מרובה ממדת פורענות ת\"ק זימני ילפינן מדכתיב במדת פורענות פוקד עון אבות וגו' על שלשים ועל רבעים, ואילו במדה טובה כתיב נוצר חסד לאלפים. אמנם הנה כלל גדול הוא בדבריהם ז\"ל (קידושין ל\"ט ע\"ב) שכר מצוה בהאי עלמא ליכא. והיינו דאין הקב\"ה משלם שכר המצוות בעוה\"ז, כי אם פירותיה של המצוה יאכל בעוה\"ז והקרן קיימת לו לעולם הבא, אז יתענג על ה' וישבע מרב טוב הצפון לו. א\"כ נמצא דמה שהבטיחה תורה לשלם במדה טובה מרובה היינו בעולם הגמול. ולא מיבעיא לדעת הרמב\"ם ז\"ל בהלכות תשובה (פ\"ט ה\"א) וז\"ל שכל היעודים הטובים הנזכרים בתורה אינם סוף מתן שכרן של מצוות ולא אותם הרעות האמורות בתורה לעוברי על דת הם סוף הנקמה שנוקמין מן העובר על המצוות, אלא שכל היעודים הללו הם שאם נקיים את התורה בשמחה ובטובת נפש וכו' יסיר הקב\"ה מאתנו את הדברים המונעים אותנו מלעשות ולקיים התורה כחולי ורעב ויגון באופן שנוכל לעבוד את ה' בלא שום מונע. ולהיפוך אם נעזוב את התורה מדעת ונעסוק בהבלי הזמן אזי דיין האמת יסיר מן העוזבים כל טובות העוה\"ז ומביא עליהם כל הרעות המונעות מלקנות עוה\"ב. אבל עיקר השכר של עוה\"ב אינו נזכר כאן כלל כדי שיעבוד את הבוי\"ת לשמו ולא מחמת שכר ההוא או מיראת העונש, עכ\"ד הרמב\"ם ז\"ל. א\"כ פשיטא דהבטחת נוצר חסד לאלפים קאי על עוה\"ב שהוא זמן תשלום השכר הטוב לאוהביו ולשומרי מצוותיו. אלא אף לדעת החולקים על הרמב\"ם ז\"ל וסבירא להו דגם היעודים הנאמרים בתורה בפרשת אם בחקתי ובשאר מקומות הם בתורת שכר על קיום המצוות, וטרחו ליישב באופנים שונים הקושיא הידועה מדוע לא נזכרו היעודים הרוחניים בתורה (עיין כלי יקר פ' זו שהביא דברי מהר\"י אברבנאל שמונה שבעה דעות שנאמרו בדברי הקדמונים בענין זה), מ\"מ אף הם יודו דשכר עוה\"ז אינו אלא מיעוטא דמיעוטא מן השכר המשתלם בעד שמירת התורה והמצוות, ועיקר השכר צפון וגנוז לעוה\"ב, וכמו שדרשו ז\"ל בס\"פ ואתחנן היום לעשותן ומחר לקבל שכרן."},{"passage_id":"vayikru2_71908b61_p8","passage_content":"והכי נמי איתא במד\"ר פ' עקב (פ\"ג א') אמרו ישראל אימתי אתה עתן לנו שכר המצוות א\"ל הקב\"ה המצוות שאתם עושים מפירותיהם אתם אוכלים עכשיו אבל שכר הקרן בעקב אני נותן לכם שנאמר והיה עקב תשמעון. והשתא תו לק\"מ מהא דאמרו ז\"ל שמדה טובה מרובה על מדת פורענות ת\"ק פעמים על מה שמצינו שמידת הטובה שהבטיח הקב\"ה לישראל ורדפו מכם חמשה מאה אינה מגעת למדת הפורענות דכתיב איכה ירדוף אחד אלף. שהרי הא דאמרו ז\"ל מדה טובה מרובה על מידת פורענות ת\"ק פעמים אין המכוון כי כל השכר המרובה הזה בארץ ישולם, דאדרבה גריעותא היא אם ישתלם שכר המצוות בעוה\"ז, וזוהי מידת העונש שהקב\"ה משלם לאויביו שכר מעשיהם הטובים בעוה\"ז. וכמו שפירש\"י ז\"ל במאה\"כ (ס\"פ ואתחנן) ומשלם לשונאיו אל פניו להאבידו שהוא משלם להם שכרם בעוה\"ז כדי לטרדם ולהאבידם מן העוה\"ב, אוי להם ואוי לנפשם. ולהיפך בצדיקים הקב\"ה נפרע מהם בעד עוונותיהם בעוה\"ז כדי יכנסו לעוה\"ב מזוככים ומטוהרים ללא כל רבב והם יקחו חלקם משלם להתענג בג\"ע מרב טוב הצפון להם."},{"passage_id":"vayikru2_71908b61_p9","passage_content":"אלא כך הוא עיקרן של דברים הקב\"ה מאכיל לעובדיו בעוה\"ז מפירות המצוה שעשו, והשכר כולו קיים להם לעולם הבא. ואם יש להם עוונות נפרע מהם בעוה\"ז כדי שבצאתם מן העוה\"ז יזכו מיד ליהנות מפרי מעשיהם הטובים, וע\"ד שאמרו ז\"ל במי שנהרג ע\"י עכו\"ם שהוא זוכה מיד לחיי העוה\"ב שהריגתו כפרה על כל עוונותיו, והריהו נכנס לג\"ע נקי וזך בלי שמץ חשא. וענין שכר העולם הבא תלוי הכל לפי המדריגה שזכה לה בחייו, ואם יזכה יקבל יותר ויותר מת\"ק פעמים בשכר מצוותיו. וכמ\"ש האוה\"ח הקדוש בס\"פ ואתחנן עה\"פ ולשומרי מצוותיו לאלף דור ואמרו ז\"ל העושים מיראה לאלף דור ולעושים מאהבה אלפים, כי לא כפל בלבד יגיד אלפים כי בודאי שעושה מאהבה אין קץ לשכר מעשיו, ולאלפים האמור באוהביו לשון רבים יכולנו לומר עד מאה אלף וכו', ויש בין אוהב לאוהב כפלי כפלים אלא קטן שבאוהבים גדול כפלים כגדול שביראים, עכדה\"ק."},{"passage_id":"vayikru2_71908b61_p10","passage_content":"ובדרך זו נראה ליישב מה שנתקשו המפרשים בדברי הכתוב נוצר חסד לאלפים, דלפי מה שאמרו ז\"ל (ר\"ה ל\"א ע\"א) שית אלפי שני הוה עלמא, אין במציאות שיהיו בעולם ב' אלפים דורות במשך כל ימות העולם, וכיצד הבשיחה תורה נוצר חסד לאלפים אם כל שנות העולם הם פחותים בהרבה מאלפים דורות. ובספר תורת משה למרן החתם סופר זלה\"ה מביא מספר שושנים לדוד (הובאו דבריו בתוספות חדשים על משניות סוף מסכת מכות ממוהרש\"ח זצ\"ל) לתרץ קושיא זו ע\"ד שכתב בהקדמת בה\"ג דהתורה נבראת ב' אלפים שנה קודם העולם, וכתיב דבר צוה לאלף דור שהוא תתקע\"ד דורות קודם העולם, ש\"מ כל דור ודור הוא שתי שנים וי\"ט יום וי\"א שעות וכו', ע\"כ. וא\"כ שפיר איכא בעולם ב' אלפים דורות שהם ד' אלפים שנה מתחלת ב' אלפים תורה שתחילתן מזמן אברהם אבינו עליו השלום (עי' ע\"ז ש' ע\"א)."},{"passage_id":"vayikru2_71908b61_p11","passage_content":"אכן אכתי קשה דכיון דמזמן מתן תורה ליכא ב' אלפים דור עד סוף ימות עולם, א\"כ כיצד אמרה תורה במעמד הנבחר נוצר חסד לאלפים, בעוד שלא נותרו בעולם ב' אלפים דורות ממ\"ת. ותו קשה דבמדת פורענות כתיב פוקד עון אבות על בנים ועל בני בנים על שלשים ועל רבעים, הרי דמדת העונש הוא ארבע דורות ממש בנים ובני בנים וכו', ולא בדורות של ב' שנים, ומהתם ינפינן דמדה טובה דכתיב בה ועושה חסד לאלפים מרובה ת\"ק זמני על מדת פורענות. וא\"כ כי היכי דבמדת פורענות אמרינן דארבע דורות הם דורות ממש, ה\"נ במדה טובה אלפים דור האמורים בה הם דורות ממש, והדרה קושיא לדוכתה דאין כאן ב' אלפים דור במנין כל ימות עולם."},{"passage_id":"vayikru2_71908b61_p12","passage_content":"ונראה בהקדם עוד מ\"ש מרן החתם סופר זלה\"ה בתשובותיו (חאו\"ח סימן קנ\"ח) על מה שכתב מהרי\"ל בשם רבינו פרץ דסנדקאות מעשרת כקטורת, והרמ\"א ז\"ל ביורה דיעה (הלכות מילה סימן רס\"ה) העתיק דברי ר\"פ הללו וכתב עליו דמה\"ט נוהגין שלא ליתן ב' ילדים לבעל ברית אחד כדאמרינן בקטרת (תמיד פ\"ה מ\"ב) חדשים לקערת בואו והפיסו מפני שמעשרת. והגר\"א זלה\"ה בהגהותיו כתב על דברי הרמ\"א דמעולם לא ראינו לסנדק שמתעשר. ולדעתו מקור הדברים שלא ליתן ב' סנדקאות לאיש אחד נובע מצוואת ר\"י החסיד. וכתב על כך החת\"ס זלה\"ה דלא ראינו אינה ראיה, ואין זה כדאי להכחיש דברי אחד מן הראשונים, ואפשר החליפו לו מן השמים שכר העשירות בשכר אחר לפי זכותו ולפי מזלו, עיי\"ש בארוכה."},{"passage_id":"vayikru2_71908b61_p13","passage_content":"וכמו כן אף אנו נאמר לענינינו כי הקב\"ה הבטיחנו בתורתו הקדושה לשלם שכר טוב לאוהביו ולשומרי מצוותיו לאלפים דור, אכן באמת אין זו הבטחה שיהיה שכרו משתלם לו בעוה\"ז, כמבואר דשכר מצוה בהאי עלמא ליכא, אלא שהבטחת הקב\"ה הוא שישולם לו בעוה\"ב שכר השוה באיכותו ובערכו אל השכר שהיה ראוי להשתלם במשך אלפיים דור, והבטחתו יתברך שרירה וקיימת, ולעד עומדת. והוא דוגמת מ\"ש החת\"ס זלה\"ה דאפשר שהחליפו מן השמים שכר עשירות בשכר אחר, ה\"נ כך היה ענין יעוד זה שישתלם לו שכר עוה\"ב לפי מדת שכר של משך ב' אלפי דור מן העוה\"ז, כי הרבה דרכים למקום לתת לאיש כדרכיו וכפרי מעלליו בעולם הנצחי באופן שישוה אל השכר הראוי לו על פי הבטחת ועושה חסד לאלפים. אף שאין אנו מבינים ומשיגים ענינים אלו בעוה\"ז, כי גבהו דרכי המקום יתברך מדרכנו ומחשבותיו ממחשבותינו כגבוה שמים מארץ, ומה מאד עמקו מחשבותיו יתברך עד אין חקר, ואין אתנו יודע עד מה, וגם אסור לנו לחקור ולהתבונן במה שלא הורשינו משום מה למעלה ומה למטה וכו'."},{"passage_id":"vayikru2_71908b61_p14","passage_content":"תבנא לענין ראשון כי עיקר תשלום השכר המיועד לשומרי מצוות השי\"ת הוא בעולם הנצחי, ובעוה\"ז אין ישראל נהנים כי אם מפירות השכר. וא\"כ שוב אין לתמוה ולהקשות על מה שנראה לעין כי אין מדה טובה מרובה ממדת פורענות, שהרי במדת פורענות נפרטין מישראל בעוה\"ז על כל עוונותיהן משא\"כ במדה טובה עיקר הגמול שמור הוא לעולם הבא, ועל כן נדמה לעיני בשר כי ח\"ו מדת פורענות מרובה, מאחר שבמדה טובה אין משלמין בעוה\"ז כי אם כטיפה מן הים מהשכר הרב והעצום השמור לחלקן של ישראל, והקרן כולה קיימת וגנוזה לעולם הבא. והשתא דאתאן להכא, לכאורה איכא לאקשויי איפכא מדוע היה דוד מתאנח על ב' מאות החסרים לו לתשלום האלף משום שנאמר באוה\"ע איכה ירדוף אחד אלף הרי לא דמיין כלל זה לזה, דבישראל אין הקב\"ה משלם שכר מצוותיהן בעוה\"ז, ומה לו להצטער על זאת, ודאי כי שכרו הרבה מאד לפי צדקתו ומעשיו הטובים, אלא שהוא צפון לו לעוה\"ב."},{"passage_id":"vayikru2_71908b61_p15","passage_content":"אכן נראה לבאר ענין אנחתו של דוד על חסרון ב' מאות חלל לתשלום אלף, עפ\"י מה שכתב בספר אבן יחיא (דניאל פ\"ח) שעושה חשבון עפ\"י הסוד וז\"ל כי בסוף ה' אלפים ושבע מאות שנה לבה\"ע בקירוב אם מעט קודם או מעט אח\"כ יבא קצנו בעזהי\"ת, למען יוכלו בני ישראל לשבת בטח על אדמתם כג' מאות שנה מהאלף הששי, למען יתראה לעין כל היות האמת אתם, ויהנו בגוף ונפש מן העוה\"ז וכו', ויהיו המאות שלשה להיות כי בסך ההוא תפול החזקה, ויתאמת הדבר היותו בלתי מקריי בהתמידו הסך ההוא וכו'. ואותו הטוב הגופני מהעוה\"ז אשר ינתן להם בסוף אלף הששי הוא לאות ולמופת שהם בני עליה, ויראו כל העולם ויושבי תבל סכלותם מקדם ומעלת ישראל, וישערו מטובם הגופני הטוב הרוחני אשר ירשו בני הגלות אחר המות ולנצח נצחים וכו', ע\"כ. ובדבריו אלו פירשתי מאה\"כ (תהלים ל\"א) מה רב טובך אשר צפנת ליראיך פעלת לחוסים בך נגד בני אדם (עיין בדברינו לעיל פ' פקודי תכ\"ח)."},{"passage_id":"vayikru2_71908b61_p16","passage_content":"תמצית הדברים כי כאשר יושבי תבל רואים במו עיניהם רום מעלת בני ישראל ותפארת גדולתם בעוה\"ז, אזי מתגדל ומתקדש שמו הגדול יתברך בעולם כולו, כי הן בראותם את כל הטוב אשר עשה ה' לישראל, ישפטו בדעתם כמה טובה כפולה ומכופלת למקום עלינו לעולם הבא, ויכירו ויודו כולם מה רב הטוב הצפון לישראל לנצח נצחים. וע\"ד זה כתב בסה\"ק ערבי נחל לפרש מאה\"כ (תהלים ח') נודע ה' משפט עשה בפועל כפיו נוקש רשע וגו', פירוש אימתי נודע ה' ונגלה כבוד ה' ומתעלה שמו בקרב יושבי תבל בזמן שמשפט עשה בפועל כפיו נוקש רשע, דהיינו מיד כאשר הרשע עובר עבירה הוא נוקש ונלכד בחטאו, כי הקב\"ה עשה בו משפט ודין לאלתר, או אז כל יושבי תבל צדק למדו בראותם בעליל כי עוונותיו ילכדנו את הרשע, ישוב עמלו בראשו ועל קדקדו חמסו ירד. אבל אם ישובו רשעים לשאולה כלומר שאין הקב\"ה משלם לשונאיו אל פניהם רע כרשעתם, אלא הם שלוים ושקטים בעוה\"ז ועברתם שמורה נצח להפרע מהם אחרי מותם, ולדונם בתופת שלהבות, אזי בל גויים שבחי אלקים, בי אינם מכירים ויודעים גדולתו של הקב\"ה, והם תמהים ומשתוממים מדוע אינו משלם לרשע רע כרעתו, ולא ידעו ולא יבינו בי חטאתו צרורה ומונחת להפרע ממנו ביום הגמול."},{"passage_id":"vayikru2_71908b61_p17","passage_content":"והיוצא מזה בי אף שעיקר שכר מצוותיהן של ישראל שמור להם לעוה\"ב ואז שברם יטלו משלם מבעל הגמולות, מ\"מ בדין הוא שיתן הקב\"ה לישראל בל טוב בעוה\"ז ויפאר אותם וירוממם וינשאם לבל הפחות במדה השוה לתפארת גדולת גויי הארצות בעת היותם בשיא גדולתם. שאם לא תגיע מעלתן של ישראל וגדולתן למעלת העכו\"ם, ח\"ו יתחלל שם שמים לעיני הגויים, באמרם איה השכר הטוב אשר הבטיח הקב\"ה לזרע ידידיו. דלא סגי במה שיהיו מספרים לאוה\"ע רבותא דיעבד לן קב\"ה כד מטיא שעתא, במיתי לן נהורא ותחפי להון בהתא, שהרי אוה\"ע אינם מאמינים במה שצפון להם לישראל לעולם הבא, דאין להם אלא מה שעיניהם רואות, ומאין להם לדעת מה שגנוז לבני ישראל לעת\"ל, שהוא אחד מעיקרי האמונה ורק בני ישראל העובדים את השי\"ת ודבוקים בתורתו הקדושה מקושרים באמונה זו וברורה ופשוטה היא בעיניהם. ובעוה\"ר נמצאים גם אנשים מישראל החלושין בענין האמונה בגודל הנסיונות בדור האחרון הזה דור עיקבא דמשיחא, ואם בישראל כך כש\"כ באוה\"ע שחסרה מהם אמונה אמיתית. אמנם כאשר השי\"ת משפיע טוב לישראל ומרוממם ומנשאם עכ\"פ בערכם של האומות, בזה נודע ה' אף לעיני האומות, כי עיניהם לנוכח יביטו כי יש מנהיג לבירה אשר רגלי חסידיו ישמור, ודורשי ה' לא יחסרו כל טוב. והטוב הזה הניתן לבני ישראל בעוה\"ז יעיד על רב טוב הצפון להם לעוה\"ב, בדברי האבן יחיא הנ\"ל."},{"passage_id":"vayikru2_71908b61_p18","passage_content":"ובזה מובן היטב מה שהתאנח דוד המע\"ה על ב' מאות חלל שחסרו לו לתשלום האלף, דלא היה מתאנח על שלא קבל שברו משלם בעוה\"ז במדה טובה מרובה, דאילו בן לא על חסרון ב' מאות בלבד היה מתאנח, אלא שהיה לו להתאנח עד ת\"ק אלף הראוי לו לפי חשבון מדה טובה מרובה ממדת פורענות חמש מאות פעמים, אלא ודאי שהוא ידע שפיר דשכר מצוה בהאי עלמא ליכא, וכל שברו שמור לעוה\"ב אשר עין לא ראתה. אלא שהיה מתאנח על חסרון ב' מאות מחמת שהיה מיצר ודואג על כבוד שמים המחולל בעולם, כי יאמרו הגויים איכה ירדוף אחד מהם אחרי אלף מישראל, ואילו דוד מלך ישראל אשר נמשח בפך שמן הקדש ונבחר לה' שיתגלה כבוד מלכותו בעולם על ידו בעת הגאולה, ואעפ\"כ אין בכוחו למחוץ כ\"א ח' מאות חלל בבת אחת. ונמצא כי אין גבורתו של מלך ישראל מגעת עכ\"פ לגבורת הגויים. ועל בך יגע באנחתו על חילול ה' הנצמח מכך, עד שיצתה בת קול ואמרה רק בדבר אוריה החתי."},{"passage_id":"vayikru2_71908b61_p19","passage_content":"ואל תתמה דלפי דברינו מה טיבה של הבטחת ורדפו מכם חמשה מאה בזמן שהיו ישראל עושין רצונו של מקום, הלא אינה מגעת אפילו למעלת האומות שנאמר בהם איכה ירדוף אחד אלף, וא\"כ לכאורה לא מעליותא היא לישראל אדרבה גריעותא היא. ואפ\"ל דכיון שיעוד זה ורדפו מכם חמשה מאה מיירי בזמן שישראל עושין רצש\"מ ואין בהם חטאים, א\"כ לעולם לא יבא לידי כך שירדוף אחד מן האומות אלף מישראל, וכיון שלא יתקיים קרא דאיכה ירדוף אחד אלף אין בכך העדר כבוד שמים אם ירדפו חמשה מישראל מאה מן האומות ותו לא. שהרי אף במספר זה תוודע מעלת ישראל וגדולתן על האומות, שלא ישיגו לרדוף כלל אחרי ישראל. אבל אחרי שחטא ישראל ובעוונות הדור נתחזק כח הגויים והשיגו לרדוף אחד מהם אחרי אלף מישראל. אזי בזמן שהקב\"ה מושיע לישראל ומאמץ כחם לרדוף אחרי העכו\"ם, בדין הוא שיגביר ה' כחם של ישראל שיגיעו עכ\"פ לגבורת הגויים ברדפם אחריהם, וישיגו לרדוף אלף מהם. ולפיכך היה דוד מתאנח על ב' מאות חלל, דמאחר שכבר חטאו ישראל בעגל ובעוונות הדור כבר נתקיים מלפנים איכה ירדוף אחד אלף, על כן כאשר זכה הוא לרדוף את האומות היה ראוי שירדוף לכל הפחות אלף מהם בבת אחת, כאשר עשו האומות לישראל בזמן מעלתם, כדי שלא יתחלל שם שמים, והשיבתו בת קול רק בדבר אוריה החתי."},{"passage_id":"vayikru2_71908b61_p20","passage_content":"ועל פי כל האמור נבא אל הביאור בכוונת המד\"ר המוצג בפתח דברינו אם בחקתי תלכו וגו' הה\"ד חשבתי דרכי ואשיבה רגלי אל עדותיך אמר דוד בכל יום הייתי מחשב למקום פלוני וכו' אני הולך והיו רגלי מוליכות אותי לבתי כנסיות ולבתי מדרשות. כי הנה דוד המע\"ה היה מתאווה ומשתוקק בכל לבו ונפשו להרבות כבוד שמים בעולם, וכמבואר שעל כן היה מתאנח על ב' מאות חלל, משום שיש בכך העדר כבוד שמים אם אין ישראל שוין אל האומות בתוקף גבורתן. ולזאת חשב מחשבות ללכת ולהביט ביקר תפארת האומות ולהתבונן בבתיהם ובטירותם ובארמנותם, וכל כוונתו בזה היתה לעורר רחמים על בני ישראל שישפיע להם הקב\"ה שפע טובה דוגמת האומות, דאם למכעיסיו כך לעושי רצונו עאכו\"כ. ובכך יתפאר ויתרומם ויתנשא כבוד שמים בעולם, כאשר יראו מעלת ישראל וזיו כבודם. אמנם אח\"כ התנחם דוד המע\"ה על מחשבתו ראשונה, והיו רגליו מוליכות אותו לביהמ\"ד, כי ראה והשיג בעיני חכמתו שלא ישיגו ישראל אל הטוב ההוא אלא אחר ביאת המשיח, ועד אותה שעה עליהם להתנחם ולהתעודד בסיפור כל הטובות והנחמות המיועדות להם לעתיד. וכדאיתא בזוה\"ק פרשת תשא (קפ\"ח ע\"ב) וזלה\"ק, וישראל סבלין עליהון כמה בישין בגלותהון, ואלמלא כל אינון טבאן דקא מחכאן וחמאן כתיבי באורייתא לא הוו יכלין למיקם ולמיסבל גלותא וכו', והא איתמר דעאלין לבתי כנסיות ולבתי מדרשות ותמאן כל אינון נחמות וחדאן בלבייהו למסבל כל מה דייתי עלייהו ואלמלי דא לא יכלין למסבל, עכלה\"ק."},{"passage_id":"vayikru2_71908b61_p21","passage_content":"ועל כן אחרי שהתבונן דוד כי לא ישיגו ישראל כבוד וגדולה הראוי להם לעוה\"ז, והיתה נפשו מרה עלי כבוד שמים אשר גלה, בראותו כל עיר על תילה בנויה בארמנות פאר ובמשכיות חמדה, ועיר האלקים מושפלת ולא זכתה להגיע אל מעלת האומות, לא מצא במה להתנחם ולהתחזק ממרירותו אלא במה שהיו רגליו מוליכות אותו לבתי כנסיות ולבתי מדרשות, כי מן השמים הדריכוהו ללכת לבתי כנסיות ולבתי מדרשות, שם היה צופה ומביט כל הנחמות והיעודים המובטחות לישראל לעת\"ל, וזאת היתה נחמתו, עדי יעלה ברצון השי\"ת לגאול את ישראל. ואז יתן ה' את עמו ישראל לשם ולתהלה ולתפארת על כל גויי הארץ, ויתגדל כבוד שמים בעולם באמור עליהם עם ה' אלה."},{"passage_id":"vayikru2_71908b61_p22","passage_content":"אך עד אותה שעה גדולים מאד הנסיונות העומדים על ישראל כאמרם ז\"ל (גיטין נ\"ו ע\"ב) מי כמוכה באלים (שמות ע\"ו) מי כמוכה באלמים ה' מי כמוך באלמים שאתה שומע ניאוצו וגידופו של אותו אדם ושותק. ובאמת הן הן גבורותיו והן הן נוראותיו שסובל כל אלה ושותק (יומא ס\"ע ע\"ב). וכמ\"ש אא\"ז הגה\"ק מוה\"ר אליעזר ניסן זלה\"ה (הובא בייטב לב פרשת ראה) ע\"ד מליצה ישרה מאה\"כ (ירמי' ב') ההימיר גוי אלהים וגו' ועמי המיר כבודי בלא יועיל, כי בימים מקדם שנות עולמים היה שבחו של הקב\"ה במה שסיפרו את הגדולות ואת הנוראות אשר עשה לעם סגולתו להושיעם מיד שונא. אך אח\"כ כאשר ראתה גויים באו מקדשה, והם מקרקרים בהיכלו ושותק, והיתה השאלה איה גבורותיו איה נוראותיו, וענו ואמרו הן הן גבורותיו הן הן נוראותיו שרואה כל אלה וסובל ושותק, משום שהוא היודע שכל זה תכליתו לטובת ישראל. וזהו ועמי המיר כבודי בלא יועיל, שהחליפו סיפור שבחו של מקום שמלפנים היו מספרים פועל אשר פעל את אבותינו בימי קדם, ועתה בשעה שהוא סובל ומעלים עין מצוררים אעפ\"כ לא יחשו ולא ישקוטו מלספר בשבח הקב\"ה, ואינם קורים תגר לנגדו, אלא ועמי המיר כבודי בלא יועיל, שאף בשעה שאינו מועיל להם כלום הם נותנים כבוד וגדולה, באמרם שזהו רצונו וכבודו לסבול חרופיהם וגידופיהם, ואעפ\"כ הוא כובש גבורתו ואינו מועיל ומושיע את ישראל."},{"passage_id":"vayikru2_71908b61_p23","passage_content":"וביותר בדור הזה שבני ישראל נתונים בגלות בין הערב רב שמוצאם משרש האומות, הן הן גדולת גבורותיו ועזוז נוראותיו שסובל כל זאת ומחריש, כי ראתה חכמתו יתברך שכל הנסיונות והסתרת הפנים הם לטובתן של ישראל. ואמונתם של ישראל בבוכה\"ע חזקה כיתד שלא תמוט, והם יודעים ומשיגים שגודל ההסתרה היא רק למראית עין, ובאמת הנה זה עומד אחר כתלינו משגיח מן החלונות מציץ מן החרכים להושיע את ישראל. וכבר הבטיחנו הבורא יתברך בתורתו הקדושה כי לא תשכח מפי זרעו, והן הן גבורותיו של הקב\"ה שבתוקף השפלות וההסתרה עדיין נמצאים מעטים מישראל הדבוקים בדרך התורה והאמונה ובוטחים בישועת ה'."},{"passage_id":"vayikru2_71908b61_p24","passage_content":"והבוכה\"ע יעזור שנתחזק באמונה השלימה ולא נזוז מכתלי ביהמ\"ד, שתשאר קדושת ביהמ\"ד דבוקה בלבנו, ואף בלכתנו בחוץ יהיה צמוד על לוח לבנו כח התורה והתפלה שעסקנו בהם בביהמ\"ד, וכח האמונה והדביקות בהשי\"ת ובתורתו הקדושה. ונזכה להיות דבוקים בהשי\"ת ובתורתו הקדושה. ונזכה להיות דבוקים באמת בדרך התורה, ונזכה לעבוד את השי\"ת באמת ובתמים ונעמוד בכל הנסיונות ולא נכשל ח\"ו. ובקרוב נזכה לראות את הישועה השלימה בשוב ה' ציון, וראו כל עמי הארץ כי שם ה' נקרא עליך, בישועת כל ישראל ושמחתן ובהתגלות כבוד שמים עלינו, במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru2_828edc78","title":"ברכת שלום בארץ וחרב לא תעבור","summary":"הדבר תורה עוסק בברכת השם לשלום בארץ, והבנת הפסוק 'וחרב לא תעבור בארצכם' לפי פירושי ר' אליעזר ור' שמעון. ישנה מחלוקת אם כלי זיין יתבטלו לעתיד או לא, והשפעת התורה כחרבם של ישראל במלחמה.","contents":[{"passage_id":"vayikru2_828edc78_p1","passage_content":"ונתתי שלום בארץ ושכבתם ואין מחריד והשבתי חיה רעה מן הארץ וחרב לא תעבור בארצכם. ופירש\"י (מתורת כהנים) א\"צ לומר שלא יבואו למלחמה אלא אפילו לעבור דרך ארצכם ממדינה למדינה. וכתבו המפרשים דדייק לה מדכתיב וחרב לא תעבור בארצכם, ולא כתיב וחרב לא תבא בארצכם, משמע דאפילו לעבור דרך ארצכם ממדינה למדינה. אכן אונקלוס תרגם על וחרב לא תעבור בארצכם, ודקטלין בחרבא לא יעידון בארעכון. ונראה שגם הוא יליף לה מדכתיב לשון העברה, ומצינו כיו\"ב דהעברה פירושו הסרה דכתיב (בראשית י\"ח) אל נא תעבור מעל עבדך. וה\"נ לא תעבור בארצכם פירושו לא תסור מלהיות בארצכם. אבל קשה דלכאורה אין זו ברכה, אדרבה הוא היפוך הברכה שיהיו שולפי חרב בארץ בכל עת, ולא יסורו ממנה."},{"passage_id":"vayikru2_828edc78_p2","passage_content":"ונראה עפ\"י מה דתנן במסכת שבת (דף ס\"ג ע\"א) לא יצא האיש בסייף וכו' ואם יצא חייב חטאת ר\"א אומר תכשיטין הן לו וחכמים אומרים אינן אלא לגנאי שנאמר (ישעיה ב') וכתתו חרבותם לאתים וחניתותיהם למזמרות ולא ישא גוי אל גוי חרב ולא ילמדו עוד מלחמה. ובגמרא שם תניא אמרו לו לר\"א וכי מאחר דתכשיטין הן לו מפני מה הן בטלין לימות המשיח וכו', אמר להן אף לימות המשיח אינן בטלין. א\"ל אביי לר' דימי מ\"ט דר\"א דאמר תכשיטין הן לו דכתיב (תהלים ס\"ג) חגור חרבך על ירך גבור הודך והדרך, א\"ל ר\"כ למר בריה דרבינא האי בדברי תורה כתיב (פירש\"י האי בד\"ת כתיב, הוה זהיר לחזור על משנתך שתהא מזומנת לך בשעת הדין להביא ראיה כחרב על ירך גבור וכו') א\"ל אין מקרא יוצא מידי פשוטו. א\"ר כהנא כד הוינא בר תמני סרי שנין והוה גמירנא ליה לכולה הש\"ס ולא הוה ידענא דאין מקרא יוצא מידי פשוטו עד השתא, עכ\"ד הגמרא. ולכאורה יש להבין דהלא חכמים פליגי עליה דר' אליעזר, וסברי דהיוצא בכלי זיין בשבת חייב חטאת משום דלאו תכשיט הוא לו, והלכתא כחכמים לגבי ר\"א, אך ר\"א מייתי ראיה לשיטתיה מקרא דכתיב חגור חרבך על ירך וגו', הרי דתכשיט הוא לו, ור' כהנא טרח ליישב קרא גם לדעת חכמים דהאי בדברי תורה הוא דכתיב, וע\"ז קא מדחה ליה מר בריה דרבינא דאין מקרא יוצא מפשוטו, ופשוטיה דקרא מיירי בכל זיין ממש, וא\"כ יש לשאול מדוע לא קא מקשה גמרא על דברי חכמים מקרא דחגור חרבך וגו', דאין לומר דרבנן לא ס\"ל הך כללא דאין מקרא יוצא מידי פשוטו, שהרי כלל זה נמי הלכתא הוא, ולא נראה שיהיה שום חולק על כלל זה דאין מקרא יוצא מידי פשוטו, וא\"כ הוה ליה לתלמודא ליישב שיעת חכמים דלא תקשה עלייהו מפשוטו של מקרא. ובר מן דין גוף הפלוגתא בין ר\"א וחכמים אם כלי זיין עתידין להבטל לעת\"ל או לאו צריך ביאור במאי פליגי, ובאיזה טעם או סברא תליא פלוגתייהו."},{"passage_id":"vayikru2_828edc78_p3","passage_content":"ואפ\"ל דהנה כעין פלוגתא דר\"א וחכמים מצינו גם בתורת כהנים פרשה זו על הכתוב והשבתי חיה רעה מן הארץ, דפליגי ר' יהודה ור' שמעון ר\"י אמר מעבירן מן העולם ר\"ש אומר משביתן שלא תזיק אר\"ש אימתי הוא שבח של הקב\"ה כשאין מזיקין או כשיש מזיקין ואין מזיקין הוי אומר כשיש מזיקין ואין מזיקין וכה\"א מזמור שיר ליום השבת למשבית מזיקין מן העולם שלא יזיקו, ע\"כ. והרמב\"ן ז\"ל בפרשתן הביא פלוגתא זו והסכים לדעת ר\"ש, שלא ישבית הקב\"ה לגמרי את החיות מן העולם, אלא שתהיה ארץ ישראל בעת קיום המצוה כאשר היה העולם מתחלתו קודם חטאו של אדם, אין חיה ורמש ממית אדם וכו'. ועל כן אמר הכתוב על ימי הגואל היוצא מגזע ישי שישוב השלום כעולם, ויחדל הטרף ורעת הבהמה וכל הרמש כאשר היה טבעם מתחלה וכו', ע\"כ. עכ\"פ בתורת כהנים מבואר להדיא דדעת ר\"ש כי יותר גדול שבחו של הקב\"ה בזמן שיש מזיקין בעולם ואינם מזיקים, וע\"ד זה אפ\"ל גם שיטתו של ר\"א דס\"ל שלא יתבטלו כלי זיין לעת\"ל, אדרבה בזה יהיה גדול שבחו של מקום אם יהיו כלי משחית בעולם ואעפ\"כ לא ירעו ולא ישחיתו, וכיון שע\"י כלי הזיין מתגדל שבחו של הקב\"ה שפיר הוו תכשיט."},{"passage_id":"vayikru2_828edc78_p4","passage_content":"ועפ\"י זה נבא לביאור התרגום אונקלוס ודקטלין בחרבא לא יעידון בארעכון, דהנה הרמב\"ן ז\"ל כתב להלן בפרשה עה\"פ והתהלכתי בתוככם וז\"ל, ודע כי לא השיגו ישראל מעולם לברכות האלו בשלימותן לא הרבים ולא היחידין מה שלא עלתה זכותם לכך וכו' אבל יתקיים עמנו בזמן השליחות, ע\"כ. וא\"כ לעתיד לבא בזמן השלימות כאשר יתקיים ונתתי שלום בארץ, יהיה שבחו של הקב\"ה ע\"י החרב, כדברי ר\"ש ששבחו של הקב\"ה הוא בזמן שיש מזיקין ואינם מזיקים. והנה ידוע מדבריהם ז\"ל כי אונקלוס הוא תלמידם של ר\"א ור\"י, וכדאיתא בפ\"ק דמגילה (דף ג' ע\"א) תרגום של תורה אונקלוס הגר אמרו מפי ר\"א ור\"י (ועיין בבראשית רבה פ\"ע). ועפ\"י מה שנתבאר דעת ר\"א הוא דכלי זיין הרי הם תכשיטין משום שלעת\"ל יהיה שבחו של הקב\"ה על ידם שלא יזיקו, ושפיר תרגם אונקלוס על וחרב לא תעבור בארצכם שלא יסורו מאת ישראל שולפי חרב, כי איהו בשיטת ר\"א רבו אמרה, דס\"ל כר' שמעון בת\"כ שזהו מן הברכות והיעודים הטובים שיהיו שולפי חרב ואעפ\"כ לא יזיקו."},{"passage_id":"vayikru2_828edc78_p5","passage_content":"אכן הנה מקום אתי לבאר דברי התרגום אפילו לשיטת רבנן דפליגי עליה דר' אליעזר וסברי דכלי זיין בעלין לגמרי לימות המשיח, דהנה הערנו לעיל דאמאי לא פריך בגמרא על שיטת חכמים מן המקרא שהביא ר\"א ממנו ראיה לדבריו, דכתיב חגור חרבך על ירך גבור הודך והדרך, הרי שהחרב תכשיט הוא, ואף דדחי בגמרא דהאי בדברי תורה כתיב, מ\"מ הקשו ע\"ז דאין מקרא יוצא מידי פשוטו, ופשוטיה דקרא מיירי בכלי זיין. ונראה ליישב דחכמים סבירא להו דפשוטו של מקרא מיירי בדברי תורה, דמצינו כמה מקראות כיוצא בזה שאי אפשר לפרשם אף לפי פשוטם כי אם שהחרב וכלי הזיק האמורים בהם קאי על דברי תורה. וכהא דכתיב (תהלים קמ\"ט) רוממות א-ל בגרונם וחרב פיפיות בידם ופירש רש\"י ז\"ל שם דרוממות הא-ל שהם מזמרים בגרונם הוא החרב פיפיות שבידם (ועי' בגמ' ברכות ה' ע\"א). הרי דאף דבקרא כתיב חרב פיפיות, ההכרח לומר דפשוטו של מקרא קאי על דברי תורה ותפלה."},{"passage_id":"vayikru2_828edc78_p6","passage_content":"והכי איתא במד\"ר פרשת פקודי (פנ\"א ו') בשלשה שמות נקרא ההר הזה וכו' הר חורב למה שבו נתנה התורה שנקראת חרב שנאמר רוממות א-ל בגרונם וחרב פיפיות בידם. ומצינו שדרשו ז\"ל במס' מכות (י' ע\"א) א\"ר יהושע בן לוי מאי דכתיב (תהלים קכ\"ב) עומדות היו רגלינו בשעריך ירושלים מי גרם לרגלינו שיעמדו במלחמה שערי ירושלים שהיו עוסקים בתורה. הרי כי זכות התורה שישראל עוסקים בה היא חרבם של ישראל שבכוח זה ינצחו את אויביהם בשדה המלחמה. וסברי רבנן דאעפ\"י שגדול שבחו של הקב\"ה אם ישארו כלי הזיין בעולם ואעפ\"כ לא יזיקו, מ\"מ כיון שכבר הזיקו כלי משחית אלו בעולם בדין הוא שיבטלו, וע\"ד הכתוב (דברים כ\"ז) לא תניף עליהם ברזל משום שאינו בדין שיונף המקצר על המאריך כאמרם ז\"ל. וה\"נ כיון שכלי הזיין גרמו הפסד גדול לעולם הכרח הוא שיבטלו. ועל כרחך לפרש פשוטו של מקרא חגור חרבך על ירך וגו' דקאי אדברי תורה, וכמבואר דזהו פירושו הפשוט של הפסוק דהתורה חרבם של ישראל שעל ידה המה מנצחים את אויביהם. ועל פי זה מובן מה שאמר יצחק אע\"ה לעשיו על חרבך תחיה, נקט \"חרבך\" ולא אמר על החרב תחיה, להודיע שכוונתו לכלי זיין שהם חרבו של עשיו, מה שאין כן לבני ישראל ישנה חרב מסוג אחר היא התוה\"ק, וכמו שפירש\"י ז\"ל בפרשת דברים עה\"פ בואו ורשו את הארץ, אין מערער בדבר ואינכם צריכים למלחמה אילו לא שלחו מרגלים לא היו צריכים כלי זיין. כי לולא החטא היו בני ישראל מתגברים על אויביהם בלי כלי זיין שהתה\"ק הוא כלי זינם ובה הם נוצחים."},{"passage_id":"vayikru2_828edc78_p7","passage_content":"ועפ\"י האמור יתבארו דברי התרגום אונקלוס ודקטלין בחרבא לא יעידון בארעכון גם לדעת חכמים דסברי שכלי זיין עתידין להבטל מן העולם לימות המשיח, שהרי לדידהו חרב קאי על התוה\"ק, והכי נמי מה שאמה\"כ וחרב לא תעבור בארצכם קאי על התורה הקדושה. וזהו שתרגם אונקלוס ודקטלין בחרבא לא יעידון בארעכון, כי לעתיד לבא יהיה כח התורה בשלימות, ולא ירהו ולא יפחדו ישראל מכל אומה ולשון, כי רוממות א-ל בגרונם וחרב פיפיות בידם לעשות נקמה בגויים תוכחות בלאומים. ולא זו בלבד אלא אפילו בזמן שאין ישראל ראויים כ\"כ והיו צריכים לכלי זיין ללחום עם שונאיהם, מ\"מ כדי שיוכלו לנצח במערכות המלחמה היה עליהם להיות דבוקים ומקושרים בתה\"ק, דלולא כן כבר העיד בהם הפסוק (דבריה פכ\"ג) ולא יראה וגו' ושב מאחריך."},{"passage_id":"vayikru2_828edc78_p8","passage_content":"והשתא עלו כהוגן דברי הת\"א בין לשיטת ר\"א ובין לדברי חכמים, דהבטחה זו קאי על אחרי ביאת המשיח, לדעת ר\"א כדאית ליה שכלי זיין לא יבטלו מן העולם יתפרשו דברי התרגום אכלי זיין ממש, והיא תהלתו ותפארתו יתברך שיהיו שולפי חרב בארץ, ואעפ\"כ אין פרץ ואין יוצאת ואין צוחה, כי אם שלום אמת יהיה בכל העולם. ולדעת חכמים דס\"ל שיבטלו כלי זיין מן הארץ לעתיד, יתבארו דברי התרגום על דברי תורה, שהיא חרבם של ישראל ובה נבוס צרינו."}]},{"dvar_torah_id":"vayikru2_db5ab442","title":"","summary":"","contents":[{"passage_id":"vayikru2_db5ab442_p1","passage_content":"ל\"ג בעומר ה'תשי\"ב בסיום משניות בביהמ\"ד \"חרדים\" באיסט סייד ניו יארק יצ\"ו"}]},{"dvar_torah_id":"vayikru2_6fad0f95","title":"השלום ככלי מחזיק ברכה לישראל","summary":"אומר ר' שמעון בן חלפתא כי לא מצא הקב'ה כלי מחזיק ברכה לישראל אלא השלום. השלום הוא יסוד לקיום הברכות, ובביאת המשיח יתחזק שלום בין ישראל לאומות, וישובו כולם לעבוד את ה'.","contents":[{"passage_id":"vayikru2_6fad0f95_p1","passage_content":"א\"ר שמעון בן חלפתא לא מצא הקב\"ה כלי מחזיק ברכה לישראל אלא השלום שנאמר (תהלים כ\"ט) ה' עוז לעמו יתן ה' יברך את עמו בשלום. מאימתי קורין את שמע בערבין משעה שהכהנים נכנסים לאכול בתרומתן וכו',  לקשר סיום הש\"ס לתחלתו."},{"passage_id":"vayikru2_6fad0f95_p2","passage_content":"ב) יל\"ד מנא יליף כי השלום הוא כלי מחזיק ברכה, דלמא מה שהקב\"ה בירך את ישראל בשלום היא ברכה כשאר ברכות, והיכי משמע ממקרא זה כי השלום מחזיק ומשמר את הברכות."},{"passage_id":"vayikru2_6fad0f95_p3","passage_content":"ג) בתוספות יו\"ט מסיים כאן במאחז\"ל וז\"ל, גדול השלום שכשמלך המשיח יבא אינו פותח אלא בשלום שנאמר (ישעיה נ\"ב) מה נאוו על ההרים רגלי מבשר משמיע שלום, וצ\"ב. ולהלן בהמשך הדברים יבואר מאמר זה."},{"passage_id":"vayikru2_6fad0f95_p4","passage_content":"ד) בפרשת השבוע אחר שפירש הכתוב את היעודים הטובים המובטחים לישראל אם ישמרו תורת ה', כתיב וישבתם לבטח בארצכם, והדר כתיב ונתתי שלום בארץ ושכבתם ואין מחריד והשבתי חיה רעה מן הארץ וגו'. וכ' האוה\"ח הק' צריך לדעת למה הוצרך להבטחת ונתתי שלום בארץ אחר שכבר אמר וישבתם לבטח בארצכם, ותירץ אולי שיכוון על עם בני ישראל עצמם שלא יהיה להם פירוד הלבבות, שיטע השם ביניהם שלום וריעות. או אפשר שיכוון על כללות העולם, שיהיה שלום בכל העולם. ותמצא שחפץ ה' בדבר וכו', גם כפי הטבע כשיש מלחמות בעולם יחרדו גם היושבים בטח, עכ\"ד האה\"ח הקדוש. וכתירוץ הראשון שכתב האה\"ח הקדוש מבואר גם בדברי הרמב\"ן ז\"ל, שכתב ונתתי שלום בארץ שיהיה שלום ביניכם ולא תלחמו איש באחיו. ועוד כתב הרמב\"ן ז\"ל כי השלום הוא שישבית חיה רעה מן הארץ, וחרב לא תעבור בארצכם וכו'. ועל פירושו השני של הרמב\"ן יש להקשות, חדא שהרי בזמן שיש חיה רעה בארץ אין יושבי הארץ מובטחים בארצם מפני חיות הערף, וא\"כ מאחר שכבר אמר הכתוב וישבתם לבטח בארצכם, הרי נכלל ביעוד זה גם הבטחה שלא ישחיתו בהם חיות השדה, ומה איצטריך לכפול הבטחה זו במאמר ונתתי שלום בארץ. וביותר קשה שהרי מבואר להלן בקרא והשבתי חיה רעה מן הארץ וחרב לא תעבור בארצכם, ומה צורך לכפול הבטחה זו במאמר ונתתי שלום בארץ."},{"passage_id":"vayikru2_6fad0f95_p5","passage_content":"ונראה לבאר הענין דהנה בתורת כהנים איתא והשבתי חיה רעה רבי יהודה אומר מעבירם מן העולם, רבי שמעון אומר משביתם שלא תזיק, אמר רבי שמעון אימתי שבחו של הקב\"ה כשאין מזיקין או כשיש מזיקין ואין מזיקים, הוי אומר כשיש מזיקין ואין מזיקים. וכן הוא אומר (תהלים צ\"ב) מזמור שיר ליום השבת למשבית מזיקין מן העולם שלא יזיקו וכו', ע\"כ. ופירש בקרבן אהרן דר\"ש ס\"ל לפרש והשבתי חיה רעה היינו שאשבית כח הרע שבחיות, ולא שיעברו לגמרי מן העולם. אך צ\"ב מה דמייתי ר\"ש ראיה לשיטתי' מדכתיב מזמור שיר ליום השבת, ודריש ליה למשבית מזיקין מן העולם, וקשה שמוציא הפסוק ממשמעותו לגמרי, דפשטות הקרא מיירי ביום השבת והוא דורשו על השבתת המזיקין מן העולם. ואף דאמרו ז\"ל (תמיד ל\"ג ע\"ב ר\"ה ל\"א ע\"א) כי כל המזמורים שהיו הלוים אומרים בששת ימים הם על מה שהיה כבר, חוץ ממזמור שיר ליום השבת שהוא מכוון על לעתיד. אך מ\"מ לא מיחוור להוציא הכתוב ממשמעותו, דקאי על השבת, ולדרשו על השבתת מזיקין."},{"passage_id":"vayikru2_6fad0f95_p6","passage_content":"אמנם נראה דהנה הרמב\"ן הקדוש בפרשה זו הסכים כי דעת ר\"ש היא הנכונה, שלא ישבית הקב\"ה לגמרי את החיות מן העולם, אלא שתהיה ארץ ישראל בזמן קיום המצות כאשר היה העולם מתחלתו קודם חטאו של אדם, אין חיה ורמש ממית האדם וכו', כי לא היה הטרף בחיות הרעות רק מפני חטאו של אדם, כי נגזר עליו להיות טרף לשיניהם, והושם הטרף טבע להם וכו'. ובהיות ארץ ישראל על השלמות, תשבות רעת מנהגם, ויעמדו על הטבע הראשון אשר הושם בהם בעת יצירתם וכו'. ועל כן אמר הכתוב על ימי הגואל היוצא מגזע ישי שישוב השלום בעולם, ויחדל הטרף ורעת הבהמה וכל הרמש, כאשר היה טבעם מתחלה וכו', עכ\"ד ז\"ל. ובדברי הרמב\"ן הללו ביארו המפרשים ז\"ל מאמר חז\"ל (הובא ברמב\"ן פרשת שמיני) למה נקרא שמו חזיר שעתיד הקב\"ה להחזירו להיתרו. והקשה ביפ\"ת שהרי זאת התורה לא תהא מוחלפת ולא תהא תורה אחרת מאת הבוי\"ת, וכיצד יהיה היתר לאיסור אכילת חזיר. אמנם הנה סימני הטומאה בבעלי חיים מורים על כוחות הרע הדבוקים בהם מחמת טבעם הרע, אבל לעת\"ל כשיתבטל מהם רוע טבעם, ויעמדו על הטבע הראשון שהושם בהם בשעת יצירתם, אזי ישתנו סימנים ייוולדו להם סימני טהרה. וא\"כ אין כאן שינוי בדיני התורה, אלא השינוי הוא בבהמות עצמן שישתנו לטהרה, שהרי לא אסרה תורה את החזיר אלא בעבור שיש בו סימן טומאה והוא גרה לא יגר, ובהשתנות המציאות ויוולד בו סימן טהרה לא זהו מין החזיר שאסרה תורה (ועי' בדברינו פרשת שמיני עמוד ר\"ס)."},{"passage_id":"vayikru2_6fad0f95_p7","passage_content":"והנה בגמרא זבחים (מ\"ה ע\"א) פריך רבא על ר\"נ דקבע הלכה בעניני קדשים, הלכתא למשיחא, (ופירש\"י ז\"ל, הרי קבע לנו הלכה הצריכה לנו לימות המשיח כשיבנה ביהמ\"ק, ועכשיו לא הוצרכנו לה) וקא\"ל אביי לרבא אלא מעתה כל שחיטת קדשים לא לתני הלכתא למשיחא הוא, אלא דרוש וקבל שכר ה\"נ דרוש וקבל שכר. אמר ליה רבא הלכה קאמינא (כלומר שרבא מתמה על שקבע הלכה בעניני קדשים, אבל ללמוד מתני' וברייתות החולקות בדיני קדשים צריכים אף בזה\"ז, לפי שתורה היא ודרוש וקבל שכר, אבל קיבוע הלכה אינו אלא להורות הלכה למעשה ועכשיו אינו נוהג). וכתב בשו\"ת מהרי\"ק שרש קס\"ה לבאר הטעם דלא קבעינן הלכתא למשיחא, משום שכל הכללים המסורים בידינו לפסוק הלכה על פיהם אינם אלא בדינים הנוהגים בזה\"ז, ולא בדינים שינהגו לעתיד, כי אז ישתנו הכללים. וביד מלאכי הביא כמה ראשונים הסוברים כדעת מהרי\"ק. אמנם הרחיד\"א בספריו שער יוסף וביעיר אוזן (מערכת ה' אות י\"ג) כתב דמדהרמב\"ם והסמ\"ג כתבו כל ההלכות שבסדר קדשים וטהרות שאינם נוהגים בזה\"ז, עפ\"י כללי הש\"ס שבידינו, ע\"כ דלא סבירא להו כדברי מהרי\"ק. ולי נראה לומר כי מהרי\"ף והרא\"ש והטור איכא ראיה להיפך, דמדלא פסקו הלכות בדיני קדשים וטהרות משמע שתפסו סברת המהרי\"ק, שישתנו כללי ההלכה לעתיד לבא."},{"passage_id":"vayikru2_6fad0f95_p8","passage_content":"והנה כלל זה מסור בידינו בכל מקום, דהיכא דפליגי ר' יהודה ור' שמעון הלכה כר' יהודה (עירובין מ\"ו ע\"ב ביצה כ\"ז ע\"ב). ונראה לומר הטעם לזה דהנה סתם ר' שמעון הוא ר\"ש בן יוחאי, וידוע כי רשב\"י זכה בגודל מדרגתו לעשות מעשים רבים לעולם התיקון כנודע. ולפיכך גם ההלכות שפסק הם שייכים לעולם התיקון, משא\"כ בזה\"ז הל' כר' יהודה. וע\"ד זה פירשנו גם מה שאמרו ז\"ל (עירובין י\"ג ע\"ב) א\"ר אחא בר חנינא גלוי וידוע לפני מי שאמר והיה העולם שאין בדורו של ר' מאיר כמותו ומפני מה לא קבעו הלכה כמותו שלא יכלו חביריו לעמוד על סוף דעתו וכו' (פירש\"י לא יכלו להבין באיזה דבריו נכונים ובאיזה אין דבריו נכונים, שהיה נותן טעם מיושב והגון על אין הלכה כהלכה). ולכאורה צ\"ב כי אדרבה היא הנותנת, בעבור שהיה חריף כ\"כ היה ראוי לקבוע הלכה כוותיה, לגודל חכמתו ורוחב דעתו, דמסתמא הורה כהלכה וכהוגן. אמנם אפ\"ל הכוונה כי לגודל מדרגתו של ר\"מ היו פסקיו לפי הבחינה שתהיה בעת התיקון השלם. וזה המכוון באמרם שלא יכלו חביריו לעמוד על \"סוף\" דעתו, היינו לקץ אחרית הימים, שעל אותו הזמן היו הדברים מכוונים. ולפיכך בזה\"ז לא נקבעה הלכה כמותו."},{"passage_id":"vayikru2_6fad0f95_p9","passage_content":"ועפ\"י הנחה סוברת זו נבא לבאר שורש מחלוקת ר\"י ור'ש בת\"כ הנ\"ל, כי דברי ר' יהודה אמורים על זמן הזה אם יהיו ישראל ראויים, על כן אמר כי והשבתי חיה רעה מן הארץ היינו שיכלו ויתבטלו מן העולם לגמרי, כי כל זמן שלא כלה ונתבער רוח הטומאה מן העולם מבלי השאיר לו שריד, עדיין לא יוכל להיות כדבר הזה שיתבטלו מן החיות הטמאות כוחות הרע הדבוקים בהם מכל וכל. ולפיכך מוטב שיעבירם הקב\"ה מן העולם, שלא יוכלו להזיק. אבל ר' שמעון קאי על זמן העתיד, שאז רוח הטומאה יעבור מן הארץ ויתבטלו מן החיות כוחות הטומאה הדבוקים בהם ויוולדו בהם סימני טהרה, ואז אין צורך בכך שיעברו מן העולם, אלא ישבית הקב\"ה מהם טבעם המזיק, ויתהפכו לטוב. ובזה מובן היטב מה שמביא ר\"ש ראיה לדבריו מדברי הכתוב מזמור שיר ליום השבת למשבית מזיקין מן העולם שלא יזיקו, דאין הוא מוציא דברי הפסוק ממשמעותם, אלא אף הוא קאמר דמזמור שיר ליום השבת הוא מזמור שיר לעת\"ל, ליום שכולו שבת ומנוחה לחיי העולמית כדאיתא בגמרא, ומשום כך הוא מפרש דוהשבתי חיה רעה מן הארץ היינו שישביתם שלא יזיקו, ולא שיבטלו מן העולם. והסמיך דרשתו על דברי הכתוב מזמור שיר ליום השבח, למשבית מזיקין מן העולם שלא יזיקו, כי הא בהא תליין, דביום שכולו שבת ומנוחה לא יהי' צורך להשבית ולבטל את המזיקים לגמרי מן העולם, אלא די בכך שיהא הקב\"ה משביתם שלא יזיקו. ולפיכך מייתי נמי ראיה ממאה\"כ (ישעי' י\"א) וגר זאב עם כבש וגו' שהוא נבואה על לעתיד לבא."},{"passage_id":"vayikru2_6fad0f95_p10","passage_content":"ובדרך זה יתיישב גם מה שהקשינו על דברי הרמב\"ן ז\"ל שפירש ונתתי שלום בארץ על השבתת חיה רעה מן הארץ, ולכאורה הרי כבר אמור וישבתם לבטח בארצכם. אמנם מה שאמר הכתוב וישבתם לבטח היינו שלא יהיו חמת רעות בארץ, ואין זו הבטחת ונתתי שלום בארץ, אדרבה בעבור שהמה משחיתים וטורפים ואין שלום עמהם לפיכך נתבטלו מן העולם, על כן אמר הכתוב כי לעתיד לבא יתקיים ונתתי שלום בארץ, פירוש שיהיה שלום ביניכם ובין החיות, ולא ירעו ולא ישחיתו אתכם. ואף שאמר הכתוב והשבתי חיה רעה מן הארץ, ולדברי רש\"י פירושו שלא יזיקו, מ\"מ צריכים אנו להבטחת ונתתי שלום בארץ, דלולא כן הו\"א לפרש והשבתי חיה רעה מן הארץ שיבוטלו לגמרי מן העולם כדברי ר\"י, על כן בא דברו ית' בהבטחת ונתתי שלום בארן שלא יכלו לגמרי, אלא שלא יוסיפו להזיק, כי יבטל מהם טבעם הרע והמזיק, ויהיה שלום ביניהם לבין בני האדם."},{"passage_id":"vayikru2_6fad0f95_p11","passage_content":"ועל פי זה נבא לביאור אמרם ז\"ל לא מצא הקב\"ה כלי מחזיק ברכה לישראל אלא השלום. בהקדם עוד הא דתנן במתני' סוף עדיות וחכ\"א אין אליהו בא לא לרחק ולא לקרב אלא לעשות שלום ביניהם וכתב הראב\"ד ז\"ל וחכ\"א וכו' לעשות שלום בעולם, כלו' לעשות שלום לישראל מן האומות ולבשרם על ביאת הגואל והיינו דכתיב (מלאכי ג') הנה אנכי שולח לכם את אליהו הנביא וגו' והשיב לב אבות על בנים ולב בנים על אבותם, כלומר לב האבות והבנים אשר נפל בם מורך מפחד, וברחו אלה פה ואלה פה מפני צרותם, ישובו אותו היום לגבורתו, וישובו אלה את אלה, ויתנחמו זה בזה אמן וכן יהא בימינו, עכ\"ד הראב\"ד ז\"ל."},{"passage_id":"vayikru2_6fad0f95_p12","passage_content":"היוצא מדבריו כי בזמן ביאת המשיח יתהפך טבעם הרע של האומות, שהוא מושרש בהם מכח הטומאה הדבוקה בהם, ולא יוסיפו לשנוא עוד את ישראל. ובזה ביארנו דברי הגמרא (זבחים קט\"ז ע\"א) שכשנתנה תורה לישראל היה קולו הולך מסוף העולם ועד סופו וכל מלכי אומות העולם אחזתן רעדה בהיכליהן וכו', נקבצו כולם אצל בלעם הרשע ואמרו לו מה קול ההמון אשר שמענו שמא מבול בא לעולם, א\"ל ה' למבול ישב וגו' כבר נשבע הקב\"ה שאינו מביא מבול לעולם וכו', ומה קול ההמון הזה ששמענו, א\"ל חמדה טובה יש לו בבית גנזיו וכו', וביקש ליתנה לבניו שנאמר ה' עוז לעמו יתן, מיד פתחו ואמרו ה' יברך את עמו בשלום. והקושיא מבוארת איך נהפך לבם של האומות לאהוב את ישראל ולברכם בברכת שלום, והלא הלכה בידוע הוא שעשו שונא ליעקב, ושנאתם עזה כמות. אמנם הנה ידוע מה שכתב הרמב\"ם ז\"ל באגרת תימן כי עיקר הסבה שהאומות שונאים את ישראל היא שנאת הדת, כי דתותיהם של ישראל שונות מכל עם, ולפיכך הם מקנאים בנו ושונאים אותנו. וזה טעם שאמרו האומות ה' יברך את עמו בשלום, ומתוך ברכותיהם אתה למד שהיה בלבם לקללם, שיעזבו ישראל את התורה וילכו בחוקות הגוים, וממילא גם שנאתם גם קנאתם של האומות תבטל. אכן באמת נבאו ולא ידעו מה נבאו, כי בעת התיקון השלם יהיה שלום ביניהם לבין ישראל, אך לא כמחשבותם הרעות אשר זממו, כי אם להיפך שיתעקר מהם רוח הטומאה, ויתהפכו אל הקדושה, ואז שלום יהיה בינם לבין ישראל, כי בהבטל סבת הקנאה גם השנאה תסור ותעלם."},{"passage_id":"vayikru2_6fad0f95_p13","passage_content":"ובזה נבוא אל הביאור, כי הנה בתוקף הגלות והשעבוד בין האומות אין ביכלת האדם לעבוד את השי\"ת בכל עת וזמן, כי הגלות והשעבוד המה בעוכרינו, ואפילו הצדיקים בני העליה יש להם עיכובים שונים המטרידים אותם מעבודת ה', ועאכ\"ו שאין ביד המון העם לעסוק תמיד בעבודת ה', מחמת עיכובים שונים המשתרגים על צוארם, אלא פעמים נדלק בהם ניצוץ קדוש ומבהיק בלבם זיק אש שלהבתי', ואח\"כ חוזרים ונופלים למעמדם הקודם. אכן כל עיכובים וטרדות אלו הם באים מכח הגלות המר בו אנו נתונים, אבל לעתיד לבא בטח נזכה להגאל גאולת עולמים, יוסרו כל המונעים המעכבים את ישראל מעבודת השי\"ת, ויהיה בידם לעבוד את השי\"ת בכל עת וזמן בלי שום מונע ומעכב. וזאת אפ\"ל בכוונת המשנה לא מצא הקב\"ה כלי מחזיק ברכה לישראל אלא השלום, שלא נמצא דבר המחזיק בתמידות את ישראל בעבודת ה' בלי שום מונע ומעכב שהוא המוריד שפע הברכה לעולם אלא השלום, הוא השלום האמיתי שיהיה לעתיד בין ישראל לאוה\"ע, וכמ\"ש הראב\"ד ז\"ל. ועלה מייתי ראיה מקרא שנאמר ה' עוז לעמו יתן ה' יברך את עמו בשלום, והוא הכתוב שאמרו האומות בעת מ\"ת, אלא שנבאו ולא ידעו מה נבאו, כי הם נתכוונו לרעת ישראל שישלימו אתם ויתדבקו בדרכיהם, ונהפוך הוא כי המה ישתנו לטוב וישלימו עם ישראל."},{"passage_id":"vayikru2_6fad0f95_p14","passage_content":"ובזה מבואר גם המדרש שהביא התוי\"ט (קושיא ג') שהמלך המשיח אינו פותח אלא בשלום, כי זה יהיה ראשית דרכו של מלך המשיח ליישר לבם של ישראל, ולקרבם לאביהם שבשמים. ולפיכך יפתח בשלום, דהיינו שיסיר את כל הסיבות הטורדות המעכבות את ישראל מלהתדבק בקונם. דהיינו שיבטלו כוחות הטומאה מן האומות ויהיה שלום בינם לישראל."},{"passage_id":"vayikru2_6fad0f95_p15","passage_content":"ובדרך זה אפ\"ל הקישור בין סוף הש\"ס לתחלתו, דיהיב תנא סימנא לתחלת זמן ק\"ש של ערבית משפה שהכהנים נכנסין לאכול בתרומתן, ובגמרא פריך ענה כהנים אימת קאכלי בתרומה משעת צאת הכוכבים לתני משעת צאת הכוכבים, ואפ\"ל דהנה הך סימנא דצאת הכוכבים לא שייך אלא בזה\"ז, משא\"כ בזמן התיקון השלם לא יוכלו לדעת זמן ק\"ש עפ\"י צאת הכוכבים. דהנה אמרו ז\"ל (חולין ס' ע\"ב) אמר הקב\"ה הביאו עלי כפרה על שמיעטתי את הירח, ואיתא במד\"ר (בראשית פ\"ו ו') אמר הקב\"ה הואיל והלבנה הזו מיעטה עצמה להיות שולטת בלילה גוזר אני עליה בשעה שהיא יוצאת יהיו כוכבים יוצאים עמה ובשעה שהיא הנכנסת יהיו כוכבים נכנסים עמה, ע\"כ. ולפי זה נמצא כי לעתיד שיהיה אור הלבנה כאור החמה לא יראו עוד כוכבים בלילה, שהרי לא יצטרכו עוד להפיס דעתה של לבנה. וגם מסתברא הוא כן דכמו שבזה\"ז אין הכוכבים נראים ביום מחמת אור השמש, כן יהיה לעתיד אשר לילה כיום יאיר לא יהיו נראים הכוכבים אף בלילה. וא\"כ אין צה\"כ סימן לזמן ק\"ש לעת\"ל. וכמו כן אין לתת סימן לזמן ק\"ש לעת\"ל בתחלת זמן שכיבה, דהנה אמרו ז\"ל (עירובין ס\"ה ע\"א) לא איברי סיהרא אלא לגירסא, כי לת\"ח העוסקים בתורה אין הלילה עשוי לשכיבה, כי אם לעסוק בתורה (ועיין רמב\"ם הלכות ת\"ת פ\"ג הי\"ג), ורק להמון עם שאינם עוסקים בתורה הלילה עשוי לשכיבה. וא\"כ לעת\"ל שיתקיים הכתוב ומלאה הארץ דעה וכולם יעסקו בתורה, לא יהיה הלילה לשינה אלא לעסוק בתורה, ולא יהיה סימן לתחלת זמן קריאת שמע בתחלת זמן שכיבה. ולזאת נתן התנא סימן לזמן ק\"ש משעה שהכהנים נכנסים לאכול בתרומתן, שהרי ודאי יהיה איזה סימן גם לעת\"ל לדעת אימת תחלת הלילה כדי שידעו לקיים כל ההלכות התלויות בזמן תחלת הלילה, ויהיה זמן תחלת אכילת תרומה לעתיד באותו העת שיהיה סימן הלילה. ולפיכך נקט תנא הך סימנא שהכהנים נכנסים לאכול בתרומתן, שהוא סימן השוה בזה\"ז וגם לעת\"ל, משא\"כ סימן דצה\"כ אינו סימן מובהק אלא בזמן הזה."},{"passage_id":"vayikru2_6fad0f95_p16","passage_content":"ובזה מבואר הקישור בין סוף הש\"ס לתחילתו, כי לפי שסיום הש\"ס מיירי מן זמן העתיד כאשר נתבאר לעיל, דכוונת אמרם לא מצא הקב\"ה כלי מחזיק ברכה לישראל אלא השלום קאי על השלום שיהיה לעת\"ל בין ישראל לאומות העולם, מהאי טעמא פתח מתניתין דברכות מאימתי קורין את שמע בערבין משעה שהכהנים נכנסין לאכול בתרומתן, ולא תני משעת צאת הכוכבים, כי לעת\"ל לא יהיה שייך לשמר בזמן צאת הכוכבים כמבואר, על כן נקע זמן אכילת תרומה. ונזכה שיהיה במהרה השלום האמיתי, ולאורו של רשב\"י נסע ונלך, וכמבואר שהוא פסק הלכותיו לימות המשיח. ונזכה במהרה להתרוממות קרן התורה וישראל ולהתגלות כבוד שמים עלינו בב\"א."}]},{"dvar_torah_id":"vayikru2_f2fb3374","title":"שלום בארץ ותוצאות השפע","summary":"רש\"י ז\"ל מפרש כי ריבוי מאכל ומשתה עלול לעורר קנאת האומות. הכתוב מבטיח כי אם ישראל עושים רצון ה', לא יתקנאו בהם האומות. דברי חז\"ל מעידים על החשש מקנאה ושנאה, במיוחד בימי בית המקדש.","contents":[{"passage_id":"vayikru2_f2fb3374_p1","passage_content":"ונתתי שלום בארץ וגו' פירש\"י ז\"ל שמא תאמרו הרי מאכל הרי משתה אם אין שלום אין כלום ת\"ל אחר כל זה ונתתי שלום בארץ וכו'. וצריך ביאור דמדברי רש\"י ז\"ל נראה דריבוי המאכל והמשתה הוא הגורם למניעת השלום, עד שהוצרך הכתוב להבטיח דאעפ\"כ ונתתי שלום בארץ, ולכאורה הוא פלאי מה תלוי זה בזה."},{"passage_id":"vayikru2_f2fb3374_p2","passage_content":"ונראה לבאר כוונת רש\"י ז\"ל עפ\"י מה שכתב הש\"ך עה\"ת לפרש הפסוק ונתתי שלום בארץ, דהנה מדרך אומות העולם הוא דכאשר הם רואים שיש לישראל הרחבה והשפעה ולא יחסרו כל טוב אזי המה באים לידי שנאה ומתגרים בהם מלחמה. ולזאת אחרי שפרט הכתוב כל הברכות והשיג לכם דיש את בצור וגו', שיהיה לישראל השפעה מרובה, א\"כ יש לחוש לקנאת האומות, ופן יבואו על ישראל למלחמה, משו\"ה הבטיחנו הכתוב ונתתי שלום בארץ, שלא יתקנאו האומות בישראל בזמן שיהיו ישראל עושים רצונו של מקום, עכת\"ד. ובאמת מצינו בדברי חז\"ל שחששו מאד שלא לעורר קנאת האומות ושנאתם, כדאיתא בגמרא (מגילה ז' ע\"א) ששלחה אסתר לחכמים קבעוני לדורות והשיבו לה קנאה את מעוררת עלינו לבין האומות וכו'."},{"passage_id":"vayikru2_f2fb3374_p3","passage_content":"וכן איתא במדרש רבה (איכה פ\"א ל\"ד) בעובדא דרבי יוחנן בן זכאי שהיה ממליץ טוב על ישראל לפני אספסיינוס שר צבא הרומים, והיה פנגר דוכס הערבים מקטרג לנגדו, א\"ל רבי יוחנן בן זכאי לפנגר לא די לך שאין אתה מלמד סניגוריא עלינו אלא שאתה מלמד עלינו קטרוג, השיב לו פנגר לטובתכם אני מתכוון, דכל זמן דהדין ביתא קיים (היינו בית המקדש) מלכוותא מתגרין בכון, אין איחרוב הדין ביתא לית מלכוותא מתגרין בכון. א\"ל ריב\"ז הלב יודע אם לעקל אם לעקלקלות (פירוש הלב יודע אם כוונתך לקשור ולתקן או לקלקל). מבואר מזה דאף ריב\"ז לא סתר דבריו דבית המקדש הוא הגורם לשנאת האומות והתגרותם בישראל, אלא שאמר לו כי מה שהוא מקטרג להחריב את ביהמ\"ק אינו משום שהוא רוצה לתקן שלא יתגרו המלכיות בישראל, כי אם מחמת שהוא רשע ושונא ישראל. אבל בזאת הודה ריב\"ז לדבריו כי כל זמן שישראל יושבים על אדמתם והם ברום המעלות, גדולה קנאת האומות ושנאתם אותם. אלא דבזמן שישראל עושים רצונו של מקום הבטיחה התורה הקדושה ונתתי שלום בארץ, שלא יתקנאו בהם האומות ולא ישנאו אותם. אמנם ריב\"ז ידע כי באותה העת גרמו עוונות ישראל להחריב ביהמ\"ק, שהרי גם בתחלת בנין הבית השני היה ידוע להם כי אין זה הבית הנצחי אשר יעמוד לעד, כי אם עתיד הוא להחרב, וגם נודע להם מראש כמה שנים עתיד הוא לעמוד כדאיתא במסכת נזיר (דף ל\"ב) ולפיכך לא סתר רבי יוחנן את דברי פנגר כי הביהמ\"ק גורם לשנאת האומות, שהרי לפי מצבם של ישראל באותה שעה היה הביהמ\"ק מעורר קנאה ושנאה בלבות אוה\"ע."},{"passage_id":"vayikru2_f2fb3374_p4","passage_content":"ובדרך זה מבוארים דברי רש\"י ז\"ל שמא תאמרו הרי מאכל הרי משתה אם אין שלום אין כלום, דמחמת שפע מאכל ומשתה וכל טוב יש לחוש לקנאת האומות ושנאתם, וכמו שמצינו גם ביעקב אע\"ה שהוכיח את בניו למה תתראו, ופירש\"י למה תראו עצמכם בפני בני ישמעאל ובני עשיו כאילו אתם שבעים. שהיה חושש יעאע\"ה מפני קנאת האומות וה\"נ יש לחוש לקנאתם על ישראל שהוא המביא לידי שנאה ולידי מלחמה, ת\"ל אחרי כל זאת ונתתי שלום בארץ. שאם יהיו ישראל עושים רצונו של מקום, הרי הם מובטחים שלא יתקנאו בהם האומות ולא יתגרו עמם מלחמה מחמת ריבוי השפע אשר לישראל."}]},{"dvar_torah_id":"vayikru2_31bb06a2","title":"ברכת שלום ועסק התורה","summary":"הכתוב מבטיח לישראל שלום בארץ, שיאפשר להם לעסוק בתורה מבלי להטרד בעסקי המו\"מ. בעתיד, מלאכתם תיעשה על ידי אחרים, ובכך יתממשו הברכות מבלי שיתבטלו מתלמוד תורה. שלום זה כולל גם את האמונה בעסקי המו\"מ.","contents":[{"passage_id":"vayikru2_31bb06a2_p1","passage_content":"באופן אחר נראה לפרש הכתוב ונתתי שלום בארץ דהנה איתא בגמרא (ברכות ל\"ה ע\"ב) א\"ל רבא לרבנן במטותא מינייכו ביומי ניסן וביומי תשרי לא תתחזו קמאי כי היכי דלא תטרדו במזונייכו כולא שתא. ופירש\"י ז\"ל יומי ניסן ימי הקציר יומי תשרי דריכת הגיתות והבדים. ולכאורה לפי זה יש לשאול מאי מעליותא איכא בהבטחת הכתוב והשיג לכם דיש את בציר וגו', ופירש\"י ז\"ל שיהא הדיש מרובה ואתם עסוקים בו עד הבציר ובבציר תתעסקו עד שעת הזרע. הלא אם תהיה עבודת השדה מרובה כ\"כ עד שיהיו טרודים במזונותיהם כל השנה תורתם מתי נעשית, והרי לא יהא להם פנאי לעסוק בתורה, ומה ברכה היא זו אם יתעכבו על ידה מלעסוק בתורה. אכן באמת אין כאן מקום תמיהה, שהרי ידוע מה שכתב הרמב\"ן ז\"ל בפרשה זו כי לא השיגו ישראל מעולם לברכות האלו בשלמותן וכו', שלא עלתה זכותן לכך וכו',  אבל עתידין הם להתקיים לעתיד לבא. וכיון שברכות אלו יתקיימו רק לעת\"ל, א\"כ שוב אין לתמוה על ברכת והשיג לכם דיש את בציר, דא\"כ תורתם מתי נעשית. שהרי כבר הובטחנו ביעודי הנביאים (ישעיה ס\"א) ועמדו זרים ורעו צאנכם וגו', וכיון שתהא מלאכתם של ישראל נעשית ע\"י אחרים יהיו המה פנויים לעסוק בתורה, ומלאכת הדיש והבציר והקציר יהיו נעשים ע\"י משרתיהם עושי רצונם."},{"passage_id":"vayikru2_31bb06a2_p2","passage_content":"אכן לכאורה אם כי מחד גיסא מעליותא היא שתהיה מלאכתן נעשית ע\"י אחרים, מ\"מ מאידך גיסא יש מקום לחוש למכשול אם יהיו עסקיהם נעשים ע\"י אחרים, וכמו שכתב ק\"ז זלה\"ה בתפלה למשה עה\"פ (פרק ק\"א) אשכילה בדרך תמים מתי תבא אלי וגו'. דמבואר בשלה\"ק כי לעסוק במו\"מ טוב יותר שיעסוק בעצמו משיעסוק ע\"י שלוחו, כי אולי לא יעסוק שלוחו באמונה עם אחרים ויגזול וירמה את אחרים, עכ\"ד השלה\"ק. וכתב ק\"ז זלה\"ה ע\"ז דדבריו הקדושים מפילים במבוכה גדולה את הרוצה להתמיד בתורת ה' ואין להם מלאכה רק מו\"מ וכו', אבל זאת עצה שיברור לשלוח אותן שהן נאמנים ודאי בעיניו, שבודאי יעשו באמונה ולא יעשו רמיה, ופי' שם בזה דברי הכתוב הנ\"ל, עיי\"ש."},{"passage_id":"vayikru2_31bb06a2_p3","passage_content":"ולפי זה איכא למיחש בזמן העתיד שאם יעסקו זרים במלאכת ישראל ובמשאם ומתנם אולי נח יהיו עסקיהם באמונה, ויהיו גוזלים ומרמים אחרים, ויהיה הקולר תלוי בצוארי ישראל המשלחים. אך י\"ל דלעת\"ל לא יהיה עוד חשש זה, משום שיהיה גדול השלום בין ישראל לאומות, וכולם ישתוקקו למלאות רצונם של ישראל ולהטות אליהם, וכמו שאמרו ז\"ל (עבודה זרה ג' ע\"ב) שכל האומות יהיו גרים גרורים לעתיד לבא. וכיון שכן שוב אין לחוש שיעלה על דעתם לעשות דבר נגד רצונם של ישראל, ויוכלו ישראלי לסמוך עליהם שיהיו מנהלים עסקי מו\"מ שלהם באמונה, והם יעסקו בתורה תמיד. ושפיר תהיה ברכת והשיג לכם דיש את בציר ברכה שלמה, ולא יבואו על ידה לביטול תורה."},{"passage_id":"vayikru2_31bb06a2_p4","passage_content":"ובדרך זו נבא אל הביאור, דהנה התורה קרויה שלום, כדאיתא בגמרא (ברכות ח' ע\"א) כתיב (תהלים נ\"ה) פדה בשלום נפשי וגו' אמר הקב\"ה כל העוסק בתורה ובגמ\"ח ומתפלל עם הצבור מעלה אני עליו כאילו פדאני לי ולבני מבין אוה\"ע, ופירש\"י ז\"ל פדה בשלום, זה שעסק בדברי שלום דהיינו תורה דכתיב וכל נתיבותיה שלום וכו'. ולפיכך אחר שהבטיח הכתוב כל ההבטחות הללו, שיהיה לישראל שפע ברכה ועשירות והשפעה מרובה בתבואת השדה והכרם, א\"כ לכאורה קמה וגם נצבה החששא שאם תהיה לישראל עבודה רבה כ\"כ, יהיו עסוקים ראשם ורובם במלאכתם במשך כל ימות השנים, ותורתם מתי תהא נעשית. ומה גם לפי מה דאיתא בתורת כהנים עה\"פ ונתתי גשמיכם בעתם ולא גשמי שאר ארצות, שיהיו פירות מרובים בארץ ישראל ורעב בכל הארצות, ויהיו באים ולוקחים מכם ומעשירים אתכם בכספים וכו',  א\"כ יהיו ישראל צריכים לעסוק גם בסיפוק התבואה והפירות לכל הארצות שיבואו לקנות אצלם, וכיון שיהיו טרודים כ\"כ ודאי שלא יוותר להם פנאי ללמוד תורה, ואם יתבטלו ע\"י ריבוי ההשפעה מתלמוד תורה אין כאן ברכה כלל, דכל השפעה שתוצאותיה הם ביטול תלמוד תורה לאו מעליותא היא, אלא אדרבה גריעותא."},{"passage_id":"vayikru2_31bb06a2_p5","passage_content":"וכלפי טענה זו נתכוון הכתוב באמרו ונתתי שלום בארץ, דתיבת שלום כלולות בו ב' משמעיות כפשוטו השלום מן האויבים, ובמדרשו דשלום היינו תורה כנ\"ל. והבטיח הכתוב לישראל שיתברכו בברכת השלום בב' הבחינות הללו גם יחד, שיהיו עוסקים בתורה הקרויה שלום, ולא יתבטלו ממנה מחמת ריבוי השפע ועסקי מו\"מ שלהם, וכמו שנתבאר שתהיה מלאכתן נעשית ע\"י אחרים, המה אוה\"ע שיהיו מנהלים עסקי משאם ומתנם, וישראל עצמם יהיו פנויים מכל מלאכה ועסוקים בתורה. וכלפי החשש שלא יהיו האומות עוסקים במשא ומתן באמונה, ויהיה הקולר תלוי בצואר ישראל, הבטיח הכתוב ונתתי שלום בארץ כמשמעו, שיהיה שלום רב בין ישראל לאומות העולם, וכולם קרבת ישראל יחפצון, וישתוקקו למלאות רצונם של ישראל בשלימות, למען ימצאו חן בעיניהם, ושוב אין לחוש שיעשו מלאכתם רמיה בעושק וגזל נגד רצון ישראל, דבודאי יעסקו במלאכתם באמונה, וישראל יהיו פנויים לעסוק בתורה ובעבדות ה'."},{"passage_id":"vayikru2_31bb06a2_p6","passage_content":"ובזה מובנים היטב גם דברי רש\"י ז\"ל שמא תאמרו הרי מאכל הרי משתה אם אין אין שלום אין כלום, פירוש דע\"י ריבוי השפע לא יהיה שלום, שלא יוכלו לעסוק בתורה הקרויה שלום, ואם תפוג תורה ח\"ו אזי אין כל ערך לברכות הללו, דמה בצע בכל אלו בלא תורה, ע\"כ אמר הכתוב אחר כל הברכות ונתתי שלום בארץ בפשוטו ובמדרשו."}]},{"dvar_torah_id":"vayikru2_5f2c8e5e","title":"שלום בארץ ותכלית השלימות","summary":"הכתוב מבטיח לישראל שלום בארץ, כדי שיתאחדו כגוף אחד ויוכלו לקיים מצוות. יעקב אבינו ביקש שלמות מן החטא, כדי להגיע לשלום אמיתי. השלום האמיתי נובע מהדבקות בתורה ובמצוות, ובכך יזכו לישועה ולשלמות נפשית.","contents":[{"passage_id":"vayikru2_5f2c8e5e_p1","passage_content":"עוד אפ\"ל בכוונת הכתוב ונתתי שלום בארץ, עפ\"י מה שכתב בספר בית שמואל אחרון לפרש הא דאיתא במסכת שבת (דף ל\"א ע\"א) באחד שבא לפני שמאי וא\"ל גיירני ע\"מ שתלמדני כל התורה כולה כשאני עומד על רגל אחת וכו', דהנה איתא שכל אחד מישראל צריך לקיים כל התרי\"ג מצוות, וצריך להתגלגל עד שיקיים כולן. והנה הגר הזה רצה להתגייר רק באופן שיקנה שלימות בפעם הזאת שהוא בעולם, ולא יצטרך שוב להתגלגל, ורגל היא לשון פעם וכו'. שמאי דחפו באמת הבנין, דזה דבר שא\"א הוא, דהרי אין יכול לקיים מצות כהנים ומצות יבום וכדומה. והנה איתא בספרים דמי שמקשר עצמו עם כל אחד מישראל כנפשו, הריהו נחשב כגוף אחד עם כל ישראל, וכל מה שמקיים א' מישראל כאילו קיום הוא. וזה אשר השיב לו הלל כל מה דעלך סני לחברך לא תעביד זו היא כל התורה כולה, שבמצוות שיעשה חבירך תצא ידי חובתך גם אתה, עכת\"ד ז\"ל."},{"passage_id":"vayikru2_5f2c8e5e_p2","passage_content":"והנה מאחר שהבטיח הכתוב לישראל את הברכות הללו, והשיג לכם דיש את בציר וגו', א\"כ יהיו ישראל טרודים במלאכתם ובעסקי מו\"מ ולא יהיה להם פנאי לעסוק בתורה, וכמה מצוות לא יהיה באפשרותם לקיימם מחמת טרדותיהם, וכיצד יקנו שלימות נפשם, לזאת הבטיח הכתוב ונתתי שלום בארץ שיהיה אהבה ואחוה שלום ואחדות בין כל ישראל, עד שיהיו כולם נחשבים כגוף אחד, וכיון שמקצתן יהיו עסוקים בתורה, יחשב גם לשאר ישראל כאילו אף הם עסקו בתורה יחד עמהם, דאף שהם עוסקים בסחורה ובמו\"מ, מ\"מ כיון דכגוף אחד חשיבי, נחשב להם כאילו עסקו גם המה בתורה."},{"passage_id":"vayikru2_5f2c8e5e_p3","passage_content":"עוד יש לרמוז במאה\"כ ונתתי שלום בארץ, בהקדם דברי הפסוק בפרשת ויצא, וידר יעקב נדר לאמר אם יהיה אלקים עמדי ושמרני בדרך הזה אשר אנכי הולך וגו' ושבתי בשלום אל בית אבי וגו'. ופירש\"י ז\"ל ושבתי בשלום וגו' שלם מן החטא שלא אלמד מדרכי לבן. והכלי יקר ז\"ל ביאר הענין וז\"ל, חלילה שהיה יעקב מסופק בהבמחת השי\"ת, כי כבר א\"ל אלקים ושמרתיך בכל אשר תלך, אלא ביאור הענין הוא שיעקב לא ביקש כלל על שמירת הגוף, שכבר הובטח בו, אלא ביקש עכשיו על שמירת הנפש מן החטא, והעד ע\"ז כי בהבטחת השי\"ת נאמר ושמרתיך בכל אשר תלך, ויעקב אמר ושמרני בדרך הזה, הול\"ל ושמרני בכל אשר אלך, גם מלת אנכי מיותרת לגמרי וכר ועוד כמה שינויים. מכל השינויים האלו נוכל ללמוד שיעקב לא ביקש כ\"א על שמירת הנפש מן החמא, כי זה דבר שתלוי בבחירתו של אדם, וצריך גם עזר אלקי וכו'. וז\"ש ושמרני בדרך הזה אשר אנכי הולך, כי בי תלוי הדבר בצירוף העזר האלקי וכו'. ושבתי בשלום שלם מן החטא שלא אלמוד מדרכי לבן, ולאו דוקא לבן, שהרי אפילו הכנעני יושב הארץ לא מוב עשה בעמיו, ויש לחוש שלא ילמוד גם מדרכי האמורי, ע\"כ אמר אל בית אבי, אז ינצל מחשש זה שלא ילמוד מדרכי הרשעים ויהיה שלם מן החטא כפירוש רש\"י, עכ\"ד הכל\"י ז\"ל."},{"passage_id":"vayikru2_5f2c8e5e_p4","passage_content":"והנה לכאורה צ\"ב להבין מה שפירש רש\"י ז\"ל במאה\"כ ושבתי בשלום וגו', שלם מן החטא. שהרי בקרא כתיב שלום בואו, ואילו רש\"י ז\"ל קא מפרש ליה מלשון שלימות, ולפי\"ז היה צריך לכתוב שלם בלא ואו. וכמו שמצינו גם בגמרא (קידושין ס\"ו ע\"ב) דיליף שעבודת בעל מום פסולה מדכתיב בר\"פ פנחס הנני נותן לו את בריתי שלום כשהוא שלם ולא כשהוא חסר, ופריך והא שלום כתיב, ומשני א\"ר נחמן ואו דשלום קטיעא היא. הרי דאילו לא היתה הואו דשלום קטיעא לא היה אפשר לדרוש תיבת שלום בואו מלשון שלימות, וא\"כ כיצד מפרש רש\"י ז\"ל הכא ושבתי בשלום מלשון שלימות."},{"passage_id":"vayikru2_5f2c8e5e_p5","passage_content":"אמנם נראה דהא בהא תליין, ויתבאר עפ\"י מה דתנן במסכת אבות (פ\"ד מי\"ד) רבי ינאי אומר אין בידינו לא משלות הרשעים ואף לא מיסורי הצדיקים. והכוונה דהנה ידוע מה שאמרו ז\"ל רשעים מלאים חרטה, כי בכל עת תמיד המה מתחרטים על מעשיהם הרעים, אלא שאין לבם מסור ברשותם שיוכלו להתגבר על יצרם ולהמנע מלחטוא, אבל אחר שעשו את העבירה לבם נוקפם עליה. חוץ מאותם הרשעים שעליהם העיד הכתוב (תהלים ע\"ג) כי אין חרצובות למותם ובריא אולם, ודרשו ז\"ל (שבת ל\"א ע\"ב) אמר הקב\"ה לא דיין לרשעים שאינן חרדים ועצבים מיום המיתה אלא שלבן בריא להן כאולם, וכו', עיי\"ש. כי אלו הרשעים אינם מתפרטים כלל וכלל על מעלליהם, אדרבה אומרים שלום עלי נפשי, ודרכם ישרה בעיניהם שהכל דומה עליהם כמישור, ונפשם שלוה, שהרי אינם עושים אף תנועה קלה להלחם עם יצרם ולהנחם על מעשיהם. ולעומת זאת הצדיקים שרויים תמיד בצער על כל נדנוד חטא ומכשול שאירע להם, ונפשם עליהם תאבל ביסורים ומכאובים עד אין שיעור וערך. והם הם דברי ר' ינאי אנו אין בידינו מיסורי הצדיקים, כגומר שעדיין לא הגענו למדריגת הצדיקים המלאים תמיד צער ויסורים על כל פגם שלהם, ועל מה שהם רואים אצל אחרים מכשול ופגם, והמה נאנחים וכואבים על שפלות הדור, ואנו איננו בבחינה זו שיכאב לנו כ\"כ. אך מ\"מ גם שלום הרשעים אין לנו, כי אין אנחנו מקולקלים ח\"ו כ\"כ כמו הרשעים הגמורים שיש להם חלב על כסלם, ונפשם שנוה עליהם באמרם שלום יהיה לנו וכל רע אלינו לא יאונה. כי אסור לו לאדם שיחזיק עצמו לרשע גמור ח\"ו, וכמו שאמרו ז\"ל בקידושין (דף מ' ע\"ב) לעולם יראה אדם עצמו כאילו חציו חייב וחציו זכאי דאל\"כ ח\"ו אפשר לבוא לידי יאוש. וזהו שאמר אין לנו משלות הרשעים, דיהודי שומר תורה ומצוות ומאמין בהקב\"ה א\"א שיהיה לו שלוה, שהרי תמיד הוא עומד במלחמת היצר, ורק אחרי שיוודע לו בבירור שלא יפגום עוד אז יוכל לשבח בשלוה, כמאמר הכתוב (משלי ל') ותשחק ליום אחרון. וכמו דאיתא בירושלמי (ע\"ז פ\"ג ה\"א) בר' אבוהו דאחזו ליה י\"ג נהרי דאפרסמונא דכיא אמר כל אלין דאבוהו ואני אמרתי לריק יגעתי. והנה עיקר השלוה היא הדביקות בתורה ובמצוות, שע\"י זה באים בסופו של דבר אל השלוה האמיתית. ולזאת אמר יעקב אבינו ע\"ה ושבתי בשלום אל בית אבי, שביקש רחמים מלפני הקב\"ה שיהיה לו קצת מנוחת שלום ושלוה והשקע ובטח, וע\"ז שפיר קא מפרש רש\"י ז\"ל איזו הדרך אשר על ידו יגיע אל השלוה, ע\"י שיהיה שלם מן החטא, שלא ילמוד מדרכי לבן, אלא יהיה דבוק בהשי\"ת ובתורתו הקדושה, אזי יזכה להשיג את השלוה האמיתית. וזה אפ\"ל גם בהבטחת הקב\"ה לישראל ונתתי שלום בארץ, שיגיעו בעזר אלקי אל השלוה האמיתית, ע\"י שיהיו דבוקים בדרך התורה והקדושה, דאך ורק דרך זה הוא המביא אל השלוה."}]},{"dvar_torah_id":"vayikru2_6c28819b","title":"כוח התשובה והתהפכות הגזירות","summary":"המדרש מלמד על כוחות דוד המלך בתשובה, ועל ההבטחה שהקללות תהפוכנה לברכות כאשר ישראל שומרים את תורת ה'. יש להבין את הקשר בין חובות ישראל לבין השפעתם על חוקי שמים וארץ, ובפרט בזמן הגלות.","contents":[{"passage_id":"vayikru2_6c28819b_p1","passage_content":"אם בחקתי תלכו ואת מצותי תשמרו ועשיתם אותם וגו'. במד\"ר ריש פ' זו איתא הה\"ד (תהלים קי\"ט) חשבתי דרכי ואשיבה רגלי אל עדותיך. אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות וכו'. ודרשה זו תמוהה עד מאד, היתכן לצייר כזאת על דוד המלך ע\"ה רוח אפינו משיח ה', שהעלה על לבו בכל יום להתהלך במקומות לא טובים, עד שנמלך ללכת לביהמ\"ד. והלא אף איש ישראל ההמוני ראשית ביכורי מחשבתו בבקר השכם ללכת לביהמ\"ד לעסוק בתורה ולשפוך שיחו לפני ה' יתברך, ועאכו\"כ קדוש וטהור כדוד מלך ישראל."},{"passage_id":"vayikru2_6c28819b_p2","passage_content":"ב) עוד שם במדרש ר' הונא בשם ר' אחא אמר חשבחי מחן שכרן של מצווח והפסידן של עבירות ואשיבה רגלי אל עדותיך. ר' מנחם חתנא דר' אלעזר בר אבינא אמר חשבתי מה שכתבת לנו בתורה אם בחקתי תלכו ומה כתיב תמן ונחתי שלום בארץ. ואם לא תשמעו לי מה כתיב תמן ויספתי ליסרה אתכם רבי אבא וכו' אמר חשבתי ברכות חשבתי קללות ברכות מאל\"ף ועד תי\"ו וקללות מן וי\"ו ועד ה\"א ולא עוד אלא שהן הפוכות א\"ר אבין אם זכיתם הריני הופך לכם קללות לברכות אימתי כשתשמרו את תורתי הה\"ד אם בחקתי תלכו. וגם דרשות אלו קשין להלמן. דהא דדריש שהיה מחשב מתן שכרן של מצוות והפסידן של עבירות וכו'. חשבתי מה שכתבת לנו בתורה אם בחקתי תלכו ומה כתיב תמן ונחתי שלום בארץ וכו' צריך ביאור, האם היתה עבודתו של דהמע\"ה לפני השי\"ת בעבור תקות השכר העתיד להשתלם לו חלף עבודתו, ומחמת יראת העונש המגיע לעוברי רצונו, אתמהה."},{"passage_id":"vayikru2_6c28819b_p3","passage_content":"ג) עוד צ\"ב להבין מה שמסיים המד\"ר א\"ר אבין אם זכיתם הריני הופך לכם קללות לברכות אימתי כשתשמרו תורתי. ולכאורה קשה דאם ישמרו ישראל תורת ה' ומצוותיו ינצורו בל יראו ובל ימצאו בעולם קללות כלל ועיקר, ומאי האי דקאמר הריני הופך לכם קללות לברכות, דמשמע מיניה שהקללות ישנם בעולם, אלא שיתהפכו הן עצמן לברכות, והלא טוב מזה ומזה אילו היו מתבטלין לגמרי מן העולם."},{"passage_id":"vayikru2_6c28819b_p4","passage_content":"ד) עוד איתא במד\"ר (סימן ג') אם בחקתי תלכו וגו' חקים שחקקתי בהם את השמים ואת הארץ וכו' חקים שחקקתי בהם את הים וכו', ומונה והולך מעשי בראשית שכולם נחקקו ע\"י חוקותיה של תורה, ומייתי מקרא דבכולהו כתיב בהו לישנא דחוקה. וצ\"ב מאי שייכא דרשה זו להכא, דאם להודיענו דחוקות שמים וארץ תלויים בתורה הקדושה, הלא כמ\"פ מצינו במקרא כשהוא מזהיר על שמירת התורה כתיב חוקים, ומדוע בחר להעמיד דרשתו בקרא דאם בחקתי תלכו דוקא."},{"passage_id":"vayikru2_6c28819b_p5","passage_content":"ה) בזוה\"ק (ר\"פ זו) איתא אם בחקתי תלכו וגו' ר\"ח פתח (מיכה פ\"ו) עמי זכר נא מה יעץ בלק מלך מואב ומה ענה אותו בלעם בן בעור וגו'. ומפרש עד כמה היה גדול כח בלעם ובלק בכשפים, ואעפ\"כ לא יכלו להרע לישראל. וצריך להבין שייכות כל הענין לפרשת בחקתי."},{"passage_id":"vayikru2_6c28819b_p6","passage_content":"ו) ונתתי שלום בארץ וגו'. האה\"ח הקדוש הקשה דאחר שכבר הבטיח הכתוב וישבתם לבטח בארצכם למה הוצרך לחזור ולומר ונתתי שלום בארץ, יעיי\"ש מ\"ש בזה."},{"passage_id":"vayikru2_6c28819b_p7","passage_content":"ז) רש\"י ז\"ל כתב (מתורת כהנים) שמא תאמרו הרי מאכל הרי משתה אם אין שלום אין כלום ת\"ל ונתתי שלום בארץ מגיד שהשלום שקול כנגד הכל וכו'. הקשו המפרשים דמדברים אלו מוכח ששפע המאכל והמשתה עלול לגרום להעדר השלום, עד שהוצרך הכתוב להבעיחנו ונתתי שלום בארץ, שלא ישבית ריבוי השפע את השלום. ולכאורה הסברא נותנת להיפוך, דבזמן שהשפע מצוי בעולם שלום שורר בעולם, כמו שדרשו ז\"ל (ב\"מ נ\"ט ע\"א) במאה\"כ השם גבולך שלום חלב חטים ישביעך כשהשבע בעולם עין כל בריה יפה בחבירתה וכו', כדאמרי אינשי כד משלם שערי מכדא נקיש ואתא תיגרא בביתא."},{"passage_id":"vayikru2_6c28819b_p8","passage_content":"ח) ורדפו מכם חמשה מאה ומאה מכם רבבה ירדופו וגו'. בגמרא (סוטה י\"א ע\"א) ולעולם מדה טובה מרובה ממדת פורענות וכו'. והקשו התוס' וא\"ת והא מצינו מדת פורענות גדולה ממדה טובה דכתיב איכה ירדוף אחד אלף ושנים יניסו רבבה גבי מדת פורענות, ואילו במדה טובה כתיב ורדפו מכם חמשה מאה. ותירצו דגבי מדת פורענות מיירי ברדיפה ולא בהריגה, אבל הכא דכתיב ורדפו מכם חמשה מאה סיפא דקרא ונפלו אויביכם לפניכם לחרב. עכ\"ד התוספות. והקשה האוה\"ח הקדוש על תירוץ התוס' מהא דאמרינן באלו מגלחין (מו\"ק ע\"ז ע\"ב) בשעה שהיה דוד יוצא למלחמה היה מעורר חניתו על ח' מאות חלל והיה מתאנח על מאתים דכתיב איכה ירדוף אחד אלף, יצתה בת קול ואמרה רק בדבר אוריה החתי, ולפי\"ד התוס' אמאי היה מתאנח הא התם לא הוה אלא רדיפה ולא הריגה (וקושיא זו מביא גם המהרש\"א בסוטה עיי\"ש). וכתב הוא ז\"ל לתרץ קושיית התוס' באופן אחר יעיי\"ש. ולפי דבריו ז\"ל מיירי קרא דאיכה ירדוף וגו' ברדיפה והריגה, ונדחה תירוצם של התוספות דמוקי להך קרא ברדיפה ולא בהריגה. וראוי לן למשכוני אנפשן ליישב תי' התוס', ולהלן נביא מה שכתב העיון יעקב בדברי התוספות, ומה שנראה לי להעיר בענין. ובעזהי\"ת יתיישבו הדברים על מכונם."},{"passage_id":"vayikru2_6c28819b_p9","passage_content":"ט) להלן בפרשת התוכחה (פכ\"ו ל\"ג) ואתכם אזרה בגויים וגו'. פירש\"י (ת\"כ) זו מדה קשה לישראל שבשעה שבני מדינה גולים למקום אחד רואים זה את זה ומתנחמים וישראל נזרו כבמזרה כאדם הזורה שעורים בנפה ואין אחת מהם דבוקה לחבירתה. ולהלן בקרא אף אני אלך עמם בקרי והבאתי אותם בארץ אויביהם וגו'. פירש\"י ז\"ל (ת\"כ) אני בעצמי אביאם זו מדה טובה לישראל, שלא יהיו אומרים הואיל וגלינו בין האומות עו\"א נעשה כמעשיהם, אני איני מניחם אלא מעמיד אני את נביאי ומחזירן לתחת כנפי שנאמר והעולה על רוחכם היה לא תהיה וגו'. וכתב הרא\"ם ז\"ל דהא ליכא למימר דע\"כ פירש רש\"י ז\"ל דאומרו והבאתי אתכם היא מדה טובה לישראל, משום דרצה ליישב דלא תקשי דהוה להו שמנה פורעניות ע\"כ אמר דהיא מדה טובה ואין למנותה בכלל הפורעניות. דלפי\"ז תקשי ממאמר ואתכם אזרה בגוים שהיא מדה קשה למה לא מנה אותה בכלל הפורעניות, אלא ודאי שכבר נשלם חשבון ז' הפורעניות ושוב אין לחוש על מספר הפורעניות הנוסף על הז' וכו', עיי\"ש. ועיין מ\"ש הגו\"א בזה. ובדברינו להלן יתבאר דאף מאמר ואתכם אזרה בגוים צפונה בו טובה גדולה לישראל."},{"passage_id":"vayikru2_6c28819b_p10","passage_content":"י) וזכרתי את בריתי יעקב ואף את בריתי יצחק ואף את בריתי אברהם אזכור והארץ אזכור. במד\"ר (פל\"ו ה') עה\"פ וזכרתי את בריתי יעקב וגו' פליגי אמוראי עד מתי זכות אבות קיימת, ר' תנחומא וכו' עד יהואחז וכו', ריב\"ל אמר עד אליהו וכו',  שמואל אמר עד הושע, ר' יוחנן אמר עד חזקיה שנא' למרבה המשרה ולשלום אין קץ וגו' (פירש. במת\"כ וסיפא דקרא קנאת ה' צבאות תעשה זאת ולא זכות אבות) וכולהו מייתו לה מקראי. ומסיים המדרש א\"ר אחא לעולם זכות אבות קיימת, לעולם מזכירין ואומרים כי א-ל רחום ה' אלקיך לא ירפך ולא ישחיתך ולא ישכח את ברית אבותיך אשר נשבע להם. ופלוגתא זו אם תמה זכות אבות איתא נמי במסכת שבת (דף נ\"ה ע\"א) דשמואל אמר תמה זכות אבות ור' יוחנן אמר תחון זכות אבות. ולהלן שם בגמרא מאימתי תמה זכות אבות אמר רב מימות הושע בן בארי וכו', ושמואל אמר מימי חזאל וכו', ריב\"ל אמר מימי אליהו וכו',  ורבי יוחנן אמר מימות חזקיה שנאמר (ישעי' פ\"ע) למרבה המשרה ולשלום אין קץ על כסא דוד ועל ממלכתו להכין אותה ולסעדה במשפט ובצדקה מעתה ועד עולם קנאת ה' צבאות תעשה זאת ופירש\"י קנאת ה' צ' תעשה זאת ולא זכות אבות. ובתוספות (שם ד\"ה ושמואל) אור\"ת דזכות אבות תמה אבל בריח אבות לא תמה דהא כתיב וזכרתי את בריתי יעקב אף לאחר גלות וכו'. והר\"י השיג על פיר\"ת מכח דברי המד\"ר הנ\"ל עיי\"ש. ועל כן נראה לר\"י דלא פליגי שמואל ור' יוחנן אלא שמואל קאמר דלרשעים תמה אבל לצדיקים לא תמה ור' יוחנן דאמר תחון זכות אבות מיירי בצדיקים, תדע דר\"י לא איירי כי אם בצדיקים דהא ר' יוחנן גופיה אמר בסמוך דמימות חזקיה תמה זכות אבות, והכא קאמר דאף בשעת חורבן דבתר הכי תחון זכות אבות, אלא ע\"כ צריכין אנו לחילוק זה, ועל כך אנו סומכין להזכיר זכות אבות. והדר מייתו התוס' דברי ר' אחא במדרש רבה פרשה זו הנ\"ל דלעולם זכות אבות קיימת, ולעולם אנו מזכירים אותם, וכן הוא אומר כי א-ל רחום ה' אלקיך וגו' ולא ישכח את ברית אבותיך וגו', עכת\"ד התוספות. וכבר הארכנו בזה (בדברינו לעיל פרשת ויחי עמוד תקפ\"ג) דלכאורה קשה על דברי ר\"ת ז\"ל ממה שמצינו בכמה מקומות שמזכירין זכות אבות. וכן איתא במתני' (יומא פ\"ג מ\"א) אמר להם הממונה וכו' האיר פני המזרח שבחברון, ואיתא בירושלמי דע\"כ מזכירין חברון כדי לעורר זכות אבות ישני חברון. וגם כיצד יפרנסו אותם דס\"ל תמה זכות אבות מקרא שכתוב כי א-ל רחום ה' א' וגו' ולא ישכח את ברית אבותיך אשר נשבע להם. וכתיב קרא לאמר וזכרתי את בריתי יעקב וגו', ואף גם זאת בהיותם בארץ אויביהם לא מאסתים וגו' להפר בריתי אתם כי אני ה' א'. וכן קשה איך אנו מזכירין זכות אבות בתפלה לכל הנהו אמוראי דס\"ל תמה זכות אבות. ובגמרא התם ס\"ל לכולהו אמוראי תמה זכות אבות, וכמ\"ש התוספות דאף ר\"י גופיה דאמר תחון זכות אבות ס\"ל להלן דתמה זכות אבות מימות חזקיהו ואילך. ואף שיעת הר\"י קשה להלמה דהא דמחלק דדוקא לרשעים תמה אבל לצדיקים לא תמה וע\"ז אנו סומכים להזכיר זכות אבות בתפלה, קשה דהיאך יתכן שאנו מתפללין על סמך שאנו צדיקים וראויים לזכור לנו ברית אבות, והלא אנחנו אומרים בתפלה שאין אנו עזי פנים וכו' לומר לפניך וכו' צדיקים אנחנו ולא חטאנו וכו'. וא\"כ כיון שאנו מעידין על עצמנו שאין אנו בגדר צדיקים, כיצד אנו מזכירין זכות אבות. ומיהו אפ\"ל בכוונת הר\"י, דהנה אפילו בזכות צדיק א' שישנו בעולם העולם מתקיים, אמנם דוקא בצדיק שהוא מופלג מאד בחסידותו ובצדקתו ובקדושתו חד בדרא, וכגון הא דרשב\"י שאמר (סוכה נ\"ה ע\"ב) יכול אני לפעור את העולם כולו מן הדין וכו'. אבל צדיקים שלא הגיעו לידי מדה זו אין בכחם להגין על דורם מחמת זכות עצמם, אלא שיש בידם זכות אבות ובכח זכות האבות הם מגינים על הדור. ועל כן אנו מזכירין זכות אבות, שיהיה בכח הצדיקים שבדור להגין עלינו מחמת זכות האבות. אבל אכתי קשה דמפשיטות דברי התוס' לא מוכח הכי, וגם מה שמסיימין התוס' שאנו סומכין על דברי ר' אחא במדרש דס\"ל דזכות אבות לעולם קיימת צ\"ב, דבגמרא לא נזכרו כלל דברי ר' אחא, וכולהו אמוראי ס\"ל תמה זכות אבות, ומה הוה עלן לדעת כל הנך אמוראי, וכיצד אנו מזכירין זכות אבות."},{"passage_id":"vayikru2_6c28819b_p11","passage_content":"יא) והארץ אזכור במד\"ר מקשה למה מזכיר זכות אבות ומזכיר זכות הארץ עמהם משל למלך שהיו לו שלשה בנים ושפחה אחת משלו מגדלתן כ\"ז שהיה המלך שואל שלום בניו היה אומר שאלו לי בשלום המגדלת כך כל זמן שהקב\"ה מזכיר אבות מזכיר הארץ עמהם וכו'. וצ\"ב להבין דמיון הנמשל אל המשל, וכי הארץ היא המגדלתן. והאלשיך הקדוש וכן בעל העקידה שניהם מפרשים בסגנון אחד מה שהזכיר כאן הארץ היפך דרשת המד\"ר הנ\"ל, דאינהו מפרשי לה בדרך תוכחה, וה\"פ דקרא וזכרתי את בריתי יעקב וגו', כלומר שכבר הייתי מתרצה לזכור לכם ברית האבות הקדושים אילולא \"והארץ אזכור\" כי בזכרי עלבון הארץ שחיללו בה שמיטין ויובלות ושאר מצות התלויות בארץ אני נמנע מלמחול לכם, אלא אביא עליכם כל העונשים הכתובים בעבור צער ועלבון הארץ, עכת\"ד ז\"ל. אכן קשה לומר כפירוש זה שיהיו דברי הכתוב באמרו הארץ אזכור על צד העונש, שהרי אנו מזכירין בתפלות זכר לנו ברית אבות כאשר אמרת וזכרתי את בריתי יעקב וגו' והארץ אזכור, ואם מקרא זה הוא ענין זכירה לרעה, א\"כ כיצד אנו מזכירין זאת ומבקשים רחמים שיזכר לנו הקב\"ה דבר זה. ותו דממאמרי חז\"ל דמיירו ממקרא זה מוכח שהוא לטיבותא ולא לגריעותא."},{"passage_id":"vayikru2_6c28819b_p12","passage_content":"יב) וזכרתי את בריתי יעקב וגו' פירש\"י ז\"ל בחמשה מקומות נכתב יעקוב מלא ואליה חסר בה' מקומות יעקב נטל אות משמו של אליהו ערבון שיבא ויבשר גאולת בניו. והקשה הרא\"ם ז\"ל לא ידעתי למה צריך ה' פעמים במשכון פ\"א סגי, ואפשר שהשביעו בה' חומשי תורה וזה רמז שנעל ה' פעמים נגד ה' חומשי תורה. והגור אריה הקשה עליו מדוע הוצרך ליטול ממנו משכון וגם להשביעו, בחדא מינייהו סגי, והוא ז\"ל תירץ דמיירי במשכון ע\"י ערבות, ובערב כתיב תקעת לזר כפיך, ויד יש לה חמש אצבעות לכן נעל ה' פעמים כנגד ה' אצבעות, ע\"כ. וגם זה קשה להלמו דמה ענין תקיעת כף לה' אצבעות, דאינו קרוי ע\"ש האצבעות אלא ע\"ש כף היד. ותו דכשם שהקשה הגו\"א על הר\"א מזרחי שבועה מאן דכר שמה, איכא לאקשוייה אדידיה היכן הוזכרה כאן תקיעת כף בדבריהם ז\"ל, והרי לא נזכר אלא משכון ותו לא מידי."},{"passage_id":"vayikru2_6c28819b_p13","passage_content":"יג) להלן בס\"פ התוכחה אלה החוקים והמשפטים והתורות אשר נתן ה' בינו ובין בני ישראל בהר סיני ביד משה. וצ\"ב יתור הלשון בינו ובין בני ישראל, גם מהו שאמר ביד משה לא הול\"ל כי אם אלה החוקים וגו' אשר צוה ה' את משה אל בני ישראל כדרך הכתוב בכל מקום, והכי כתיב להלן בסיומא דפרשת ערכין, ומדוע האריך הכתוב כאן בלישנא יתירא לכאורה."},{"passage_id":"vayikru2_6c28819b_p14","passage_content":"ונראה לבאר הענין בהקדם להבין ענין ההבטחה הטובה הכלולה במאמר והבאתי אותם בארץ אויביהם (קושיא ט'), דהנה נודע מדברי חז\"ל בהרבה מקומות ומבואר בספרי הקדמונים ז\"ל כי מה שהגלה הקב\"ה את ישראל לבין האומות מלבד מדת העונש שיש בו למרק עוונותיהם של ישראל, עוד יש בענין הגלות ענין נוסף, שהיא צורך אל הגאולה, וכמו שנתבאר ענין זה בארוכה בספרי ויואל משה (מאמר ישוב א\"י סימן ק\"י). ושם הבאנו מ\"ש השלה\"ק בשער האותיות אות ק' וזלה\"ק, אלו המסעות שנגזרו על האדם ועל זרעו הם לטובה וכו'. כשחטא אדה\"ר וגורש מגן עדן הי' הפיזור בכל מקומות מושבות, אף שהי' מצד העונש מ\"מ הפיזור הי' לטובה, כדי שתתפשט הקדושה בכל העולם לדעת לעבוד את ה' וכו'. אח\"כ אלה מסעי למוצאיהם למסעיהם ולמסעיהם למוצאיהם, כי גלו מא\"י לחו\"ל כדי שיחזרו מחו\"ל לא\"י, ואז הארץ הנשמה תהי' כגן עדן, כי הגליות גורמים גאולה גדולה לעתיד וכו'. גם גלות ישראל שפיזרם הקב\"ה בעולם זה הי' לטובה טב לדידי' להקב\"ה וטב לישראל ע\"ש שהאריך בענין זה כמ\"פ בחיבורו, וכפל ושנה ושלש כי הגלות הוא הכרח עבור הגאולה."},{"passage_id":"vayikru2_6c28819b_p15","passage_content":"ואיתא במד\"ר (שה\"ש פ\"ב ח') עה\"פ קול דודי הנה זה בא בשעה שהמלך המשיח אומר לישראל בחדש הזה אתם נגאלין אומרים לו היאך אנו נגאלין ולא כבר נשבע הקב\"ה שהוא משעבדנו בע' אומות, והוא משיבן ב' תשובות א' מכם גולה לברבריא וא' גולה לסמטריא דומה כמי שגליתם כולכם וכו', עיי\"ש. מבסאר להדיא כי שבועה היא שנשבע המקום ב\"ה שבטרם יגאלו ישראל גאולה נצחית יהיו משתעבדין בכל ע' אומות, עד שכאשר יבוא משיח יהיו ישראל יראים פן לא נתקיימה עדיין השבועה במלואה, שלא נשתעבדו לכל ע' אומות, ולא יתכן שתהיה הגאולה."},{"passage_id":"vayikru2_6c28819b_p16","passage_content":"וביאור ענין זה הלא הוא כתוב בשער המצוות להאריה\"ק (במצות זכירת יצי\"מ פ' ראה) כי בגלות מצרים נתבררו כל הנשמות שהיו נדחים שם, משא\"כ בשאר הגלויות נשארו נשמות שלא נתבררו. ובד' גליות בבל מדי יון ואדום שם הוא גלות מרובה מכלל ישראל, כיון שהם השרשים, אבל בשאר אומות סגי בגלות אחד מישראל כיון שהם רק פרטים וענפים, ואין כל ישראל צריכים לילך בגלות שם, זולת אותם בני אדם אשר נפלו ניצוצות נשמותיהם באומה ההיא, הם צריכים לגלות שם כדי לברר ולהוציא משם ניצוצותיהם שנפלו שם, יעיי\"ש שהאריך טובא. וזאת כוונת המדרש שה\"ש הנ\"ל דישנן מדינות דסגי בא' מישראל הגולה להתם, לצאת ידי גזירת הגלות. ונודע מ\"ש הבעש\"ט הקדוש עה\"פ (תהלים ל\"ז) מה' מצעדי גבר כוננו ודרכו יחפץ, כי האדם סבור בדעתו כי לדרכו הוא מהלך אל מקום שהוא חפץ ללכת לצורך תועלתו והנאתו, אבל באמת מה' מצעדי גבר כוננו, שהקב\"ה מכונן צעדיו ומכוון דרכו ללכת אל אותו מקום, לצורך איזו תכלית ומטרה לתקן שם דבר הטעון תיקון. ומחמת כן התגבר בו החפץ ללכת למקום זה, ואין אתו יודע עד מה סיבת הרצון הלזה. וכיון שהאדם שלוח מאת השי\"ת אל המקום אשר הוא מהלך אסור לו למעול בשליחותו, כי אם עליו לעבוד את השי\"ת בתורה ובעבודה במצוות ובמע\"ט, ובזה הריהו מעלה ניצוצות הקדושה אשר נפלו במקום ההוא המצפים להתעלות על ידו אל מקורן ושרשן."},{"passage_id":"vayikru2_6c28819b_p17","passage_content":"ובדברי האוה\"ח הקדוש בפרשת בהר עה\"פ וכי ימוך אחיך כתוב לאמר, כי סוד הגלות הוא בירור הנצוצות הקדושות, דאל\"כ למה לא ייסרם ה' בשבט מוסר בארצם ובנחלתם, אלא אחד מהטעמים הוא כדי שיבררו נצה\"ק מבין הארצות, כי כל מקום ומקום שימצאו שם ישראל באמצעות היסורין והתורה והמצוות הנצוצות מתבררין מעצמן, וא\"ת א\"כ אם לא היו ישראל חוטאין וגולין מי היה מברר המתבררים בתפוצות ישראל, דע כי אם לא היו ישראל חוטאין היה להם כח לברר נצה\"ק במקום שהם מכל המקומות אשר באו שם, משא\"כ אחר חטאם שחלש כחם והלואי שתשיג ידם במקום עצמו אשר שם הנצוצות, עכדה\"ק."},{"passage_id":"vayikru2_6c28819b_p18","passage_content":"עוד כתב האוה\"ח בפרשה זו כמה טעמים בענין הגלות וביאר שם מאה\"כ ואתכם אזרה בגוים וגו' שהוא אזהרה לישראל שישמרו את שלש השבועות שהשביע הקב\"ה את ישראל, וז\"ש ואתכם אזרה בגוים כאן רמז לב' דברים אומרו אזרה שלא יעלו בחומה, בגוים ושלא ימרדו בגוים. ואומרו והריקותי אחריכם חרב שתהיה חרב מרוטה לפניכם אם לא תקיימו גזירת זירוי בגוים כנזכר ע\"ד שאמרו ז\"ל בכתובות (שם) א\"ל הקב\"ה לישראל אם אתם מקיימים את השבועה מוטב ואם לאו אני מתיר את בשרכם כצבאות וכאילות השדה וכו',  עכדה\"ק ז\"ל. עכ\"פ מכל הלין שמעינן כי גזירת הגלות היא הכרחית, כי כך גזר יוצר בראשית, וישנן בענין זה טעמים רבים ונכבדים. ועפ\"י זה יבואר טעם אומרם ז\"ל במאה\"כ והבאתי אותם בארץ אויביהם זו מדה טובה לישראל, כי בישרם הכתוב בזה שהקב\"ה בכבודו ובעצמו הוא המוליך אותם בארצות אויביהם, ומכונן צעדיהם ומדריכם באיזו הדרך ובאיזה מדינת יגלו, ולא יחשבו כי הגלות מקרה הוא ח\"ו, אלא הוא סיבה מאת הקב\"ה, כדי שתתקיים גזירת הגלות ההכרחית. ובזה אפ\"ל דגם במאה\"כ ואתכם אזרה בגוים טמונה ברכה לישראל, דאף שזו מדה קשה להם שיהיו נזרים כבמזרה פזורים ומפורדים בכל פנות, מ\"מ פיזור זה הוא לטובתם, שכ\"א יש לו שליחות ללקט נצה\"ק הפזורות באותו מקום שאליו הוא נזרה."},{"passage_id":"vayikru2_6c28819b_p19","passage_content":"ועד\"ז נבא אל הביאור, כי הנה בהיות ישראל בגלות פזוריה בגוים וזרויים בארצות, אין כאו\"א מישראל יודע בבירור איה המקום בו נמצאים הנצה\"ק השייכים לשרשו, ושמוטל עליו לתקנן ולהעלותן. וע\"ד שפירשנו (פרשת לך לך ע' רמ\"ב) הא דאיתא בתנחומא פ' לך עה\"פ ויאמר ה, אל אברם לך לך ילמדנו רבינו אדם מישראל מהו שיקבל עליו עול מלכות שמים כשהוא מהלך וכו', ר' אידי ור\"ה בש\"ר יהודה וכו' אמרו אסור לקבל עליו עמ\"ש כשהוא מהלך וכו' אלא יעמוד במקום אחד וכו' ויקרא שמע ישראל וכו',  וכשמתחיל ואהבת רצה מהלך רצה עומד וכו',  שכן כתיב בשבתך בביתך ובלכתך בדרך וכו',  עכ\"ד התנחומא. וביארנו שם הדברים באריכות ותוכן הענין דיש לחקור מאין ידע האדם איה המקום שבו מצויים נצה\"ק השייכות לחלק נשמתו, שהוא המקום הראוי אליו להתיישב בו ולעסוק בעבודת השי\"ת להעלות אותן הנצוצות לשרשם. אלא הענין יובן עפ\"י מאמרם ז\"ל (סוטה מ\"ז ע\"א) ג' חנות הן חן מקום על יושביו וכו', וכמו כן לענינינו הקב\"ה נותן בלב איש הישראל חן המקום שבו נמצאים הנצה\"ק השייכים לשרש נשמתו, כדי שילך לשם להוציא יקר מזולל ולתקן את הטעון תיקון. ובזה יבואר התנחומא הנ\"ל, דלכאורה באמת ראוי להבין מדוע באמת התירה תורה לקרות את שמע מפסוק ראשון ואילך כשהוא מהלך, והלא כשם שאמרו בפסוק ראשון שצריך לקרותו מעומד כדי שיכוון לבו לשמים כן היה ראוי לעשות בכל פרשה ראשונה. ועפ\"י מה שביארנו אפ\"ל כי הקב\"ה נותן בלב כל איש ללכת בדרך ששם נמצאים הנצה\"ק השייכים לנשמתו, ובפרע בצדיקים אמתיים עובדי ה' באמת, שכל תנועותיהם והילוכם רק ברצון הבוי\"ת, ודאי שהקב\"ה מכונן מצעדיהם ללכת אל המקום הראוי להם. ויתכן כי לטעם זה התירו חכמים לקרות את שמע כשהוא מהלך, ותלו הדבר ברצון האדם כאמרם רצה עומד רצה מהלך, כי בודאי מכיון שרצונו מושכו ללכת יש לו שליחות מן השמים באותו הדרך שהוא מהלך בה, וע\"י עבודת השי\"ת במסירות נפש בקבלת עומ\"ש ועול מצוות יתוקנו הנצה\"ק הנמצאים שם השייכים לשרשו, ועל כן ניתן לו הרצון מן השמים ללכת בזו הדרך. ועיי\"ש שביארנו בדרך זה קישור התנחומא אל ריש פ' לך לך."},{"passage_id":"vayikru2_6c28819b_p20","passage_content":"ועתה יתפרשו לנו דברי המד\"ר בריש פרשתן אמר דוד וכו' בכל יום הייתי מחשב ואומר למקום פלוני וכו' אני הולך וכו' (קושיא א'), כי הנה דוד המע\"ה בגודל קדושתו הרגיש איזו השתוקקות אל מקום פלוני ובית דירה פלונית, והבין כי אין זאת אלא ששם ספונים טמונים נצה\"ק השייכים לנשמתו, המצפים להיות נתקנים על ידו, ולפיכך נפשו שואפת ללכת לשם כדי לתקנן ולהעלות למקורן. וזהו שאמר בכל יום הייתי מחשב ואומר לבית פלוני וכו', כי רצונו משכו לשם, אבל באמת לא היה זקוק לכך, כי כל כך גדלה מעלת קדושת אדונינו דהמע\"ה שהיה בכוחו להמשיך כל הנצה\"ק השייכים אליו מכל המקומות שהם נמצאים, ולהעלותן אל מקורן ושרשן כשהוא יושב ועוסק בתורה ובעבודת ה' בבית מדרשו. וז\"ש והיו רגלי מביאות אותי לביהמ\"ד, כלומר שהיו מוליכות ומביאות כל הנצה\"ק ממקום המצאם אל בית המדרש, כי מכל המקומות שם נמצאו והיו ניצוצות הקדושה השייכים אליו היו מתלקטין מעצמן ונמשכין לבית מדרשות ולא היה לו צורך בהליכה בפועל לאותן מקומות."},{"passage_id":"vayikru2_6c28819b_p21","passage_content":"ואפשר להוסיף נופך בביאור לשון המדרש והיו רגלי מביאות \"אותי\" לבית המדרש, עפ\"י מ\"ש רש\"י ז\"ל בפרשת וישב עה\"פ ויתנכלו אותו להמיתו, אותו כמו אתו עמו כלומר אליו. ולכאורה דברי רש\"י ז\"ל נפלאים מאד וכבר נתחבטו בהם כל המפרשים, וביארנו כוונת דבריו עפ\"י מה דאיתא במד\"ר פרשת וישב עה\"פ הנה בטל החלומות הלזה בא, עתיד זה להשיאן לבטלים. ופירש\"י ז\"ל שראו שעתיד לצאת מיוסף ירבעם שמשיא את ישראל לעבוד בטלים וע\"ז. ותיבת \"בטל\" החלומות קדריש על ע\"ז. עכ\"פ מבואר כי השבטים הקדושים ברוח קדשם ראו והשיגו כל הענפים העתידים לצאת מיוסף, וגלל כן רצו להרגו מאחר שענף אחד אשר עתיד לצאת ממנו הוא ירבעם שחטא והחטיא את ישראל, ולפי שכל הדורות נכללו בהאבות כמ\"ש האה\"ח הקדוש עה\"פ תבא עד דור אבותיו וגו' ע\"כ דנוהו ע\"ש סופו שעתיד לצאת ממנו ירבעם, וכהא דאמרו ז\"ל בבן סו\"מ שהוא נידון ע\"ש סופו. וז\"ש רש\"י ז\"ל לבאר מה שדנוהו השבטים הקדושים למיתה, לזאת אמר ויתנכלו אותו להמיתו כמו אתו עמו פירוש דתיבת אותו משמעה כמו אתו עמו, דהיינו מחמת מה שאתו עמו הם התולדות העתידין לצאת ממנו הנכללין עמו בהעלם. על כן התנכלו להמיתו וזה שמסיים רש\"י כלומר אליו, דמחמת הענפים הנכללים בו שהם כלולים בו ע\"כ התנכלו אליו, אבל לא דנוהו למיתה מחמת שמצאו בו עול, אלא מחמת מה שאתו עמו כמבואר. ובדרך זה יתבאר כמין חומר מ\"ש המדרש והיו רגלי מביאות \"אותי\" לביהמ\"ד, אותי כמו אתי עמי הוא כל היקום אשר ברגלי, הם הנצה\"ק התלויים בי השייכים לשרשי והמצפות להתקן על ידי, הם היו מובאים אלי לבית המדרש."},{"passage_id":"vayikru2_6c28819b_p22","passage_content":"ובבחינה זו נבא לבאר המד\"ר אם בחקתי תלכו וגו' חקים שחקקתי בהם שמים וארץ וכו' שנאמר אם לא בריתי יומם ולילה חוקות שמים וארץ לא שמתי, דהנה האה\"ח הקדוש עה\"פ אם בחקתי וגו' כתב לפרש (באופן כ\"ו) עפי\"ד המד\"ר בפ' הבט נא השמימה (ב\"ר פמ\"ד י\"ד) שהעלה ה' לאברהם ודרך על המזלות, והוא אומרו אם בחקתי תלכו עד\"א חוקות שמים וארץ אם בם תלכו וכו' תנאי הדבר ואת מצוותי תשמרו וגו' כי באמצעות קיום המצוה הוא שולע ודורך על המזלות וכו' ואומרו ועשיתם אותם ע\"ד שאמרו (שבת קנ\"ו ע\"ב) עה\"פ צדק יקראהו לרגלו (ישעי' מ\"א) שאמר לו הקב\"ה לאברהם מאי דעתך צדק קאי וכו', הרי שמעריך המזלות בסדר נאות לכם, והוא מאמרם ז\"ל (שם ע\"א) אין מזל לישראל, פירוש שהם שולטים בו, עכ\"ל האה\"ח הק'. ובדבריו ממילא מתבארת גם כוונת המדרש חוקים שחקקתי בהם שמים וארן וכו', דרצונו לבאר הפסוק אם בחקתי תלכו בבחינה זו שפירש האה\"ח הקדוש, כי באמצעות קיום התורה ושמירת המצוות בכוחם של ישראל לשלוט על מהלך המזלות ולשנותם כרצונם, על כן אמר חוקים שחקקתי בהם שמים וארץ וכו', פירוש שאתם תהיו מושלים על משערי הכוכבים והמזלות, לשנות הנהגתם ודרך מהלכם כרצונכם וכחפצכם."},{"passage_id":"vayikru2_6c28819b_p23","passage_content":"ועפי\"ז יובן גם שייכות דרשא הנ\"ל הה\"ד חשבתי דרכי וגו' אמר דוד בכל יום הייתי מחשב למקום פלוני וכו' אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות למאמר הכתוב אם בחקתי תלכו, דלפי שמקרא זה נדרש על הצדיקים השומרים מצוות ה', אשר בכוחם לדרוך על המזלות ולעשות בהם כרצונם, כדרשת המד\"ר הנ\"ל חוקים שחקקתי בהם שמים וארץ וכו', וכמו שביאר האה\"ח הקדוש בהך קרא. על כן הסמיך המד\"ר להכא מה שאמר דוד שאינו צריך להלך ממקום למקום לחפש ולתור אחרי נצוצות הקדושה השייכים אליו כדי לתקנן ולהעלותן, כי בכוחו הגדול הרי הוא שואבן ומביאן אליו לבית המדרש כמו שנתבאר לעיל באורך. ודבר זה נשמע ממה שאמר הכתוב אם בחקתי תלכו שהוא הבטחה לישראל שיהיה בכוחן לשנות חקות שמים וארץ, ואם כך גדול כח קדושת הצדיק לשלוט על מערך המזלות ולעשות בהם כרצונו, עאכו\"כ שיפה כוחו לשאוב נצה\"ק השייכים אליו ממקום המצאו, ואינו צריך לחפש אחריהם."},{"passage_id":"vayikru2_6c28819b_p24","passage_content":"ולדרכנו יובן גם מה דאיתא בזה\"ק אם בחקתי תלכו וגו' ר\"ח פתח (מיכה ה') עמי זכר נא מה יעץ בלק מלך מואב ומה ענה אותו בלעם בן בעור וגו', ומבאר והולך בזוה\"ק כמה גדול כחם של בלעם ובלק במעשה הכשפים, וזלה\"ק, דאע\"ג דבלעם חרשא הוה רב מכל חרשין דעלמא, חרשא עילאה מיניה הוה בלק, בקסם הוה בלק רב מכל חכימין, ובלעם בנחש. קסם ונחש תרין דרגין אינון, קסם תליא בעובדא, ונחש תליא באיסתכלותא ובמלה דפומא וכו'. וע\"ד בעא בלק לאחברא בבלעם וכו', א\"ל קב\"ה רשע הא קדמוך בני, עובדא אית בגוייהו דכל סערין בישין וזינין בישין וחרשין דעלמא לא יכלין לקרבא בהדייהו דכולהו ערקין מקמיה וכו', עכדה\"ק. ולכאורה תימה מ\"ע סמיכות ענין זה לפרשת אם בחקתי, דמה ענין כח הכשפים של בלעם ובלק ומעלת ישראל שבידן לכפות ולבטל כחן לפרשה זו."},{"passage_id":"vayikru2_6c28819b_p25","passage_content":"ועל פי מה שנתבאר יובן היטב שייכות ענין זה לפרשתן, דהנה אמרו ז\"ל (חולין ז' ע\"ב) למה נקרא שמן כשפים שמכחישין פמליא של מעלה. וביאור הענין כתב הרמב\"ן ז\"ל בפרשת שופטים, כי הבוי\"ת כאשר ברא הכל יש מאין, עשה העליונים מנהיגי התחתונים אשר למעה מהן, נתן כח הארץ וכל אשר עלי' בכוכבים ומזלות לפי הנהגתם ומבטם בהם וכו', ועשה עוד על הכוכבים ומזלות מנהיגים מלאכים ושרים וכו'. אבל היה מנפלאותיו העצומים ששם בכח המנהיגים העליונים דרכי תמורות וכוחות להמיר אשר למעה מהם וכו', וזה סוד הכשפים וכחם, שאמרו בהם שהם מכחישים פמליא של מעלה, לומר שהם היפך הכוחות הפשוטים וכו',  עכדה\"ק ז\"ל. והיוצא מזה כי בכח הכשפים להכריח שרי מעלה להמיר ולשנות הכוחות שלמטה מהם הכפופים אליהם והמונהגים על ידם, ובכך משתנים דרכי הכוכבים והמזלות וסדר השפעתם על הארץ ואשר בה (ועיין בדברינו פ' לך ע' רמ\"ו בענין זה באורך)."},{"passage_id":"vayikru2_6c28819b_p26","passage_content":"וכיון שכל כח הכשפים הוא בהכרחת שרי מעלה הממונים על כוחות שתחתיהם, ע\"כ כאשר ברצון העליון יתברך למנוע בעד המכשפים מלבצע זממת הרי הוא משנה תפקידם של שרי מעלת ומחליף את המלאכים הממונים על הכוחות המשפיעים על הארץ, ושוב אין בכח הכשפים לעשות מאומה, וכהא דאיתא במדרש (איכ\"ר פ\"ב ה') עה\"פ חלל ממלכה ושרית שהיו ישראל אומרים לירמיה אם יבואו השונאים מה הם יכולים לעשות לנו חד אמר אנא מקיף לה חומת מיא (פי' המת\"כ ע\"י השבעת שר של מים אקיף ירושלים בחומת מים סביב), וחרינא אמר אנא מקיף לה חומת נורא וכו', א\"ל הקב\"ה בדידי אתון משתמשין, עמד הקב\"ה ושינה שמותן של מלאכים, דעל מיא עבד על נורא ודעל נורא עבד על פרזלא, והיו מזכירין שמותן מלמטה ולא היו עונין להם, וכו', ע\"כ."},{"passage_id":"vayikru2_6c28819b_p27","passage_content":"והנה בעל הטורים כתב במאה\"כ וירא בלק בן צפור שראה שעמדה לו חמה למשה. וכדאיתא בעבודה זרה (דף כ\"ה ע\"א) שכשם שעמדה חמה ליהושע כך עמדה לו למשה. ולכאורה צריך להבין מדוע נתיירא בלעם מנס העמדת החמה יותר משאר האותות והמופתים הגדולים והנוראים אשר עשה ה' לפרעה ולכל מצרים. אכן יתבאר עפ\"י מה דאיתא בברכות (דף ז' ע\"א) שכוחו של בלעם היה שידע לכוון אותה שעה שהקב\"ה כועס בה, ואז היה מקום לקללתו לחול. והנה איתא בגמרא (שם) תנא משמיה דר\"מ בשעה שהחמה זורחת וכל מלכי מזרח ומערב מניחין כתריהן בראשיהן ומשתחוין לחמה מיד כועס הקב\"ה. ומכיון שכל כוחו של בלעם לקלל היה במה שהיה יודע לכוון שעת הזעם, וזעמו של הקב\"ה הוא מחמת שמלכי מזרח ומערב כורעים ומשתחווין לחמה בשעת זריחתה, ע\"כ הי' בלק מתיירא ביותר כשראה העמדת החמה ע\"י משרע\"ה, דכיון שבכחן של ישראל להעמיד החמה כשירצו, א\"כ בידם לבטל פעולת הקללה של בלעם, שהרי כל כוחו של בלעם הוא מחמת זעמו של הקב\"ה הבא מכח זריחת החמה, שאז מלכי מזרח ומערב משתחוין לה, ואם יעמידו בני ישראל את החמה שלא תלך במהלכה הטבעי הרגיל לא יהא ביכלתו לקלל אח ישראל, שלא ידע רגע שהקב\"ה זועם בה."},{"passage_id":"vayikru2_6c28819b_p28","passage_content":"ובאו\"א קצת אפ\"ל טעם שנתיירא בלק מנס העמדת חמה דייקא, עפ\"י מה שנתבאר לעיל דכל כחן של הכשפים הוא להחליף ולהמיר פעולת מערכת השמים כוכבים ומזלות ע\"י שמשביעין השרים הממונים עליהם. על כן מכיון שראה בלק כי משרע\"ה העמיד חמה ברקיע, ובכוחו לשלוט על כוכבי שמים וכסיליהם, ולשנות גלגל המזלות כרצונו, א\"כ לא יוכל בלעם לפעול מאומה בכשפיו להפך סדרי המזלות, כיון שישראל שולטים על חוקות שמים וארן."},{"passage_id":"vayikru2_6c28819b_p29","passage_content":"ובזה מובנים היטב דברי הזה\"ק הנ\"ל דסמך לפ' אם בחקתי תלכו כחם הגדול של בלק ובלעם בכשפים, וכי לא יכלו לשלוט על ישראל בכשפיהם. דשפיר שייך ענין זה לפ' אם בחקתי, שהרי מכאן למדנו כי חוקות השמים והארץ ומשטר כוכבי שמים ומערכות המזלות מסורים ביד ישראל בזמן שהם ראויים, להטותם אל אשר יחפצו, וא\"כ נתבטל כל כחן של כשפים, ואין בידן להרע לישראל כלל ועיקר. להכי מייתי הך קרא עמי זכר נא מה יעץ בלק וכו' ומה ענה אותו בלעם וגו', דעל אף גודל גבורתן של בלק ובלעם בכשפים, לא יכלו לעשות לישראל מאומה, דכל כחן בהשבעת שרי מעלה הממונים על מערכת המזלות, וכיון שישראל שולטים על חוקות שמים וארץ, לא יוכלו להרע לישראל בכשפיהם."},{"passage_id":"vayikru2_6c28819b_p30","passage_content":"ועתה נבא לבאר מה שפירש\"י ז\"ל שמא תאמר הרי מאכל הרי משתה אם אין שלום אין כלום ת\"ל ונתתי שלום בארץ. דהנה המפרשים התעוררו דאחר שכבר אמה\"כ וישבתם לבטח בארצכם מה צורך לומר עוד ונתתי שלום בארץ, והאה\"ח הק' כתב ואולי שיכוון על עם בנ\"י עצמם שלא יהיה להם פירוד הלבבות שיטע ביניהם שלום וריעות. או אפשר שיכוון על כללות העולם וכו', ע\"כ. ואפ\"ל עוד דהנה בסוף מסכת עדיות תנן אין אליהו בא לא לרחק ולא לקרב אלא לעשות שלום ביניהם שנאמר הנה אנכי שולח לכם את אליהו הנביא וגו' והשיב לב אבות על בנים ולב בנים על אבותם. והרמב\"ם ז\"ל בסוף הלכות מלכים כתב שקודם מלחמת גוג ומגוג יעמוד נביא ליישר ישראל ולהכין לבם שנאמר הנה אנכי שולח לכם את אלי' הנביא וגו'. ולכאורה מדוע נטה הרמב\"ם ז\"ל מדברי המשנה עדיות הנ\"ל, דיליף מהך קרא דאליהו בא לעשות שלום בעולם, ואילו איהו מפרש לה לענין שעתיד להחזיר את ישראל בתשובה. וביארנו (עיין פ' אחרי עמוד פ') דדא ודא אחת היא, דענין השלום המבואר במשנה עדיות היינו שיחזיר את ישראל בתשובה ויקרב לבבם לעבודתו יתברך, וזהו השלום האמיתי בין ישראל לאביהם שבשמים, כי החטאים גורמים לפירוד בין ישראל לקב\"ה, ע\"ש באורך שהבאנו ראיה לכך מדברי הילקוט."},{"passage_id":"vayikru2_6c28819b_p31","passage_content":"ועד\"ז אפ\"ל גם במאה\"כ ונתתי שלום בארץ שהיא הבטחה שישוב אל כנו השלום האמיתי בין בני ישראל לאביהם שבשמים. ופלא דהכי איתא להדיא בזוה\"ק פרשה זו, ונתתי שלום בארץ, לעילא דאתי קב\"ה לאתחברא בכנסת ישראל. והנה מבואר בדבריהם ז\"ל (ספרי פ' האזינו) כי אכילה ושתי' יתירה מביאה למרוד בהקב\"ה וכדכתיב (דברים ח') פן תאכל ושבעת וגו' ורם לבבך ושכחת את ה' אלקיך. והענין מבואר בספה\"ק דאם האכילה ושתיה הוא בקדושה ובטהרה היא עבודה להשי\"ת, ואם אינו כן אזי זה גורם להתגשם ביותר ולטמטום הלב והמוח. נמצא כי בסיבת אכילה ושתיה שלא בקדושה נפסקת ח\"ו הדביקות וההתחברות בין כנס\"י לקבה\"ו. וז\"ש רש\"י ז\"ל שמא תאמר הרי מאכל הרי משתה וזאת הסיבה להשבית השלום האמיתי והדביקות בין קב\"ה לכנס\"י, ואם אין שלום זה איך כלום, דזהו עיקר הכל, ואל כך אנו מצפים ומקוים, ת\"ל אחר כל זאת ונתתי שלום בארץ, שתהיה האכילה והשתיה בקדושה ובטהרה, ואדרבה תוסיף דביקות והתחברות בין ישראל לאביהם שבשמים."},{"passage_id":"vayikru2_6c28819b_p32","passage_content":"ואפ\"ל עוד מה שפירש\"י ז\"ל שמה תאמר הרי מאכל הרי משתה אם אין שלום אין כלום וכו', דהנה איתא במד\"ר פ' נשא (פי\"א י\"ח) גדול השלום שניתן לעושי צדקה שנאמר (ישעי' ל\"ד) והיה מעשה הצדקה שלום, והטעם דע\"י צדקה שגומלין חסד זה עם זה באים לידי שלום. ועל כן לפי שהבטיח הכתוב שיהיה לישראל שפע ברכה ולא יחסרו כל טוב, א\"כ שוב לא יצטרכו בני ישראל זה לזה כלל ולא יהיה שייך ענין הצדקה. וז\"ש שמא תאמר הרי מאכל הרי משתה, וכיון שיהיה לכ\"א ואחד די מחסורו אין שלום שהרי השלום ניתן לעושי צדקה, על כן הבטיח הכתוב ונתתי שלום בארץ דאעפ\"י כן לא יושבת מהם השלום."},{"passage_id":"vayikru2_6c28819b_p33","passage_content":"ועוד אפ\"ל בזה דהנה אי' במדרש מתחלה עלתה במחשבה לפניו ית' לברוא את העולם בדין וראה שאין העולם מתקיים שיתף מדת הרחמים למדה\"ד. והנה התעוררות מדת הרחמים הוא באמצעות הצדקה, כאמרם ז\"ל במאה\"כ (דברים כ\"ו) השקיפה ממעון קדשך כל השקפה לרעה חוץ מהשקיפה ממעון קדשך שגדול כח מתנות עניים שהופך מדת הרוגז לרחמים (מדרש הובא ברש\"י פ' וירא). וא\"כ לפי מה שכתבנו לעיל דלעת\"ל שיפסק לגמרי ענין מעשה הצדקה שיהיה שפע ברכה בעולם, ולא יצטרכו איש לרעהו, וגם תמלא הארץ דעה ולא יצטרכו זל\"ז כלל ברוחניות כמאה\"כ (ירמי' ל\"ג) ולא ילמדו עוד איש את רעהו כי כולם ידעו את ה' וגו', א\"כ לא תהיה מדה\"ר בעולם, וכיצד יוכל העולם להתקיים במדה\"ד בלחוד בלא שיתוף מדה\"ר, ובמה יתהפך הדין לרחמים. ע\"כ אמה\"כ ונתתי שלום בארץ, שאעפ\"כ תהיה מדה\"ד נהפכת לרחמים, שהרי כבר הבעיח הכתוב אם בחקתי תלכו, וכמו שנתבאר שבזמן שישראל ראויים הרי הם שולעים בחוקות שמים וארץ בכח התורה, ובידם להפך מהלך הכוכבים ולשנותם כרצונם."},{"passage_id":"vayikru2_6c28819b_p34","passage_content":"והנה כשם שכל עת וזמן יש לו מזל ושר מיוחד בעולם הגלגלים הממונה להשפיע לעולם בזמנו ובשעתו, כן יש בעולם העליון מדה מיוחדת המאירה לעולם בכל עת ובכל זמן, והנהגת העולם תלויה בבחינת המדה המשפיעה לעולם באותו זמן (עיין בנזה\"ק פ' ויחי בשם חכמי האמת). וכשם שמסר הקב\"ה ביד ישראל כח זה שיוכלו להפך ולשנות סדרי הנהגת מערכוח הכוכבים ומזלות, כמו כן בכחם לשנות סדרי הנהגת מדות העליונות, דהכל שורש אחד הוא, שכך חקק יוצר בראשית סדרי הנהגות עולמו, שיהיו אלו ממונים על אלו ומשפיעים לעולם בהשתלשלות. ועל כן הבטיח הכתוב אם בחקתי תלכו, וכפירוש האה\"ח הקדוש הנ\"ל שתהיו שולטים על חוקות שמים וארץ בכח התורה להנהיגם כרצונכם, אזי ונתתי שלום בארץ. דאף אם תחסר לכם מדת הצדקה המהפכת רוגז לרצון ודין לרחמים, אעפ\"י כן תהיה מדה\"ר שולטת בעולם, כי בכח הקדושה תהיו שולטין על מדות עליונות להפכם לרחמים גמורים."},{"passage_id":"vayikru2_6c28819b_p35","passage_content":"ועפ\"י זה יבואר המשך המד\"ר הנ\"ל (קושיא ב') חשבתי מתן שכרן של מצוות והפסדן של עבירות וכו', חשבתי מה שכתבת לנו בתורה אם בחקתי תלכו ומה כתיב תמן ונתתי שלום בארץ, ואם לא תשמעו לי מה כתיב תמן ויספתי ליסרה אתכם וכו'. דאין הכוונה בדברים אלו שהיה דהמע\"ה נושא את נפשו לחקות השכר העתיד להשתלם בעד מעשי המצוות, שלא היה עובד את ה' ית' ע\"מ לקבל פרס. אלא שהיה חפץ ומשתוקק בכל לבו ונפשו שיתקיים מאה\"כ ונתתי שלום בארץ לאתחברא כנס\"י בקב\"ה, כי זה כל תקות נפשו וחמדת לבבו של כל יהודי אמיתי לדביקות בהשי\"ת, וזאת היא תכלית כל העבודה ושורש הכל. וזהו שאמר חשבתי דרכי וגו' חשבתי וכו' אם בחקתי תלכו ומה כתיב תמן ונתתי שלום בארץ, הכוונה על השלום בין ישראל לאביהם שבשמים, והוא הדביקות וההתחברות בין כנס\"י לקבה\"ו. וכמ\"ש הכל\"י ז\"ל על מה שהקשו הקדמונים מדוע לא נכתבו יעודים רוחניים בתורה כי אם יעודים גשמיים, וביאר דבפנימיות הדברים צפונים טמונים יעודים רוחניים רבים ונכבדים, וה\"נ פנימיות הכתוב ונתתי שלום בארץ מורה על הדביקות בין ישראל לאביהם שבשמים. ודהמע\"ה ראה והבין כי כדי להשיג התחברות זו צריכין להתחזק בכח התוה\"ק, והיו רגלי מוליכות אותי לבתי כנסיות ולבתי מדרשות. ולהיפוך ח\"ו ואם לא תשמעו לי מה כתיב תמן ויספתי ליסרה אתכם וכו'. והכוונה דהנה דקדקנו במה שאמר הכתוב ויספתי ליסרה אתכם שבע על חטאתיכם דמקרא יתר הוא לכאורה, שהרי הכתוב מונה והולך ז' הפורעניות העתידות לבא עליהם, וממילא ידענו דיסורין הם ולמה הוצרך לפרט ויספתי ליסרה וגו'. אכן הנה האוה\"ח הקדוש כתב בפרשת עקב עה\"פ אבד תאבדון כגוים וגו' דקאי על הכרתת נבואה ורוה\"ק מקרב ישראל, ועל זאת יחרד עם ה' שאין קללה בעולם כזו, אוי לדורות שטעמו כוס המר הזה מר ממות, והוא רחום ישוב ירחמנו וכו', עכדה\"ק. וכיוצא בזה כתב בפ' זו עה\"פ וגעלה נפשי שלא יתנבאו עוד בישראל נביאים, כי לא יופיע ה' שכינתו וכו',  והיא שנתקיימה בזמן הזה ולה כלו עינינו ודאבה מאד נפשינו אוי נא לנו, עכ\"ד האה\"ח הקדוש."},{"passage_id":"vayikru2_6c28819b_p36","passage_content":"וע\"ד זה יתבאר מה שאמה\"כ ויספתי ליסרה אתכם שבע על חטאתיכם, דהנה שבע פורעניות הם כנגד הז' מדות כנודע, דכשם שישנן ז' מדות בקדושה יש לעומתן להיפוך בטומאה, דזה לעומת זה עשה אלקים, וע\"י החטאים נופלין ח\"ו לז' מדורות הטומאה, ומגבירים כחם באמצעות העוונות. וז\"פ ויספתי ליסרה אתכם וגו' רמז על הסתלקות השכינה הקדושה והתמעטות כח הקדושה מישראל, והתגברות כחות הטומאה שהם היסורין המרים ביותר, כמ\"ש האה\"ח הקדוש."},{"passage_id":"vayikru2_6c28819b_p37","passage_content":"וזהו גם ביאור המשך דברי המד\"ר חשבתי ברכות וכו' חשבתי קללות ברכות מא' ועד ת' קללות מו' ועד ה' ולא עוד אלא שהם הפוכות. כי הכל תלוי במעשי בני ישראל, ואותם האותיות עצמם המורים על קללות ח\"ו ניתן להפכן לברכה אם יזכו. וזהו שאמר ולא עוד אלא שהן הפוכות, לרמוז כי גם הקללות עצמן הם ברכות, ובכחן של ישראל להפכן לטוב אם יזכו, כמבואר שחוקות שמים וארץ אף הם נמסרו בידן של ישראל לשנותן כטוב בעיניהם. ולהלן בדברנו יתבאר עוד ענין זה."},{"passage_id":"vayikru2_6c28819b_p38","passage_content":"ואחרי שנתבאר לנו כח הפיכת הקללות לברכות המסור בידן של ישראל בזמן שהם ראויים, נבא אל הביאור במאמר הכתוב ורדפו מכם חמשה מאה, ויתיישב מה שהקשו המפרשים על תירוץ התוס' דקרא דאיכה ירדוף אחד אלף מיירי ברדיפה בלא הריגה, ממה דאיתא במו\"ק שהיה דוד זורק חץ והורג ח' מאות חלל בבת אחת והיה מתאנח על חסרון מאתים לתשלום האלף, דכתיב איכה ירדוף אחד אלף, ואם כדברי התוס' דמיירי ברדיפה בלא הריגה אמאי היה מתאנח, הלא שם לא מיירי אלא ברדיפה ואילו הוא הרג ח' מאות בב\"א (עיין קושיא ח'). בהקדם מה שכתב בעיון יעקב שם לתרץ קושיא זו, עפ\"י מה דאיתא בספרי פ' האזינו על הך קרא וז\"ל, כי גוי אובד עצות המה וגו', ר' יהודה דורשו כלפי ישראל ור\"נ דורשו כלפי אוה\"ע וכו'. וצ\"ל במאי פליגי. אלא דר' יהודה דורשו כלפי ישראל ס\"ל דמוכח דקאי על ישראל, דאי על אוה\"ע יהיה קשה להם קושית התוספות דאיך יהיה מדה רעה מרובה ממידה טובה, ולא ס\"ל כתירוץ התוספות, דמה\"ת יהיה כאן לענין רדיפה ולא הריגה, הא תחלת נפילה ניסה. להכי דורשו כלפי ישראל, ולא קשיין קראי אהדדי, די\"ל דהתם מיירי כשהם צדיקים ביותר. ועי\"ל דהתם כתיב ורדפו מכם חמשה מאה, דהיינו מן החלשים שבהם כדאיתא במד\"ר, משא\"כ בפרשת האזינו מיירי בגבורים שבישראל וכו'. אבל ר\"נ דורשו כלפי אוה\"ע דס\"ל דחילוק זה בין גבורים לחלשים הוא דוחק, כיון דכתיב כי צורם מכרם, ולפניו גבורים וחלשים חדא מילתא כי אין מעצור להושיע, וגם בפ' בחקתי מיירי בגבורים ביותר להכי דורשו כלפי אוה\"ע. ומכל מקום מדה טובה מרובה דהתם הריגה והכא רדיפה בעלמא, והשתא סוגיא דמו\"ק על כרחך קאי אליבא דר' יהודה דדורשו כלפי ישראל, דהרי משום הכי התאנח דוד שהיה גבור ולא הכה רק ח' מאות ולא אלף. ואליבא דר\"י ע\"כ לא סבירא ליה כתירוץ התוס', כי אין צורך לחלק כן, כיון דאיכה ירדוף אחד אלף קאי גם לענין מדה טובה. אבל סוגיא דסוטה קאי אליבא דר\"נ, דדרש קרא דאיכה ירדוף וגו' כלפי אוה\"ע, ולזה מקשים התוס' ומתרצים שפיר, עכ\"ד העיון יעקב ז\"ל."},{"passage_id":"vayikru2_6c28819b_p39","passage_content":"אמנם לדרכנו תתיישב קו' המפרשים על התוספות באופן אחרי דהנה בכל גזירה וקללה הכתובות בתוה\"ק כלולה וטמונה גם ישועה וברכה, כמבואר לעיל. ובספה\"ק דגל מחנה אפרים פ' בהר כתב בשם הבעש\"ט הקדוש לבאר ענין זה, כי הגזירה יורדת מן השמים בצירוף אותיות, ובכח הצדיקים לשנות צירוף האותיות, וע\"י כן היא מתהפכת לברכה. עד\"מ כשהגזירה יורדת למטה באותיות נגע, ביד הצדיק להפכה מנגע לענג, ונמצא דאותם האותיות עצמן שבאה הגזירה לעולם נתהפכו מקללה לברכה. ועד\"ז אמרתי לפרש דברי הפסוק בפ' מצורע וראה הכהן והנה נרפא נגע הצרעת מן הצרוע, דלכאורה יל\"ד בלשון הכתוב שהיה ראוי שיאמר והנה נרפא הצרוע מן הנגע, שהרי המצורע הוא שנרפא ולא נגעו. ולפי\"ד הדגמ\"א יובן דהנגע בעצמו היתה לו רפואה, דע\"י שעשה המצורע תשובה היה בכח הכהן לבטל הגזירה ולהפך האותיות מנגע לענג."},{"passage_id":"vayikru2_6c28819b_p40","passage_content":"ונעתיק לשון הספרי בפ' האזינו וז\"ל, כי גוי אובד עצות המה ר' יהודה דורשו כלפי ישראל רב נחמיה דורשו כלפי עו\"א, ר\"י דורשו כלפי ישראל אבדו ישראל עצה טובה שניתנה להם וכו', ואין בהם תבונה אין אחד שיסתכל ויאמר אמש אחד ממנו רודף מן העו\"א אלף ושנים רבבה. ר\"נ דורשו כלפי עו\"א וכר, אין בהם א' שיסתכל ויאמר עכשיו אחד ממנו רודף מישראל אלף ושנים יניסו רבבה, ולימות המשיח אחד מישראל רודף ממנו אלף ושנים יניסו רבבה, ע\"כ. ובילקוט שם איתא על הפסוק לו חכמו ישכילו זאת איכה ירדוף אחד אלף וגו', אם לא עשיתם את התורה היאך אני עושה הבטחתכם, הייתם מבקשים שיהא אחד מכם רודף אלף ושנים יניסו רבבה, עכשיו אחד מן האוה\"ע רודף אלף ושנים יניסו רבבה, עכ\"ד הילקוט."},{"passage_id":"vayikru2_6c28819b_p41","passage_content":"ומדברים אלו מפורש יוצא דקרא דאיכה ירדוף אחד אלף מתפרש לתרי אנפי, ואף למ\"ד דדריש ליה על אוה\"ע שיהא אחד מהם רודף אלף מישראל, מ\"מ אם זכו ישראל יתהפך להם מקרא זה להבטחה טובה, שיהא אחד מישראל רודף אלף מן האומות. והיינו כדאמרן שמקרא זה עצמו שהיא גזירה אפשר שיתהפך ע\"י ישראל לטוב להם. וענין הטובה לישראל היא ע\"י שהגזירה מתהפכת לחול על ראש האומות שונאי ישראל."},{"passage_id":"vayikru2_6c28819b_p42","passage_content":"וע\"ד שכתב ק\"ז זלה\"ה ביש\"מ פ' בשלח בטעם הדבר שהיה נחוץ שישוב הים לאיתנו להטביע את מצרים, מלבד הפשוט כי אם היה נשאר בחרבה היו מצרים רודפים אחריהם, עוד יש דברים בגו, עפ\"י הקדמה מזוה\"ק דמדת הדין אינה חוזרת בריקניא, וידוע דהים היה סוער עליהם להטביען דהללו עובדי ע\"ז והללו עובדי ע\"ז, וגם חמה חסר כתיב, ולזה היה צריך יד חזקה לכבוש מדה\"ד, וכיון דאינו חוזר בריקניא לזה באו המצרים בתוך הים, ובהדיא נאמר בקרא (ישעי' מ\"ג) נתתי כפרך מצרים וגו'. והכי איתא בהדיא בילקוט פ' בשלח (רמז רל\"ד) עה\"פ והמים להם חמה (חסר כתיב) שטען ס\"מ הללו עוע\"ז והללו עוע\"ז ונתמלא הים חימה עליהם להטביעם, והשיב הלא לא עבדו אלא מתוך שעבוד, כיון ששמע שרו של ים אותו חימה החזירו על מצרים, הה\"ד וישובו המים ששבו מן ישראל על מצרים, ע\"כ. זת\"ד ק\"ז זלה\"ה."},{"passage_id":"vayikru2_6c28819b_p43","passage_content":"ובדבר הזה אף אנו נאמר בענין גזירה זו דאיכה ירדוף אחד אלף, דאף אם בעיקרן של דברים קאי מקרא זה אאומות העולם שירדפו אחרי אלף מישראל, מ\"מ אם יזכו ישראל ויעשו תשובה כראוי יעשה מאותם תיבות עצמן רחמים וחסדים לישראל, שתתהפך אותה גזירה עצמה לטובה ותחזור אותה החיעה שנגזרה מתחלה על ישראל על ראש האומות שירדוף אחד מישראל אחרי אלף מן האומות. אכן חילוק יש בדבר, דלא הרי משמעות הפ' בזמן שהוא נדרש פל ישראל, שירדוף אחד מהם אחרי אלף מן האומות, כמשמעותו בזמן שהיא נדרש להיפך שירדוף א' מן האומות אחרי אלף מישראל. דבזמן שישראל זוכין והמקרא הזה הוא להם ענין הבטחה טובה, אזי משמעותיה דקרא הריגה ממת שירדוף אחד מישראל אחרי אלף מן האומות וישיגם וימחצם ולא ישוב עד כלותם, כפשטות הכתוב דקאי ארדיפה והריגה. אבל בזמן שלא זכו ישראל וח\"ו מקרא זה הוא גזירה רעה עליהם, שירדוף א' מן העכו\"ם אחרי אלף מישראלי אזי פירושא דקרא רדיפה בלא הריגה. דאף כאשר חלה הגזירה על ישראל, עוזר הבוכה\"ע ברוב רחמיו וחסדיו להמתיק הגזירה, שיהיה די ברדיפה ולא ישיגו להרגם."},{"passage_id":"vayikru2_6c28819b_p44","passage_content":"וא\"כ נמצא כי בגזירה עצמה טמונה הצלה וישועה לישראל שלא יוכלו האומות לבצע זממם לרדוף ולהשיג ולהרוג. והרמב\"ן ז\"ל כתב בפ' וישלח עה\"פ והיה המחנה הנשאר לפליטה דיש בשליחות זו רמז לדורות כי כל אשר שאירע לאבינו עם עשיו אחיו יארע לנו תמיד עם בני עשיו, וראוי לנו לאחוז בדרכו של צדיק שנזמין עצמנו לג' דברים לתפלה ולדורון ולהצלה בדרך מלחמה לברוח ולהנצל, עכלה\"ק. ולכאורה תמוה הזהו דרך מלחמה לברוח ולהנצל, ומדוע לא יעמוד נגדו להלחם עמו. אכן זוהי הוראת דרך מאת יעקב אבינו עליו השלות כי זהו דרך מלחמה לישראל בדורות הגלות, לברוח ולהנצל. ואסור לערוך מלחמה בפועל נגד האומות, אלא בזמן שהיו ישראל שרויין על אדמתן אדמת הקדש, והיתה מלכות ישראל עפ\"י התורה וההלכה, ושאלו באורים ותומים ובסנהדרי גדולה אם לצאת למלחמה או לחדול, אז ידעו בבירור מה הוא רצון ה'. אבל בזמן הגלות אסור לישראל לעשות מלחמה נגדם. והעצה היחידה המסורה לנו מאת אבינו הזקן לברוח ולהנצל."},{"passage_id":"vayikru2_6c28819b_p45","passage_content":"והיוצא מזה כי אף בתוכחה זו דאיכה ירדוף אחד אלף וגו' טמונה בה ברכה, דבאמת דבר זה הוא שלא כדרך הטבע שיוכל אדם אחד לרדוף אחרי אלף בני אדם, ושני אנשים יניסו רבבה, דבדרך הטבע אי אפשר כזאת שלא יוכלו אלף אנשים לשות עצות בנפשם נגד אחד, ועשרת אלפים לא יוכלו לגבור על ב'. אלא צריך לומר כי כאשר בני ישראל מאמינים בהקב\"ה שהשביעם שלא ימרדו באומות, אזי אף אם אחד מן האומות רודף אלף ושנים רבבה אין הם מתייצבים כנגדם ללחום עמת דלפי שכן רצון הבוב\"ה שיברחו וינוסו מהם ולא ילחמו נגדם, הם מקבלים על עצמם גזירת הבוי\"ת ונסים ובורחים, וזאת היא באמת ישועה גדולה שיכולין לברוח ולהמלט על נפשם. נמצא דבפורענות זו דאיכה ירדוף וגו' ושנים יניסו רבבה ישנה ישועה, שהכתוב מבשר שיניסו רבבה דהיינו שלא יהרגו אותם, אלא ינוסו מפניהם ותהיה להם נפשם לשלל. וכאשר ראינו בעוה\"ר כי עוון הדור גרם בעבור שעברו על השבועה ומרדו באומות אירע האסון הנורא ולא יכלו לברוח ולהמלט, ומי יתן והיה מתקיים ושנים יניסו רבבה, דאילו היו נסים ונמלטים כל אותם הרבבות אחב\"י היתה זאת ישועה גדולה. ובעוה\"ר עוון הדור גרם מכה אשר לא כתובה בתורת ששלטה מדה\"ד עד כדי כך שלא יכלו אפילו לברוח, ולא נתקיים אף האמור בתוכחה ושנים יניסו רבבה, וכ\"ז בא מחמת שעשו נגד רצון השי\"ת למרוד באומות. והקדוש מהר\"א גאלאנטי זצלה\"ה בספרו זכות אבות על מסכת אבות, על מתני' ואל תתוודע לרשות הביא מעשה רב, שבמלכות פורטוגאל העלו ישראל על לב להשביע השבעות כנגד המלכות ולמרוד בהם, ולצאת עליהם למלחמה, ולהרגם וללכוד המלוכה. והיה שם זקן אחד ושאל ע\"י שם אחד והשיבוהו אם תעירו ואם תעוררו, וכמו שפירשו ז\"ל ג' שבועות השביע הקב\"ה את ישראל אחת שלא ימרדו בהקב\"ה וכו', עיי\"ש. הרי דאף שהיה במלכות פורטוגאל גזירת שמד כמו בספרד, והרגו בהם במיתות משונות, אעפ\"כ לא הותר להם ללחום נגד המלוכה, אם כי היה בכחם להתגבר עליהם ולהרגם וללכוד המלוכה. וה\"נ כן הוא דאף אם יש ביד הרבבה לנצח נגד ב', מ\"מ כיון שאין כן רצון הבוי\"ת עליהם לקבל גזירתו ית' ולברוח."},{"passage_id":"vayikru2_6c28819b_p46","passage_content":"נמצא לפי זה דתו לא צריכנא לומר כשינוייא דספר עיון יעקב הנ\"ל, דהך גמרא דמו\"ק שהיה דוד מתאנח על חסרון מאתים תליא בפלוגתא דר' יהודה ור' נחמיה, דלפי מה שנתבאר בדברנו לא פליגי ר\"י ור\"נ בעיקרא דמילתא, דלתרווייהו מתפרש קרא דאיכה ירדוף אחד אלף בישראל אם זכו, וח\"ו להיפך באומות העולם אם לא זכו. אלא דבזמן דקרא קאי על אוה\"ע שהם הרודפים ובנ\"י הנרדפים אזי יוצאין בניסה גרידא, דברחמי ה' וחמלתו על ישראל הוא ממתיק הגזירה. משא\"כ בזמן שישראל עושי רצונו של מקום בשלימות, אזי הך קרא מיירי ברדיפה והריגה ממש, שיהיה אחד מישראל רודף אלף מן האומות והן נופלים חללים לפניו, דמהיכי תיתי להקל גזירת העונש מן האומות ולומר דסגי להו בניסה. משא\"כ כאשר אין זוכין והגזירה חלה ח\"ו על ראש בני ישראל, אזי בעזרתו יתברך ימצאו הזדמנות לברוח ולהמלט."},{"passage_id":"vayikru2_6c28819b_p47","passage_content":"ובדרך זה יתבארו על נכון דברי התוספות דהוה קשיא להו דבמדת פורענות כתיב איכה ירדוף אחד אלף ואילו במדה טובה כתיב ורדפו מכם חמשה מאה בלבד, א\"כ מדת פורענות מרובה, ואף דקרא דאיכה ירדוף אחד אלף מתפרש גם על מדה טובה, דאם זכו ישראל יתקיים בהם איכה ירדוף אחד מישראל אלף מן האומות, מ\"מ קשה מקרא דורדפו חמשה מאה. ולא ניחא להו לשינויי דמיירי בחלשים שבישראל שאין בהם אלא מקרא וד\"א בלבד, דעכ\"פ היה ראוי שתהי' מעלת החלשים שבישראל כמעלת האומות בשעת תוקף גדולתם. ותו דגם הבטחת איכה ירדוף וגו' בזמן שהיא מתפרשת על ישראל אין זו מדה טובה מרובה, דאינה אלא שוה למדת פורענות, ולפי החשבון ראוי שתהיה מדה טובה מרובה ת\"ק פעמים ממדת פורענות, דהיינו שירדוף אחד מישראל ת\"ק אלף מן האומות."},{"passage_id":"vayikru2_6c28819b_p48","passage_content":"ועל כך כתבו התוספות לתרץ דקרא דאיכה ירדוף וגו' מיירי ברדיפה ולא בהריגה, והיינו כדאמרן דבזמן דקאי על אוה\"ע הרודפים את ישראל ברדיפה בעלמא סגי להו ולא יבואו לידי הריגה, משא\"כ בזמן שמקרא זה נאמר על ישראל הרודפים ועכו\"ם הנרדפים אז מיירי ברדיפה והריגה כאמור. והשתא ליכא לאקשויי מהא דתנן מדה טובה מרובה, דקרא דורדפו מכם חמשה מאה מיירי ברדיפה והריגה, ואינו בסוג אחד עם קרא דאיכה ירדוף אחד אלף דמיירי ברדיפה ולא בהריגה בזמן דקאי על אוה\"ע הרודפים. ותו לק\"מ קו' המפרשים על תירוץ התוספות מהא דאי' במו\"ק שהיה דוד יורה חץ והורג ח' מאות חלל בב\"א, והיה מתאנח על מאתים דכתיב איכה ירדוף א' אלף, דהא דמשני התוס' דמיירי ברדיפה ולא בהריגה היינו בזמן שהכתוב מתפרש על אוה\"ע הרודפים וישראל הנרדפים, משא\"כ בזמן שישראל זוכין ומקרא זה הוא יעוד והבטחה שירדוף א' מישראל אלף מן האומות, אזי משמעות הפסוק רדיפה והריגה."},{"passage_id":"vayikru2_6c28819b_p49","passage_content":"והנה דוד המע\"ה הוא הגבר הוקם על, והיה דורו מתוקן עד מאד, על כן היה סבור כי כבר הגיע הזמן שתתקיים בו ברכת איכה ירדוף וגו', וכיון שלא הכה אלא ח' מאות חלל בבת אחת היה מתאנת ועל כן השיבתו בת קול רק בדבר אוריה החתי, דעדיין לא נתקן הכל בשלימות, ולא זכו עדיין שיתהפך קרא דאיכה ירדוף לברכה."},{"passage_id":"vayikru2_6c28819b_p50","passage_content":"ועפ\"י מה שנתבאר בדברינו יובנו לנו דברי בעהתו\"ס עה\"ת פ' זו, שכתבו להקשות כקושית התוס' במס' סוטה, דהבטחת הטובה ורדפו מכם חמשה מאה לכאורה אינה מגעת למדת הפורענות דאיכה ירדוף א' אלף האמורה באוה\"ע, ותירצו בב' פנים הא' דאיכה ירדוף אחד אלף קאי כשישראל הרודפים ועכו\"ם הנרדפים, איכה ירדוף אחד זה שמשון שהכה אלף איש בלחי החמור. א\"נ הכא רודפים והורגים קאי, כדכתיב ונפלו אויביכם לפניכם לחרב, אבל התם יניסו כתיב אבל לא הורגין, ע\"כ. ולפי תירוץ העיון יעקב הנ\"ל נמצא דדברי התוס' האלו סתראי נינהו, דתירוץ הב' דמחלק דהכא מיירי ברדיפה ולא בהריגה לא אתי אליבא דמאן דאמר דאיכה ירדוף וגו' נאמר בישראל ואילו בתירוץ הא' מוקי קרא דאיכה ירדוף בישראל. ולא מסתברא למימר הכי שיתרצו התוס' כ' תירוצים חד למאן דמוקי קרא דאיכה ירדוף בישראל, והב' לאידך מ\"ד ולא יכתבו בהדיא דתליין בפלוגתא. ולדברינו ניחא דלא פליגי כלל דהא והא איתנייהו, דמקרא זה נדרש על ישראל, אלא שח\"ו אם לא זכו קאי על אוה\"ע, וא\"כ ב' התירוצים שכתבו התוספות יכונו יחד ואין כאן סתירה כלל. ובזה מיושב גם מה שמקשים על התוספות דאי מיירי ברדיפה בלא הריגה היה ראוי שיכתוב איכה יניס א' אלף, ומדכתיב ירדוף משמע דעל עסקי נפשות באו. ולדרכנו יובן דבאמת אוה\"ע באים על עסקי נפשות, ורצונם לעקור את הכל, אלא דהקב\"ה מצילנו מידם, ובעזרתו ית' מוצאים הזדמנות לברוח ולהנצל."},{"passage_id":"vayikru2_6c28819b_p51","passage_content":"תמצית הדברים דמפרשה זו נמצינו למדים ענין התהפכות הפעולות לפי המעשים, דמקרא זה עצמו משמש פעמים בתורת פורענות לישראל, ופעמים להיפך שתחול אותה הפורענות על שונאיהם. ומובנים בזה היטב דברי המדרש אם זכיתם הריני הופך לכם קללות לברכות אימתי כשתשמרו תורתי (קושיא ג'). כי עצם הקללות עצמן חוזרות ומתהפכות לברכות, במה שהם מתרגשות ובאות על ראש אויבי ישראל, דאין מדה\"ד חוזרת בריקניא, אלא שבזכות ישראל ניטלת החימה מהם ונתנת על שונאיהם."},{"passage_id":"vayikru2_6c28819b_p52","passage_content":"ובבחינה זו נל\"פ כוונת הפיטן בזמר לכה דודי מקדש מלך עיר מלוכה קומי צאי מתוך ההפיכה, דלכאורה צ\"ב וכי היכן מצינו שארץ ישראל נהפכה, ואף שאמה\"כ בפרשת נצבים גפרית ומלח וגו' כמהפכת סדום ועמורה אדמה וצבויים אשר הפך ה' באפו ובחמתו. כבר ביארנו (עיין פ' וירא ע' תל\"ו) על פי דברי הרמב\"ן ז\"ל פ' וירא כי משפט סדום היה למעלת ארץ ישראל, כי היא מכלל נחלת ה' ואינה סובלת אנשי תועבות וכו', וראה הקב\"ה שיהיה לאות לבני מרי לישראל העתידים ליורשה, כאשר התרה בהן גפרית ומלח שריפה כל ארצה כמהפכת סדום ועמורה אדמה וצבויים וגו', כי יש באומות רעים וחטאים מאד ולא עשה להם ככה אבל למעלת א\"י הכל כי היכל ה' המה, עכלה\"ק. ולפי זה אין הכוונה בדברי הכתוב כמהפכת סדום ועמורה וגו' שיהיה העונש לישראל שוה לעונש סדום ועמורה, דכשם שנהפכה סדום כן תהפך ארץ ישראל בזמן שיחטאו, אלא שהכתוב מתרה את ישראל על חומר העונש הצפוי לאותם החוטאים בארץ ישראל, ועל כן אמר כמהפכת סדום ועמורה וגו', שזה הוא אות לבני מרי כמה חמור פגם העבירות הנעשים בארץ ישראל, דאינו דומה עונש המורד במלך בפלטרין שלו לעונש המורד חוץ לפלטין. ולפיכך עליהם להזהר מאד שלא למרוד בהקב\"ה בזמן שהם יושבים על אדמתן, כי אז יגדל עוונם כפלי כפלים. אך אין הפי' בדברי הכתוב שיהיה עונשן דומה לעונש סדום במכוון, דכמה דרכים למקום להענישן באופנים שונים ולא בהפיכת הארץ דייקת וא\"כ צריך להבין כוונת השיר קומי צאי מתוך ההפיכה, והרי א\"י לא נהפכה."},{"passage_id":"vayikru2_6c28819b_p53","passage_content":"אכן לדרכנו אפ\"ל דה\"פ שכל הפורענות שבאו על ישראל הם מפני שלא זכו ונתקיימה בהם התוכחה אשר הוזהרו עליה בתוה\"ק, אמנם כאשר יזכו ישראל ויעשו תשובה שלימה, ישוב הקב\"ה לרחם עליהם ולהסיר מעליהם חרון אפו, ואז כל התוכחות שהיו אמורות לבוא על ישראל יתהפכו לטובה, ויחולו על ראש האומות המעיקים לישראל. לזאת אמר מקדש מלך עיר מלוכה שנחרבה בסיבת עוונות ישראל שגרמו להביא עליהם את כל האלות בצירוף אתוון לרע להם, קומי צאי מתוך \"ההפיכה\", כלומר מתוך מה שיתהפכו התוכחות עצמן לטובה, שיסורו מעל ישראל וינתנו על האומות."},{"passage_id":"vayikru2_6c28819b_p54","passage_content":"והיינו טעמא דמילתא שפרשת התוכחה מסתיימת אלה החוקים וגו' אשר נתן ה' בינו ובין בני ישראל בהר סיני \"ביד משה\". דאחר שהודיע הכתוב את כל התוכחות העלולות לבא על ישראל אם יחטאו, חזר וגילה כי בכח הצדיק לחזור ונהפכן לברכות, וז\"ש \"ביד משה\" כי ברשותו הדבר מסור לשנותן ולהפכן על האומות."},{"passage_id":"vayikru2_6c28819b_p55","passage_content":"וזה אפ\"ל גם בדברי הכתוב (תהלים קמ\"ט) יעלזו חסידים וגו' רוממות אל בגרונם וחרב פיפיות בידם לעשות נקמה בגוים וגו',  לעשות בהם משפט כתוב. דלכאורה יל\"ד מה הכוונה במ\"ש משפט \"כתוב\", ומאי נפק\"מ בין אם המשפט כתוב או אינו כתוב. ונראה דה\"פ דאפילו משפט שהיה כתוב בתוה\"ק על ישראל לרעה בכח הצדיקים יתהפך אותו משפט ויחול על ראש האומות, לעשות נקמה בגוים תוכחות בלאומים."},{"passage_id":"vayikru2_6c28819b_p56","passage_content":"ובדרך זו יתבארו באופן אחר דברי המד\"ר הנ\"ל בקושיא א') הה\"ד חשבתי דרכי וגו' אמר דוד בכל יום הייתי מחשב למקום פלוני אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות. והכוונה שהיה דהמע\"ה מתיעץ מה לעשות כדי להתגבר על אויבי ישראל המצירים להם, והיה מעלה על לבו לעסוק בתכסיסי מלחמה כדי להתגבר עליהם, ולפיכך אמר למקום פלוני ולבית פלוני אני הולך ללמוד עכסיסי מלחמה, כי בתחבולות יעשה לו מלחמה. אבל בסופו של דבר היו רגליו מביאות אותו לבית המדרש, וכמו שאמרו ז\"ל השכם והערב עליהם לביהמ\"ד והן כלין מאליהם, דגדול כחו וזכותו של הצדיק להפוך כל התוכחות על ראש שונאי ישראל, ואין לו צורך בעשיית שום פעולה בידים, דבזכות התורה ועבודת ה' יתהפכו מעצמן להנתן על ראש האומות."},{"passage_id":"vayikru2_6c28819b_p57","passage_content":"אכן דבר זה שיהא בכח תפלת הצדיקים להסיר הקללות מעל בני ישראל ולהפכן על ראש האומות אינו מסור אלא ביד הקב\"ה לבדו, שהוא היודע אם תועיל תפלתו וזכותו של הצדיק לבטל רוע הגזירה. וכמו שכתב בספה\"ק נועם אלימלך פ' ויחי לפרש מאמר רחב\"ד בברכות (דף ל\"ד ע\"ב) אם תפלתי שגורה בפי יודע אני שהוא מקובל ואם לאו וכו',  ותו\"ד דהאם יתכן ח\"ו שינוי בדעת יוצר בראשית, וכיצד מועלת התפילה להעביר הגזירה. אלא שאם נרשם כך מתחלת הבריאה שתועיל תפלת הצדיק רק באופן זה מועלת התפלה וכר. וז\"ש רחב\"ד אם תפלתי שגורה, ר\"ל התפילה הזאת שאני מתפלל עתה היא שגורה בפי כמו דבר רגיל שהורגל בה כבר, ומה הוא ההרגל שהיה הדבר הזה ותפלה הזאת והצדיק כולם בכח האין סוף וכו',  בידוע שהוא מקובל מחמת שהיה בכח הא\"ס ב\"ה, ואין השתטח לפניו חלילה יכו', עכתדה\"ק."},{"passage_id":"vayikru2_6c28819b_p58","passage_content":"והיוצא מזה כי ענין זה אם תועיל תפלת הצדיק להעביר רוע הגזירה ולשנותה לטוב לישראל אינו מסור אלא ביד יודע תעלומות ב\"ה, ואין בריה מכרת בכך. וז\"ש אלה החוקים וגו' אשר נתן ה' בינו ובין בני ישראל ביד משה, כלומר דדבר זה שיהא ביד משה היא הצדיק להפוך התוכחות האמורות בפרשה לטובת ישראל ולתתם על ראש האומות, הוא אשר צום ה' בינו ובין בני ישראל, ולא נודע ונגלה לשום נברא, נעלמה היא מעין כל חי, ואינו אלא ברשותו של העליון יתברך, והוא היודע אימתי יתכן שתהיה השתנות והתהפכות הגזירה לטובה."},{"passage_id":"vayikru2_6c28819b_p59","passage_content":"וכדאיתא בפתיחתא דאיכה רבתי (פתיחתא כ\"ד) שבשעת החורבן הלך ירמיה וקרא למשרע\"ה שיבא לקונן על החורבן וכו',  א\"ל משה לירמי' לך לפני שאלך ואביאם ואראה מי מניח ידו עליהם וכו'. מיד הלך משה וירמי' לפניו, כיון שהגיעו לנהרות בבל ראוהו למשה ואמרו זה לזה בא בן עמרם מקברו לפדותנו מצרינו, יצתה בת קול ואמרה משה גזירה היא שנגזרה, אמר להם בני להחזיר אתכם אי אפשר, אלא המקום יפדה אתכם במהרה וכו', ע\"כ. הרי כי אם גזירה היא שנגזרה, ולא נרשם מתחלת הבריאה שיהא בכוחו לשנות, אזי את הנעשה אין להשיב, ולא היה אף בידו של משרע\"ה לפדותן."}]},{"dvar_torah_id":"vayikru2_85a66606","title":"ברכת התוכחה בהסתר וזכות אבות","summary":"בביאור פסוק החוקים, נלמד כי התוכחות טומנות ברכות הנאמרות בלשון קללה כדי למנוע קיטרוג. זכות אבות קיימת גם בעת חטא, והקב\"ה יגאל את ישראל בזכותם, אף אם הם בגלות, והאבות יקומו לתחיה לרשת את הארץ.","contents":[{"passage_id":"vayikru2_85a66606_p1","passage_content":"עוד אפ\"ל בביאור הפסוק אלה החוקים וגו' אשר נתן ה' בינו ובין בני ישראל ביד משה, בהקדם מ\"ש ק\"ז זלה\"ה בישמח משה פ' במדבר לבאר מאמר הגמרא במו\"ק (דף ט' ע\"א) א\"ל רשב\"י לבריה הללו אנשים של צורה הם זיל גביהון דליברכוך וכו' אמרו ליה יהא רעוא דתזרע ולא תחצד תעייל ולא תיפוק וכו' הנך כולהו ברכתא נינהו תזרע ולא תחצד תוליד בנים ולא ימותו וכו'. וביאר עפי\"מ דאי' בזוה\"ק (בראשית ר\"ט ע\"ב) דברכה ותפלה בהסתר עדיף לצד שלא ימצאו המקטרגים מקום להסעין ולעכב הברכה והתפלה מלעבור. וכמו כן הם אמרו ברכתם בהסתר דהיינו בלשון קללת כי היכי דלא יוכלו המקטרגים לעכב הברכת דהמלאכים אינם יודעים מחשבות שבלב האדם, כמ\"ש התוס' (ברכות ג' ע\"א) בטעם שנתקן קדיש בל' ארמי שלא יבינו המלאכים. וכיון דאמרו ברכתם בל' קללה, אלא שמחשבתם היתה לברך לא יבואו המקטרגים לעכב ברכתו, שהרי אינם יודעים שיש כאן ברכה שיקטרגו עליו. אך אליה וקוץ בה דא\"כ שהברכה בהסתר אין מלאכי השרת נזקקין להכניס התפלה והברכה, דשורש הברכה היא תפלה שמתפלל על זה האדם שהיה לו כך וכך, וכיון דמלאכי רחמים הממונים על התפלות סוברים דקללה היא, אינם מכניסים התפלה להעלותה עד כסא הכבוד. אכן במקום שהשכינה שורה על המברך אין צורך למלאכים מכניסי התפלת וכהא דמשני גמרא במס' שבת (דף י\"ב ע\"ב) שאני חולה דשכינה עמו. והנה אנשים של צורה היינו צלם אלקים ושכינה שורה עליהם, ולכך בירכו אותו בהסתר שהוא טוב מצד שאין קיטרוג, ולא יזיק מה שלא יזדקקו המלאכים, דהא א\"צ למלאכים מאחר שהשכינה שורה עליהם, עכת\"ד ק\"ז זלה\"ה עיי\"ש שהאריך."},{"passage_id":"vayikru2_85a66606_p2","passage_content":"ועפ\"י זה יתבאר הכתוב כמין חומר, אלה החוקים וגו' הם דברי התוכחות האמורות בענין, שטמונות בהם בהסתר ברכות וישועות, אלא שהם נאמרות בלשון קללת כדי שלא יבינו המקטרגים ולא יוכלו לעכבם מלעלות. וז\"ש אשר נתן ה' בינו ובין בני ישראל, כלומר שאותם הברכות הגדולות הנכללות בתוכחה זו בהעלם נתנם ה' בינו ובין בני ישראל, היינו שיעלו ויגיעו אלו הברכות והתפלות מאת בני ישראל עד כסא הכבוד, בלי אמצעות מלאכי רחמים המעלים ומביאים התפלות, שהרי אינם מבינים הברכות הטמונות בהם בהסתר. וגמר אומר ביד משה כלומר כיצד יוכלו התפלות לעלות למעלה עד כסא הכבוד בלי מלאכי רחמים משרתי עליון המכניסים תפלותיהם של ישראל לפני הקב\"ה, \"ביד משה\" הם הצדיקים האמיתיים שהשכינה שורה עליהם, שיש בכחם להעלות התפלות לפני הקב\"ה, ואינם נזקקים למלאכים שהרי שכינה עמהם."},{"passage_id":"vayikru2_85a66606_p3","passage_content":"ועתה נבוא לבאר הסתירות הנמצאות בדבריהם ז\"ל בענין אם זכות אבות קיימת או תמה זכות אבות (קושיא יו\"ד). וכבר אמרנו בישוב ענין זה כמה בחינות, וכעת נראה לומר בדרך אחר. דכל מה דפליגי אמוראי אי תמה זכות אבות אם לאו לא שייכא כלל היכי דזכותן מתבקשת לצורך הגאולה, דלענין הגאולה כולי עלמא מודו דזכות אבות קיימת, והיא תעמוד לישראל להוושע במהרה תשועת עולמית ואין זה נכנס בגדר אותה פלוגתא אי תמה זכות אבות. וביאור הדברים דהנה רש\"י ז\"ל כתב בפרשת וארא במאה\"כ ושמי ה' לא נודעתי להם, לא נכרתי להם במדת אמתית שלי שעליה נקרא שמי ה' נאמן לאמת דברי שהרי הבטחתים ולא קיימתי. והקשו המפרשים ז\"ל שהרי עדיין לא הגיע זמן קיום ההבטחה, וא\"כ מה זה שאמר הבטחתים ולא קיימתי, הלא כשיגיע המועד לקיום ההבטחה ודאי יקיים הבוי\"ת הבטחתו (ועי' ברמב\"ן שם)."},{"passage_id":"vayikru2_85a66606_p4","passage_content":"אכן הנה איתא בגמרא (סנהדרין דף צ' ע\"ב) מנין לתחיית המתים מן התורה שנאמר וגם הקימותי את בריתי אתם לתת להם את ארץ כנען לכם לא נאמר אלא להם מכאן לתחיית המתים מן התורה, ע\"כ. ופירש\"י ז\"ל לכם לא נאמר אלא להם דמשמע שהבטיח הקב\"ה לאבותינו אברהם יצחק ויעקב שיתן להם ארץ ישראל וכי להם ניתנה והלא לבניהם ניתנה אלא מלמד שעתידין לחיות ועתיד הקב\"ה ליתן להם את ארץ כנען, עכ\"ל. וביארנו הדברים (לעיל פרשת וארא ע' קצ\"ו) עפ\"י דברי היפ\"ת בשם העקרים דשתי תחיות הם לעת\"ל, תחיה ראשונה תהיה בימות המשיח לצדיקים גמורים, כדי להקנותם שלימות גדול שלא יכלו לקבל תחילה, ולפרסם בעולם כוחו וגדולתו של הקב\"ה. והתחיה הב' תהיה אח\"כ הוא התחיה הכללית ביום הדין הגדול, עיי\"ש שיישב בזה כמה סתירות בדבריהם ז\"ל בענין זמן תחה\"מ. ובספרי ויוא\"מ (מאמר א' סי' נ') כתבתי דתחי' הראשונה תהיה לפני ביאת המשיח, וכדאיתא במד\"ר פרשת עקב שא\"ל הקב\"ה למשרע\"ה חייך כשאביא להם את אלי' הנביא שניכם באים כאחת. וא\"כ בעת שיבוא אליהו לבשר בשורת הגאולה לפני ביאת משיח יקום משרע\"ה לתחי' ויבא אתו עמו, ועמהם יחד האבות הקדושים אשר יקומו באותה תחי', יעיי\"ש. וא\"כ מה שאמר הכתוב לתת להם את ארץ כנען, שהוא הבטחה לאבות הקדושים שתנתן להם ארץ ישראל לעתיד, היינו בזמן התחיה הראשונה שאז יקומו האבות הקדושים, דאילו בתחי' השניה שתהיה אחרי ביאת המשיח אין צורך עוד לרשת את ארץ ישראל, שהרי מלך המשיח עתיד לכבוש את כל העולם כולו."},{"passage_id":"vayikru2_85a66606_p5","passage_content":"ומכיון שבדברי הכתוב וגם הקימותי את בריתי וגו' ישנה כריתת ברית לאבות הקדושים אברהם יצחק ויעקב שתנתן להם ארץ ישראל לעת\"ל לאחוזת עולם, א\"כ אף כאשר בני ישראל חוטאים ותמה זכות אבות הקדושים, היינו דוקא לבני ישראל עצמן, שגרם החטא ואינם זכאים להנות מזכות אבות, משא\"כ האבות הקדושים עצמן ודאי שהם זכאים לתבוע זכותם הגדולה להנות ממנה לעתיד, כי לגבי עצמן לא שייך לומר שפסקה זכותם, אדרבה גדולים צדיקים במיתתן יותר מבחייהן, וכבר כרת הקב\"ה עמהם ברית שכאשר יקומו לתחיה תנתן להם הארץ. שוב מצאתי באוה\"ח הקדוש פרשה זו על הבטחת הכתוב והקימותי את בריתי אתכם וזלה\"ק, ע\"ד אומרו בפסוק אשר נשבעתי לתת לאבותיכם שהאבות עצמן יעמדו לרשת את הארץ, והוא מאמרו כאן שאותו הברית שנשבע ה' לקיים האת לעולם ועד בידם, כל המקיים תנאי הכתוב יחייהו ה' עם האבות לקיים בידו ברית הארץ לעולמי עד, עכלה\"ק."},{"passage_id":"vayikru2_85a66606_p6","passage_content":"וזה סימן בידינו לדעת כי כבר הגיע הזמן לעלות ולרשת את ארץ ישראל, כאשר יבא אליהו הנביא לבשר הגאולה, ויקומו האבות הקדושים לתחיה וילכו לאת, נלך ביחד עם האבות הקדושים לעלות לאת ישראל ולזכות בה לעו\"ע. היוצא מזה כי מפאת זאת הברית אשר נשבע ה' לאבותינו לתת להם את הארץ אנו מובטחים שעדיין זכות אבות קיימת לנו, ואין זה נכנס בגדר הפלוגתא אם תמה זכות אבות, שהרי אף למ\"ד דלישראל תמה זכות אבות, מ\"מ לאבות הקדושים בעצמם קיימת הברית שהם עתידין לעמוד בזמן התחי' וללכת לארץ ישראל, והאבות הקדושים ימאנו לבא לארץ בגפם בלי כלל ישראל, דזאת לא יתכן, ובע\"כ תעמוד זכותם הגדולה לכל ישראל שיהיו נושעים בזכותם, ויעלו יחד עמם לארץ ישראל, כדי שיקיים ה' את הברית והשבועה אשר נשבע להם. וכל מה דפליגי אמוראי אם תמה זכות אבות היינו בטרם הגיע זמן הגאולה, וישראל שרויים בגולה, והם צריכים לזכות אבות לצורך עצמם, אז איכא למ\"ד תמה זכות אבות. ואף בהא פליג ר' אחא עלייהו, וס\"ל דזכות האבות לעולם קיימת לישראל כפשוטו של מקרא, דכתיב ואף גם זאת בהיותם בארץ אויביהם לא מאסתים וגו' להפר בריתי אתם."},{"passage_id":"vayikru2_85a66606_p7","passage_content":"אמנם מה שאנו מזכירין בתפלה זכות אבות, אין זה מחמת שאנו דורשים זכות זו מצד עצמנו, אלא דכיון שכל עיקר תפילותינו ובקשותינו הם על הגאולה העתידה, דאין לנו עוד שום עצה אחרת כי אם שתהי' הגאולה השלימה ויבא משיח צדקינו, על כן אנו מזכירין זכות אברהם יצחק ויעקב אבותינו הקדושים, אשר יעמדו לתחיה ויבואו וירשו את הארץ, ולהם בעצמם ודאי שמורה ועומדת זכותם הגדולה, ויקיים ה' את בריתו אשר נשבע להם. ובזכותם נוושע אף אנו, ותחזינה עינינו בביאת משיח צדקינו, כי לא את אבותינו בלבד יגאל ה' ויביאם לרשת את הארץ, אלא אף אותנו יביא עמהם. ועל כן אנו מזכירים זכות אבות בתפלה וזכרתי את בריתי יעקב ואף את בריתי יצחק ואף את בריתי אברהם אזכור וגו', כי מקרא זה קאי על הברית אשר נשבע ה' לאבות הקדושים שירשו את הארץ לעתיד."},{"passage_id":"vayikru2_85a66606_p8","passage_content":"ובדרך זו יתבאר גם מה שאנו מוסיפין להזכיר גם סיפא דהאי קרא והארץ אזכור, דלכאורה לפי מה שכתבו המפרשים זכירת הארץ היא לרעה, שבעבור צער ועלבון הארץ יביא הקב\"ה עליהם כל העונשים הללו, וא\"כ מה מקום להזכיר זאת בתפלה (עיין קושיא י\"א). אכן לפי המבואר בדברינו לעיל באריכות דאף במקראות שמשמעותן פורענות טמונים ברכות וטובות, והדברי תלוי במעמדן של ישראל, אם יזכו יתהפכו להם לטובה, אפ\"ל דמה שאמה\"כ והארץ אזכור אף שהוא מתפרש על צד הרעה כנ\"ל, מ\"מ היינו דוקא בטרם מטא זימנא שעדיין אין ישראל ראויים להגאל, שהארץ שרויה בצער ובעלבון נורא על שמטמאין אותה, והקב\"ה זוכר צער הארץ ומעניש בעבור כן. ואז לא יתכן לפרש מאה\"כ והארץ אזכור כפשוטו, אלא הוא מתפרש לרעה ח\"ו. אבל כאשר יגיע זמן הגאולה ויקומו האבות הקדושים לתחיה ויבואו וירשו את הארץ, אז תגאל הארץ מעלבונה, כי האבות הקדושים יעבדו את השי\"ת בארץ הקדש, ויקיימו מצוות התלויות בארץ. וכתב הרמב\"ן ז\"ל (פ' אחרי) כי קיום המצוות בשלימותם הוא בא\"י שהמצוות הם משפט חלקי הארץ. וכאשר יקיימו האבות הקדושים ובני ישראל עמהם תורה ומצוות בא\"י, אזי תתרצה הארץ ותצא מעלבונה. ואז יתפרש והארץ אזכור לטובה, שכאשר יגיע זמן הגאולה יזכור ה' ברית אברהם יצחק ויעקב אשר נשבע להם להביאם לא\"י, כי הם עצמם מצפים ומשתוקקים לכך לעבוד את השי\"ת במקום הקדש, דעתה הם פטורים מתורה ומצוות דבמתים חפשי כתיב, על כן הם מחכים לזה בעבור עצמם דיפה שעה אחת של מצוות ומע\"ט בעוה\"ז מכל חיי עוה\"ב. ומלבד זאת הם מצטערים בצרותיהם של ישראל, וע\"כ אף אם אנו אין לנו זכיות די הצורך להגאל, וגם אם תמה זכות אבות מאתנו, אבל למען האבות הקדושים המצטערים בצערן של ישראל יזכור הקב\"ה זכות אבות לבניהם, כאשר יגיע הזמן הראוי לגאולה ויושיענו ויגאלנו גאולת עולמים."},{"passage_id":"vayikru2_85a66606_p9","passage_content":"וע\"ד שכתב האגרא דכלה במאה\"כ (בראשית י\"ט) ויהי בשחת אלקים את ערי הככר ויזכור אלקים את אברהם ויעל את לוט מתוך ההפיכה וגו'. פירוש דלמען אברהם הציל הקב\"ה את לוט, כדי שלא יצטער אותו צדיק אם יאבד לוט עמהם. וזש\"ה ויזכור אלקים את אברהם, שחס הקב\"ה על אאע\"ה שלא יצטער, ובעבור כך וישלח את לוט מתוך ההפיכה."},{"passage_id":"vayikru2_85a66606_p10","passage_content":"וכמו\"כ אף אם אין אנו ראויין להיות ניאותין מזכותן הגדולה של האבות הקדושים מצד עצמנו, נזכה לכך בעבור האבות עצמן שלא יצטערו בצער בניהם. וז\"ש הכתוב וזכרתי את בריתי יעקב וגו' אזי והארץ אזכור, להצילה מני עלבון. כי כאשר יזכור הקב\"ה לאבותינו את הברית ויביא אותם אל הארץ ויעבדו את השי\"ת עבודה שלימה ותמה, שלזה משתוקקת ומתאווה הארץ. וכמו שכתב הכלי יקר בפרשת בהר כי הארץ עצמה תקפיד מאד כי רצונה שיתגלגל זכות זה על ידה לחזק האמונה בה' על ידה. אז תהיה זכירת הארץ לטובה, ולטעם זה אנו מזכירין גם זכירת הארץ בתפילותינו, דאחרי שהזכרנו וזכרתי את בריתי יעקב וגו' יהיה גם והארץ אזכור לטובה. ובזה מבואר המשל דמייתי המד\"ר הנ\"ל כ\"ז שהיה המלך שואל בשלום בניו אומר שאלו לי בשלום המגדלת וכו' כך כל זמן שהקב\"ה מזכיר אבות מזכיר הארץ עמהם. דשפיר דמיין זל\"ז, כי תשוקת הארץ היא לכך שיבואו האבות הקדושים ויעסקו בה בתורה ובעבדות ה', וכן האבות הקדושים משתוקקים ומצפים ועיניהם נשואות לעבוד את ה' על אדמת הקדש, על כן כשהוא מזכיר האבות מזכיר הארץ עמהם, דאליה כל חמדתם ומשאת נפשם."},{"passage_id":"vayikru2_85a66606_p11","passage_content":"ועוד אפ\"ל בטעם שאנו מזכירין זכות אבות אפילו להנך אמוראי דס\"ל תמה זכות אבות, בהקדם לבאר מאה\"כ ואף גם זאת בארץ אויביהם לא מאסתים וגו' כי אני ה' אלקיהם. ודקדקנו דמאי נתינת טעם הוא זה כי אני ה' אלקיהם והלא ה' צ' אלקי כל הארץ יקרא. אכן בגמרא (מגילה י\"א ע\"א) איתא שמואל אמר לא מאסתים בימי יוונים ולא געלתים בימי נבוכדנצר לכלותם בימי המן להפר בריתי אתם בימי פרסיים כי אני ה' אלקיהם בימי גוג ומגוג. במתניתא תנא לא מאסתים בימי כשדים שהעמדתי להם דניאל חמ\"ו ולא געלתים בימי יוונים שהעמדתי להם שמעון הצדיק וחשמונאי ובניו ומתתי' כ\"ג לכלותם בימי המן שהעמדתי להם מרדכי ואסתר להפר בריתי אתם בימי פרסיים שהעמדתי להם של בית רבי וחכמי הדורות כי אני ה' אלקיהם לעת\"ל שאין כל אומה ולשון יכולה לשלוט בהם, עכ\"ד הגמרא. עכ\"פ מבואר מכל זה שחושב והולך כל צדיקי הדורות אשר העמיד הקב\"ה לישראל, שבזכותן המה מתקיימים בדורות הגלות, בכל המלכיות שישראל משתעבדין בהם. אבל בימי גוג ומגוג לא יהיו להם לישראל כל אותם הזכיות, אלא שיעשה הקב\"ה למענו ולמען שמו הגדול המחולל בין הגוים, ולא יעזבנו ולא יטשנו בעבור שמו הגדול הגבור והנורא שנקרא עלינו."},{"passage_id":"vayikru2_85a66606_p12","passage_content":"וכמו שפירש\"י ז\"ל בפ' נצבים עה\"פ למען הקים אותך היום לו לעם והוא יהיה לך לאלקים וגו' וכאשר נשבע לאבותיך וגו' וז\"ל, כל כך הוא נכנס לטרוח למען קיים אותך לפניו לעם והוא יהיה לך לאלקים, לפי שדבר לך ונשבע לאבותיך שלא להחליף זרעם באומה אחרת לכך הוא אוסר אתכם בשבועות הללו שלא תקניטוהו, אחר שהוא אינו יכול להבדל מכם, ע\"כ. מבואר מזה כי מאחר שבחר הקב\"ה בישראל להיות לו לעם סגולה מכל העמים, א\"כ כבוד שמים בעולם הוא ע\"י בני ישראל עמו ונחלתו של הקב\"ה, ובעבור כן יעשה הקב\"ה עמנו לעת\"ל, מפני שיקנא לשמו המחולל בגוים ע\"י שעמו ישראל נתון למשיסה בעמים מנוד ראש בלאומים. וזהו שנתן הכתוב טעה כי אני ה' אלקיהם, כי מה שירחם ה' עלינו בימי גוג ומגוג אף שלא נהיה ראויים, משום דקנאת ה' צבאות תעשה זאת, שיקנא לשמו הגדול שנקרא עלינו."},{"passage_id":"vayikru2_85a66606_p13","passage_content":"נמצא כי מה שנשבע ה' לאבותינו שלא יחליפנו ולא ימיר אותנו באומה אחרת, היא הנותנת שכבוד שמים בעולם תלוי במצב ובמעמד בני ישראל, וזולת שבועה זו אזי אילו ח\"ו לא היו ישראל ראויים היה מחליפם חלילה באומה אחרת. א\"כ גם קנאת ה' צבאות שהוא עתיד לקנאות לשמו הגדול, הוא מחמת אותה השבועה אשר נשבע לאבותינו שלא יחליפנו באומה אחרת וא\"כ אתי שפיר מה שאנו מזכירים בתפלה זכות אבות, דאף לר' יוחנן דסבר תמה זכות אבות, משום דכתיב קנאת ה' צבאו' תעשה זאת ולא זכות אבות, היינו דאין אנו ראויים עוד לזכות אבות מחמת שכבר אכלוהו בימי חזקיה, אבל מ\"מ אף קנאת ה' צבאו' תהיה מכח זכות אבות, עקב שמרו את השבועה אשר נשבע להם, שלא יחליף זרעם באומה אחרת, והבן."},{"passage_id":"vayikru2_85a66606_p14","passage_content":"ומעתה נבא ליישב פירש\"י ז\"ל בטעם דכתיב ה' פעמים יעקב מלא שנטל אות אחת משמו של אליהו לערבון שיבא לבשר גאולת בניו (קושיא י\"ב). דהנה בגמרא מגלה הנ\"ל דרשו מקרא ואף גם זאת בהיותה בארץ אויביהם וגו' ד' מלכיות שישראל עתידין להשתעבד ביניהם, ומבטיחן הכתוב דעל אף כובד הצרות לא מאסתים ולא געלתים וגו'. ומה שמסיים כי אני ה' אלקיהם הוא הפעם החמישית שמוזכר בקרא שיהיו ישראל בצרה ובשביה, בימי גוג ומגוג. והנה אף שאליהו הנביא זל\"ט הוא פקיד על כל בשורות טובות, מ\"מ בגלויות הקודמות לא מצינו שבא הוא לבשר לישראל בשורות טובות וניחומים. דבגלות בבל נתנבאו חגי זכריה ומלאכי, ובימי המן מרדכי ואסתר, אבל בשורת אליהו לא מצינו. והנה אילו היה יעקב נוטל ממנו פ\"א בלבד אות משמו לערבון, א\"כ היה מקום לחוש שיבא ויבשר הבשורה בגלות הראשון, ויצא מחיוב הערבות. וכן אילו היה לוקח ממנו ב\"פ ערבון יתכן שהיה בא ב\"פ ותו לא. על כן לקח ממנו ה' פעמים ערבון, דאף אם יבא ויבשר בכל הד' גלויות האמורות בכתוב, אכתי לא נפער מחיוב הערבות, עד כי יבא ויבשר לישראל כי כבר הגיע זמן הגאולה השלימה. וכיון שנטלו ממנו ה' פעמים ערבון נתגלה ממילא שעיקר המכוון הוא שיבא בשליחות בפעם החמישית, בטרם ביאת המשיח, וע\"כ יבא רק בפעם הה', שבעבור כן נטלו ממנו חמשה פעמים ערבון כדי שיהיה מוכרח לבא לעת הזאת, שאליו עיני כל ישראל נשואות לשמוע קול מבשר."},{"passage_id":"vayikru2_85a66606_p15","passage_content":"ועפ\"י מה שנתבאר הכתוב וגה הקימותי את בריתי אתם לתת להם וגו', שהוא הבטחה וכריתת ברית על לעת\"ל שיתן הקב\"ה את הארץ לאבות הקדושים, כדאמרינן בגמרא סנהדרין הנ\"ל. יובן לנו גם מה שאמה\"כ ושמי ה' לא נודעתי להם ופירש\"י לא נכרתי להם במדת אמיתית שלי שהרי הבטחתים ולא קיימתי. דאף מקרא זה רומז על שה העתיד, ומצינו כיו\"ב כמה מקראות שנאמרו ע\"ש העתיד (עי' כתובות י' ע\"ב). וכמו שמצינו במדרש רבה פרשת שמות דכאשר שלח הקב\"ה את משרע\"ה למצרים לגאול את ישראל הראה לו כל מה שעתיד לעבור עליהם בשעבוד ובגלות עד סוף כל הדורות. ורמז לו באמרו וגם הקימותי את בריחי אתה לתת \"להם\" את ארץ וגו', דאף אם לא יהיו ישראל ראויים ותתום מהם זכות אבות, מ\"מ יגאלם הקב\"ה בעבור האבות עצמן, שכרת הקב\"ה עמם ברית לתת להם את הארץ. ובאמת בזמנינו זה כבר היה העת והעונה אשר יאתה לגאלנו, כי כבר כלו כל הקיצים ואין הדבר תלוי אלא בתשובה."},{"passage_id":"vayikru2_85a66606_p16","passage_content":"והשתא גם מ\"ש הכתוב ושמי ה' לא נודעתי להם רומז על זמן העתיד, שכבר הגיע הזמן שהבטיח הקב\"ה לאבות הקדושים שיקומו לתחיה וירשו את הארץ, ואעפ\"כ לא ניכרתי במדת אמיתות שלי, שעדיין לא נתקיימה הבטחה זו ואנחנו לא נושענו, בסבת העוונות המעכבים. וז\"ש רש\"י ז\"ל לא נכרתי להם במדת אמיתית שלי, שהרי הבטחתים ולא קיימתי, כי יעברו רוב עתים ושנים, שלא תהיה ניכרת מדת אמיתית, היא ההבטחה שהבטיח הקב\"ה לאבותינו הקדושים לתת להם את ארץ כנען. ולהבטחה זו אנו מצפים ומקוים שתתקיים במהרה, כאשר הבטיחנו יוצרנו לא מאסתים וגו' כי אני ה' אלקיהם."},{"passage_id":"vayikru2_85a66606_p17","passage_content":"והבוכה\"ע יעזור שיתהפך הכל לטובה ולברכה, וכל התוכחות האמורות יתהפכו ויעלו על ראש שונאינו, לעשות בהם משפט כתוב. ומקדש מלך עיר מלוכה קומי צאי מתוך ההפיכה, שמתוך אותה התהפכות נוושע, ואז יבוא אליהו ועמו האבות הקדושים ויתקיים והארץ אזכור לטובה. והבוכה\"ע יעזור שנזכה בימי הספירה שסופרין הז' מדות קדושות, לתקן מה שפגמו בהם ויחזרו אל הקדושה, וממילא יתהפכו ויתוקנו כל שבע הפורעניות. והבוכה\"ע יעזור שנזכה לקבלת התורה באמת ובתמים, ונזכה שהבוכה\"ע ישמח לבבות בני ישראל, ונזכה לראות במהרה הישועה השלימה והגאולה האמיתית, בהתגלות כבוד שמים עלינו במהרה בימינו אמן."},{"passage_id":"vayikru2_85a66606_p18","passage_content":"ונתתי משכני בתוככם ולא תגעל נפשי אתכם וגו', פירש\"י ז\"ל אין רוחי קצה בכם וכו'. והקשה הרמב\"ן הקדוש וז\"ל ולא ידעתי מה הטעם בזה, שיאמר הקב\"ה כי בשמרנו כל המצוות ועשותנו רצונו לא ימאס אותנו בגעול נפשו, וכן בעברנו על בריתו ועשותנו נאצות גדולות אמר לא מאסתים ולא געלתים וכו'. אבל הענין סוד מסתרי התורה וכו',  עיי\"ש שביאר הכתוב בדרך הסוד. אמנם כלל גדול הוא דאין מקרא יוצא מידי פשוטו, וא\"כ צ\"ב לתרץ קושיית הרמב\"ן ז\"ל, וליישב המקרא גם בדרך פשוט."},{"passage_id":"vayikru2_85a66606_p19","passage_content":"ונראה דהנה מה שהקשה הרמב\"ן ז\"ל, ממה שהבטיח הכתוב אשר גם בזמן שיעברו ישראל בריתו ויעשו נאצות גדולות אעפ\"כ לא מאסתים ולא געלתים, לא קשה מידי, ויבואר עפ\"י דברי קדשו של הרמב\"ן ז\"ל עצמו בפרשת כי תבוא בסוף פרשת התוכחה וז\"ל, ודע כי התוכחה במארה וכו' ושאר כל התוכחות הם כולם עד כלותו אותך מעל האדמה אשה אתה בא שמה לרשתה, אבל אחרי הגלות לא יקלל אותו וכו', ואלה התוכחות בהיותם בארץ, אבל אחרי היותנו בגלות בארצות אויבינו לא נתקללו מעשה ידינו וכו'. כי ישיבתנו בגלות היא ההבטחה שאמר לנו ואף גם זאת בהיותם בארץ אויביהם לא מאסתים ולא געלתים לכלותם וכו', עכלה\"ק. וכ\"כ גם האה\"ח הק' בפרשה זו עה\"פ ואף גם זאת בהיותם בארץ אויביהם וגו', כדברי הרמב\"ן ז\"ל עיי\"ש. וכבר נתבאר הדבר בארוכה בספרי ויואל משה מאמר ישוב ארץ ישראל (סימן י\"ד) שכאשר רוב ישראל הנם פזורים בארצות אויביהם, וסובלים גזרת הגלות, אזי קיימת הבטחתו יתברך לשמור מכליה אף את בני ישראל היושבים בארץ ישראל, יעיי\"ש."},{"passage_id":"vayikru2_85a66606_p20","passage_content":"היוצא לנו מזה כי הבטחתו יתברך אשר גם בעברנו את בריתו אשר כרת עמנו לא ימאס בנו ולא יגעל אותנו לכלותינו, ניתנה דוקא על זמן היותנו בארצות אויבינו כבושים בגולה. וא\"כ יתירה על הבטחה זו היא הבטחת ולא תגעל נפשי אתכם, שהרי הך קרא מיירי בהיותינו בארץ ישראל, כדכתיב ברישא דקרא ונתתי משכני בתוככם, משא\"כ מה שהבטיחנו הכתוב לא מאסתים ולא געלתים לכלותם מיירי דוקא בזמן שישראל בגלות כאמור, ומיושב מה שהקשה הרמב\"ן ז\"ל."},{"passage_id":"vayikru2_85a66606_p21","passage_content":"אכן גם בלאו מה שהקשה הוא ז\"ל ממה שהבטיח הכתוב ולא מאסתים, יש מקום לתמוה טובא על מקרא זה מצד עצמו, דכיון דהכא מיירי בזמן שישראל שומרים את התורה ואת המצוות בשלימות, עד שהובטחו בכל היעודים האמורים בפ', א\"כ מדוע יעלה על הדעת שתגעל רוחו יתברך בהם, עד שהוצרך להבטיח ולא תגעל נפשי אתכם."},{"passage_id":"vayikru2_85a66606_p22","passage_content":"ואפ\"ל עפ\"י מה שכתב האה\"ח הקדוש בפרשת בהר עה\"פ כי ימוך אחיך, שאחד מן הטעמים של גזירת הגנות ולא סגי שייסרה ה' בשבט מוסר בארצם ובנחלתה, הוא כדי לברר ניצוצות הקדושה מבין הארצות שבכל העולם. ואח\"כ כתב וזלה\"ק, וא\"ת א\"כ אם לא היו ישראל חוטאים וגולים מי היה מברר המתבררים עתה בתפוצות ישראל, דע כי אם לא היו ישראל חוטאים היה להם כח לברר נצה\"ק במקום שהם מכל המקומות אשר באו שם, משא\"כ אחר חטאה דחלש כוחם ולואי שתשיג ידם במקום עצמו אשר שה הניצוצות, עכלה\"ק. ובדבריו אלו ארווחנא ליישב מה שכתב רש\"י ז\"ל עה\"פ והשימותי אני את הארץ וגו', וז\"ל, זו מדה טובה לישראל שלא ימצאו האויבים נחת רוח בארצם וכו'. וכתב הר\"א מזרחי ז\"ל דאין לומר שרש\"י כתב כן כדי ליישב שלא יהיה כאן יותר משבע פורעניות, וכמאה\"כ ויסרתי אתכם אף אני שבע על חטאתיכם, דא\"כ תקשה לך ממה דכתיב ואתכם אזרה בגויים דהיא מדת פורעניות, א\"כ בלא והשימותי איכא שמנה פורעניות, אלא בע\"כ שאין הפסוק מקפיד אם נשלם מספר שבע פורעניות ומוסיף עליהם עוד פורעניות אחרים. אבל רש\"י כתב כן לקושטא דמילתא, שהיא מדה טובה שלא ימצאו האויבים נחת רוח בא\"י, ע\"כ. אמנה לפי דברי האה\"ח הקדוש הנ\"ל, שפיר יש לומר דכוונת רש\"י ז\"ל במ\"ש זו מדה טובה לישראל היא ליישב דלא להוי יתר על שב פורענותא. ומה שהקשה המזרחי ז\"ל מן הכתוב ואתכם אזרה בגויים דאף היא מדת פורענות לק\"מ, דאף זו מדה טובה היא לישראל אחרי שחטאו ואין בכוחם לברר ענפי הקדושה ממקומם, ע\"כ עליהם להיות נזרים בין הגויים, למען תשיג ידם לשאוב ולהעלות נצה\"ק בכל מקום בו המה אסורים ולכודים. וכיו\"ב מצינו מפורש בדברי חז\"ל כי הגלות מדה טובה היא לישראל, שדרשו (פסחים פ\"ז ע\"ב) עה\"פ צדקות פרזונו בישראל (שופטים ה') צדקה עשה הקב\"ה עם ישראל שפזרן לבין האומות."},{"passage_id":"vayikru2_85a66606_p23","passage_content":"ועפ\"י דברי האה\"ח הקדוש הללו יתבאר מה שהוצרך הכתוב להבטיח ולא תגעל נפשי אתכם, בזמן שישראל משמרין את התורה והמצוות, דאי לאו קרא הו\"א דאף אם אין ישראל חוטאין צריכים הם ללכת בגולה למען יתבררו ענפי הקדושה הזרויים בארצות תבל. ולזאת באה הבטחתו יתברך ולא תגעל נפשי אתכם, כלומר שלא יוצרכו לגלות מארץ ישראל בעבור כן, אלא אם חפץ ה' בנו ויהיו מעשינו רצויים לפניו, אזי כח הקדושה יהיה חזק מאד למשוך ולשאוב כל נצוצות הקדושה מכל מקום שהם, ולא יהיה צורך לגלות בראש גולים, כמ\"ש האה\"ח הקדוש."}]},{"dvar_torah_id":"vayikru2_c62cf6a5","title":"זכות הדורות הראשונים וביאת הארץ","summary":"הכתוב רומז על ביאת הארץ לעתיד לבוא, בזכות קיום מצוות ביכורים. גם אם ישראל יחטאו, זכות הדורות הראשונים תעמוד להם. הבטחת ה' שלא יגעל את בני ישראל נובעת מעבודת אבותיהם בשלמות.","contents":[{"passage_id":"vayikru2_c62cf6a5_p1","passage_content":"או יאמר לבאר אומרו ולא תגעל נפשי אתכם, בהקדם מאה\"כ והיה כי תבא אל הארץ אשר ה' אלקיך נותן לך נחלה וגו' ולקחת מראשית כל פרי האדמה וגו'. ובספרי שם איתא עשה מצוה זו שבשבילה תכנם לארץ, והקשו המפרשים ז\"ל שהרי מצות ביכורים אינה נוהגת כי אם לאחר ירושה וישיבה, וא\"כ כיצד שייך לומר שבזכות קיום מצוה זו יהיו נכנסים לארץ ישראל, בעוד שבהכרח תקדם הכניסה לארץ ישראל לקיום מצות ביכורים. גם אומרו והיה צ\"ב דהו\"ל כי תבא אל הארץ ותו לא."},{"passage_id":"vayikru2_c62cf6a5_p2","passage_content":"ונל\"פ ע\"ד מ\"ש הסה\"ק דהכתוב הלזה רמז על ביאת הארץ לעת\"ל, וז\"ש \"והיה\" לשון שמחה כי תבא אל הארץ אשר ה' אלקיך נותן לך היינו לעתיד לבא אחרי ביאת המשיח שאז תהיה ביאת הארץ בשלימות ותהיה השמחה השלימה האמיתית. וכלפי ביאת הארץ לעתיד לבא דרשו ז\"ל בספרי עשה מצוה זו שבשבילה תכנס לארץ, כי זכות התורה והמצוות שעבדו ישראל את השי\"ת בהם בזמן שבית המקדש היה קיים לעד עומדת, והיא שתעמוד לדורות האחרונים לזכות לביאת הארץ לעת\"ל, כי עבודתן של דורות הראשונים קיימת לנצח לפני הבוי\"ת, להועיל לבניהם אחריהם עד סוף כל הדורות."},{"passage_id":"vayikru2_c62cf6a5_p3","passage_content":"ועל פי זה אפ\"ל גם מה שאמר הכתוב ולא תגעל נפשי אתכם, דאחרי שהפרשה הזאת מדברת בזמן שישראל עושים רצונו של מקום בשלימות הגמור, כאמור בתחלת הפרשה אם בחקותי תלכו ואת מצותי תשמרו, על כן הבטיחנו הכתוב כי זכות זה ששמרו ישראל את התורה והמצוות בשלימות תעמוד לבני ישראל לדורות עולם, וגם אם בדורות שלאחריהם יהיו ישראל מכעיסין לפניו, מ\"מ בזכות הדורות הראשונים שעבדו את השי\"ת באמת ובלב שלם לא תגעל רוחו יתברך את בני ישראל. והשתא הבטחת ולא תגעל נפשי אתכם היא המקור והשרש להבטחת ואף גם זאת בהיום בארץ אויביהם לא מאסתים ולא געלתים וגו'. שהרי כל מה שהבטיח הקב\"ה שלא יגעל אותנו ולא ימאסנו, הוא בעבור זכות הדורות הראשונים."}]},{"dvar_torah_id":"vayikru2_c48ab9b7","title":"הבטחת הגאולה הנצחית בישראל","summary":"הגאולה העתידה תהיה נצחית, בניגוד לגאולות הקודמות, ותתרחש בזכות הקב\"ה בלבד. הכתוב מבטיח שלא תגעל נפשו את ישראל, שכן לא יהיו עוד חטאים שיגרמו לגלות ויסורים.","contents":[{"passage_id":"vayikru2_c48ab9b7_p1","passage_content":"עוד יאמר לפרש מאה\"כ ולא תגעל נפשי אתכם, עפ\"י דברי הרמב\"ן ז\"ל עה\"פ והתהלכתי בתוככם וזלה\"ק, ודע כי לא השיגו ישראל מעולם לברכות האלו בשלימותן לא הרבים ולא היחידים מהם וכו', וע\"כ תמצא לרז\"ל שיזכירו בפסוקים אלו לעתיד לבא וכו',  עכ\"ל הקדוש. עכ\"פ כל הברכות האלו מיועדות להתקיים אחרי ביאת המשיח. ולזאת הוצרכו ישראל להבטחת ולא תגעל נפשי אתכם. דהנה בגאולות הקודמות אף שהיו ישראל לפי שעה ברום המעלה בתוקף ובעוז, מ\"מ לא היו גאולות אלו נצחיות, ולא ארכו הימים עד שגרמו העוונות שגלו מארצם. לא כן הגאולה העתידה שתהיה גאולה נצחית, ולא תהיה אחריה גלות עוד, ומה\"ט ארך הגלות הזה מכל הגליות הקודמות, מכיון שתהיה הגאולה הנצחית ע\"י הקב\"ה לבדו, ולזה צריך אריכות זמן כמ\"ש ק\"ז זלה\"ה בישמח משה ס\"פ שופטים במאה\"כ (ישעיה נ\"ב) כי לא בחפזון תצאו ובמנוסה לא תלכון כי הולך לפניכם ה' ומאסיפכם קדוש ישראל עיי\"ש."},{"passage_id":"vayikru2_c48ab9b7_p2","passage_content":"וזהו שהבטיח הכתוב ונתתי משכני בתוככם ולא תגעל נפשי אתכם, פירוש שלעת\"ל תהיה התגלות שכינתו יתברך בתוקף רב כ\"כ, שתהיה הגאולה נצחית וישכון בתוכנו לעד לעולם. וז\"ש ולא תגעל נפשי אתכם, שלא יהיו עוד חטאים בעולם שיגרמו לגליות ויסורין, כמו שהיה אחרי הגאולות הקודמות."}]},{"dvar_torah_id":"vayikru2_96ecb334","title":"כפל הלשון בשממת הארץ","summary":"בפרשת הגלות והחורבן, הכתוב מדגיש את השממה שתהיה בארץ ישראל אם ישראל לא יקיימו את השבועות. הכוונה היא להזהיר את ישראל לא למהר לשוב, אלא להמתין לגאולה האמיתית, אחרת הבניינים שנבנים על יסוד מינות יחרבו.","contents":[{"passage_id":"vayikru2_96ecb334_p1","passage_content":"והשימותי אני את הארץ ושממו עליה אויביכם היושבים בה ואתכם אזרה בגוים והריקותי אחריכם חרב והיתה ארצכם שממה ועריכם יהיו חרבה. יל\"ד מה שכפל הכתוב ב\"פ שהארץ תהא שממה, דפתח לומר והשימותי אני את הארץ ואח\"כ חזר ואמר והיתה ארצכם שממה וגו'. ומדברי רש\"י ז\"ל נראה שרוצה ליישב כפל הלשון שכתב על אומרו והיתה ארצכם שממה שלא תמהרו לשוב לתוכה, ומתוך כך עריכם יהיו חרבה נראות לכם חרבות, שבשעה שאדם גולה מביתו וכו' וסופו לחזור כאילו אין כרמו וביתו חרבים, כך שנויה בת\"כ. אך אכתי לא סגי בהכי ליישב כפל לישנא דקרא, שהרי ממה שאמר הכתוב בתחלת דבריו והשימותי אני את הארץ כבר שמענו שלא ימהרו ישראל לחזור אליה, דאל\"כ אין זו שממה. ותו צ\"ב מה שכתב רש\"י ז\"ל שלא תמהרו לשוב לתוכה וכו', האם על הגלות המר והארוך הזה שייך לומר שלא נמהר לחזור לארץ, הלא בעוה\"ר כבר עברו קרוב לאלפיים שנה מעת שגלינו מארצנו ונתרחקנו מעל אדמתינו, ואנחנו לא נושענו, ואין שייך לכנות זמן ארוך כ\"כ בגדר חסרון מהירות בלבד."},{"passage_id":"vayikru2_96ecb334_p2","passage_content":"ונראה לבאר הענין בהקדם דברי האה\"ח הקדוש עה\"פ ואתכם אזרה בגוים וגו' וזה לשונו, יתבאר ע\"ד אומרם ז\"ל (כתובות קי\"א ע\"ב) שהשביע ה' את ישראל ג' שבועות א' שלא יעלו בחומה פירוש ביד חזקה וא' שלא ימרדו באוה\"ע וכו', ע\"כ. והוא מאמר ואתכם אזרה בגוים, כאן רמז לב' דברים באומרו אזרה שלא יעלו בחומה בגוים ושלא ימרדו בגוים. ואומרו והריקותי אחריכם חרב יתבאר ע\"ד שאמרו שם א\"ל הקב\"ה לישראל אם אתם מקיימין השבועה מוטב ואם לאו אני מתיר בשרכם כצבאות וכאילות השדה, והוא אומרו והריקותי אחריכם חרב, שתהיה חרב מרוטה לפניכם אם לא תקיימו גזירת זירוי בגוים כנזכר וכו', עכלה\"ק. ולפי דבריו הקדושים נראה שהכתוב מדבר בשתי ענינים נפרדים, דרישא דקרא דכתיב והשימותי אני את הארץ וגו' מיירי בחורבן בית המקדש, שהארץ היתה לשמה מאין יושב. אכן מה שחזר הכתוב ואמר והיתה ארצכם שממה אחרי אזהרת והריקותי אחריכם חרב, שענינה עונש חרב מרוטה אם לא ישמרו ישראל את ג' השבועות, וידחקו את הקץ קודם זמנו, כאן רמז הכתוב על ענין אחר. והוא עפ\"י מה שהבאנו בארוכה בפרשת מצורע דברי הזה\"ק (מצורע נ' ע\"א) שנתן טעם לגזירת נגעי בתים משום דכל בית שנבנה לשם עבודה זרה או שהיתה במחשבת בוניו כוונה לעבודה זרה שורה עליו רוח מסאבא, ועלול הוא להזיק את ישראל הבאים לדור באותו בית. ולפיכך כל מי שבונה בית צריך להזכיר בפיו בתחלת בנינו שהוא בונהו לשם השי\"ת, ועי\"ז הוא משרה עליו רוח קדושה, את\"ד הזה\"ק. (ועיי\"ש מה שכתבנו ליישב בכמה אנפי שלא יסתרו דברי הזה\"ק עם המבואר בגמרא ובמדרשות שנגעי בתים בשורה עובה הם לישראל)."},{"passage_id":"vayikru2_96ecb334_p3","passage_content":"ואם כך אמור ענין זה, שמחשבת בוני הבית בלבד משרה רוח הטומאה על אותו בית, א\"כ ק\"ו בן בנו של ק\"ו כי כל בניני הרשעים ההם, העוברים על השבועות שהשביע הקב\"ה את ישראל, שלא ידחקו את הקץ וכו',  ושלא ימהרו לשוב מעצמם בטרם יהיה רצון העליון לגאלנו, והמה עלו בחומה ומרדו באומות ובונים להם בנינים בארץ ישראל, ודאי שרוח הטומאה שורה על כל אותם הבנינים, וכולם עתידין להחרב, מק\"ו מספר תורה שכתבו מין שצריך לשרפו על האזכרות שבו, כמבואר בגמרא (שבת קט\"ז ע\"א). והרמב\"ם ז\"ל בהלכות יסודי התורה (פ\"ו ה\"ח) כתב הטעם שמצוה לשרפו כדי שלא להניח שם לאפיקורסים ולא למעשיהם. ושם מיירי בס\"ת שנכתב כדין, ולא חידש בו המין שום אות ותג מדעתו, כי אם העתיקו מס\"ת כשרה שכל הכתוב בה נמסר לנו מסיני, ואפ\"ה נצטוינו לשרפו בעבור שהוא מעשי ידי המין, ועלינו להכחיד מארץ זכרו ולא להניח שם לפעולתו כלל. ועאכו\"כ שכל אותם הבנינים שהמה מקימים לחזק בהם את ידיהם, ולהגביר פעולות המינות והאפיקורסות שלהם, וההעברה על השבועות, ודאי הדבר שבעת ביאת משיח צדקינו כולם יחרבו ויאבדו, כלה ואבד עד בלתי השאיר מהם כל שריד."},{"passage_id":"vayikru2_96ecb334_p4","passage_content":"ובזה מבואר היטב כפל הכתוב שפתח לומר והשימותי אני את הארץ, ואח\"כ חזר ואמר והיתה ארצכם שממה, דפסוק ראשון מדבר מחורבן ביהמ\"ק וחורבן הארץ שנבנו בכח הקדושה, אלא שגרמו העוונות להחריבן, והארץ היתה לשממה. ואח\"כ אמר הכתוב ואתכם אזרה בגוים והריקותי אחריכם חרב, וכפירוש האה\"ח הקדוש שאם לא תקיימו גזירת זירוי בגוים ותדחקו את הקץ תהיה חרב מרועה לפניכם, וכאשר היה בזמנינו בדור הזה בעוה\"ר אשר קמו מינים ואפיקורסים ועברו על כל ג' השבועות שהשביע הקב\"ה את ישראל, והקימו להם ממשלת זדון, ובונים להם בנינים בארץ ישראל, על אלו אמר הכתוב והיתה ארצכם שממה ועריכם יהיו חרבה, שכל אותם הבנינים שנבנו על יסוד המינות והכפירה כולם יחרבו ולשממה יהיו בעת ביאת המשיח, ולא ישאר להם כל זכר בעולם, כדאמרן מק\"ו מן הבתים שבנו האמוריים לשם ע\"ז, ששלח הקב\"ה נגעים עליהם לסתרם, וכ\"ש מינות שחמור יותר מע\"ז כידוע מדבריהם ז\"ל, ודאי שהארץ תהיה שממה מכל אותם הבנינים, ולא יוותר כל שריד ופליט מהם."},{"passage_id":"vayikru2_96ecb334_p5","passage_content":"וזהו שמדייק רש\"י הקדוש בלשון הזהב שלו, והיתה ארצכם שממה שלא תמהרו לשוב לתוכה וכו', דהרי זו כאזהרה לישראל שיסבלו גזירת הגלות וימתינו על הזמן האמיתי אשר נקבע בגזירת יוצר בראשית, ולא ימהרו לדחוק את הקץ, וזהו הזכות היחידי שנוכל לזכות על ידו אל הגאולה, כאשר הבאנו כמ\"פ דברי הילקוט פ' בא שבזכות נטרונא נזכה אל הגאולה השלימה, בב\"א."},{"passage_id":"vayikru2_96ecb334_p6","passage_content":"R"}]}]
