[{"dvar_torah_id":"vayikru1_f1f1b9f1","title":"זירוז בעולה וחשיבות נקיות כפיים","summary":"בפרשת העולה יש זירוז לקיום מצוות, במיוחד במקום חסרון כיס. המדרש מדגיש את הצורך בנקיות כפיים מעוון גזל, כי רק כך יתקבל הקרבן. לימוד תורת העולה נחשב כהקרבה, אך רק אם ידיו נקיות.","contents":[{"passage_id":"vayikru1_f1f1b9f1_p1","passage_content":"וידבר ה' אל משה לאמר צו את אהרן ואת בניו לאמר זאת תורת העולה וגו'. פירש\"י ז\"ל אין צו אלא לשון זירוז מיד ולדורות אמר ר''ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, ע''כ. ונחלקו המפרשים ז''ל בפירוש דברי ת''ק דאמר אין צו אלא לשון זירוז, מקצתם פירשו דתנא קמא לא ס''ל כר\"ש שהזירוז הוא משום שיש בה חסרון כיס, אלא שהזירוז הוא לדורות. וקשה מה נשתנתה פרשת עולה שהוצרך הכתוב לזרז בה שיקיימוה לדורות, יותר מבשאר מצות התורה, והלא התורה כולה היא נצחיית. וגם לדברי ר''ש דאמר שבא הכתוב לזרז משום שיש בה חסרון כיס קשה, שהרי איכא נמי מצוות אחרות שיש בהם חסרון כיס כגון אתרוג וכיו''ב, ולא נאמר בהם לשון זירוז, ולמה זירז הכתוב בפרשת העולה יותר מבכולן."},{"passage_id":"vayikru1_f1f1b9f1_p2","passage_content":"ב) במדרש תנחומא (סי' א') איתא וז''ל ד''א וידבר ה' וגו' צו את אהרן ואת בניו אמר הקב''ה קיימו מה שכתוב למעלה מן הענין ואח''כ זאת תורת העולה למה כי אני ה' אוהב משפט שונא גזל בעולה (ישעיה ס''ח) אפילו בעולה מה כתיב למעלה מן הענין (ויקרא ה כ''ג) והיה כי יחטא ואשם והשיב את הגזלה אשר גזל וגו' ואח''כ זאת תורת העולה וכו' ואימתי אתה מעלה עולה ואני מקבלה כשתנקה כפיך מן גזל מה היא הגזל דוד אמר מי יעלה בהר ה' ומי יקום במקום קדשו נקי כפים ובר לבב (תהלים כ''ד) זאת תורת העולה מי שהוא נקי כפים מן הגזל הוא יעלה בהר ה' וכו' עכ''ל. ויש להפליא על דברי המדרש אשר שואל מה הוא הגזל, ואין אלו אלא דברי תימה, הכי לא ידע מה היא הגזל. וגם צריך ביאור שהשיב על שאלתו מדברי אדוננו המלך דוד ע\"ה מי יעלה בהר ה' וגו' נקי כפים ובר לבב וגו'. וכי מה תשובה היא זו על שאלתו, ואיך ידעינן ממקרא זה מה הוא גזל."},{"passage_id":"vayikru1_f1f1b9f1_p3","passage_content":"ג) עוד איתא במדרש תנחומא (סי' י''ד) ד''א צו את אהרן ואת בניו וכו' אמר ליה הקב\"ה למשה הואיל וכך העולה חביבה עלי לכך צוה אהרן ובניו שיהיו זהירין בה להקריב אותה לפני למה אמר זאת תורת העולה ירצה לומר קריאת תורה ראו כמו חביבה קריאת תורה לפני הקב\"ה וכו' שנא' צו את אהרן ואת בניו לאמר כלומר שיאמרו לבני ישראל ויתעסקו בקריאת העולה שאע\"פ שמקריבין עולה עוסקין היו בקריאתה כדי שיזכו בקרבן עולה ובקריאתה וכו', עכ\"ל. וצריך להבין דברי המדרש וכי מה רבותא היא זו שהיו עוסקים בלימוד פרשת עולה אע\"פ שמקריבין אותה בפועל, והלא פשיטא הוא שיש חיוב לעסוק גם בפרשת העולה מכח חיוב תלמוד תורה, ואם נאמר שכוונת המדרש שהיו עוסקים בפרשת עולה כדי שיעלה להם העסק בה במקום קרבן כאמרם ז\"ל כל העוסק בתורת עולה כאילו הקריב עולה, יש לתמוה שהרי המדרש מיירי בזמן שבהמ''ק היה קיים, כמבואר בדבריו, שאע\"פ שהיו מקריבין עולה עוסקין היו בקריאתה. וא''כ כיון שהיה בידם להקריב עולה בפועל, מה צורך היה שיעלה להם לימוד פרשת עולה במקום הקרבן, והרי פשיטא שהקרבתה בפועל חשובה ומקובלת יותר מלימוד פרשת העולה, שהרי הלימוד נחשב לו רק כאילו הקריב עולה, ולא כהקריב ממש."},{"passage_id":"vayikru1_f1f1b9f1_p4","passage_content":"ד) במד''ר (פ''ט ח) א''ר אחא משל לשלטון שנכנס למדינה ועמו כיתות כיתות של לסטים אמר אחד לחבירו מה דחיל הדין שליטא (מה נורא זה השלטון) א\"ל הדא פסטמא דילך טבא (פירש הערוך דבור והנהגה שלך יהא טוב) ולית את דחיל מיניה כך כיון ששמעו ישראל פרשת קרבנות נתיראו אמר להן משה אל תיראו התעסקו בתורה ואין אתם יראים מכל אלה הה''ד זאת התורה לעולה ולמנחה, ע''כ. ודברי המדרש תמוהים וכל עובר עליהם ישתומם, למה נתייראו ישראל בשמעם פרשת הקרבנות, ואם יראו למה שקטו במה שאמר להם משה התעסקו בתורה."},{"passage_id":"vayikru1_f1f1b9f1_p5","passage_content":"וכדי לבא לביאור הענין נקדים לבאר מה היה פחדם ויראתם של ישראל בשמעם פרשת הקרבנות, דהנה בתורת כהנים פרשה זו דרשו מדכתיב ביום צוותו את בני ישראל להקריב את קרבניהם לה' שכל הקרבנות כולם אין כשרים אלא ביום, וכ''ה במס' זבחים (צ''ח ע''א ובמגילה כ' ע''א). ונ''ל לומר טעם שאסרה תורה להקריב קרבנות בלילה בהקדם הא דאיתא בירושלמי פאה (פ''ח ה''ח) ר''ח ב''פ הוה מפלג מצוה (מחלק צדקה) בלילה חד זמן פגע ביה רבהון דרוחין א''ל לא כך אולפן לא חסיג גבול רעך (דברים י''ט ד) (פירוש לפי שהלילה הוא גבול רוחות ושדים ולא בני אדם) א''ל לא כך כתיב מתן בסתר יכפה אף (משלי כ''א) והוה מתכפי מיניה וערק מן קמיה. ע''כ. היוצא מזה כי לפי שבלילה הוא זמן שליטת המזיקין אין להתגרות בהם להשיג גבולם, ורק זכות מצות מתן צדקה בסתר עמדה לר' חנינא בר פפא לכפותם ולהבריחם. והנה מבואר בזה''ק (פ' צו דף כ''ז ע''ב) שע''י הקרבת הקרבנות מתבטלים כוחות הסט''א וזינין בישין דיליה מעלמא, וכיון שבלילה הוא זמן שליטת המזיקין, ע''כ אין מקריבין קרבנות בלילה, שלא להסיג גבולם, ורק הקטרת אברים ופדרים של הקרבנות שהקריבו ביום כשרה כל הלילה."},{"passage_id":"vayikru1_f1f1b9f1_p6","passage_content":"ועפ''י זה יתבארו לנו דברי המדרש רבה (אות ד') משל למלך שנכנס למדינה ועמו כיתות כיתות של לסטים וכו' כך כששמעו ישראל פרשת הקרבנות נתייראו, כי כאשר שמעו ישראל דכתיב בפרשת הקרבנות ביום צוותו את בני ישראל להקריב את קרבניהם, ונודע להם מה שדרשו מיניה שאין להקריב קרבנות אלא ביום נתייראו, ופחדם ויראתם היתה כי ידעו כמה גדול כח המזיקים השטים בעולם, ותהי זאת נחמתם כי ע''י הקרבת הקרבנות ינצלו מכל מרעין בישין ופגעים רעים, אמנם עתה ששמעו שאין להקריב קרבנות בלילה, פחדו מפחד בלילות שלא יהיו להם הקרבנות להגין עליהם מפני המזיקין. ועפ\"י זה מובן שפיר מה שמביא המדרש משל למלך שנכנס למדינה ועמו כיתות כיתות לסטים וכו', דכוונתו על כתות המחבלים והמזיקים שברא הקב''ה בעולם שמהם נתייראו ישראל."},{"passage_id":"vayikru1_f1f1b9f1_p7","passage_content":"ובדרך זה נבאר מה שהשיב להם משה אל תיראו התעסקו בתורה ואין אתם יראים מכל אלה, דהנה מבואר בדברי חז''ל בכמה מקומות כי העסק והלימוד בתורת הקרבנות חשוב ומרוצה לפני הקב''ה כאילו הקריבום בפועל, וכדאיתא במסכת תענית (דף כ\"ז ע\"ב) אמר ר' יעקב בר אחא אמר ר' אסי אלמלא מעמדות לא נתקיימו שמים וארץ (פי' רש\"י מעמדות, עסקי קרבנות שישראל עושין הן היו כלין בחטאן ומשהן כלין שמים וארץ העומדים בזכותם אין מתקיימין) שנא' ויאמר ה' אלקים במה אדע כי אירשנה (בראשית ט\"ו) אמר אברהם רבש''ע שמא ישראל חוטאים לפניך אתה עושה להם כדור המבול וכדור הפלגה אמר לאו אמר לפניו רבש\"ע הודיעני במה אירשנה אמר לו קחה לי עגלה משולשת ועז משולשת אמר לפניו רבש''ע תינח בזמן שביהמ''ק קיים בזמן שאין ביהמ\"ק קיים מה תהא עליהם אמר לו כבר תיקנתי להם סדר קרבנות בזמן שקורין בהן לפני מעלה אני עליהם כאילו הקריבום לפני ואני מוחל להם על כל עוונותיהם, ע''כ."},{"passage_id":"vayikru1_f1f1b9f1_p8","passage_content":"והנה זה פשוט שאף שאין להקריב קרבנות בלילה, מטעם שאין להשיג גבול המזיקין כאשר נתבאר, מכל מקום לא שייך לומר כן גבי לימוד תורת הקרבנות, ואדרבה מבואר בדברי חז\"ל ובזוהר הקדוש בכמה מקומות מה גדלה מעלת העוסק בתורה בלילה, אשר על ידי כך הוא כופה ומבטל כח הסט\"א וגונדא דיליה, וכדאיתא בזה''ק פ' ויחי (דף רמ\"ב ע''א) פתח ואמר לדוד ה' אורי וישעי ממי אירא ה' מעוז חיי ממי אפחד (תהלים כ\"ז) כמה חביבין אונון מילי דאורייתא כמה חביבין אינון דמשתדלין באורייתא קמי קב\"ה דכל מאן דאישתדל באורייתא לא דחיל מפגעי עלמא נטיר הוא לעילא נטיר הוא לתתא ולא עוד אלא דכפית לכל פגעי עלמא ואחית להון לעומקי דתהומא רבא ת''ח בשעתא דעאל ליליא פתחי סתימין וכלבי וחמרי שריין ושטאן בעלמא ואתייהיבת רשו לחבלא וכו' כד אתער רוח צפון ואתפליג ליליא וכו' זכאה חולקיה דההוא ב\"נ דאיהו קאים בההוא שעתא ואשתדל באורייתא כיון דאיהו פתח באורייתא כל אינון זינין בישין אעיל לון בנקבי דתהומא רבה וכו', עכ''ל. וזאת השיב משה לישראל להפיג פחדם מפני המזיקין, כי אף בלילה שאין להם מצות הקרבנות בפועל, יתעסקו בתורה היינו בפרשת הקרבנות, ויעלה להם כאילו הקריבו קרבן בפועל, ואין להם להתיירא מן המזיקים, כי בכח התורה כולהו ערקין ואתעברו מינייהו ויורידום לעמקי תהום רבה."},{"passage_id":"vayikru1_f1f1b9f1_p9","passage_content":"ובדרך זה יש לבאר גם המדרש תנחומא (קושיא ג) דקאמר שצום הקב''ה לבני ישראל שאע''פ שיקריבו עולה יתעסקו בקריאת פרשת עולה כדי שיזכו בקרבן עולה ובקריאתה. והכוונה כי לפי שאין הלילה כשר להקרבה, על כן יתעסקו בקריאת פרשת עולה בלילה, כדי שיחשב להם הלימוד כהקרבת עולה, וגם יהיה להם למגן מפני המזיקים השולטים בלילות. ונראה לומר כי המדרש תנחומא יליף ליה מדכתיב היא העולה על מוקדה כל הלילה וגו', דלכאורה משמעותיה שיקריבו קרבן עולה בלילה, וקשה שהרי אין הלילה כשר להקרבה, וחז''ל (בתורת כהנים) דרשו מיניה שזמן הקטרת אברים היא כל הלילה, אמנם המד\"ת מפרש האי קרא שנצטוו בני ישראל ללמוד תורת עולה בלילה, ונחשב להם כאילו הקריבו עולה. וע''כ כתיב היא העולה על מוקדה כל הלילה וגו', שלימוד תורת עולה בלילה תחשב כקרבן עולה."},{"passage_id":"vayikru1_f1f1b9f1_p10","passage_content":"ועפי\"ז יש לפרש דברי ת''ק שאמר אין צו אלא לשון זירוז מיד ולדורות, כי לפי מה שנתבאר שהכתוב מרמז שיעסקו בתורת הקרבנות בלילות בזמן שביהמ\"ק קיים, כדי שיעלה להם הלימוד במקום קרבן, שאין מקריבין בלילה, על כן אמר הכתוב צו לשון זירוז, כי הוצרך לזרזם על לימוד התורה, דד''ת צריכים חיזוק, והזירוז הוא מיד, פירוש בזמן שביהמ''ק היה קיים, שיעסקו בתורת הקרבן בלילות להגין עליהם מדבר באופל יהלוך. ולדורות פירוש בזמן שחרב בית המקדש, וא\"א להקריב קרבנות בפועל, זירז הכתוב שיעסקו בתורת עולה ויעלה להם כאילו הקריבו עולה בפועל."},{"passage_id":"vayikru1_f1f1b9f1_p11","passage_content":"ולבאר דברי ר''ש שאמר ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, נקדים לבאר שאלת המדרש תנחומא הנ''ל (אות ב) מה היא הגזל וכו', דהנה כפי המבואר במדרש תנחומא שם החמיר הכתוב בעון גזל גבי קרבן עולה יותר מבשאר מצוות, שכתב ואימתי אתה מעלה עולה ואני מקבלה כשתנקה כפיך מן הגזל, הרי כי כל זמן אשר המצא תמצא הגזלה בידו, אף שאין הוא מקריב קרבנו מאותו ממון, כ\"א מממון היתר שבידו, לא יחפוץ ה' בעולה וכליל, ופגול הוא לא ירצה. אמנם לא כן הוא גבי שאר מצוות, שהרי אף שאינו יוצא ידי חובת המצוה אם מקיימה מממון שהוא גזול בידו, משום מצוה הבאה בעבירה, מ''מ אם קיים את המצוה מממון היתר שבידו תחשב לו למצוה, אף שאין ידיו נקיות מן הגזל. וזאת היא שאלת המדרש מה היא הגזל, פירוש מפני מה חמור כ\"כ עוון הגזל, שאין קרבנו מתקבל לרצון כל זמן שלא נקה כפיו ממנו. וע\"ז הוא משיב דוד אמר מי יעלה בהר ה' ומי יקום במקום קדשו נקי כפים ובר לבב, כי מכתוב זה נשמע כמה חמור פגם הגזל, כדכתיב נקי כפים ובר לבב, שכל זמן שאין כפיו מנוקות מעוון הגזל, גם לבו אינו זך וישר, וכמו שכתב בסה''ק אגרא דפרקא (אות קכ''ו) בשם מהרמ''מ על מה שיש לתמוה שאנחנו רואים כמה פעמים הילדים בקטנותם הולכים לבית רבם, ומתמידים בלימוד תורתם ומתפללים בכוונה, ועונים איש''ר ומישרים אורחותם, ואחר כך כשמתגדלים מתהפכים ח\"ו במדות גרועות, ומבטלים התורה והתפלה וכיוצא, מאין יתהווה זה הרי התורה שלמדו בקטנותם והוא הבל שאין בו חטא היה מהראוי שתעמוד למשען להם, ויוסיפו אומץ בנפשותם, כי מצוה גוררת מצוה, ואמר הוא ז''ל שהוא על שאבותיהם האכילו אותם ממון גזל שסיגלו ע''י מו\"מ שאינו באמונה, ונתפטמו באיסורין ושב להם לבשר מבשרם, ועי''ז נולדים תאוות ומדות גרועות וכו' עיי\"ש. הרי כמה גדול פגם הגזל שהוא מטמטם לב האדם כמאכלות אסורות, לפי שהאדם נזון ומתפרנס בממון שאינו של יושר וגדל באיסור. וזאת ראית המדרש על חומר עוון הגזל, מדכתיב מי יעלה בהר ה' וגו' נקי כפים ובר לבב, כי אך לריק יזכה לבו אם לא רחץ בנקיון כפיו, ורק מי שהוא מנוקה מעוון גזל יעלה בהר ה' להקריב עולה. ולא זאת בלבד שלהקרבת העולה בפועל צריך להיות נקי כפים ובר לבב, אלא שאפילו לימוד תורת העולה לא יתקבל לרצון לפני ה', אא\"כ ידיו נקיות מגזל, כי לפי שעסק בתורת עולה נחשב לפני הקב\"ה כהקרבת עולה, נמצא כי מי שלא חדל מעושק ידיו הרי הכתוב מעיד עליו אני ה' שונא גזל בעולה, ועוד כי לפי שהוא מתפטם בגזל, לא יוכל לעסוק בתורת הקרבנות, כי לבבו אטום וסתום מלהבין ד\"ת."},{"passage_id":"vayikru1_f1f1b9f1_p12","passage_content":"ועפ\"י זה נבא לבאר דברי ר' שמעון שאמר ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס. כי לפי שנצטוו ישראל כאן על הקרבת העולה, שלא תתקבל לרצון אלא אם ידיו נקיות מעוון גזל, וגם נרמז במקרא זה לימוד פרשת העולה בין בזמן שבית המקדש היה קיים, שהוצרכו לעסוק בתורת עולה במקום קרבן מפחד בלילות, ובין בזמן שאין ביהמ\"ק קיים שאין לנו קרבן שיכפר בעדנו, ועלינו לקיים ונשלמה פרים שפתינו. וכפי מה שנתבאר גם לימוד תורת העולה לא יתקבל לרצון לפני ה' להחשב כקרבן, אא\"כ היה מנוקה מעון גזל, ע\"כ אמר ר\"ש ביותר הוצרך הכתוב לזרז במקום שיש בו חסרון כיס, ולא על הפסד הממון שבשרפת העולה נתכוון, אלא לפי שעליו לבדוק ולתור בכל ממונו ורכושו, ואם ימצא בהם ממון של גזל ישיב את הגזלה, ואם לאו לא יתקבל קרבנו, וגם לימוד תורת עולה לא יעלה לו כקרבן עד אשר כסף ישיב לבעליו, וזה הוא חסרון כיס גדול, ולא מצינו כיוצא בו בשאר מצוות, על כן הוצרך הכתוב לזרז כאן ביותר."}]},{"dvar_torah_id":"vayikru1_cf345660","title":"תורת העולה וחשיבותה","summary":"בפרשת צו נדרשת זריזות בהקרבת עולה, שהיא חביבה לפני הקב\"ה. המדרש מדגיש את ערך קריאת פרשת עולה לבניין ירושלים, ומלמד על חיוב לימוד תורה, גם בזמן חורבן, כדי לזכות בקרבן. קריאת העולה מכפרת על מחשבות הלב ומחזקת את כוונת ההקרבה.","contents":[{"passage_id":"vayikru1_cf345660_p1","passage_content":"וידבר ה' אל משה לאמר צו את אהרן ואת בניו לאמר זאת תורת העולה אשר צוה ה' וגו'. יל\"ד על אמרו לאמר ב' פעמים, ולכאורה סגי שיכתוב וידבר ה' אל משה לאמר, והרי זה ציווי שיאמר משה מצוה זו לישראל, ומה צורך לכתוב צו את אהרן וגו' לאמר, וכי למי יאמרוה אהרן ובניו, והרי הם לא נצטוו על האמירה כי אם על ההקרבה."},{"passage_id":"vayikru1_cf345660_p2","passage_content":"ב) צו את אהרן וגו' פירש\"י ז\"ל (מתורת כהנים) אין צו אלא זירוז, אר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חםרון כיס. וצ\"ב להבין למה הוצרכה תורה להשמיענו במצוה זו דייקא שהיא נוהגת מיד ולדורות, והרי כל התורה נוהגת לדורות, ומדוע תשתנה מצות עולה משאר המצוות, עד דאיצטריך קרא לריבוייא, ואף בזמן החרבן, שאין בידינו להקריב קרבנות בפועל, אמרו חז\"ל כל העוסק בפרשת עולה כאילו הקריב עולה, וכן בכל הקרבנות, ואם כן מצוה זו נוהגת לדורות. גם לדרשת ר' שמעון קשה, שהרי הרבה מצות יש הנקנות בדמים יקרים, ולא ליהנות ניתנו, ואעפ\"כ לא מצינו שיזרז בהם הכתוב, ולמה הוצרך לזרז כ\"כ במצות עולה דייקא."},{"passage_id":"vayikru1_cf345660_p3","passage_content":"ג) א\"א זלה\"ה בספרו קדושת יו\"ט מביא מדרש פליאה וזה תוארו שאלו תלמידיו את ר' יוסי בן קיסמא אימת בן דוד בא אמר להם זאת תורת העולה, וצ\"ב."},{"passage_id":"vayikru1_cf345660_p4","passage_content":"ד) בתנחומא (י\"ד) איתא צו את אהרן זש\"ה היטיבה ברצונך את ציון ואח\"כ אז תחפוץ זבחי צדק עולה וכליל אם אין ישראל מקריבין עולה לפני הקב\"ה אין ציון וירושלים נבנית לפי שאון נבנית אלא בזכות קרבן עולה וכו' ומ\"ש קרבן עולה יותר מן הקרבנות כולן מפני שנקרא זבחי צדק שנא' אז תחפוץ זבחי צדק עולה וכליל א\"ל הקב\"ה למשה הואיל וכך העולה חביבה עלי לכך צוה אהרן ובניו שיהיו זריזין להקריב אותה לפני למה אמר תורת העולה ירצה לומר קריאת תורה ראו כמה חביבה קריאת תורה לפני הקב\"ה כי יש חיוב באדם לתת כל ממונו ללמד תורה לעצמו ולבניו שנא' צו את אהרן ואת בניו לאמר כלומר שיאמרו לבני ישראל ויתעסקו בקריאת העולה שאע\"פ שמקריבין עולה עוסקין היו בקריאתה כדי שיזכו בקרבן עולה ובקריאתה, עכ\"ל. והמדרש הזו כולו מוקשה, חדא צ\"ב להבין מה דקאמר אם אין ישראל מקריבין עולה אין ציון וירושלים נבנית, וקשה שהרי לא יתכן להקריב קרבנות כל זמן שלא נבנה המקדש ומזבח ואולם על מכונו, וא\"כ הדברים הפוכים שמתחלה תבנה ציון וירושלים, ואח\"כ נעשה ונקריב את קרבנות חובותינו. ואם כוונת המדרש על קריאת פרשת עולה שיתכן לקיים אף בחורבנה, צ\"ב איך תלוי בנין ציון וירושלים בקריאת פרשת עולה, יותר מבשאר הקרבנות וכל המצוות. וקושיא זו הקשה במדרש שכתב ומאי שנא קרבן עולה יותר מכל הקרבנות, ומשני מפני שנקרא זבחי צדק וכו'. אך עדיין לא נתיישבה הקושיא בזה, דהא גופא טעמא בעי מאי שנא קרבן עולה שנקרא זבחי צדק יותר מכל הקרבנות."},{"passage_id":"vayikru1_cf345660_p5","passage_content":"ה) עוד צ\"ב בדברי המדרש שאין החתימה מעין הפתיחה, דפתח דבריו במעלת הקרבת העולה, שא\"ל הקב\"ה למשה הואיל וכך העולה חביבה לפני לכך צו את אהרן ואת בניו שיהיו זריזין להקריב אותה לפני, והדר מבאר והולך דזאת תורת העולה קאי על קריאת הפרשה, ועד כמה חביבה קריאת התורה לפני הקב\"ה. וקשה שמדברי חז\"ל בגמ' מוכח דקריאת פרשת עולה נאמרה על זמן החרבן, שאין בידינו להקריבה בפועל, ומדוע עירב המדרש שני הבחינות גם יחד ותנא להו כחדא."},{"passage_id":"vayikru1_cf345660_p6","passage_content":"ו) עוד צ\"ב מה דקאמר שיש חיוב באדם לתת כל ממונו ללימוד התורה, מה שייך חיוב זה לפ' עולה דוקא, וכיצד נשמע הלכה זו מהכא. גם מה שסיים המדרש שאע\"פ שמקריבין עולה עוסקין היו בקריאתה כדי שיזכו בקרבן עולה ובקריאתה, צ\"ב דכיון שהיו מקריבין עולה בפועל, מה הוצרכו לקריאת הפרשה, ואם מפני חביבות לימוד התורה, מדוע קראו בפרשת עולה דוקא ולא בשאר פרשיות שבתורה."},{"passage_id":"vayikru1_cf345660_p7","passage_content":"ולבאר כל זאת נקדים דברי הגמרא זבחים (דף צ' ע\"א) ר\"א אומר כל מקום ששנים באים חטאת ועולה חטאת קודמת וכאן בקרבן יולדת עולה קודמת. ופריך מיניה על הא דתניא התם חטאת העוף קודמת לעולת בהמה ומשני רבא למקראה הקדימה הכתוב, ופירש\"י שתהא נקראת בענין תחלה אבל בעבודתן חטאת קודמת. וכדאמרינן (זבחים ז' ע\"ב) למה חטאת קודמת לעולה משל לפרקליט שנכנס לרצות ריצה פרקליט נכנס הדורון אחריו. והקשו התוס' מה חידוש הוא זה דעולה קודמת לחטאת בקריאתה, והרי זיל קרי ביה רב הוא, ומאי קמ\"ל ר\"א, ותירץ הר\"ר חיים ז\"ל למקראה היינו להקדיש תחלה העולה קודם לחטאת, אבל להקרבה חטאת קודמת. והקשו בתוס' על תירוץ הר\"ר חיים ז\"ל מגמ' ערכין ולא תירצו כלום. ובשיטה מקובצת בשם הר\"ר יחיאל ז\"ל כתב דה\"פ למקראה לשון מקרה, כלומר שאם לא נזדמנה לה כי אם פרידה אחת הרשות בידה להקדים ולעשות בה עולתה, וכשתזדמן אחרת תקריב חטאתה, אבל כשהן באות שתים לעולם חטאת קודמת לעולה, ע\"כ. אכן גם פירושו דחוק דקשה לפרש תיבת למקראה מלשון מקרה, ולא משמע הכי כלל, גם לא מצינו הלכה זו בשום מקום. ואכתי צ\"ב להבין דברי רבא שהשיב למקראה הקדימה הכתוב."},{"passage_id":"vayikru1_cf345660_p8","passage_content":"ונראה לפרש בהקדם מ\"ש ק\"ז זלה\"ה בישמח משה בפרשה זו עה\"פ ואם האכל יאכל וגו' ביום השלישי לא ירצה המקריב אותו לא יחשב לו פגול יהי' וגו'. ופירש\"י במחשב לאכלו בשלישי הכתוב מדבר. והקשה על כפל הלשון לא יחשב ולא ירצה ופיגול הוא דכל הני למה לי, גם יש להפליא למה תצא זאת מלפני הכהנים עובדי השי\"ת לשחוט את הזבח במחשבת חוץ לזמנו, אטו ברשיעי עסקינן, הלא מסתמא הכהנים המה יראי ה', ואין בודקין מן המזבח ולמעלה. אמנם נראה דהנה כבר עמדו הקדמונים בטעם הקרבנות, ונאמרו בהם כמה טעמים בנגלה, ועוד יש בהם ע\"ד האמת סוד כמוס וטעם נעלם, כמ\"ש הרמב\"ן ז\"ל בפ' ויקרא, והטעם הפשוט והעקרי דע\"י הקרבן ישים החוטא אל לבו לעשות תשובה, כי יראה מענין הקרבן השתעבדות הפחות לנכבד ממנו, וילמד ק\"ו ב\"ב של ק\"ו דעאכו\"כ שראוי לאדם להשתעבד ולהכנע להנכבד ממ\"ה הקב\"ה שבראו והוציאו מאין ליש וכו', ועי\"ז יתחרט וישוב בתשובה שלמה. עייש\"ד באריכות. אבל אם אינו עושה חשבון עם נפשו ואינו שב בתשובה אז הקרבן אינו כלום ואינו לרצון לפניו יתברך והירצה ה' באילים ורחמיו על כל מעשיו כתיב ולא תשחט הבהמה שלא חטאה ללא צורך. והנה אמרו חז\"ל שהכהנים אוכלים בזמן שהבעלים מתכפרים ולא בזמן שאין הבעלים מתכפרים בו, א\"כ לכאורה איך יוודע לכהן המקריב אם חשבו הבעלים לנפשם לעשות תשובה, והרי דבר זה תלוי במחשבת הבעלים, ולא יכיר הכהן בחינת המחשבה. ולבי אומר לי וברור בעיני דזה הי' סבה מאת ה' החוקר כליות ולב, דאם הבעלים לא שמו אל לבם ככל הנ\"ל ולא שבו בתשובה, אז בע\"כ של הכהן נזרקה במחשבתו בעת הקרבת הקרבן מחשבת חוץ לזמנו, וממילא יפסל ולא יאכל ע\"י הכהנים, וז\"ש המקריב אותו (ר\"ל הבעלים) לא יחשב, כלומר לא עשה החשבון לנפשו ללמוד השתעבדות הפחות לנכבד ממנו, לכך פיגול יהי' לא יאכל. עכת\"ד ז\"ל הנעימים."},{"passage_id":"vayikru1_cf345660_p9","passage_content":"והנה לפי האמור כי עיקר הקרבן הוא שישים החוטא אל לבו, וחשב עם קונהו לשוב בתשובה שלמה, ולתקן את אשר עוות, יש לחקור הכיצד יוכל אדם שיש בידו חטא במחשבה, שעדיין לא שב עליה, להקריב קרבן חטאת על אשר חטא בפועל, והרי יש לחוש כי מחשבת החטא הקדומה שעדיין לא שב עליה, תגרור אחריה מחשבה רעה אף בשעת הקרבת החטאת, ותמנענו מלחשוב מחשבת חרטה והרהור תשובה על חטאו, וכאמרם ז\"ל עבירה גוררת עבירה (אבות פ\"ד מ\"ב). וכתב המהרש\"א ז\"ל במס' מכות דף י' על אמרם ז\"ל בדרך שאדם רוצה לילך מוליכין אותו. דבכל מחשבה ודיבור ומעשה האדם הוא בורא לו מלאך לפי ענינו, אם לטוב או להיפך ח\"ו, ואותם המלאכים הנבראים מן הרצון והמחשבה מוליכין אותו לגמור כפי המחשבה שהתחיל בה, ע\"כ. וכדי להוציא מחששא זו היה מן הראוי שיקריב האיש הלזה מתחלה קרבן עולה, בטרם יקריב את חטאתו על שגגתו. כי העולה באה לכפר על יצר מחשבות הלב, ובאמצעות הקרבת העולה יתכפר לו חטא המחשבה, ויהי' בידו לחשב מחשבת תשובה בעת יקריב את קרבנו. אך לא יתכן לעשות כן שהרי חז\"ל אמרו חטאת קודמת לעולה בכל מקום, וא\"כ עדיין החששא במקומה עומדת פן ואולי לא שב על מחשבות לבו, ולא יוכל להתחרט בחרטה גמורה מעומקא דלבא בעת הקרבת הקרבן. אמנם יש עצה ותקנה להנצל מחשש זה, אשר בטרם יבוא להקריב את קרבנו על חטאו, יעסוק בלימוד פרשת העולה, ובאמצעות עסקו בדיני עולה יתכפר לו חטא המחשבה, כאמרם ז\"ל כל העוסק בפרשת עולה כאילו הקריב עולה, ושוב אין לחוש שלא תהי' מחשבתו וכוונתו שלמה ורצויה בעת הקרבת החטאת, שהרי כבר זיכך לבו ממחשבת עבירה ע\"י לימוד פרשת העולה, ושפיר יקריב את החטאת ראשונה, ולבבו יבין לחשוב מחשבת תשובה ושב ורפא לו."},{"passage_id":"vayikru1_cf345660_p10","passage_content":"והשתא מובן שפיר סיום דברי התנחומא, דדרש מדכתיב צו את אהרן ואת בניו לאמר, שיאמר לבני ישראל שיתעסקו בקריאת העולה, שאעפ\"י שמקריבין עולה עוסקין היו בקריאתה כדי שיזכו בקרבן עולה ובקריאתה. ואמנם היה צורך בתרוייהו, בין בהקרבת העולה בפועל, בין בקריאת הפרשה. כמו שנתבאר, דהיה צורך להקדים קריאת הפרשה בטרם הקרבת הקרבן, הבא לכפר על חטאתו אשר חטא, כדי שע\"י קריאת פרשת עולה יהי' בידו לחשוב מחשבת תשובה בעת ההקרבה, ולא תעכבהו מחשבת עבירה אשר חטא בה מקדם, ולא סגי בהקרבת העולה שהרי החטאת קודמת לעולה."},{"passage_id":"vayikru1_cf345660_p11","passage_content":"ובזה יתבאר היטב מה דמשני רבא שהקדים הכתוב עולה לחטאת למקראה, כי הכתוב בא ללמדנו שיש צורך להקדים קריאת פרשת עולה בטרם הקרבת החטאת, מטעמא דאמרן. ואפשר עוד דאף המקריב קרבן עולה בלבד צריך שיקדים לה קריאת פרשת עולה, מטעם הנ\"ל, ולא סגי בהקרבת העולה, כי אם לא תהי' מחשבתו רצויה בעת ההקרבה לא יחשב לו ופיגול יהי' לא ירצה, על כן צריך להקדים לה קריאת פרשת עולה לכפר על מחשבת הלב. ובזה יש ליישב כפל תיבת לאמר (קושיא א'), דלאמר הב' הוא ציווי לבני ישראל אשר בטרם יקריבו עולתם לכפר על נגעי לבם, יאמרו בפיהם פרשת העולה, כדי שתהא ההקרבה בלבב שלם."},{"passage_id":"vayikru1_cf345660_p12","passage_content":"ולבאר יתר הקושיות, נקדים עוד מ\"ש ק\"ז זלה\"ה בישמח משה פ' קרח בשם ס' עיר בנימין לפרש דברי רש\"י ז\"ל ר\"פ תרומה ויקחו לי, לשמי. וקשה שהרי כל המצוות עלינו לעשות לשמה, ולמה גילה הכתוב דבר זה במלאכת המשכן דוקא. וביאר עפ\"י אמרם ז\"ל (פסחים נ' ע\"ב) רבא רמי כתיב (תהלים נ\"ז) כי גדול עד שמים חסדך וגו' וכתיב (תהלים ק\"ח) כי גדול מעל שמים חסדך ומשני כאן בעושין לשמה כאן בעושין שלא לשמה, ומעתה מצוה שלא לשמה אינה עולה אלא עד לשמים, והנה אמרו חז\"ל בהמ\"ק שלמטה מכוון כנגד בהמ\"ק של מעלה, ומקדש של מעלה הוא בזבול שהוא למעלה משחקים, וע\"כ הזהירה תורה בבנין המשכן בפרטיות שיעשו לשמה, כדי שיגיע הזכות עד מעל לשמים שהוא רקיע זבול, עכ\"ד העיר בנימין, וק\"ז זלה\"ה פירש בזה דברי הפסוק, עיי\"ש."},{"passage_id":"vayikru1_cf345660_p13","passage_content":"ועפ\"י זה יתבארו דברי התנחומא אם אין ישראל מקריבין עולה אין ציון וירושלים נבנית לפי שאין נבנית אלא בזכות קרבן עולה וכו'. דהנה נתבאר שבנין ביהמ\"ק חייב להיות לשמה דוקא, ועאכו\"כ שבנין המקווה שיהי' מעל לשמים צריך להיות נבנה לשמה, ואף שמבואר בזה\"ק פ' פנחס (רכ\"א ע\"א) שהבנין העתיד יהי' מעשי ידי יוצר וירד בנוי ומשוכלל משמים, מ\"מ צריך לומר שההכנה תעשה בידי אדם בבחינת איתערותא דלתתא הקודמת לאיתערותא דלעילא, וכאשר נתבאר בספרי ויואל משה (מאמר שלש שבועות מסי' ס\"א) לתרץ הסתירות בדברי חז\"ל בענין זה, דבזוה\"ק הנ\"ל מבואר שירד בנוי ומשוכלל משמים, וכ\"כ רש\"י והתוס' והרשב\"א והריטב\"א ז\"ל במס' סוכה (דף מ\"א ע\"א). ואילו במד\"ר פ' צו וכן בירושלמי מגלה (פ\"א הי\"א) איתא דמלך המשיח יבנה את ביהמ\"ק וכ\"כ הרמב\"ם ז\"ל (בהלכות מלכים פי\"א ה\"ד). עיי\"ש כמה תירוצים על זה. ועכ\"פ לד\"ה בע\"כ לומר שתהי' איזה הכנה לבנין המקדש ע\"י בני אדם, להמשיך השפעת הקדושה מלמעלה, והכנה זו צריכה להיות לשמה דוקא כמבואר. ובזה מבוארים דברי התנחומא דאין ירושלים נבנית אלא בזכות קרבן עולה, ואף שא\"א להקריב עולה בפועל בזמן החרבן, הכוונה על קריאת פ' עולה שהכרח הוא שתקדם לבנין ביהמ\"ק, כדי שע\"י קריאת פרשת עולה שהיא מכפרת על הרהורי הלב, יזדכך לבנו ויטהרו מחשבותינו מכל הרהור חטא, ואז יהי' בידינו לעשות ההכנה לבנין בהמ\"ק בכוונה זכה ורצויה בלתי לה' לבדו, ונמשיך באמצעות הכנתנו את ביהמ\"ק שלמעלה שירד בנוי ומשוכלל משמים. ואפ\"ל בזה מה דקאמר בתנחומא ומ\"ש עולה מכל הקרבנות מפני שנקרא זבחי צדק, ויתכן דטעם שנקראת העולה זבחי צדק, מפני שמצדקת המחשבות ומכשרת את הלב לחשוב מחשבות קדושות בלי הרהור חטא ועוון."},{"passage_id":"vayikru1_cf345660_p14","passage_content":"והשתא מובן היטב המשך דברי התנחומא ראו כמה חביבה קריאת התורה לפני הקב\"ה, שהרי ממה דקאמר שאין ציון וירושלים נבנית כ\"א בזכות העולה, והכוונה על קריאת הפרשה, נמצינו למדים גודל ערך וחשיבות לימוד התורה, שבזכותה ציון וירושלים נבנית, וע\"כ חייב האדם לתת כל ממונו ללמד תורה לעצמו ולבניו, ובזכות זה תבנה ציון וירושלים."},{"passage_id":"vayikru1_cf345660_p15","passage_content":"ובזה יובן מה שדרש בת\"כ אין צו אלא זירוז מיד ולדורות, והכוונה על תורת העולה שהיא קריאת פרשת עולה, הנוהגת לעולם בין בזמן שביהמ\"ק קיים בין בחרבנו כמבואר, ולא כן בשאר קרבנות שאין קריאת הפרשה נוהגת כי אם בחרבנה, שאין בידינו להקריבם בפועל, אבל בזמן שביהמ\"ק היה קיים, שהיה בידם להקריבה בפועל, אין חיוב בקריאת הפרשה. גם מובן מה שאמר ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, דקאי על קריאת פרשת עולה שיש בו חסרון כיס גדול, כדאי' בתנחומא שחייב אדם לתת כל ממונו ללמד תורה לעצמו ולבניו, ומייתי ראי' מזאת תורת העולה, עד כמה חשוב הוא לימוד התורה, ע\"כ קאמר ר\"ש ביותר צריך הכתוב לזרז על חיוב לימוד התורה במקום שיש בו חסרון כיס, אפ\"ה חייב האדם לפזר כל ממונו על לימוד התורה."},{"passage_id":"vayikru1_cf345660_p16","passage_content":"ואפ\"ל עוד עפ\"י אמרם ז\"ל (נדרים פ\"א ע\"א) הזהרו בבני עניים שמהם תצא תורה. ולפי שדרשו מזאת תורת העולה דקאי על לימוד התורה, ע\"כ קאמר ר\"ש ביותר צריך הכתוב לזרז להשתדל בלימוד התורה במקום שיש בו חסרון כיס, הם בני העניים שמהם תצא תורה. ויבואר גם המדרש פליאה הנ\"ל שאלו תלמידיו את ר\"י בן קיסמא אימת בן דוד בא א\"ל זאת תורת העולה, דבזכות קריאת פרשת עולה ציון וירושלים נבנית."}]},{"dvar_torah_id":"vayikru1_d9f14174","title":"הציווי לעסוק בתורת העולה","summary":"הכתוב מזהיר לעסוק בתורת העולה גם בזמן המקדש, מפני חסרון כיס. לימוד תורת הקרבנות הוא חובה תמיד, כדי להשלים את מה שנחסר מהקרבנות בפועל, והמצווה נוהגת לדורות.","contents":[{"passage_id":"vayikru1_d9f14174_p1","passage_content":"צו את אהרן ואת בניו לאמר זאת תורת העולה וגו' פירש\"י אין צו אלא לשון זירוז מיד ולדורות אר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס. יש להקשות למה הוצרך הכתוב לזרז במצוה זו מיד ולדורות, והרי פשיטא הוא שכל מצות התורה נוהגות לדורות עולם, ולא יחול בהם חילוף ותמורה כלל."},{"passage_id":"vayikru1_d9f14174_p2","passage_content":"ב) הקשו המפרשים שהרי איכא נמי שאר מצות שיש בהם חסרון כיס, ולא מצינו שאמר בהם לשון זירוז, ולמה הוצרך הכתוב לזרז בהקרבת עולה דוקא."},{"passage_id":"vayikru1_d9f14174_p3","passage_content":"ג) במדרש תנחומא (סי' י\"ד) איתא למה אמר זאת תורת העולה וכו' כלומר שיאמרו לבני ישראל ויתעסקו בקריאת העולה שאעפ\"י שמקריבין עולה עוסקין היו בקריאתה כדי שיזכו בקרבן עולה ובקריאתה וכו'. ע\"כ. ולכאורה קשה דבשלמא בזמן שאין ביהמ\"ק קיים חייבים ישראל להתעסק בפרשת עולה, כדי שיעלה להם הלימוד במקום קרבן, כאומרם ז\"ל (סוף מנחות) כל העוסק בתורת חטאת כאלו הקריב חטאת וכו'. אבל בזמן שביהמ\"ק היה קיים, והקריבו קרבנות בפועל, למה הוצרכו לעסוק בפרשת עולה במקום קרבן."},{"passage_id":"vayikru1_d9f14174_p4","passage_content":"ונראה לבאר הענין עפ\"י מה דאיתא במסכת זבחים (דף ו' ע\"ב) אמור מעתה ראויין היו ישראל להקריב קרבנותיהן בכל עת ובכל שעה (פירש\"י דכל שעה בספק חוטאים קיימי) אלא שחיסך הכתוב (חסך על עוונותיהם ולא דקדק עליהם לפי שחס על ממונם וחבירו במנחות מפני החסכון ומפרש מאי חסכון שהתורה חסה על ממונם של ישראל). ע\"כ. היוצא מזה כי פעם שאין אנו מקריבים קרבנות בכל עת ובכל שעה, הוא לפי שהתורה חסה על ממונינו. אמנם לא נפטרנו בכך כי אם מהקרבת קרבן בפועל בכל עת, אבל לימוד תורת הקרבנות שהוא דבר שאין בו חסרון ממון, ודאי חובה הוא עלינו בכל עת."},{"passage_id":"vayikru1_d9f14174_p5","passage_content":"ועפ\"י זה יתבארו לנו דברי התנחומא (אות ג') שנצטוינו לעסוק בהקרבת עולה ובקריאת הפרשה, דתרווייהו צריכי אף בזמן שביהמ\"ק היה קיים, ולא סגי בהקרבת עולה בלבד, שהרי היה ראוי להקריב קרבנות בכל עת, אלא שמפני חסרון כיס חסה עלינו התורה, ודי בלימוד תורת הקרבן."},{"passage_id":"vayikru1_d9f14174_p6","passage_content":"ובדרך זה י\"ל דברי רש\"י ז\"ל אין צו אלא ל' זירוז מיד ולדורות, כלומר דהא דכתיב בקרא זאת תורת העולה, ודרשו מיניה שהוא ציווי לעסוק בפרשת עולה, מצוה זו נוהגת מיד בזמן שביהמ\"ק קיים, ולדורות אחר החרבן. ובא ר\"ש כמפרש שלא תתמה התינח אחר החרבן יש צורך בלימוד תורת עולה במקום הקרבה בפועל, אבל בזמן שבהמ\"ק קיים מה צורך בכך, על כן אמר ביותר צריך הכתוב לזרז, על לימוד תורת הקרבן, במקום שיש בו חסרון כיס, פירוש שהרי לאמתו של דבר היה ראוי להקריב קרבנות בכל עת, אלא שפטרה תורה מפני חסרון כיס, ועל כן חובה עלינו ללמוד תורת עולה, גם בזמן שבהמ\"ק קיים כדי להשלים כל הקרבנות החסרים שהיה לנו להקריב."}]},{"dvar_torah_id":"vayikru1_40fae7a7","title":"חובת לימוד תורת העולה","summary":"למדנו כי העוסק בתורת העולה כאילו הקריב עולה, גם אם אינו מבין הלכותיה. הכתוב מדגיש את הצורך ללמד פרשת קרבנות, אף במקום חסרון כיס, כדי שיתקבל כקרבן גם בלימוד שאינו עם הבנה מלאה.","contents":[{"passage_id":"vayikru1_40fae7a7_p1","passage_content":"וידבר ה' אל משה לאמר צו את אהרן ואת בניו לאמר זאת תורת העולה. ויל\"ד מדוע כתיב לאמר תרי זימני, חדא מינייהו יתירא הוא."},{"passage_id":"vayikru1_40fae7a7_p2","passage_content":"ב) רש\"י ז\"ל פירש אין צו אלא ל' זירוז וכו' אר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, וצ\"ב."},{"passage_id":"vayikru1_40fae7a7_p3","passage_content":"ונראה דהנה מזאת תורת העולה למדנו שכל העוסק בתורת עולה כאילו הקריב עולה, ולכאורה הוי אמינא דהיינו רק בעוסק בדיני העולה ובבירור הלכותיה, אזי יחשב לו העסק במקום קרבן, כמו שמשמע מאמרם כל העוסק בתורת עולה שפירושו שהוא מתייגע בה להבין ולברר ההלכה. אבל מי שלבו בל עמו, ואין בכוחו לעסוק בה לברר הלכותיה, כגון דורות האחרונים שעליהם אמרו ז\"ל (שה\"ש רבה פ\"ב י\"ד) לשעבר היתה הפרוטה מצויה והיה אדם מתאוה לשמוע דבר משנה והלכה ועכשיו שאין הפרוטה מצויה אין מבקשין לשמוע אלא דברי ברכות ואגדה. עכ\"ל. וא\"כ לכאורה מה להם ללמוד תורת העולה, והלא כיון שהלימוד בלא הבנה, לא יחשב להם הלימוד כקרבן. לפיכך קאמר קרא לאמר יתירא, להורות שחייבים הם ללמוד פרשת קרבנות אפילו אם הלימוד הוא באמירה בעלמא בלא בירור ההלכה, דאעפ\"כ יעלה להם במקום קרבן. וז\"ש רש\"י ז\"ל ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, כלומר שהוצרך הכתוב לזרז שילמדו פרשת העולה אפילו במקום שאין הפרוטה מצויה בכיס, והלימוד הוא באמירה בעלמא בלא בינת הלב, אעפי\"כ יעלה להם במקום קרבן."}]},{"dvar_torah_id":"vayikru1_5ded0d0b","title":"תורת העולה וחשיבות הכוונה","summary":"הכתוב מצווה על הקרבת עולה, תוך הדגשת הצורך בכוונה טהורה ולימוד תורה. המדרש מדגיש שהקרבן מתקבל רק כאשר הלב נקי, והלימוד עצמו יכול להיחשב כקרבן. יש להיזהר מחסרון כיס, שעלול להוביל לחטא ולפגום בכוונה.","contents":[{"passage_id":"vayikru1_5ded0d0b_p1","passage_content":"צו את אהרן ואת בניו לאמר זאת תורת העולה וגו'. פירש\"י ז\"ל אין צו אלא לשון זירוז מיד ולדורות אמר ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס. וצריך ביאור לדברי ת\"ק למה הוצרך הכתוב לזרז במצות עולה יותר מבשאר מצוות, שכולם נוהגות לדורות. וגם לדברי ר\"ש קשה למה לא הוצרך הכתוב לזרז גם בשאר מצוות שיש בהם חסרון כיס."},{"passage_id":"vayikru1_5ded0d0b_p2","passage_content":"ב) בזה\"ק (פ' זו דף כ\"ג ע\"א) איתא צו דא ע\"ז רוח מסאבא, וצ\"ב."},{"passage_id":"vayikru1_5ded0d0b_p3","passage_content":"ג) במדרש תנחומא (סי' א) ד\"א צו את אהרן וגו' אמר הקב\"ה קיימו מה שכתוב למעלה מן הענין ואח\"כ זאת תורת העולה למה כי אני ה' אוהב משפט שונא גזל בעולה (ישעיה ס\"ח) אפילו בעולה מה כתיב למעלה מן הענין והיה כי יחטא ואשם והשיב את הגזלה אשר גזל ואח\"כ זאת תורת העולה וכו' אם בקשת להקריב קרבן לא תגזול לאדם כלום וכו' ואימתי אתה מעלה עולה ואני מקבלה כשתנקה כפיך מן הגזל, מה היא הגזל דוד אמר מי יעלה בהר ה' ומי יקום במקום קדשו נקי כפים ובר לבב (תהלים כ\"ד) זאת תורת העולה מי שהוא נקי כפים מן הגזל הוא יעלה בהר ה' וכו' עכ\"ל. וצריך ביאור להבין שאלת המדרש מה היא הגזל, הכי לא ידע כי גזל הוא חטיפת ממון מחבירו. וגם מה השיב המדרש על שאלתו מדברי דוד המלך ע\"ה נקי כפים וגו', אכתי לא נודע מזה מהות הגזל."},{"passage_id":"vayikru1_5ded0d0b_p4","passage_content":"ד) עוד איתא במדרש תנחומא (י\"ד) ד\"א צו את אהרן ואת בניו וכו' למה אמר זאת תורת העולה ירצה לומר קריאת תורה ראו כמה חביבה קריאת תורה לפני הקב\"ה וכו' שנאמר צו את אהרן ואת בניו לאמר כלומר שיאמרו לבני ישראל ויתעסקו בקריאת העולה שאע\"פ שמקריבין עולה עוסקין היו בקריאתה כדי שיזכו בקרבן עולה ובקריאתה וכו' עכ\"ל. וצ\"ב למה הוצרך הכתוב לצוות ביחוד על העסק בפרשת עולה, והרי פשיטא שיש חיוב ללמוד פרשת עולה, שהוא בכלל מצות ידיעת התורה. ואם תמצי לומר שצוה הכתוב לעסוק בפרשת עולה כדי שיעלה להם הלימוד במקום קרבן, יש לתמוה שהרי המדרש מיירי בזמן שבהמ\"ק היה קיים, כדקאמר שאע\"פ שמקריבין עולה עוסקין היו בקריאתה, וא\"כ למה הוצרכו לעסוק בפרשת עולה במקום הקרבתה, והרי היה בידם להקריב עולה בפועל, שהיא חשובה יותר מלימוד פרשת העולה, כאשר מוכיח מאמרם ז\"ל (מנחות ק\"י) כל העוסק בתורת חטאת כאילו הקרוב חטאת וכו'. משמע שנחשב רק כאילו הקריב ולא כקרבן ממש. ומה שאמרו ז\"ל שנצטוו ישראל לעסוק בתורת הקרבנות ויעלה להם כקרבן, היינו אחר החרבן שלא היה בידם להקריב הקרבנות בפועל, וכמו שפי' הכלי יקר על הכתוב היא העולה על מוקדה כל הלילה וגו' וז\"ל, והודיע לנו הכתוב שזמן העולה כל הלילה עד הבוקר וכו' על צד הרמז בא שזמן העולה כל הלילה עד הבוקר כך הזמן המוכן לזה שהעוסק בתורת עולה דומה כאילו הקריב עולה הוא בזמן הגלות שנמשל ללילה כי אז צריכים ישראל לשלם פרים שפתותיהם ועד הבוקר ולא עד בכלל כי בזמן שיעלה בקרן של ישראל אז יעלו על מזבח ה' פרים ממש וכו' עכ\"ל."},{"passage_id":"vayikru1_5ded0d0b_p5","passage_content":"ה) זאת תורת העולה הוא העולה. כתב הכלי יקר ז\"ל שהסכימו כל המפרשים לומר שהכתוב בא להודיע שכל העוסק בתורת עולה כאילו הקריב עולה וע\"ז אמר זאת תורת העולה העוסק בתורת העולה הוא העולה זה טוב כמו הקרבת העולה עצמה. וכ\"כ בעל הטורים בפרפראותיו. וצ\"ב למה איצטריך להו למילף מהאי קרא שכל העוסק בתורת עולה כאילו הקריב עולה, והרי בגמרא דרשינן ליה מקרא אחרינא כדאי' במנחות (דף ק\"י) אמר ריש לקיש מאי דכתיב זאת התורה לעולה ולמנחה לחטאת ולאשם כל העוסק בתורה כאילו הקריב עולה ומנחה חטאת ואשם, ותרי קראי למה לי."},{"passage_id":"vayikru1_5ded0d0b_p6","passage_content":"ו) כ\"ק אבא מארי זלה\"ה בקדושת יו\"ט פ' זו הביא מדרש פליאה וז\"ל. שאלו תלמידיו את ר' יוסי בן קיסמא אימת בן דוד בא השיב להם זאת תורת העולה. והוא פלאי."},{"passage_id":"vayikru1_5ded0d0b_p7","passage_content":"ז) להלן בפרשה, וזאת תורת זבח השלמים וגו' במדרש תנחומא (ד) זש\"ה אשמעה מה ידבר האל ה' כי ידבר שלום אל עמו ואל חסידיו וגו' (תהלים פ\"ה) אמרו אומות העולם לבלעם למה אמר הקב\"ה לישראל שיהיו מקריבין לו קרבנות ולנו לא אמר כלום אמר להם בלעם הקרבנות אינן אלא שלום ומי שקיבל את התורה שכתובין בה צריך שיקריב קרבנות אתם מתחלה פסלתם אותה ועכשיו אתם מבקשים להקריב קרבנות מי שקבלה הוא מקריב קרבנות שנא' ה' עוז לעמו יתן ה' יברך את עמו בשלום (תהלים כ\"ט) לכך נאמר אשמעה מה ידבר הא-ל ומה דבר וזאת תורת זבח השלמים וכו' ולמה נא' זבח שלמים שהוא עושה שלום בין המזבח ובין הכהנים ובין ישראל וכו' עכ\"ל. וצ\"ב הטעם שתלויה הקרבת הקרבנות בקבלת התורה."},{"passage_id":"vayikru1_5ded0d0b_p8","passage_content":"ח) להלן בפרשה זאת התורה לעולה למנחה ולחטאת ולאשם ולמילואים ולזבח השלמים. במד\"ר (פ\"ט ח') א\"ר אחא משל לשלטון שנכנס למדינה ועמו כיתות כיתות של לסטים אמר אחד לחבירו מה דחיל הדין שליטא א\"ל הדא פסטמא דילך טבא (דבור והנהגה שלך יהא טוב) ולית את דחיל מיניה כך כיון ששמעו ישראל פרשת קרבנות נתיראו אמר להן משה אל תיראו התעסקו בתורה ואין אתם יראים מכל אלה הה\"ד זאת התורה לעולה למנחה וכר ע\"כ. והוא תמוה מה היה פחדם ויראתם של ישראל בשמעם פרשת הקרבנות, וגם איך הפיג משה פחדם והניח דעתם באמרו להם התעסקו בתורה ואין אתם יראים מכל אלה. עוד צ\"ב דמיון המשל שמביא המדרש לשלטון שנכנס למדינה ועמו כיתות כתות של לסטים אל הנמשל שהוא ענין הקרבנות."},{"passage_id":"vayikru1_5ded0d0b_p9","passage_content":"ט) בתורת כהנים פרשה זו (פרק י\"ח) איתא זאת התורה לעולה למנחה ולחטאת ולאשם ולמילואים ולזבח השלמים מה מילואים נאמרו כללותיהן ודקדוקיהם בסיני אף כולם נאמרו כללותיהם ודקדוקיהם בסיני (ופירש הראב\"ד ז\"ל שם דהוקשו כולם למילואים מה מילואים כללותיהם ודקדוקיהם נאמרו בסיני שהרי קודם שהוקם המשכן נאמר לו הכל כדכתיב בפ' תצוה אף כולם נאמרו כללותיהם בסיני) אי מה מילואים קרבן צבור אף אין לי אלא קרבן צבור יחיד מנין ת\"ל ולאשם וכו' אשר צוה ה' את משה בהר סיני ביום צוותו את בני ישראל להקריב את קרבניהם זה הבכור והמעשר והפסח. לה' לרבות את כולם שכולם נאמרו כללותיהם ודקדוקיהם מסיני עכ\"ל התו\"כ. וקשה כיון דמסיק לרבות כל הקרבנות כולם שנאמרו כללותיהם ודקדוקיהם בסיני מדכתיב לה', א\"כ אמאי איצטריך לרבות כל קרבן בפני עצמו מריבויא אחרינא, כל הני ריבויי למה לי. וגדולה מזו יש להקשות כמו שהקשו המפרשים על מה שפירש\"י ז\"ל בריש פרשת ואלה המשפטים וגו' כ\"מ שנאמר אלה פוסל את הראשונים ואלה מוסיף על הראשונים מה הראשונים מסיני אף אלו מסיני, ע\"כ והקשו הר\"א מזרחי והאור החיים הק' וכל המפרשים אמאי איצטריך לרבות שהמשפטים נאמרו בסיני, והרי רש\"י ז\"ל פירש בפ' בהר מה שמיטה נאמרו כללותיה ודקדוקיה מסיני אף כולן נאמרו כללותיהן ודקדוקיהן מסיני כך שנויה בתו\"כ, עכ\"ל. והוא כדעת ר\"ע בזבחים (קט\"ו ע\"ב), וא\"כ כיון שכבר למדנו שכל המצוות נאמרו כללותיהן ודקדוקיהן מסיני פשיטא שגם המשפטים בכלל, ומאי איצטריך לרבותם מדכתיב ואלה בתוספת וא\"ו. ועוד הוסיפו המפרשים להקשות שאפי' נימא דדברי רש\"י בפ' משפטים אזלי בשיטת ר' ישמעאל דס\"ל (שם), כללות נאמרו בסיני ופרטות באהל מועד, נמי לא אתי שפיר, שאם נאמר דמרבינן מואלה המשפטים שכללי המשפטים נאמרו בסיני, קשה אמאי איצטריך ריבויא הרי בכלל כל התורה הם, ואי נימא דאתי לרבות שגם פרטותיהם נאמרו בסיני, קשה מה טעם נשתנו המשפטים מכל המצוות שגם פרטותיהם נאמרו בםיני. וככל החזיון הזה וככל אלו הקושיות יש להקשות גם על דרשת התורת כהנים הנ\"ל, דאמאי איצטריך לרבות הקרבנות שנאמרו בהר סיני, הרי בכלל כל התורה הם. ולקושיא זו רמז באה\"ח הק' בפרשתן. ותגדל מדורת הקושיא שהתו\"כ בפ' בהר יליף מה שמיטה נאמרו כללותיה ודקדוקיה מסיני אף כולן נאמרו כללותיהן ודקדוקיהן מסיני. וא\"כ אמאי איצטריך לרבות קרבנות שנאמרו כללותיהן ודקדוקיהן בסיני."},{"passage_id":"vayikru1_5ded0d0b_p10","passage_content":"בטרם נבא אל ביאור הענין, נקדים לבאר פסוקי ההפטרה דפרשה זו בנבואת ירמיה (פ\"ז) שנתקשו בהם הראשונים ז\"ל דכתיב. כה אמר ה' ד' אלקי ישראל וגו' כי לא דברתי את אבותיכם ולא צויתים ביום הוציאי אותם מארץ מצרים על דברי עולה וזבח כי אם את הדבר הזה צויתי אותם לאמר שמעו בקולי ואתם תהיו לי לעם וגו'. וכתב הרמב\"ם ז\"ל בספר המורה (ח\"ג פל\"ב) שכבר הוקשה זה המאמר בעיני כל, שנשמעו דבריו כאילו לא ציוונו הקב\"ה על הקרבת עולה וזבח, והרי רוב המצוות נצטווינו בדיני קרבנות, והשיב על זה ב' תשובות האחד שכוונת הכתוב לומר שרצון השי\"ת וכוונתו היתה שישיגוהו בני ישראל ולא יעבדו זולתו, והוא יהיה להם לאלקים והמה יהיו לו לעם, ותכלית מצות הקרבנות ועבודת בית אלקינו היו בעבור שתעלה בידינו כוונה זאת, ובעבור זאת העתיק אלו העבודות שהיו נעשים לע\"ז, וצוה לעשותם לשמו, עד שימחה שם הע\"ז מן העולם, ותתקיים פנת יחודו. אמנם בני ישראל בטלו התכלית ההוא, והתחזקו במה שנעשה בעבורו, כי הם ספקו במציאותו כמו שאמר כחשו בה' ויאמרו לא הוא, ועבדו ע\"ז וקטרו לבעל והלכו אחרי אלהים אחרים, והיו באים אל הבית ומקריבים הקרבנות ולא היו מכוונים כוונה ראשונה שעבורה ציוום ה' בעבודת הקרבנות."},{"passage_id":"vayikru1_5ded0d0b_p11","passage_content":"עוד כתב הרמב\"ם ז\"ל לפרש הכתובים בדייקו במאמר הכתוב ביום הוציאי אותם מארץ מצרים, והוא שכבר התבאר בפסוק ובקבלה שתחלת המצוות שנצטווינו בהם לא היה בדברי עולה וזבח כלל, כי הנה בראשונה אחרי יציאת מצרים התחילו לקבל מצוות במרה, ולא קבלו שם אלא שבת ודינים כדברי חכז\"ל, וכמו שאמר הכתוב שם שם לו חוק ומשפט, אבל לא היו במצוות ההם דברי עולה וזבח. והוקשה להרמב\"ם ז\"ל על פירושו שהרי נצטוו על פסח מצרים שהיה קרבן וזבח, והשיב שהמצווה ההיא היתה לסבה אחרת, ושלא נצטוו עליה אלא במצרים לא אחרי היציאה משם, עכת\"ד הרמב\"ם ז\"ל. והאברבנאל הביא דבריו והשיג עליהם, על התשובה הראשונה שהשיב הרמב\"ם ז\"ל כי כוונת הכתוב לומר כי לא צווה הקב\"ה על הקרבנות אלא כדי שבאמצעותם יגיעו ישראל להשגת הבורא יתברך ולא יעבדו זולתו, וישראל ביטלו כונה זו, ולפי זה פירוש הפסוק כי לא ציויתי את אבותיכם וגו' על דבר עולה וזבח, היינו שלא צווה אותם שיהיה הקרבן עיקר התכלית והכוונה, וא\"כ עיקר חסר מן הספר, כי לא נזכר בכתוב כלל לאיזה כוונה נצטוו במצות הקרבנות. ועל הפירוש השני שפירש הרמב\"ם ז\"ל כי כוונת הכתוב שלא היתה מצות הקרבנות מצוה ראשונה שנצטוו בה ישראל, הקשה האברבנאל ז\"ל מה נוגע דבר זה לענין התוכחה שהוכיח הנביא את ישראל. ומה להם לישראל אם הקרבנות הם המצוה הראשונה שנצטוו בה, או שתהיינה מצוות אחרות קודמות לה והיא אחריהן, כי הנה לא ימלט מהיות הקרבנות מצוה אלוקית, בין שתהיה ראשונה שניה או שלישית מתרי\"ג מצוות."},{"passage_id":"vayikru1_5ded0d0b_p12","passage_content":"ועל כן פירש האברבנאל ז\"ל דברי הכתוב באותן אחר, ותוכן דבריו הוא, כי ישראל כשיצאו ממצרים ובאו לפני הר סיני ושמעו התורה והמצוות, לא צוום ה' דבר מענין הקרבנות, אבל ציוום עניני האמונות והמעשים המשובחים אשר יעשו, אמנם כאשר עשו העגל וראה השי\"ת שרירות לבם הרע. ובכל יום ויום יחטאו לפניו, הוצרך לתקן להם צרי ורפואה למחלתם, ולכן באו מצוות הקרבנות שלא נצטוו עליהם אילו לא היו חוטאים, וזה אומרו כאן כי לא דברתי עם אבותיכם ולא צויתים ביום הוציאי אותם מארץ מצרים, רומז למעמד הר סיני וקבול המצוות שבפרשת יתרו ומשפטים, שבהם לא צוה אותם השי\"ת על דברי עולה וזבח, אלא צוה אותם לשמוע בקולו והוא יהיה להם לאלקים והם יהיו לו לעם. ולפי שאותם הדורות שהיו אז לא שמעו ולא הטו אזנם וילכו במועצות לבם הרע, רימז הכתוב בזה למה שחטאו בעגל במועצותם שהיו מתיעצים כי בושש משה, ועל זה מפני כובד חטאתם הוצרכו למצות הקרבנות. עכת\"ד האברבנאל ז\"ל. ולפי דרשת התורת כהנים הנ\"ל שהקרבנות נאמרו בסיני כללותיהן ופרטותיהן נסתר גם פירושו, שהרי אי אפשר לומר כדבריו שלא נצטוו על הקרבנות אלא אחר חטא העגל."},{"passage_id":"vayikru1_5ded0d0b_p13","passage_content":"גם פירש\"י ז\"ל שם קשה להלמו שכתב לפרש דברי הכתוב כי לא דברתי את אבותיכם וגו' ביום הוציאי אותם מארץ מצרים, וז\"ל תחלת תנאי לא היתה אלא אם שמוע תשמעו בקולי ושמרתם את בריתי והייתם לי סגולה (שמות י\"ט). ע\"כ. ובדרך זו דרך גם הרד\"ק ז\"ל. וקשה שהרי כיון שתחלת התנאי שהתנה הקב\"ה עם ישראל היה אם שמוע תשמעו בקולי וגו', א\"כ בתנאי זה נכללת שמירת התורה כולה וגם הקרבנות בכלל."},{"passage_id":"vayikru1_5ded0d0b_p14","passage_content":"ונראה ליישב מאמר הכתוב שנתקשו בו כל הראשונים ז\"ל, על פי דרכו של האברבנאל ז\"ל אך באופן אחר, ודרך שם נפנה ליישב כל הקושיות המובאים בתחלת הדרוש. ותחלה נקדים לבאר דברי הגמרא סוף מנחות (דף ק\"י) וז\"ל אמר ריש לקיש מאי דכתיב זאת התורה לעולה למנחה ולחטאת ולאשם כל העוסק בתורה כאילו הקריב עולה ומנחה חטאת ואשם אמר רבא האי לעולה ולמנחה עולה ומנחה מיבעי ליה (פירש\"י עולה ומנחה מיבעי ליה דליהווי משמע זאת התורה היא עולה ומנחה) אלא אמר רבא כל העוסק בתורה אינו צריך לא עולה ולא מנחה ולא חטאת ולא אשם (דהכי משמע זאת התורה לעולה כלומר במקום עולה למנחה בשביל המנחה כגון לכם בשבילכם כלומר התלמוד תורה מכפר על עוונותינו) ע\"כ."},{"passage_id":"vayikru1_5ded0d0b_p15","passage_content":"ולכאורה אין מובן במאי פליגי ר\"ל ורבא, שהרי לתרוייהו חשוב לימוד התורה כקרבן, וכתב בעיון יעקב שם לבאר מחלקותם דריש לקיש קאמר כל העוסק בתורה \"כאילו\" הקריב עולה וכו', משמע דס\"ל שהוא רק נחשב כקרבן, אבל הקרבת קרבנות בפועל עדיפא מלימוד תורה, ועליה פליג רבא ואמר כל העוסק בתורה אינו צריך לא עולה וכו', דסבר שלימוד התורה עדיף מהקרבת קרבן בפועל, וכ\"כ בהקדמת הספר סמיכת חכמים דרבא ס\"ל דתורה עדיפא מקרבנות."},{"passage_id":"vayikru1_5ded0d0b_p16","passage_content":"והנה בכל פלוגתא בדברי חז\"ל אמרינן אלו ואלו דברי אלקים חיים, ורש\"י ז\"ל במסכת כתובות (דף נ\"ז ע\"א ד\"ה הא קמ\"ל) אסברא לן וז\"ל, כי פליגי תרי אמוראי בדין או באיסור והיתר כל חד אמר הכי מסתבר טעמא אין כאן שקר כל חד וחד סברא דידיה קאמר מר יהיב טעמא להיתירא ומר יהיב טעמא לאיםורא מר מדמי מילתא למילתא הכי ומר מדמי ליה בענינא אחריני ואיכא למימר אלו ואלו דברי אלוקים חיים הם זמנין דשייך האי טעמא וזמנין דשייך האי טעמא שהטעם מתהפך לפי שינוי הדברים בשינוי מועט, עכ\"ל. וכמו כן הכא נמי נימא כי בעיקר הדבר לא פליגי ריש לקיש ורבא, אלא דכל חד מוקי לקרא במילתא אחריתא, זמנין שייך טעמיה דר\"ל וזמנין דשייך טעמיה דרבא. דהנה הא פשיטא דרבא דאמר דלימוד התורה עדיף מקרבן מיירי בעוסקים בתורה לשמה, כמ\"ש באור החיים הק' (פ' בחקותי) דרק תורה לשמה היא מגן נגד היצה\"ר, ברם גם בתורה לשמה לאו כל אנפין שוין, ומדרגות שונות יש גבוה מעל גבוה, וכמו שמצינו מה רב ועצום היה כח קדושת תורתם של התנאים והאמוראים הקדושים, אשר כידודי אש מפיהם התהלכו בעסקם בתורה, וכמו שאמרו ז\"ל (סוכה כ\"ח ע\"א) על יונתן בן עוזיאל שכל כך שגבה מעלתו, אשר בעת עסקו בתורה, כל עוף הפורח עליו מיד נשרף מלהבת שלהבת קדושת תורתו. וצריך לומר דמילתיה דרבא קאי על העוסקים בתורה לשמה בבחינתה המעולה ביותר, ולשיטתיה אזיל דאמר ביבמות דף ק\"ה (לדעת רש\"י שם דגריס רבא) על מאמר הכתוב (שמואל א' ג) לכן נשבעתי לבית עלי אם יתכפר עון בית עלי בזבח ומנחה אמר רבא בזבח ומנחה אינו מתכפר אבל מתכפר הוא בדברי תורה, והתם מיירי בעוסקים בתורה לשמה בבחינתה המעולה, כדמייתי בגמרא עלה, רבה דמבית עלי קאתי (אשר נגזר עליהם למות בני י\"ח) וע\"י שעסק החורה חיה ארבעין שנין. ועל בחינה גבוהה זו של תורה לשמה העיד התנא ר\"מ (אבות פ\"ו מ\"א) כל העוסק בתורה לשמה זוכה לדברים הרבה."},{"passage_id":"vayikru1_5ded0d0b_p17","passage_content":"ברם זעירין אינון שזוכין להשיג בחינה עליונה זו של תורה לשמה, וכמ\"ש המהרח\"ו ז\"ל (בהקדמתו לעץ חיים) אם יאמר לך אדם שלמד תורה לשמה התנא ר\"מ מכחישו כי אן אינון הדברים הרבה שזכה להם. אלא יש מדרגות בתורה לשמה בבחינה קטנה יותר, ועלייהו קאמר ריש לקיש כל העוסק בתורה כאילו הקריב עולה ומנחה וכו', ולא כעולה ומנחה ממש, ואף שגם ריש לקיש מיירי בעוסקים בתורה לשמה, אך כיון שאינה בבחינה מעולה כל כך אינה חשובה אלא כאילו הקריב קרבן. נמצא כי לא פליגי ריש לקיש ורבא, אלא דרבא מיירי בעוסקים בתורה לשמה בבחינה גבוהה ביותר, על כן אמר אין צריך לא עולה ולא מנחה וכו', וריש לקיש נמי מיירי בעוסקים לשמה אך לא במדרגה גבוהה כ\"כ, ועל כן הוא רק \"כאילו\" הקריב קרבן."},{"passage_id":"vayikru1_5ded0d0b_p18","passage_content":"ועל פי אמרינו יש להוסיף נופך ולתת טוב טעם לדברי האברבנאל ז\"ל, שכתב לפרש בדברי הכתוב שקודם חטא העגל לא נצטוו ישראל להקריב קרבנות, ורק אחר שחטאו בעגל נצטוו בקרבנות, כי בעת שעמדו ישראל על הר סיני פסקה זוהמתן ונזדככו אבריהם, וודאי הוא שכח קדושת תורתם היה רב ועצום, ועסקו בתורה לשמה בבחינתה המעולה ביותר, ועל כן לא היו זקוקים לקרבנות, כי עסק התורה במעלה עליונה זו עדיפא מקרבנות, כדאמר רבא כל העוסק בתורה אין צריך לא עולה ולא מנחה וכו', אבל אחר שחטאו בעגל נפלו ממדרגתם ואבדו מעלתם, וכבר לא זכו לעסוק בתורה לשמה בבחינה גבוהה כ\"כ שתהיה נבחרת תורתם מזבח, אלא שעסקו בתורה בבחינה פחותה מזו, שנחשב להם עסקם בתורה רק כאילו הקריבו קרבן, על כן נצטוו להקריב קרבנות, כי הקרבת קרבן בפועל עדיפא מלימוד התורה בבחינה זו."},{"passage_id":"vayikru1_5ded0d0b_p19","passage_content":"אך בדברינו עדיין לא עלתה ארוכה למה שהקשינו על פירוש האברבנאל ז\"ל, דאיך אפשר לומר שלא נאמרו להם הקרבנות בסיני, והלא מפורש בתורת כהנים שנאמרו הקרבנות כולם בסיני כללותיהן ודקדוקיהן. ונראה לומר עפ\"י מה דאיתא בגמרא ע\"ז (דף ה' ע\"א) דפריך למימרא דאי לא חטאו ישראל לא הוו מייתי והכתיב פרשת יבמות ופרשת נחלות ומשני על תנאי ומי כתיבי קראי על תנאי אין דהכי אמר ר\"ל וכו' הוא דאמר כי האי תנא דתניא ר' יוסי אומר לא קבלו ישראל את התורה אלא כדי שלא יהא מלאך המות שולט בהם שנאמר (תהלים פ\"ב) אני אמרתי אלהים אתם ובני עליון כלכם חבלתם מעשיכם אכן כאדם תמותון, ע\"כ. וצריך לומר דהא דפריך בגמרא והכתיבי פרשת יבמות ופרשת נחלות הכי פירושו דאף שראתה חכמתו יתברך שעתידים ישראל לחבל מעשיהם, ותחזור עליהם גזירת המיתה, מ\"מ ליכא למימר שעל שם שעתידים לחטוא נאמרו להם בהר סיני פרשיות אלו, שהרי החטא הוא דבר התלוי בבחירה, ודבורו יתברך מכריח את הבחירה, נמצא כי אילו נאמרו להם פרשיות אלו בבחינת ציווי מוחלט היו מוכרחים לחטוא וע\"כ משני בגמרא שנאמרו להם ע\"ת, כדי שלא להכריח את הבחירה. והנה לפי מה שנתבאר בדברינו לעיל כי כאשר עמדו ישראל על ה\"ס היו בבחינה עליונה כ\"כ שלימוד תורתם היה חשוב יותר מקרבנות א\"כ תקשה כקושית הגמרא על הא דדריש בת\"כ שנאמרו לישראל דיני הקרבנות בסיני כללותיהן ופרטותיהם, וקשה האיך נצטוו על הקרבנות והלא אילו לא חטאו לא היו צריכים לקרבנות כלל, כי תורתן הויא עדיפא מקרבנות, ולכאורה דבורו יתברך שצוה על קרבנות מכריח את הבחירה שיחטאו. ועל כרחך עלינו ליישב דברי התו\"כ כדמשני בגמרא, ונאמר שגם פרשיות הקרבנות על תנאי נאמרו, שאם יחטאו ויפלו ממדרגתם ולא יחשב לימוד תורתם כקרבן, אזי יקריבו קרבנות בפועל. נמצא כי כאשר נאמרו להם דיני קרבנות בהר סיני לא נאמרו בתורת ציווי, אלא על תנאי אם יחטאו ויפלו ממדרגתם, ורק אחר שחטאו ונפלו ממדרגתם, ולא נחשב להם לימוד התורה יותר מקרבן, אל עליהם ציווי הקרבנות."},{"passage_id":"vayikru1_5ded0d0b_p20","passage_content":"ועל פי זה יתפרשו לנו היטב דברי הכתוב כי לא דברתי את אבותיכם ולא ציוויתים ביום הוציאי אותם מארץ מצרים וגו' על דבר עולה וזבח. והכוונה כי לא נאמרה להם מצות הקרבנות בהר סיני בדבור של ציווי, שהרי היו אז במדרגה עליונה שלא הוצרכו לקרבנות, ולא נאמרה להם אלא על תנאי, והיו דברי הנביא בזה תוכחת מוסר לישראל, שעוונותיהם גרמו שלא זכו ללמוד תורה לשמה שתהיה חשובה יותר מקרבנות, ועל כן הוצרכו לקרבנות בפועל."},{"passage_id":"vayikru1_5ded0d0b_p21","passage_content":"ועל פי זה יש ליישב מה שקשה על הת\"כ (קושיא ט') אמאי צריך ריבוי שהקרבנות נאמרו בסיני והלא התורה כולה נאמרה בסיני וגם קרבטת בכלל. ולדברינו א\"ש כי הוה אמינא דאף שהתורה נאמרה בסיני, מ\"מ יצאו קרבנות מכללם, לפי שלא הוה שייך גבייהו ענין הקרבנות בעת מ\"ת, שהיתה תורתם בבחינה גדולה יותר מקרבנות, על כן איצטריך ריבויא יתירא שאף קרבנות נאמרו בסיני, אלא שנאמרו על תנאי, כדי שלא יהא הדיבור מכריח את הבחירה. ומה שנאמרו להם הקרבנות בסיני ולא המתין הקב\"ה לצוותם עד עת שיתחייבו בהם אחר החטא, יש לומר בפשטות כי לפי שדבור הקב\"ה בהר סיני היה בבחינה גבוהה ביותר, בקולות וברקים והתגלות אלקות נפלאה, על כן נאמרה להם אז אף פרשת הקרבנות בהתגלות זו, אך לא נאמרו להם בבחינת ציווי אלא על תנאי. וגם יתיישב מה שהקשינו דאמאי איצטריך בת\"כ לרבות כל קרבן וקרבן בפני עצמו, הא בסוף מרבה כל הקרבנות מדכתיב להקריב את קרבניהם לה' וגו', והשתא א\"ש דאי מהתם הר\"א שלא נתרבו רק הקרבנות שאינם באים על חטא, שאינם מורים כ\"כ בהכרח שעתידין ישראל לחטוא, אלא שלא יהיו בבחינה גבוהה כ\"כ שתהיה תורתם חשובה מן הקרבנות, אבל הקרבנות הבאים על חטא לא נאמרו בסיני, שהרי היו במעלה עליונה ולא היו עלולים אז לחטוא, קמ\"ל ריבויא יתירא שגם אותם קרבנות בסיני נאמרו, אלא שלא נאמרו בציווי כי אם על תנאי."},{"passage_id":"vayikru1_5ded0d0b_p22","passage_content":"ובדרך זה יתבאר גם המדרש (קושיא ח') בשעה ששמעו ישראל פרשת הקרבנות נתייראו וכו'. דהנה מדברי הכתוב זאת התורה לעולה למנחה נלמד שכל העוסק בתורה אינו צריך עולה ומנחה וכו', כדדריש רבא. וכיון ששמעו ישראל פרשת הקרבנות ונודע להם שאפשר לצאת ידי חובת הקרבן בלימוד התורה, כדדרשינן מזאת התורה לעולה וגו', המה ראו כן תמהו למה זה הוצרכו לצוותם גם על הקרבת קרבנות בפועל, הלא טוב להם לקיים מצוה זו ע\"י לימוד התורה, ועל כרחך נצטוו על הקרבנות לפי שיגרום החטא, ולא תתקבל תורתם לרצון כקרבן כליל ואישים, ועל זאת נבהלו נחפזו רעדה אחזתם למשמע אזנם כי עתידים הם לנפול ממדרגתם, ולא יעמדו על עמדם הקודם שהיו בו בעת מ\"ת, ולא יזכו לעסוק בתורה לשמה במדרגה עליונה, ובהאי פחדא יתבו כי אם לא יהי' להם כח התורה כדבעי, איך ובמה יוכלו לעמוד נגד היצה\"ר, שאין לך דבר העומד כנגדו כי אם כח התורה, וכדאי' בזה\"ק (ואתחנן רס\"ח ע\"א) לית לי' מקטרג ליצה\"ר בר מילי דאורייתא. ומובן נמי משל המדרש לשלטון שנכנס למדינה ועמו כיתות כיתות של לסטים וכו', כי מדמה את הס\"מ ללסטים האורב על האדם למשכו ברשתו ולהפילו לבאר שחת, וממנו נתיראו ישראל יראה גדולה. ויאמר משה אל העם התעסקו בתורה ואין אתם יראים מכל אלה, פירוש כי הודיעם שלא נאמר ציווי הקרבנות אלא על תנאי, ואין הכרח שלא יעלה עסק התורה שלהם במקום קרבן, ואם יזכו ללמוד תורה לשמה כדבעי, אזי תהא תורתם עדיפא מקרבנות, כדרבא דאמר כל העוסק בתורה אין צריך לא עולה וכו', ולא זו בלבד אלא שאפילו אם לא יזכו למדרגה גבוהה זו שיעלה לימוד תורתם במקום קרבן, אין להם להתיירא מן היצה\"ר, כי עסק התורה אפילו אם אינו בשלימות הראוי, הוא מגן ומחסה מפני כוחות היצר."},{"passage_id":"vayikru1_5ded0d0b_p23","passage_content":"ובדדך זה יבוארו גם דברי המדרש תנחומא (ד) ראו כמה חביבה תורה לפני הקב\"ה וכו' שיאמרו לבני ישראל ויתעסקו בקריאת העולה שאעפ\"י שמקריבין עולה עוסקים היו בקריאתה וכו'. כי נתבאר לעיל שאם זוכים ללמוד תורה לשמה כראוי תורתם חשובה מקרבנות, ועל כן נצטוו לעסוק בתורה במקום קרבן, אלא לפי שיש לחוש שמא לא יזכו למדרגה שתהא תורתם עדיפא, לכן נצטוו להקריב קרבנות בפועל, וגם מלימוד התורה אל יניחו ידם, כי שמא יזכו ותהיה תורתם חשובה מקרבנות."},{"passage_id":"vayikru1_5ded0d0b_p24","passage_content":"ובבחינה זו פירשנו דברי רש\"י ז\"ל בריש פרשת ויקרא על מאמר הכתוב וידבר ה' אליו מאהל מועד לאמר פירש\"י ז\"ל לאמר צא ואמור להם דברי כבושים בשבילכם הוא נדבר עמי וכו', ע\"כ. והקשו המפרשים שאין אלו דברי כבושים אלא דברי שבח וגדולה לישראל שהקב\"ה מדבר עמו בעבורם. ולדברינו יובן כי מה שנצטווה משה לאמר להם פרשת הקרבנות הם הם דברים הכובשים לבו של אדם, שהרי אילו היו זוכים לעסוק בתורה לשמה כראוי, לא היו זקוקים לקרבנות, אלא שעוונותיהם גרמו שאבדו מעלתם, ולא זכו שיהיה עסק תורתם נבחר לה' מזבח. וזהו אומרו להם בשבילכם הוא נדבר עמי, כלומר כי לא בגיני נצטוויתי על פרשת הקרבנות, שהרי משה נשאר תמיד בבחינה הגבוהה שהשיג בשעת מ\"ת, וזכה ללמוד תורה לשמה בבחינה הגבוהה ביותר, עד שנתעצם בה כ\"כ שנקראת התורה על שמו, וא\"כ הוא לא הי' צריך לקרבנות כלל שהיתה תורתו חשובה מקרבנות, אלא נצטווה על מעשה הקרבנות בשביל ישראל שלא זכו לבחינה זו בעסק התורה, ודברים אלו נוקבים ויורדים חדרי בטן וכובשים לבו של אדם לתשובה, בראותו מה החטא גורם, שאבדו מעלתם ולא זכו לעסוק בתורה כראוי."},{"passage_id":"vayikru1_5ded0d0b_p25","passage_content":"ולבא אל ביאור שאר המדרשים והדקדוקים הנ\"ל נקדים מה שכתב הכלי יקר ז\"ל לפרש דברי ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס. עפ\"י מה דאיתא בירושלמי (תרומות סוף פ\"ח) מעשה בר' יוחנן דאביד ליה כיסתיה (הכיס של מעות) ובעון מיניה אוריתא ולא ידע אמרין ליה וכי מפני דאבדה כיסתך אבדה דעתך אמר להו דעתא בלבא תליא ולבא בכיסא תליא. מכאן ראיה שחסרון כיס יהולל חכם ויאבד לב מתנה אשר נתן לו אלקים לחשוב בחרושת עץ חיים וכו', ולפי שכל פרשה זו ציווי אל הכהנים לאמר לדורות ללמדם תורת הקרבנות והלימוד הוא מסתמא בחנם כארז\"ל (חגיגה ז' ע\"א) מה אני בחנם אף אתם בחנם. ועוד שהכהנים אינם עשירים כי אין להם חלק בארץ, וארוחתם דבר יום ביומו מן שלחן גבוה, ומחמת חסרון כיס שבהם חיישינן שמא יאבדו דעתם התלויה בכיס, ע\"כ בא לזרזם ואמר לו צו את אהרן ואת בניו לאמר, היינו לאמר לדורות ללמדם זאת תורת העולה, וכן כל זאת תורת הנאמרים בזאת הפרשה, כי הכל תורת כהנים הוא וכו', ע\"כ בא לזרזם לחזק לבם בתורת ה' ללמדם לדורות. ושלא יקרה להם כדרך שקרה לר' יוחנן שבעון מיניה אורייתא ולא ידע וכו', עכ\"ד הכלי יקר ז\"ל. והנה הכלי יקר ז\"ל העתיק דברי הירושלמי בלשון דעתא בלבא תליא ולבא בכיסא תליא, אמנם בירושלמי שלפנינו הגירסא כל האברים תלויים בלב והלב תלוי בכיס. ובאמת דא ודא אחת היא כי חסרון כיס מאבד דעתו של אדם, ואם אין בו דעת עלול הוא לחטוא כמ\"ש הרמב\"ם ז\"ל (הא\"ב פכ\"ב הכ\"א) אין ההרהור מצוי אלא בלב הפנוי מן החכמה. נמצא כי שתי הנוסחאות בדברי הירושלמי עולות בקנה אחד, כי ע\"י חסרון ממונו אבדה עצה מלבו ונסרחה חכמתו ודעתו, וכאשר אין דעת ותבונה בלבו לחשוב מחשבות בתורה הקדושה, מתגבר עליו היצר וכלי המעשה גומרים, ובא לידי חטא בפועל, נמצא כי אבריו וגם דעתו תלויים בלבו. ועל כן הוצרך הכתוב לזרז במקום שיש בו חסרון כיס, כי ע\"י חסרון כיס עלול הוא לבא לידי מחשבות עבירה, ועליו להקריב עולה כדי לכפר על יצר מחשבות לבו, בטרם יתגבר עליו היצה\"ר ויסיתו לעבור עבירה בפועל."},{"passage_id":"vayikru1_5ded0d0b_p26","passage_content":"אמנם עוד לאלוקי מילין לפרש דברי ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס באופן אחר, דהנה מודעת זאת אשר כדי שיוכל האדם להשיג דרך האמת בתוה\"ק עליו לזכך לבו ולטהרו מכל שמץ עון ואשמה, והטעם כי לימוד התורה הקדושה תלוי בבינת הלב, וכדאיתא בקהלת רבתי (פ\"א יז) עה\"פ (שם א) כל הנחלים הולכים אל הים כל התורה שאדם לומד אינה אלא בלב, ע\"כ. ולכן כאשר לבבו איננו טהור לא יוכל להגיע להשגה אמיתית בתוה\"ק. ועוד שהרי מבואר בירושלמי דדעתא בלבא תליא, ועל כן כאשר לבבו פונה ללכת אחרי עצת יצרו, גם דעתו והבנתו מושללת מהשגה אמיתית בתורה. והנה מן הדברים אשר חייב האדם להזהר בהם כדי לשמור על טהרת לבו וצלילות דעתו, הוא שיהיה זהיר מקבלת שוחד, כאשר הכתוב מעידו כי השוחד יעוור עיני חכמים (דברים ט\"ז) והטעם שהשוחד מביא לידי סמיות עינים יובן על פי מה שאמרו ז\"ל (כתובות ק\"ה ע\"ב) מאי שוחד שהוא חד ופירש\"י ז\"ל הנותן והמקבל נעשים לב אחד, ע\"כ. הרי כי ע\"י לקיחת השוחד לבבו פונה מדרך האמת והוא מצדיק רשע בריבו, וכיון שלבו איננו טהור חשך גם מאור עיני שכלו, כי דעתו וכל אבריו תלויים בלבו. ולא זאת בלבד שהמקבל שוחד אינו רואה את האמת בתוה\"ק, אלא שהוא מעוות ומסלף את דברי התוה\"ק עצמם, וכמו שביארנו כונת רש\"י ז\"ל שפירש במאה\"כ כי השוחד וגו' ויסלף דברי צדיקים, דברים המצודקים משפטי אמת, ע\"כ. ולכאורה כיצד אפשר לסלף את דברי התורה הקדושה, והרי כיון שהוא משנה בהם מדעתו אפילו כקוצו של יו\"ד נגד קבלת חז\"ל אין אלו קרויים ד\"ת אלא דברי עצמו, וא\"כ אין זה מסלף דברים המצודקים ומשפטי אמת, אלא מחליף ד\"ת בדבריו הבדויים. ולמה פירש\"י ז\"ל שהוא מסלף דברים המצודקים, שמשמעו שאינו אומר דברי עצמו אלא שאומר ד\"ת ומסלפם."},{"passage_id":"vayikru1_5ded0d0b_p27","passage_content":"ופירשנו (עי' בדברינו לעיל פרשת נח דף קכ\"ד באורך) דהנה בתורה\"ק נמצאים מצוות הפכיות אשר פעמים מצוה להשתמש במדה זו ופעמים לאחוז בשכנגדה, ועל האיש הישר וזך הלבב לשקול במאזני שכלו, אימת העת לקרב המדה ואימתי עת לרחקה, כגון בעוון לה\"ר שהחמירה תורה מאד, אך לא בכל עת ובכל זמן צריך האדם לנצור לשונו ולהאלם דומיה, אדרבה נגד משנאי ה' חייב האדם להשתמש במדה הפכיית, להתקוטט עמהם ולשנאותם ולהוכיחם על פניהם, וגם לגלות חרפתם בקהל רב, למען ידעו להבדל מעושי רשע, כמאה\"כ (תהלים קל\"ט) הלא משנאיך ה' אשנא ובמתקוממיך אתקוטט תכלית שנאה שנאתים וגו'. אמנם מי שדעתו משוחדת בשוחד ממון או שהוא משוחד משאר נגיעות ותאוות, וכמ\"ש בחוה\"ל אין לך משוחד יותר ממי שמשוחד מתאוותיו ורצונותיו ע\"כ. אזי ימצא אמתלא וסמך לדבריו מן התורה, ויענה ויאמר שאסור לפצות פה נגדם משום עון לה\"ר ושנאת חנם וכדומה, נמצא כי אין הוא אומר דברי עצמו, שהרי הוא מביא סמך לדבריו מן התורה, אלא שהוא מסלף דברי אלקים חיים, היינו שהוא אומרם בזמן שהתורה צוותה לעשות להיפך. וזאת כונת רש\"י ז\"ל שהוא מסלף דברים המצודקים, פירוש את הדברים המצודקים עצמם הוא מסלף ומעוות, ע\"י שהוא מתנהג בהם בהיפוך כוונתם. ומצאנו סמוכין לפירוש זה במה שדרשו ז\"ל (בילקוט תהלים רמז תרע\"ד) עה\"פ תורת ה' תמימה וגו' עדות ה' נאמנה וגו' (תהלים י\"ט) וז\"ל, אימתי היא תמימה בשעה שהיא יוצאה מפי תמים ואימתי היא נאמנה בשעה שהיא יוצאה מפי נאמן, ע\"כ. ולכאורה צ\"ב מה לנו מפי מי יוצאים הדברים, והלא אין הוא אומר דברי עצמו אלא דברי חורה, ועל כרחך לומר כמו שכתבנו כי מי שאינו תמים ונאמן היינו שלבבו פונה מדרך האמת והוא משוחד מנגיעותיו, גם כאשר יצאו דברי תורה מפיו, אין הדברים תמימים ונאמנים כי הוא מסלף דרכם ומהפך דברי אלקים חיים, לפי שאינו אומרם במקומם ובזמנם אשר ציותה התורה לעשותם."},{"passage_id":"vayikru1_5ded0d0b_p28","passage_content":"היוצא מדברינו כי כדי שיוכל האדם להשיג דבר אמת בתוה\"ק עליו לטהר לבו, וכדי לטהר לבו צריך הוא להקריב עולה המכפרת על הרהורי הלב, ואפי' הרהורי ע\"ז שהחמירה תורה בהם לצרף מחשבת ע\"ז למעשה כאמרם ז\"ל (קדושין מ' ע\"א) אעפי\"כ מתכפרים הם ע\"י קרבן עולה, כדאיתא במד\"ר פרשה זו (פ\"ז ג) ארשב\"י לעולם אין העולה באה אלא על הרהור הלב וכו' ממי אתה למד מבניו של איוב בתחלה והלכו בניו ועשו משתה (איוב א) וכו' והשכים בבוקר והעלה עולות מספר כולם וכו' כשהוא אומר כי אמר איוב אולי חטאו בני וברכו אלקים בלבבם הדא אמר אין העולה באה אלא על הרהור הלב, ע\"כ. הרי מבואר כי הקריב איוב עולות לכפר על חשש הרהורי ע\"ז של בניו, כדכתיב אולי חטאו בני וברכו אלקים בלבבם. הרי שכ\"כ גדולה הכפרה המושגת ע\"י הקרבת עולה, שהוא מכפרת אפי' על הרהורים וספקות באמונה ח\"ו, ועל כן זו היא הדרך שיגיע האדם להשגה אמיתית בתוה\"ק."},{"passage_id":"vayikru1_5ded0d0b_p29","passage_content":"ועפ\"י זה יש לבאר הכתוב זאת תורת העולה, פירוש כדי שיוכל האדם להגיע למדרגה שיחשב לימוד תורתו כהקרבת עולה ויותר, הוא העולה, עליו להקריב קרבן עולה בפועל לכפר על הרהורי לבו, וכאשר יהיה לבו זך ונקי, אזי תהיה תורתו חשובה מקרבן, ועפ\"י זה יובנו גם דברי הזה\"ק הנ\"ל (אות ב') צו דא ע\"ז כלומר שציותה תורה להקריב עולה לכפר גם על הרהורי ע\"ז כמבואר במדרש הנ\"ל, וע\"י שיהיה לבו בר ונקי מהרהורים יוכל להגיע לבחינת זאת תורת העולה, שתחשב תורתו כקרבן."},{"passage_id":"vayikru1_5ded0d0b_p30","passage_content":"ובדרך זה מיושב גם מה שהקשינו על מה שפירשו המפרשים (קושיא ה') דברי הכתוב זאת תורת העולה הוא העולה שכל הלומד תורת עולה כאילו הקריב עולה. ולכאורה הוא כמיותר שהרי חז\"ל (מנחות ק\"י) דרשו זאת מדכתיב זאת התורה לעולה וגו', ולדברנו א\"ש כי הוצרך הכתוב לגלות לנו זאת גם בפרשת עולה, דאי מהתם הוה אמינא שלימוד התורה בכל מצב שהוא חשוב במקום קרבן, על כן הודיענו הכתוב כי רק אם קדם ללימוד התורה הקרבת עולה, והיינו שטהר וזיכך לבבו ממחשבות רעות, אזי חשובה התורה הקדושה כקרבן, אבל כל זמן שלא נתכפר לו על הרהורי לבו, לא יוכל להשיג דעת תורה אמיתית."},{"passage_id":"vayikru1_5ded0d0b_p31","passage_content":"ולדרכנו מבוארים היטב דברי ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חםרון כים. דהנה נתבאר כי כוונת הכתוב לומר כי לא יוכל האדם להשיג השגה אמיתית בתוה\"ק עד שישוב בתשובה שלמה על הרהורי לבו, ויקריב עולה לכפר עליהם. וכבר קדם בדברנו לעיל כי מי שהוא משוחד ע\"י בצע ממון וכדומה לא יוכל לבא לידי טהרת הלב, כי לבו פונה אחרי בצעו, וא\"כ אין חפץ לה' בקרבן הבא לכפר על הרהורי הלב, אלא א\"כ יזהר מקבלת שוחד ומלנטות אחרי הבצע, ועל כן קאמר ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, שהרי כדי שירצה קרבנו לפני ה' לכפר על הרהורי לבו ולהשיג השגה אמיתית בתוה\"ק עליו להזהר מקבלת שוחד, ועולה לו הדבר בהפסד ממון, על כן הוצרכה תורה לזרז על כך ביותר."},{"passage_id":"vayikru1_5ded0d0b_p32","passage_content":"וגם יתבארו לנו בדרך זה דברי המדרש תנחומא (קושיא ג') וכו' ואימתי אתה מעלה עולה ואני מקבלה כשתנקה כפיך מן הגזל מה היא הגזל דוד אמר וכר נקי כפים ובר לבב וכו'. ולכאורה שאלת המדרש תמוהה וכי לא ידע מהות הגזל. אמנם על פי מה שנתבאר לעיל שלא ירצה קרבן עולה לפני ה' לכפר על מחשבות לב האדם, אא\"כ טיהר לבו מכל פגם, על כרחך לומר דמה דאיתא במדרש אימתי אתה מעלה עולה ואני מקבלה כשתנקה כפיך מן הגזל, אין הכונה רק על גזלה בידים ממש, אלא כל ממון שבא לאדם שלא ביושר הרי הוא בכלל זה. וזו היתה שאלת המדרש מה הוא הגזל, כלומר עד כמה הוא גדר הגזל המונע את הקרבן מלהתקבל, וע\"ז הוא מפרש דוד אמר מי יעלה בהר ה' וגו' נקי כפים ובר לבב, פירוש אימתי האדם בגדר נקי כפים מגזל, אם הוא בר לבב שלבו נקי מכל מחשבות ונטיות אל הרע, הרי ראיה כי כל זמן שיש לאדם נטייה אחרי בצעו, אף שלא נכשל בגזל ממש, אין הוא קרוי נקי כפים מגזל, ומכאן ראי' שכל זמן שלא נקה האדם כפיו לגמרי מממון שבא לידו שלא בדרך יושר, לא יתקבל קרבנו לרצון, ואין לו השגה אמיתית בתוה\"ק."},{"passage_id":"vayikru1_5ded0d0b_p33","passage_content":"וכדי לבאר דברי המדרש תנחומא (קושיא ז) ששאלו אומות העולם את בלעם הרשע מדוע לא נצטוו גם המה להקריב קרבנות והשיבם מי שקבל את התורה צריך שיקריב קרבנות וכו'. נראה לומר דהנה איתא בירושלמי (מכות פ\"ב ה\"ו) שאלו לחכמה חוטא מהו ענשו א\"ל חטאים תרדוף רעה (משלי י\"ג) שאלו לנבואה וכו' א\"ל הנפש החוטאת היא תמות (יחזקאל י\"ח) שאלו לתורה חוטא מה ענשו א\"ל יביא אשם ויתכפר שאלו להקב\"ה א\"ל יעשה תשובה ויתכפר לו, ע\"כ. המורם מזה כי החכמה והנבואה לא הסכימו שתועיל תקנה לחטאים, ורק התוה\"ק אמרה שיועיל קרבן, וא\"כ מובן שפיר מה שהשיבם בלעם מי שקבל את התורה צריך שיקריב קרבנות, שהרי רק התוה\"ק הסכימה שיועיל קרבן, אבל אתם מתחלה פסלתם אותה, וא\"כ אין לכם חלק ונחלה בתורה הקדושה, ומה תועיל לכם הקרבת קרבנות לכפר על חטאיכם."},{"passage_id":"vayikru1_5ded0d0b_p34","passage_content":"ועתה נבא לבאר דברי המדרש פליאה (אות ו') שאלו תלמידיו את ר\"י בן קיסמא אימת בן דוד בא השיב להם זאת תורת העולה. ונקדים דברי הגמרא סנהדרין (צ\"ט ע\"א) עה\"פ כי יום נקם בלבי ושנת גאולי באה (ישעיה ס\"ג) מאי יום נקם בלבי א\"ר יוחנן ללבי גליתי לאיברי לא גליתי רשב\"ל אמר ללבי גליתי למלאכי השרת לא גליתי, ע\"כ. ופירשו חכמי האמת (תיקוני זוהר תכ\"א ע\"ח ע\"ב) כי יש נשמות צדיקים שהם בבחינת לב, וישנם נשמות צדיקים שלא השיגו מדרגה גבוהה זאת והם בבחינת שאר איברים שאינם חשובים כמו הלב. וז\"פ הגמ' ללבי גליתי היינו לצדיקים שהם בבחינת לב גילה הקב\"ה קץ הגאולה, לאברי לא גיליתי, הם הצדיקים שהם בבחינת שאר אברים, להם לא נתגלה סוד הגאולה. וכאשר מצינו יחידי סגולה מן הצדיקים שנתגלה להם סוד הגאולה כאמרם ז\"ל (פסחים נ\"ו ע\"א הובא ברש\"י פ' ויחי) עה\"פ האספו ואגידה לכם את אשר יקרא אתכם באחרית הימים (בראשית מ\"ט) ביקש יעקב לגלות לבניו קץ הימין ונסתלקה ממנו שכינה וכו', ע\"כ."},{"passage_id":"vayikru1_5ded0d0b_p35","passage_content":"הרי שהוא בעצמו ידע זמן הגאולה אלא שלא ניתן לו רשות לגלותו. וכן דניאל נצטווה ואתה דניאל סתום הדברים וחתום הספר עד עת קץ (דניאל י\"ב) משמע שהוא עצמו ידע סוד הגאולה אלא שנצטווה להטמינו ברמז. והנה זה ודאי כי הצדיקים הקדושים שזכו להיות בבחינת לב טהרו וזככו לבם מכל שמץ פגם, ועל כן כאשר שאלו תלמידיו את ר\"י בן קיסמא אימת בן דוד בא, השיבם זאת תורת העולה, פירוש כדי שיוכלו להשיג מדרגה עליונה זו להשיג סוד הגאולה עליהם להיות בבחינת לב, וכדי להגיע לבחינה זו עליהם להקריב עולה לכפר על מחשבות לבם."}]},{"dvar_torah_id":"vayikru1_3d9a5f17","title":"תשובה וטהרת הלב כפתח לגאולה","summary":"במאמר זה נידונה מדרגת התפילה על כלל ישראל ולא על פרטיות, והגאולה תלויה בטהרת הלב ובתשובה. דברי ר' יהושע בן קיסמא מדגישים כי תיקון הלבבות הוא המפתח להגעת משיח, והדברים נלמדים מהבעש\"ט והגמרא.","contents":[{"passage_id":"vayikru1_3d9a5f17_p1","passage_content":"או יאמר לפרש דברי המדרש פליאה הנ\"ל בהקדם מ\"ש ק\"ז זלה\"ה ביטב לב (פ' ויחי) וז\"ל שמעתי ממוזלה\"ה ששמע ממורו הרב הקדוש מלובלין שאמר צדיק אחד מפי אלי' ז\"ל לפרש (סנהדרין צ\"ז ע\"ב) אין בן דוד בא עד שתכלה פרוטה מן הכיס, היינו שלא יתפלל כאו\"א על הפרט מה שצריך לו לבדו כ\"א על הכלל כולו יצא לבקש רחמים, היינו עבור גלות השכינה כביכול, והיינו שתכלה פרוטה הפרטיות מכיס הלב, עכ\"ד ז\"ל. ואעפ\"י שהפירוש הפשוט בדברי הגמרא אינו כן, מ\"מ כמה זמנים ופקידות יש, והיה גם זמן שהיה הפירוש בו שא\"א שתבא הגאולה עד שיהיו ישראל במדרגה כזו, שלא יתפללו על צרכי עצמם כלל כי אם על כבוד השכינה הקדושה שגלה. ובבחינה זו הוא ביאור הענין במה שכתב הבעש\"ט הקדוש ז\"ל באגרתו לגיסו הגה\"ק מוהר\"ר גרשון קיטובער זלה\"ה הנדפסת בסוף ספר פורת יוסף וז\"ל שם. עשיתי עליות נשמה וכו' ושאלתי את פי משיח אימת קאתי מר והשיב לי בזאת תדע בעת שיתפרסם לימודך ויתגלה בעולם ויפוצו מעיינותיך חוצה מה שלמדתי אותך והשגת ויוכלו גם המה לעשות יחודים ועליות כמוך וכו' ולא ניתנה רשות כל ימי חיי לגלות זאת ובקשתי עבורך ללמד אותך ולא הורשיתי כלל ומושבע ועומד אני על זה, עכ\"ל הקדוש. והנה זה ודאי שאין להעלות על הדעת שהיום יכולים להשיג מדרגה זו שאמר משיח להבעל שם טוב הקדוש, כי אם בדורו לא זכו למדרגות אלו, ק\"ו בדורנו השפל, ולאפוקי מדעת השוטים הסוברים כי היום יתקיים זה שיפוצו מעיינותיו חוצה, אלא שהדברים נאמרו על דורו של הבעש\"ט הקדוש, שאילו היו זוכים להשיג מדרגותיו היתה הגאולה, כמו שאמר לו משיח, אבל עתה כבר חלפו ועברו זמנים אלו, ובלעדי זאת תבא הגאולה. והוא ע\"ד דאיתא בגמרא (סנהדרין צ\"ח ע\"א) ששאל ר' יהושע בן לוי את משיח לאימת אתי מר א\"ל היום ופירש לו אליהו זל\"ט דבריו הכי אמר לך היום אם בקולו תשמעו, (תהלים צ\"ה), ע\"כ. פירוש כי היה אז זמן פקידה ואילו היו זוכין היה בא באותו יום בבחינת אחישנה, וכמו כן הוא במה שאמר משיח להבעש\"ט הקדוש כי היה אז עת רצון לגאולה אילו זכו למדרגה זו, אבל עתה הוא כבר בעתה וכלו כל הקיצין ועדיין בן דוד לא בא בסבת אלו המינים והכופרים המעכבים ביאתו, אמנם אם יטהרו ישראל לבבם ויעשו תשובה מיד יבא משיח כמ\"ש הרמב\"ם ז\"ל (פ\"ז מהלכות תשובה הלכה ה) אין ישראל נגאלין אלא בתשובה וכבר הבטיחה תורה שסוף ישראל לעשות תשובה בסוף גלותם ומיד הן נגאלין וכו' עכ\"ל."},{"passage_id":"vayikru1_3d9a5f17_p2","passage_content":"ועל פי זה יתפרשו דברי ר\"י בן קיסמא לשאלת תלמידיו אימת בן דוד בא השיבם זאת תורת העולה, ורמז להם בזה שאחר שיכלו כל הקיצין אין הדבר תלוי אלא בטהרת הלב ובתשובה, ועל כן אמר להם זאת תורת העולה, כי העולה מכפרת על הרהורי הלב, ובזה תלויה הגאולה. וזאת אפ\"ל בכוונת רש\"י ז\"ל אין צו אלא זירוז מיד ולדורות, כי בענין תיקון הלבבות צריכין לזרז מיד ולדורות, שלא יכשלו בדעות נפסדות המעכבות את הגאולה. ונזכה לטהר לבבנו ולראות בישועת כל ישראל ושמחתם ובהתגלות כבוד שמים עלינו בב\"א."}]},{"dvar_torah_id":"vayikru1_d6cd81de","title":"תורת העולה והגאולה העתידה","summary":"בני אדם אסורים לדחוק את הקץ, והגאולה תלויה ברצון ה' בלבד. כמו שהעולה כולה לה', כך הגאולה נעלמה מעיני בני אדם. עלינו להרבות בתורה ומעשים טובים ולבטוח בה' שיגאלנו במהרה.","contents":[{"passage_id":"vayikru1_d6cd81de_p1","passage_content":"או יאמר לפרש דברי המדרש שאלו תלמידיו את ר\"י בן קיסמא אימת בן דוד בא השיב להם זאת תורת העולה. דהנה בענין הגאולה אסור לבני אדם לעשות שום פעולה בידים לקרבה, ומושבעים ועומדים אנו שלא לדחוק את הקץ, כאמרם ז\"ל (כתובות קי\"א), ואין הדבר דומה לשאר ענינים שצריך האדם לעשות מעשה תחלה כדי שתכנס הברכה במעשה ידיו, כמאה\"כ למען יברכך ה\"א בכל מעשה ידך אשר תעשה (דברים י\"ד), דשאני ענין הגאולה שאין הדבר מסור אלא ביד הקב\"ה לבדו, והוא יגאלנו גאולת עולמים בעת שיעלה כן ברצונו הפשוט, ואנו אין לנו אלא לבטוח בהשי\"ת שיגאלנו בעת שיגיע הזמן הראוי לגאולה, ולהרבות בתורה ותשובה ומע\"ט, וע\"י כך מקרבים את הגאולה. והנה הרמב\"ן ז\"ל בפרשת ויקרא (פ\"א ד) נתן טעם שהעולה כולה כליל לאישים ואין בה חלק לבני אדם, לפי שהעולה באה לכפר על הרהורי הלב, כדאיתא במד\"ר פ' צו (פ\"ז), ולפי שהוא חטא שאין מכיר בו אלא ה', לפיכך כולה כליל לה' ואין לבני אדם חלק בה, עכ\"ד."},{"passage_id":"vayikru1_d6cd81de_p2","passage_content":"ועפ\"י זה יתבארו לנו דברי המדרש שאלו תלמידיו את ר' יוסי בן קיסמא אימת בן דוד בא, כלומר איזה פעולה עלינו לעשות אשר על ידה נוכל לקרב ביאתו, והוא השיב אמריו להם זאת תורת העולה, פירוש שענין הגאולה דומה לקרבן עולה, כשם שהעולה כולה כליל לה' ואין לבני אדם חלק בה, כך ענין הגאולה העתידה נעלמה היא מעין כל חי, ואין להם חלק בה, ואסור לעשות שום פעולה גשמיית בענין הגאולה, כי אדרבה ע\"י כך מרחקים אותה, ואנו אין לנו אלא להרבות בתורה ומצוות ומע\"ט ולצפות לישועת ה'."},{"passage_id":"vayikru1_d6cd81de_p3","passage_content":"ופירשנו כוונת המאמר ישועת ה' כהרף עין, ע\"ד דאיתא במדרש איכה רבתי (פ\"ב כ\"ה הובא ברש\"י ז\"ל בפירושו לאיכה פ\"ב ט\"ז) עה\"פ פצו עליך פיהם וגו' למה הקדים פ\"א לעי\"ן (שהקדים הכתוב הפסוקים המתחילים בפ\"א לפסוקים המתחילים בעי\"ן) מפני שהיו אומרים בפיהם מה שלא ראו בעיניהם, ע\"כ. ובפשטות כוונת המדרש שהלכו בדרכי שקר, וע\"כ נענשו ללכת בגולה, דמי שהולך בדרך האמת לא יעיד בפיו מה שלא ראה בעיניו. ועפי\"ז תתפרש כוונת המאמר ישועת ה' כהרף עין, שהישועה תלויה בהקדמת ראות העין לאמירת הפה, כי דין גרמא דעציראה שהגאולה מתעכבת שהולכים בדרך השקר ומקדימים הפה לעין. אמנם יש לפרש דברי המדרש איכה הנ\"ל כי כוונתו להמליץ טוב על ישראל ע\"ד הכתוב ותורת חסד על לשונה (משלי ל\"א), והוא עפ\"י מה שפירש השל\"ה הקדוש מאמרם ז\"ל עתידין ישראל לומר שירה לע\"ל (שמות רבה פכ\"ג ו) שהכוונה שישראל יאמרו שירה בזמן הגלות, על הישועה העתידה לבא עליהם בביאת המשיח, אף עפ\"י שלא ראו עיניהם הישועה עדיין, כי כל כך חזק בטחונם בהשי\"ת שיקיים את אשר הבטיחנו בתורתו ועל ידי עבדיו הנביאים, עד שהם מקדימים לשורר שירה על הגאולה בטרם תבוא."},{"passage_id":"vayikru1_d6cd81de_p4","passage_content":"וזאת אפ\"ל גם בכוונת המדרש הנ\"ל שהיו אומרים בפיהם מה שלא ראו בעיניהם, היינו שבעת היות ישראל נתונים בצרה ובשביה, ומשוקעים בעומק חשכות הגלות, ואינם רואים בעיניהם עדיין התנוצצות הישועה, אעפי\"כ הם אומרים בפיהם שירה על הגאולה העתידה, כאלו כבר קם הדבר והיה, מגודל אמונתם השלמה שיקיים הקב\"ה הבטחתו, ויגאלנו במהרה גאולת עולמים."},{"passage_id":"vayikru1_d6cd81de_p5","passage_content":"וזאת אפ\"ל בכוונת המאמר ישועת ה' כהרף עין, פירוש שאם מקדימים את אמירת הפה, לשבח ולפאר ולרומם את השי\"ת על הישועה העתידה בעוד העינים עצומות, היינו בעוד שאין רואים שום סימן להתעוררות הגאולה, והרי זה פרק בא סימן שחזק בטחונה בה', ומדה כנגד מדה ימהר ויחיש השי\"ת את הקץ, כשה שבני ישראל האמינו בו ובטחו בישועתו, ושבחו והודו לשמו בטרם ראו עיניהם התנוצצות אור הגאולה. וז\"פ ישועת ה' תלויה כהרף עין, היינו בסגירת עין, שאף בעת שהעינים עצומות ואין רואים עדיין סימני הישועה, יאמינו באמונה שלימה שבוא תבוא הגאולה ויתנו שבח והודאה לשמו על הישועה העתידה לבא, ונזכה במהרה לישועת השי\"ת בקדושה ובטהרה ובהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו בב\"א."}]},{"dvar_torah_id":"vayikru1_af8c7474","title":"זירוז בהקרבת עולה לעני","summary":"בפרשת העולה נדרש זירוז להקרבה, במיוחד במקום חסרון כיס, כדי לכפר על הרהורי לבו של העני. המדרש מדגיש את חמלת ה' על העניים, המוותר על קרבן העולה, ומורה על הצורך להמתין לגאולה באמונה פשוטה.","contents":[{"passage_id":"vayikru1_af8c7474_p1","passage_content":"וידבר ה' אל משה לאמר צו את אהרן ואת בניו לאמר זאת תורת העולה וגו'. פירש\"י ז\"ל אין צו אלא לשון זירוז מיד ולדורות אר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס. הקשו המפרשים מדוע הוצרך הכתוב לזרז בפרשת עולה יותר מבשאר מצוות שיש בהם חסרון כיס."},{"passage_id":"vayikru1_af8c7474_p2","passage_content":"ב) כ\"ק אבא מארי זלה\"ה בקדושת יו\"ט הביא מדרש פליאה שאלו תלמידיו את ר' יוסי בן קיסמא אימת בן דוד בא השיב להם זאת תורת העולה. והוא פלא דמה תשובה היא זו על שאלתם."},{"passage_id":"vayikru1_af8c7474_p3","passage_content":"ונראה לומר בהקדם דברי המד\"ר פ' ויקרא (פ\"ג ג') עה\"פ ואל אלקינו כי ירבה לסלוח (ישעי' נ\"ה) ר' יהודה בן סימון בשם ר' זעירא אף הקב\"ה ויתר לנו סליחה אחת משלו ואיזו זו עשירית האיפה. ע\"כ. ופירש ביערות דבש (ח\"א דרשה ט\"ו) וז\"ל, כי הקרבן הוא תמורת אדם וצריך ג\"כ להיות מורכב מרוח חיים וגשם, לכך יוכשר בהמה אשר נפש רוח חיים בקרבה וכו', א\"כ יש כאן מהשאלה א\"כ קרבן מנחה עשירית האיפה איך יוכשר לקרבן. אבל התשובה כי חלק רוחני לה', דכתיב השמים שמים לה' (תהלים קט\"ו), וא\"כ עני זה שאין לו להקריב, וה' לרב חמלתו חומל עליו ומוחל לו על חלק שלו שהוא חלק רוחני, ודי שמביא חלק גשמי שהוא קמח ומלח דומם וצומח, וחלק רוחני ה' מוותר לו, ולכך בעני יוכשר עשירית איפה לקרבן, כי אין לו יותר. וזה מאמר המד' ואל אלקינו כי ירבה לסלוח, כי מרבה מחילה למאד, ואמר זה עשירית איפה שאין בו חלק רוחני כלל, ואין נאות כלל לקרבן, מ\"מ ברוב חמלתו מרבה מחילה ומוותר שלו, וזהו אמרם עשירית איפה שויתר משלו ומחל על חלק גבוה, ע\"כ."},{"passage_id":"vayikru1_af8c7474_p4","passage_content":"ולי נראה לפרש דברי המדרש על פי דברי הרב חיד\"א ז\"ל בספרו פני דוד ששאלוהו על מה מה דכתיב (ויקרא ה') ואם לא תגיע ידו די שה והביא וגו' שתי תורים או שני בני יונה אחד לחטאת ואחד לעולה. וקשה מה טעם הצריכה תורה את העני להקריב חטאת ועולה, והלא חטאת הוא חייב, וכשם שהעשיר מביא כשבה או שעירה לחטאת, תיסגי לעני בתור אחד לחטאת ותו לא. והשיב ע\"ז כי העני בגשתו להקריב קרבנו, לבו הלך חשכים, ומהרהר ואומר אילו היה לי הייתי מקריב שעירה או כשבה, ויהרהר בלבו על מה עשה ה' ככה ולרש אין כל, היד ה' תקצר שאהיה עשיר כאחרים, ומה חטאתי הלא בצל א' הייתי וכו', וכל כי הני מילי דברים שבלב אש תוקד כלפי מעלה ח\"ו, ע\"כ בא האלקים החפץ לזכות בריותיו, וצוה שיביא עולה לכפר על הרהורי לבו על דלותו, כי זאת העולה לכפר על הנמשך מהקרבת חטאתו, הרהורי דברים נוסף על עיקר חטאו, ודבר הכתוב בהווה, ואף אם המצא ימצא עני ונכה רוח וחרד על דברו ולבו לב טהור, מ\"מ הדבר סתום ואין אתנו יודע מחשבות אדם, לכן מילתא פסיקתא גזר שכל דל יביא עולה וחטאת וכו', ע\"כ."},{"passage_id":"vayikru1_af8c7474_p5","passage_content":"היוצא מזה הוא כי הרהורי דברים שבלב ותרעומת כלפי מעלה שכיח ביותר אצל מי שהפסיד ממונו, כי אמור יאמר בלבו מה פשעי ומה חטאתי כי מצאוני הרעות האלה, וזה פרי הסר חטאתו שיקריב קרבן עולה לכפר על הרהורי לבו. ואפ\"ל שזאת כוונת רש\"י ז\"ל ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס כי הנה במקום שיש בו חסרון כיס מצוי יותר ההרהור ותרעומת כלפי מעלה, ועל כן כיון דהכא מיירי קרא בהקרבת עולה, ובכלל העולות יש גם עולת העוף שהעני מקריב לכפר על הרהורי לבו כלפי מדותיו יתברך, כי יאמר אל לבו מה פשעי ומה חטאתי שנלקיתי בחסרון כים, ולרש אין כל, לכן כתבה תורה בעולה צו לשון זירוז, לרמוז על עולה זו הבאה לכפר על הרהורי דברים שבלב העני כלפי מעלה, ולפי שהרהור זה מצוי ביותר הוצרך הכתוב לזרז בו ביותר. ועל פי דרך זה נבא ליישב דברי המדרש ואל אלקינו כי ירבה לסלוח וכו' הקב\"ה ויתר לנו םליחה אחת משלו ואיזו זו עשירית האיפה. דהנה החיד\"א ז\"ל שם הקשה, דלפי טעמו שהעני צריך להביא גם עולה לכפר על מה שהרהר אחר מדותיו יתברך, שלא חננו ה' בעושר ובנכסים, א\"כ מה יהיה בדלי דלות דשכיח יותר ויותר להתרעם עלי דלותו, ואעפ\"כ אינו מביא כלל דבר שבחי רק מנחה עשירית האיפה. וכתב החיד\"א ז\"ל דלפי קושי עניו לא יחשוב ה' לו עוון על דברים שבלבו וכו', עכ\"ד. הרי לנו כי בדלי דלות ויתר הקב\"ה על קרבן העולה שנתחייב עבור הרהורי לבו, והנה אמרו ז\"ל (יומא כ\"ט ע\"א) הרהורי עבירה קשים מעבירה ופירשו בספ\"ק הטעם על פי אמרם ז\"ל (נדה ל\"א ע\"ב) שלשה שותפים באדם הקב\"ה אביו ואמו וכו' והקב\"ה נותן בו רוח ונשמה וכו' ובינה והשכל. א\"כ נמצא כי כאשר האדם עובר עבירה בפועל מגיע הפגם רק לחלק אביו ואמו שהוא הגוף, משא\"כ כשהאדם חוטא במחשבה מגיע הפגם אל הנשמה שהיא חלק אלוקי ממעל, וע\"כ קשה פגם ההרהור יותר מפגם העבירה עצמה. ועל פי זה מבוארים היטב דברי המדרש הנ\"ל הקב\"ה ויתר לנו סליחה אחת משלו ואיזו זו עשירית האיפה. דלכאורה כיון שהעני המביא עשירית האיפה, ודאי מתרעם על מדותיו של מקום על עניו וכובד דלותו, א\"כ מדוע אינו מביא גם עולה לכפר על מחשבות לבו. וע\"ז בא המדרש לתרץ זו עשירית האיפה שויתר הקב\"ה משלו, היינו שהשי\"ת בגודל חמלתו ויתר לעני על קרבן העולה שהיה חייב להקריב על הרהורי לבו, שעל ידם פגם בנשמתו שהוא חלקו של הקב\"ה בו, והיינו דנקט המדרש הקב\"ה ויתר לנו בסליחה אחת \"משלו\", היינו מפגם הנוגע לחלקו של הקב\"ה היא הנשמה."},{"passage_id":"vayikru1_af8c7474_p6","passage_content":"היוצא מזה הוא כי מפרשת עולה נשמע גודל הפגם הנמשך למי שמהרהר אחרי מדותיו יתברך, כי חייב הוא להקריב עולה על הרהורי לבו, שהיה כמתאונן על דרכי השי',ת, וכמו שפירשנו בכוונת רש\"י ז\"ל ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס."},{"passage_id":"vayikru1_af8c7474_p7","passage_content":"ועפ\"י זה יתבארו דברי המדרש (אות ב') שאלו תלמידיו את ר\"י בן קיסמא אימת בן דוד בא וכו', ומשאלה זו הבין ר\"י בן קיסמא כי תלמידיו הם כמהרהרים אחר מדותיו יתברך, ותמהין ושיילין ליה על אריכות הגלות, ועל אשר נצני הגאולה עדיין לא נראו בארץ, וחפצם ורצונם לדעת בכבשי דרחמנא אימת בן דוד בא. ועל זאת השיב להם זאת תורת העולה, רמז להם בזאת כמה גדול פגם המהרהר אחר מדותיו יתברך, וכי בדבר הזה אין לשאול ולחקור, אלא עלינו להיות יושבים ומצפים באמונה פשוטה, עדי ושקיף ה' משמים וירא בעני עמו ובעלבון תורתו וישלח לנו משיחו לגאלנו במהרה גאולת עולמים."}]},{"dvar_torah_id":"vayikru1_9ac71c2b","title":"על צער השכינה וגאולת ישראל","summary":"המדרש מלמד כי אם יקדיש צדיק את צערו על גלות השכינה ולא על צרותיו האישיות, תבוא הגאולה. כמו העולה המוקרבת כליל לה', כך עלינו להתמקד בצער השכינה כדי לזכות לגאולה מהגלות.","contents":[{"passage_id":"vayikru1_9ac71c2b_p1","passage_content":"באופן אחר יש לפרש דברי המדרש שאלו תלמידיו את ר\"י בן קיסמא אימת בן דוד בא אמר להם זאת תורת העולה. בהקדם מ\"ש בסה\"ק נועם אלימלך פרשת שמות עה\"פ ומאז באתי לדבר בשמך (שמות ה') וז\"ל, דהנה אנחנו בגלות המר הזה אשר בצרותינו לו צר וגלה השכינה עמנו אין לנו לדאוג ולהתאונן אלא על גלות השכינה ולא לחשוב כלל על צרותינו כ\"א על צער וגלות השכינה ואילו היה מגמותינו וצערנו רק על צער השכינה ולא על צערנו בודאי היינו נגאלים מיד אך כי בשר אנחנו ובלתי אפשר לסבול לנו צרותינו ומכאובינו לכן ארכו וכו' ואילו היה צדיק אחד כנ\"ל היה מציל את כל העולם כולו מן הגלות, עכ\"ל הק'."},{"passage_id":"vayikru1_9ac71c2b_p2","passage_content":"ובזה יתפרשו דברי המדרש שאלו תלמידיו את ר\"י בן קיסמא אימת בן דוד בא, השיב להם זאת תורת העולה, פירוש כשם שהעולה קרבה כולה כליל לה' ואין חלק בה לבני אדם, כך אם יהיה צדיק אחד שתהיה כל מגמתו וצערו על גלות השכינה, ולא יחשוב על צער בני אדם כלל, מיד תבא הגאולה."}]},{"dvar_torah_id":"vayikru1_4a8cfe4d","title":"זמן גאולה ותורת העולה","summary":"בפרשה זו מרומזים זמנים של גאולה, והקב\"ה מתמה על ישראל שאינם מקריבים קרבנות בזמן הגלות. לימוד תורת הקרבנות חשוב כקרבן ממש, ובזכותו תיבנה ירושלים. יש חיוב לעסוק בתורה גם בזמן שאין מקדש קיים.","contents":[{"passage_id":"vayikru1_4a8cfe4d_p1","passage_content":"עוד יאמר לפרש דברי המדרש הנ\"ל בדרך פשוט, עפ\"י מה שכתב האה\"ח הקדוש לפרש כל פרשה זו בדרך רמז על גלות האחרון שאנו בו, לנחמנו מעצבון נפשנו, כי כל איש ישראל מאנה הנחם נפשו בראותו אורך הגלות, וכו' וביאר הכתוב וכו' כל הלילה שהיא זמן הגלות הנמשל ללילה וכו', עד הבוקר שהוא זמן שיריק עלינו כבודו ואתא בוקר, והזמן הוא אחר עבור ת\"ק לאלף הששי וכו' עיי\"ש באריכות בנועם דבריו, שבפרשה זו מרומז זמן גאולתינו ופדות נפשינו. וזה אשר השיב ר\"י בן קיסמא לתלמידיו זאת תורת העולה, כלומר התבוננו היטב בפרשה זו, כי בה מרומז זמן ביאת בן דוד שיתגלה במהרה בימינו אמן. צו את אהרן ואת בניו לאמר זאת תורת העולה וגו'. פירש\"י אין צו אלא זירוז מיד ולדורות אמר ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס. והדקדוקים מבוארים לעיל באורך למה הוצרך הכתוב לזרז במצוה זו שתהא נוהגת לדורות, מה שלא מצינו כן בשאר המצות, וגם לדברי ר\"ש קשה שהרי איכא כמה מצוות שיש בהם חסרון כיס גדול משריפת העולה, ולא זירז בהם הכתוב."},{"passage_id":"vayikru1_4a8cfe4d_p2","passage_content":"ב) במדרש תנחומא ריש פרשתן זאת תורת העולה זש\"ה כי מי בשחק יערך לה' ידמה לה' בבני אלים (תהלים פ\"ט) וכו' זה בלעם שביקש להדמות להקב\"ה בבני אלים בבני אברהם יצחק ויעקב שהן אילי העולם א\"ל הקב\"ה מה אתה מבקש להטעות את עצמך לפני שאקבל קרבן מן האומות אין אתה יכול שבועה היא מאת בני ישראל ברית עולם תנאי הן שאיני מקבל קרבן אלא מישראל וכו' ע\"כ. הקשה ק\"ז זלה\"ה בייטב לב מדוע לא העמיד המדרש דרשה זו בריש פרשת ויקרא, באתחלתא דקרבנות עה\"כ אדם כי יקריב וגו', כי שם הוא מקומו להודיע שאין הקב\"ה חפץ בקרבנותיהם של האומות."},{"passage_id":"vayikru1_4a8cfe4d_p3","passage_content":"ג) במד\"ר פרשה זו (פ\"ז ב) איתא זבחי אלקים רוח נשברה לב נשבר וגו' (תהלים נ\"א) ר' אבא בר יודן בשם ר' יהודה ב\"ר סימון משל למלך שהיה מהלך במדבר ובא אוהבו וכבדו בכלכלה אחת של תאנים וחבית אחת של יין א\"ל זה כיבוד גדול (בתמיה) א\"ל אדוני המלך לפי שעה כבדתיך אבל כשאתה נכנס לתוך פלטין שלך אתה רואה במה אני מכבדך כך אמר הקב\"ה לישראל זאת תורת העולה הוא העולה (לשון תימה הלא מצער הוא) אמרו לפניו רבון העולם לפי שעה הקרבנו לפניך אבל לכשתיטיב ברצונך את ציון תבנה חומות ירושלים אז תחפוץ זבחי צדק עולה וכליל ע\"כ. וצריך ביאור להבין כוונת המדרש שהקב\"ה מתמה על ישראל שאינם מקריבים לפניו אלא עולה בלבד, והלא הוא צוה את ישראל להקריב לו קרבן עולה ותו לא, ומאי קא מתמה. ואם נאמר שהתמיה היא על זמן הגלות שאין בידינו להקריב קרבנות, קשה מה היא תמיהת הקב\"ה הוא העולה הלא מצער הוא, הרי אין בידינו להקריב קרבנות כלל, וגם אין להבין תשובת ישראל רבון העולם לפי שעה הקרבנו לפניך וכו', שהרי בגלות אין אנו מקריבין קרבנות כלל."},{"passage_id":"vayikru1_4a8cfe4d_p4","passage_content":"ד) במדרש תנחומא (י\"ד) (הבאנו לשונו לעיל באורך) וז\"ל ד\"א צו את אהרן וגו' זש\"ה היטיבה ברצונך את ציון ואחר כך אז תחפוץ זבחי צדק עולה וכליל (תהלים נ\"א) כלומר אם אין ישראל מקריבין עולה לפני הקב\"ה אין ציון וירושלים נבנה לפי שאינן נבנות אלא בזכות קרבן עולה שהיו ישראל מקריבין לפני הקב\"ה ומאי שנא קרבן עולה יותר מן הקרבנות כולן מפני שנקרא זבחי צדק שנא' אז תחפוץ זבחי צדק עולה וכליל וגו' וכו' למה אמר זאת תורת העולה ירצה לומר קריאת תורה ראו כמה חביבה קריאת תורה לפני הקב\"ה כי יש חיוב באדם לתת כל ממונו ללמד תורה לעצמו ולבניו שנא' צו את אהרן ואת בניו לאמר כלומר שיאמרו לבני ישראל ויתעסקו בקריאת העולה שאעפ\"י שמקריבין עולה עוסקין היו בקריאתה כדי שיזכו בקרבן עולה ובקריאתה, ע\"כ. והמדרש הזה אומר דרשוני וחיו. חדא קשה שדבריו סותרים זא\"ז בתוך כדי דבור, דפתח דבריו היעיבה ברצונך את ציון ואח\"כ אז תחפוץ זבחי צדק משמע שעד שלא יבנה המקדש ועיר ציון תמלא אין שייך ענין קרבנות, ומיד אח\"כ קאמר אם אין ישראל מקריבין קרבן עולה אין ציון וירושלים נבנה, הרי מבואר להיפך שחייבים להקדים קרבן עולה לבנין ציון וירושלים. וגם צ\"ב איך יתכן להקריב קרבנות בזמן שאין ביהמ\"ק קיים. עוד צריך להבין הטעם שהעולה קרויה זבחי צדק יותר מכל הקרבנות. גם מה דמסיים המדרש כי יש חיוב באדם לתת כל ממונו ללמד תורה לעצמו ולבניו, קשה מנא יליף לה המדרש מפרשה זו, דלכאורה לא שמעינן מהכא אלא שמצוה לעסוק בתורת העולה, דדריש לה מדכתיב צו את אהרן ואת בניו לאמר שיאמרו לבני ישראל ויתעסקו בקריאת העולה, אבל מהיכן נשמע שכ\"כ גדול חיוב לימוד התורה שהאדם מצווה להוציא כל ממונו עליה."},{"passage_id":"vayikru1_4a8cfe4d_p5","passage_content":"ולבא אל ביאור הענין נקדים לפרש דברי המדרש תנחומא, דהנה מפורש יוצא מדברי המדרש הנ\"ל שפרשה זו נדרשת על לימוד תורת הקרבנות, שהיא חשובה ומקובלת ומרוצה לפני הקב\"ה כקרבן ממש, וכדאיתא שם להלן וז\"ל אמר ר' שמואל בר אבא אמר הקב\"ה לישראל אע\"פ שבהמ\"ק עתיד ליחרב והקרבנות בטלין לא תשכחו עצמכם לסדר הקרבנות וכו' ואם תעסקו בהן אני מעלה עליכם כאילו בקרבנות אתם עוסקים, ע\"כ. ולפי זה תתבאר כוונת המדרש שאמר אם אין ישראל מקריבין עולה אין ציון וירושלים נבנה, דקאי על לימוד תורת העולה החשובה כאילו הקריבוה בפועל, ובזכותה נבנית ציון וירושלים, וכדאיתא נמי במד\"ר פ' זו (פ\"ז ג') ר' הונא אמר וכו' אין הגליות הללו מתכנסות אלא בזכות משניות (פי' במת\"כ ששונין בתורת הקרבנות) שנאמר (הושע ח) גם כי יתנו בגוים עתה אקבצם (יתנו כמו ישנו בלשון ארמי) ע\"כ. והשתא לא קשה מה דקאמר המדרש בתחלת דבריו היטיבה ברצונך את ציון ואח\"כ אז תחפוץ זבחי צדק, דזה קאי על הקרבת קרבנות בפועל שאון בידינו לקיימם בזמן הגלות."},{"passage_id":"vayikru1_4a8cfe4d_p6","passage_content":"ועל פי זה נבא לביאור דברי רש\"י ז\"ל אין צו אלא זירוז מיד ולדורות דהנה איתא במדרש ילקוט פ' פנחס עה\"פ אתה צוית פקודיך לשמור מאד (תהלים קי\"ט) והיכן צוה בחומש הפקודים מה צוה לשמור שנאמר תשמרו להקריב לי במועדו היא הפרשה האמורה להלן היא הפרשה האמורה כאן ולמה הוא אומרה ושונה וכו' ר' אחא בשם ר' חנינא בר פפא שלא יהיו ישראל אומרים לשעבר היינו מקריבין קרבנות ומתעסקים בהם עכשיו שאין מקריבין קרבנות מהו שנתעסק בהן אמר להם הקב\"ה הואיל שאתם מתעסקים בהם כאילו אתם מקריבין אותם, ע\"כ. ופירש ביפ\"ת מהו להתעסק בדיניהם כי מפני שע\"י זה מתבטלים מהתעסק בדינים אחרים סד\"א שאין להתעסק בהם, כיון שאין תועלת מעשה בהם, לכך אמר להם הקב\"ה הואיל שאתם מתעסקים בהם כאילו אתם מקריבים אותם."},{"passage_id":"vayikru1_4a8cfe4d_p7","passage_content":"הרי לנו מדברי המדרש כי הסברא היתה נותנת שלא יתחייבו ישראל לעסוק בדיני קרבנות בגלות, ולאידך גיסא איכא סברא למימר שאין ישראל חייבים לעסוק בדיני קרבנות בזמן שביהמ\"ק קיים, שהרי יש בידם להקריב קרבנות בפועל, ומה יוסיף תת כח וזכות לימוד פרשת הקרבן. ועל כן פירש\"י ז\"ל אין צו אלא זירוז מיד ולדורות, כלומר כיון שהכתוב מיירי בלימוד תורת הקרבנות כדיליף במדרש מדכתיב זאת תורת העולה, על כן הוצרך הכתוב לזרז על לימוד דיני קרבנות מיד, פירוש בזמן שביהמ\"ק על מכונו והיו מקריבין קרבנות בפועל, אעפ\"כ חייבים ישראל להתעסק בדיני קרבנות, וכאשר נתבאר בדברינו לעיל בפרשה זו, שנצטוו ישראל לאחוז בהקרבת קרבנות בפועל, וגם מלימוד הלכות הקרבנות אל יניחו ידם, כי פעמים לימוד התורה חשוב ומקובל לפני הקב\"ה מן הקרבן. עיין בדברנו באורך בטעם הדבר. וגם הוצרך הכתוב לזרז על עסק תורת הקרבנות לדורות, היינו לדורות שאחר חורבן ביהמ\"ק שאין בידם להקריב עולה בפועל, וכדי שלא יאמרו מה תועלת תצמח לנו מלימוד דיני הקרבנות שאין בידנו לקיימם למעשה, ע\"כ הוצרך הכתוב לזרזם שיעסקו בדיני הקרבנות בגלות, כי בזכות זה יבנה בית המקדש. אמנם ר\"ש פליג על ת\"ק וקאמר שלא בעבור זה בלבד הוצרך הכתוב לכתוב צו לשון זירוז, אלא דלפי שנצטוו בפרשה זו על לימוד תורת העולה, ולימוד התורה הוא דבר שיש בו הפסד ממון רב, שהרי אדם חייב לבזבז כל ממונו על כך, על כן כתיב צו לשון זירוז כי ביותר הוצרך הכתוב לזרז במקום שיש בו חסרון כיס."},{"passage_id":"vayikru1_4a8cfe4d_p8","passage_content":"ובדרך זה יתבארו מקור מוצא דברי התנחומא הנ\"ל אות ה') שכתב יש חיוב באדם לתת כל ממונו ללמד תורה לעצמו ולבניו, דיליף ליה מדכתיב צו לשון זירוז, וס\"ל כר\"ש דטעם שהוצרך הכתוב לזרז מתני שיש בו חסרון כיס, וקשה שלא מצינו שיאמר הכתוב לשון זירוז בשאר מצוות שיש בהם חסרון כיס, ועל כרחך לומר כי כאן איכא הפסד ממון גדול מבשאר מצוות, והיינו שצריך האדם לבזבז כל ממונו על לימוד התורה, דליכא למימר שאין צורך לבזבז רק מקצת ממונו, שא\"כ קשה כנ\"ל למה הזהיר הכתוב דוקא הכא, ואין לומר שהטעם הוא לפי שעל לימוד התורה צריך להוציא ממון רב יותר מבשאר מצות, אבל אעפ\"כ אינו חייב לבזבז כל ממונו, דא\"כ לא ידענו עד כמה צריך האדם לבזבז על ת\"ת, ולא בא הכתוב לסתום אלא לפרש, אלא ע\"כ שחייב האדם לבזבז כל ממונו על ת\"ת, וע\"כ כתיב לשון זירוז."},{"passage_id":"vayikru1_4a8cfe4d_p9","passage_content":"ולפרש מה דאיתא בתנחומא שהעולה קרויה זבחי צדק, נראה לומר עפ\"י מה דאיתא במדרש ילקוט פרשת פנחס (רמז תשע\"ז) עה\"פ עולת תמיד וגו' א\"ר יודן מעולם לא לן אדם בירושלים ובידו עון הא כיצד תמיד של שחר היה מכפר על עבירות שנעשו בלילה תמיד של בין הערבים היה מכפר על עבירות שנעשו ביום מכל מקום לא לן אדם בירושלים ובידו עון ומה טעם צדק ילין בה וגו' (ישעיה א) צדיק ילין בה, ע\"כ. והשתא מבואר היטב טעם שהעולה קרויה זבחי צדק, לפי שעולת התמיד היתה מכפרת על עוונותיהם של ישראל, ובזכות הקרבתה נעשו ישראל צדיקים, כדאי' במדרש צדיק ילין בה. ועוד יש להוסיף טעם שגם שאר העולות קרויות זבחי צדק, דהנה העולה מכפרת על הרהור הלב ובכללם גם על הרהורי עריות שנכשל בהם האדם, ואילו לא היה שב על הרהורי לבו ומביא קרבן עולה לכפר בעדו, סופו להיות נכשל במעשה עבירה בפועל, כי סוף מעשה במחשבה תחלה, נמצא כי בזכות הקרבת העולה ניצל מידי עבירה. והנה השומר בריתו הוא מדת ציס\"ע, ולכן נקרא יוסף הצדיק על ששמר בריתו. והשתא מובן היטב למה נקראת העולה זבחי צדק, כי הקרבתה מכפרת על הרהורים ומחשבות רעות, וע\"י כך זוכה האדם להגיע לבחינת צדיק."},{"passage_id":"vayikru1_4a8cfe4d_p10","passage_content":"ונחזוד לעניננו לפרש המדרשים הנ\"ל (אות ב ג), דהנה כבר נתבאר בדברנו לעיל שחייב האדם לעסוק בדיני הקרבנות בין בזמן שביהמ\"ק קיים בין בזמן שאין ביהמ\"ק קיים. אמנם ודאי שהתורה שלומדים ישראל בזמן שביהמ\"ק קיים, היא בבחינה גבוהה יותר מהתורה שלומדים בזמן החרבן. ועפ\"י זה מבואר המדרש הנ\"ל (אות ג) שהקב\"ה מתמה על ישראל זאת תורת העולה הוא העולה הלא מצער הוא, דקאי על לימוד תורת העולה בזמן החורבן אשר היא בבחינה קטנה מן הראוי להיות, ועל כך מתמה הקב\"ה הוא העולה הלא היה ראוי לכם ללמוד תורה בבחינה גבוהה יותר, ועל זה מתנצלים ישראל רבון העולם לפי שעה הקרבנו לפניך, פירוש כי עתה בגולה אין ביכלתנו להגיע אל לימוד התורה בשלימות הראוי, אבל לכשתיטיב ברצונך את ציון וגו' אז תחפוץ זבחי צדק עולה וכליל, כלומר כאשר נזכה להקריב קרבנות בפועל אזי יהיה גם לימוד התורה בבחינה גבוהה יותר."},{"passage_id":"vayikru1_4a8cfe4d_p11","passage_content":"ובדרך זו נלך לפרש דברי המדרש תנחומא (ב) זאת תורת העולה הה\"ד כי מי בשחק יערך לה' ידמה לה' בבני אלים זה בלעם וכו' א\"ל הקב\"ה וכו' שבועה היא מאת בני ישראל וכו' שאיני מקבל קרבן אלא מישראל. והקשה ק\"ז הייטב לב זלה\"ה מדוע לא העמיד המדרש דבריו בריש פרשת ויקרא בתחלת ענין הקרבנות, אמנם לפי מה שנתבאר כי פרשה זו מיירי בלימוד התורה יובן, דהנה איתא במדרש תנחומא עה\"פ וזאת תורת זבח השלמים אמרו אוה\"ע לבלעם למה אמר הקב\"ה לישראל שיהיו מקריבין לו קרבנות ולנו לא אמר כלום אמר להם בלעם וכו' ומי שקבל את התורה שכתובין בה צריך שיקריב קרבנות, אתם מתחלה פסלתם אותה וכו' ע\"כ. הרי כי הטעם שאין אוה\"ע יכולים להקריב קרבנות הוא לפי שאין להם חלק בתורה, (וכבר נתבאר בדברנו לעיל טעם הדבר שתלוי ענין הקרבנות בקיום התורה) ועל כן הביא המדרש תנחומא הך דרשא שנשבע הקב\"ה שאינו מקבל קרבן אלא מישראל לפרשה זו, דמיירי בעסק התורה, להודיענו כי טעם הדבר שאין הקב\"ה חפץ בקרבנותיהם של האומות, הוא לפי שאין להם חלק בתורה הקדושה."},{"passage_id":"vayikru1_4a8cfe4d_p12","passage_content":"ולפי מה שנתבאר בדברינו כי בנין ציון וירושלים תלוי' בזכות לימוד התורה, יובנו דברי המדרש הנ\"ל (אות ד) שאלו תלמידיו את ר\"י בן קיסמא אימת בן דוד בא, פירוש באיזה פעולה נוכל לקרב ביאתו, השיב להם זאת תורת העולה, היינו בזכות לימוד התורה יבא בן דוד ויבנה ביהמ\"ק בב\"א."}]},{"dvar_torah_id":"vayikru1_ad41cee5","title":"מסירות נפש בלימוד תורה ועבודת הקרבנות","summary":"המדרש מתמה על הקרבת עולות בלבד, וההסבר הוא שעיקר הקרבן הוא מסירות נפש לה'. בזמן הגלות, קשה להשיג מדרגה זו, אך לעתיד, כשיבנה ציון, תתקבלנה העולות ברצון, כאילו הקריבו עצמם.","contents":[{"passage_id":"vayikru1_ad41cee5_p1","passage_content":"באופן אחר יש לבאר דברי המד\"ר הנ\"ל (קושיא ג) זבחי אלקים רוח נשברה לב נשבר ר' אבא בר יודן בשם ר' יהודה ב\"ר סימון משל למלך שהיה מהלך במדבר ובא אוהבו וכבדו בכלכלה אחת של תאנים וחבית אחת של יין א\"ל זה כיבוד גדול (בתמיה) א\"ל אדוני המלך לפי שעה כבדתיך אבל כשאתה נכנס לתוך פלטין שלך אתה רואה במה אני מכבדך כך אמר הקב\"ה לישראל זאת תורת העולה היא העולה (לשון תימה הלא מצער הוא) אמרו לפניו רבון העולם לפי שעה הקרבנו לפניך אבל לכשתיטיב ברצונך את ציון תבנה חומות ירושלים אז תחפוץ זבחי צדק עולה וכליל, ע\"כ. וכבר כתבנו לעיל כי דברי המדרש קשים להלמם שפירש דברי הכתוב שהקב\"ה תמה על שישראל מקריבים לפניו עולה בלבד, וקשה שהרי הקב\"ה צוה לישראל סדר וסכום מנין הקרבנות, וישראל מקריבים לפניו קרבנות כמצווה עליהם בתורה, ומה פשר התמיה שהקרבנות מוצערים הם."},{"passage_id":"vayikru1_ad41cee5_p2","passage_content":"ונראה בהקדם מ\"ש ק\"ז זלה\"ה בייטב לב פ' זו לפרש הא דכתיב \"הוא\" העולה בוא\"ו וקרינן \"היא\" ביו\"ד וכו', וכתב שהכוונה למה דאותא בתנחומא (י\"ג) זאת תורת העולה מהו עולה אלא שהיא עולה לפני הקב\"ה ומכפרת על עוונותיהם של ישראל כי בעת שעשה אברהם עולת האיל שנא' והנה איל אחר ומהו אחר אלא אחר שראה הקב\"ה כי בכל לבבו ובכל נפשו בא להעלות ליצחק בנו לעולה וכו' שם הבטיחו הקב\"ה בעת שיעלו בניו עולות שיקבלם מיד וכו' ע\"כ. ור\"ל שמכח שבכל לבבו בא אברהם להעלות את יצחק בנו לעולה, וגם באיל נכנסה נשמתו של יצחק, אז הבטיחו השי\"ת שבעת שיעלו בניו עולות, יקבלם כאילו הקריבו את עצמם ממש במסירות נפשם לה' בעת הקרבן, וז\"ש כאן זאת תורת העולה היא העולה ביו\"ד, דקאי על הקרבן שמכפר, והטעם שמתרצה הקב\"ה בקרבן לפי שהוא העולה, כלומר שבאמת הוא בעצמו העולה במס\"נ לה', יחשב לפניו יתברך כי הוא בעצמו העולה. וכשם שמה שנחשב מסירות נפש לה' בעת הקרבן כאילו הקריב עצמו, זה נצמח מאברהם בעת שעשה עולת האיל, וכמבואר לעיל, שהוא פועל דמיוני על העתיד שיקבל הקב\"ה קרבן תמורת האדם, והוא חשוב כאילו הקריב את עצמו בפועל ממש, כמו כן מה שהקריבו הכהנים קרבנות בפועל ממש, במסירות נפשם של ישראל בשעת הבאת הקרבן, זה היה פועל דמיוני על העתיד, בעת שעוסק בתורת עולה או חטאת וכו', ומקבל עליו מסירות נפשו לה' דוגמת הקרבן, אם היה זאת לרצון לפניו יתברך, אז מקבל השי\"ת עסק התורה ומחשבתו הטובה במסירות נפש ומצרפה למעשה, וג\"כ חשוב כאילו הקריב את עצמו, עכ\"ד ז\"ל, ועיי\"ש מה שפירש בזה דברי הכתוב."},{"passage_id":"vayikru1_ad41cee5_p3","passage_content":"היוצא לנו מדבריו כי עיקר לימוד התורה הנחשב לפני הקב\"ה כקרבן, הוא כאשר האדם מקבל עליו מסירות נפש בעת לימודו, ובעוה\"ר בזמן הגלות קשה להשיג בחינה זאת, שילמוד האדם תורה במחשבה זכה וטהורה בלתי לה' לבדו, ויקבל על עצמו מסירות נפש, וכמו שהבאנו לעיל דברי הספה\"ק נוע\"א, כי אילו היה כל מגמתינו וצערנו רק על צער השכינה בודאי היינו נגאלים מיד, ואילו היה צדיק אחד כנ\"ל היה מציל את כל העולם כולו מן הגלות."},{"passage_id":"vayikru1_ad41cee5_p4","passage_content":"ועפ\"י זה יובנו דברי המדרש שהקב\"ה מתמה על בני ישראל הוא העולה בתמיה, דפסוק זה קאי על לימוד תורת העולה הנחשב כאילו הקריבוהו בפועל, והתמיהה היא שהרי כיון שאין כוונת האדם ומחשבתו נקייה וטהורה בשעת לימוד התורה, ואין הוא בבחינה זו למסור נפשו בפועל, א\"כ במה נחשב הוא לימוד התורה כקרבן, הלא עיקר לימוד תורת הקרבן הוא שיקבל עליו מסירות נפש. וע\"ז השיבו ישראל רבון העולם לפי שעה הוא, כלומר עתה בגלות אין אנחנו בבחינה זו, אבל כשתיטיב ברצונך את ציון תבנה חומות ירושלים, אז תחפוץ זבחי צדק עולה וכליל, כי אז נהי' במדרגה זו לקבל עצמנו מסירות נפש בעת הקרבת הקרבן, ויתקבלו עולותינו לרצון. ועפ\"י זה מדוייק שפיר לשון הפסוק אז תחפוץ וגו' עולה וכליל, דלכאורה עולה וכליל חדא מילתא היא, ואמאי כתיב וכליל בוא\"ו המוסיף, והל\"ל עולה כליל, אמנם לפי דברינו הכוונה על שני ענינים, חדא שתתקבל עולתו ברצון לפני ה', ועליה קאמר קרא אז תחפוץ עולה, ועוד שיחשב לו כאילו הוא בעצמו היה כליל לאישים, כי הקב\"ה מצרף לו מחשבתו הרצויה למעשה, ועליה קאמר קרא וכליל."},{"passage_id":"vayikru1_ad41cee5_p5","passage_content":"ויתבארו היטב דברי המדרש הנ\"ל, כי לפי שאמר הכתוב זאת תורת העולה הוא העולה בוא\"ו וקרינן היא ביו\"ד, דבא לרמז שעיקר קרבן העולה הוא שיקבל ע\"ע מסירות נפש לה', ואז יחשב לו קרבנו, ע\"כ קאמר המדרש זבחי אלקים רוח נשברה וגו', היינו שעיקר הזביחה הוא שזובח עצמו לה', אך לא תתקיים בחינה זו אלא לעתיד, וע\"כ מסיים קרא היטיבה ברצונך את ציון וגו' אז תחפוץ זבחי צדק עולה וכליל, שיחשב לו קרבנו, וגם מעלה עליו הכתוב כאילו הקריב את עצמו כליל לה'."}]},{"dvar_torah_id":"vayikru1_e21b0984","title":"זירוז בהקרבת עולה ותשובה על הרהורי לב","summary":"הכתוב מזהיר על הקרבת עולה, שהיא מצוה לדורות, ומדגיש את חשיבות טוהר המחשבה. פגם המחשבה חמור יותר מעבירה בפועל, ולכן יש לזרז על שמירה ממנה, במיוחד במקום שיש חסרון כיס.","contents":[{"passage_id":"vayikru1_e21b0984_p1","passage_content":"וידבר ה' אל משה לאמר צו את אהרן ואת בניו לאמר זאת תורת העולה וגו'. פירש\"י ז\"ל אין צו אלא לשון זירוז מיד ולדורות א\"ר שמעון ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס ע\"כ. וצריך ביאור מדוע הוצרך הכתוב להודיענו כי הקרבת העולה היא מצוה הנוהגת לדורות, והרי כל מצוות התורה בידוע שהם קבועות לדורות, ומה מקום היה לטעות כי משונה הקרבת העולה שאינה נוהגת אלא לשעה."},{"passage_id":"vayikru1_e21b0984_p2","passage_content":"ב) גם דברי ר\"ש שאמר ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס צ\"ב, שהרי ישנם כמה מצוות הנקחות בדמים יקרים ויש בהם חסרון כיס, ומה טעם הוצרך הכתוב לזרז במצות עולה יותר מבשאר המצוות שיש בהם הפסד ממון."},{"passage_id":"vayikru1_e21b0984_p3","passage_content":"ונראה לפרש בהקדם מאמרם ז\"ל במס' זבחים (דף צ' ע\"א) ת\"ר והקריב את אשר לחטאת ראשונה (ויקרא ה) וכו' זה בנה אב לכל חטאות שיקדמו לעולות הבאות עמהם וכו' ופריך בגמ' ת\"ש ר\"א אומר כל מקום וכו' חטאת קודמת וביולדת עולה קודמת מדכתיב בה אחד לעולה ואחד לחטאת ומשני אמר רבא למקראה הקדימה הכתוב ופירש\"י שתהא עולה נקראת תחלה אבל בעבודתן חטאת קודמת. והנה צריך טעם לדבר דכיון שבעבודתם חטאת קודמת אמאי הקדים הכתוב עולה לחטאת."},{"passage_id":"vayikru1_e21b0984_p4","passage_content":"ונראה לומר עפ\"י מה דאיתא במד\"ר פרשה זו (פ\"ז ג) ארשב\"י לעולם אין העולה באה אלא על הרהור הלב א\"ר לוי מקרא מלא הוא (יחזקאל כ) והעולה על רוחכם היו לא תהי' וכו' ע\"כ. וביאור הדבר כי כל חטא אשר יחטא האדם תחלתו הוא במחשבתו הרעה אשר חשב, ומחשבתו מביאתו לידי מעשה בפועל, כי סוף מעשה במחשבה תחלה, אכן אם זירז האדם עצמו ועשה תשובה מיד בעת בא הרעיון במחשבתו לחטוא, בטרם בא לידי מעשה עבירה, אזי די לו בקרבן עולה לכפר על הרהורי לבו, אך אם לא זכה להתגבר על יצרו ולעשות תשובה על הרהוריו ורעיוניו אשר על לבו סליקו, אלא הלך שובב אחר יצר מחשבות לבו, ובא לידי מעשה עבירה בפועל, אזי מלבד קרבן העולה אשר עליו להביא על מחשבתו הרעה, עליו להביא גם קרבן חטאת על מעשה העבירה. ובזה פירשנו בדרך רמז מאה\"כ (ויקרא ו') במקום אשר תשחט העולה תשחט החטאת, כי הכתוב מתאונן על האדם אשר לא שב על חטאו במחשבה, ואלו היה עושה כן היה די לו בקרבן עולה, אמנם עתה אשר לא שב, ונתפתה ליצרו לעבור גם עבירה בפועל, עליו להקריב חטאת, וזה שרמז הכתוב במקום אשר תשחט העולה, כלומר חלף אשר היה ראוי שישוב בתשובה על הרהורי לבו, ויביא קרבנו עולה לה', תשחט החטאת עכשיו שלא זכה, אלא זדון לבו השיאו לעשות הרע בעיני ה', ונכשל בעבירה בפועל חייב הוא להביא קרבן חטאת, (ועיין בדברנו לעיל פרשת תרומה בענין זה)."},{"passage_id":"vayikru1_e21b0984_p5","passage_content":"ועפ\"י האמור מצאנו טוב טעם על שהקדים הכתוב עולה לחטאת, כי אמנם חיוב העולה קודם בזמן לחיוב החטאת, שהרי מחשבת העבירה קדמה למעשה בפועל, אלא דאעפי\"כ חטאת קריבה לפני עולה כדאי' בזבחים (דף ז' ע\"ב) משל לפרקליט שנכנס לרצות ריצה הפרקליט נכנס הדורון אחריו יעיי\"ש. ועוד יש לומר כי רמז לנו הכתוב במה שהקדים עולה לחטאת, לעורר לבות בני אדם לעשות תשובה על חטא המחשבה, ולהקריב עליה עולה, ולא יתעצל מלשוב, פן יבא לידי עבירה בפועל ויתחייב גם חטאת."},{"passage_id":"vayikru1_e21b0984_p6","passage_content":"ובדרך זה נבא אל הביאור כי הנה קל יותר לתני האדם להשמר מעבירה בפועל מאשר להשמר מחטא במחשבה, כי פעמים בעת שיגש האדם לעבור עבירה, ימצאוהו מפריעים רבים שיעכבו בעדו, ולא יוכל להוציא מחשבתו אל הפועל, ויש אשר עד עת בואו לכלל מעשה העבירה יכנסו בלבו הרהורי חרטה, וינחם על אשר זמם לעשות וימנע מן החטא. מה שאין כן הדבר בזמן שהאדם מהרהר במחשבת עבירה, כי אין מפריע בעדו מלהרהר בעבירה, ובניקל יוכל להכשל בכך. ועוד כי המחשבה משוטטת ברגע אחד בכמה ענינים שונים, וקל מאד להכשל במחשבת עבירה מבלי שיהי' לו פנאי להתבונן בכך, כי עבירה היא בידו, על כן צריך האדם לשמור עצמו בשמירה מעולה מאד לבל יפול ויכשל בפגם מחשבה רעה, ועליו להתבונן עד כמה גדול הוא פגם המחשבה, כי הפגם הוא נורא ונצחי כאשר ביארנו בדברנו (עי' לעיל פ' תרומה עה\"פ ככל אשר אני מראה אותך משם תקחנו) אמרם ז\"ל (יומא כ\"ט ע\"ב) הרהורי עבירה קשו מעבירה דהכוונה כי הרהורי עבירה עושים פגם בנפש האדם שהיא חלק אלקי ממעל, אשר נפח באפיו נשמת חיים, משא\"כ פגם המעשה מגיע לגוף האדם, שהוא חלק אביו ואמו, ולפיכך פגם המחשבה גדול מאד, כי הוא עושה פגם נצחיי בנפש, משא\"כ פגם המעשה אינו נצחי. וכן הוא הדבר בהיפך כי גם מעשי המצוות תלוים במחשבת האדם, כי אם מקיים המצוה במחשבת זכה וטהורה כחה נצחי ולעד יעמוד, ע\"ד שפירש ק\"ז זלה\"ה בייטב לב פ' אמור לפרש מאה\"כ בתהלים (פרק י\"ט) יראת ה' טהורה עומדת לעד, עפ\"י מה דאי' בספרים ההבדל בין יראת העונש ליראת הרוממות, כי הירא מעונש אינו מוריש אותה יראה לבניו, כי אינה קנין עצמי, אבל הירא מרוממותו יתעלה, אותה יראה מוריש ומנחיל לבניו אחריו, וז\"ש יראת ה' טהורה עומדת לעד, כלומר לדורותיו אחריו, עכ\"ד ז\"ל."},{"passage_id":"vayikru1_e21b0984_p7","passage_content":"ועפ\"י האמור י\"ל דברי רש\"י ז\"ל אין צו אלא לשון זירוז מיד ולדורות, כי לפי שפרשה זו מיירי בהקרבת עולה על פגם המחשבה, ע\"כ כתיב בה צו לשון זירוז, כי צריך האדם זירוז גדול לשמור מחשבותיו בטהרה, כאשר נתבאר, ונתן טעם לדבר שכך חמור פגם המחשבה עד שהוצרכה תורה לזרז עליה, באמרו מיד ולדורות, בא לרמוז בזה כי בפגם המחשבה קל מאד להכשל, כי מיד לאלתר ברצות האדם לחשוב בלבו מחשבת פיגול בידו להעלותה על לבו, ואין מי שיעכב בעדו, ועוד כי מחשבתו משוטטת כהרף עין בענינים שונים, וקשה מאד לשמור על מהלך מחשבתו לבל תתערב במוחו מחשבה רעה והרהור עבירה, ולפיכך הצריכה תורה לזרז ולהזהיר על כך שלא יתפתה האדם לעצת יצרו, ויתאמץ בכל כחו לשמור על טוהר המחשבה. ועוד הוסיף לתת טעם לחומר פגם המחשבה באמרו ולדורות, כלומר כי הפגם נורא מאד שהוא נצחי ועושה רושם בדורותיו אחריו."},{"passage_id":"vayikru1_e21b0984_p8","passage_content":"ובדרך זה נבוא לבאר דברי ר\"ש שאמר ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס. ויתבאר בהקדם מה שכתבנו על קושית המפרשים (עיין בדברנו פ' נח עמוד קצ\"ו) במאה\"כ קץ כל בשר בא לפני כי מלאה הארץ חמס מפניהם ודרשו חז\"ל (סנהדרין ק\"ח ע\"א) לא נחתם גזר דינם אלא על הגזל. והקשו שהרי בכתוב מפורש כי ענשם בא על כי השחית כל בשר דרכו על הארץ, הרי כי עון גילוי עריות הוא אשר הביא עליהם כליה, וביארנו עפ\"י מה דאיתא בגמ' ברכות (דף ל\"ה ע\"א) ארחב\"פ כל הנהנה מן העוה\"ז בלא ברכה כאילו גוזל להקב\"ה וכנסת ישראל וכו'. פירש\"י גוזל להקב\"ה את ברכתו ולכנסת ישראל שבחטאו הפירות לוקין וכתב המהרש\"א ז\"ל שם כי הברכות מורידין שפע הברכה על הפירות וכו' ובאינו מברך על דבר הנהנה הוא מפריד ומשחית שפע הקדושה והברכה לכנסת ישראל מאביהם שבשמים, עכ\"ל המהרש\"א ז\"ל. מבואר מזה כי הגורם בעוונותיו להשחית שפע הברכה מכנסת ישראל הריהו קרוי גזלן. והנה ידוע כי דור המבול פגמו בהוצאת ז\"ל רח\"ל כדאיתא בדברי חז\"ל, וידוע מה שצוחו הספה\"ק כי בסבת החטא הנורא הזה נפסקים צנורי השפע וההשפעה נופלת ליד החיצוניים, וק\"ז זלה\"ה בישמח משה פ' מקץ עה\"פ ירוד ירדנו לשבור אוכל האריך בתוכחה על פגם זה, וביאר שם מאה\"כ (תהלים ק\"ד) הכפירים שואגים לטרף ולבקש מא-ל אכלם עיי\"ש באורך. ונמצא לפי\"ז כי הפוגם בחטא הוצאת ז\"ל הרי הוא בבחינת גזלן, כי הוא ממעט השפעת הקדושה מכנסת ישראל, אמנם איכא למימר כי האדם החוטא הוא רק בחי' גרמא בניזקין, כי אינו גוזל בידים, אלא שעוונותיו גורמים להמעיט השפע, ולפי זה אין לחייבו על כך, שהרי קיי\"ל גרמא בנזקין פטור בדיני אדם וחייב בדיני שמים. אכן התינח אם שומרים את המשפטים לשפוט צדק בין איש לרעהו, אזי בזמן שיש דין למטה אין דין למעלה (דברים רבה פ\"ה ד'), כי נמסר כח המשפע ביד ב\"ד שלמטה, ולפי דיני ב\"ד שלמטה גרמא בנזקין פטור, אבל בזמן שאין דין למטה יש דין למעלה, ובדיני שמים חייב גם גרמא בנזקין."},{"passage_id":"vayikru1_e21b0984_p9","passage_content":"ובזה מבואר אמרם ז\"ל לא נחתם גזר דינם אלא על הגזל, דהכוונה על גזל ההשפעה מן העולם, בסבת חטא הוצאת ז\"ל, כמאה\"כ כי השחית כל בשר דרכו על הארץ. והנה אילו היו משמרים אנשי דור המבול את הדינים, לא היו נענשים על אשר גרמו להמעיט השפע, כי בזמן שיש דין למטה אין דין למעלת אמנם ע\"י שלא שמרו את הדינים, כדאי' במד\" פ' משפטים (פ\"ל), גרמו בכך להמשיך על עצמם תוקף הדין העליון, ונענשו גם על גרמא בנזקין. ובזה מבואר מה שאמה\"כ קץ כל בשר בא לפני, לפני דייקא, דהיינו שנדונו במדת הדין של מעלה ונענשו על גרמא בנזקין, ונתן טעם לדבר כי מלאה הארץ חמס מפניהם, שאינם משמרים את הדינים, לפיכך נענשין הם בדיני מעלה."},{"passage_id":"vayikru1_e21b0984_p10","passage_content":"ובדרך זה יבואר מאמר ר\"ש ביותר צריך הכ' לזרז במקום שיש בו חסרון כיס, דהנה ידוע כי שורש החטא הידוע הוא במחשבות רעות, כמו שדרשו ז\"ל (ע\"ז כ' ע\"ב) עה\"פ ונשמרת מכל דבר רע שלא יהרהר אדם ביום ויבא לידי טומאה בלילה. ולפיכך כיון שהכתוב רימז באמרו צו לשון זירוז להזהיר על פגם המחשבה כי רבה היא, כאשר ביארנו כי הוא פוגם מיד, וגם עושה רושם לדורות, על כן קאמר ר\"ש ביותר צריך הכתוב לזרז על טוהר המחשבה, במקום שיש בו חסרון כיס, כלומר כי פגם המחשבה הוא הגורם להכשל בחטא הידוע, ואין לך חסרון כיס גדול מזה, שהוא גורם להשחית השפע מן העולם, לכן צריך האדם שמירה יתירה לבל יפגום במחשבותיו."}]},{"dvar_torah_id":"vayikru1_7b259e25","title":"זירוז הגאולה וקרבנות ישראל","summary":"אברהם אבינו שאל באיזה זכות ירשו ישראל את הארץ, והקב\"ה השיב בזכות הקרבנות. המדרש מלמד כי ביאת המשיח תתבטא בהקרבת קרבנות, ויש לזרז על כך בכל הדורות, במיוחד במקום שיש חסרון כיס.","contents":[{"passage_id":"vayikru1_7b259e25_p1","passage_content":"או יאמר לפרש דברי רש\"י אין צו אלא זירוז מיד ולדורות אמר ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס. ויתבארו גם דברי המדרש שאלו תלמידיו את ר' יוסי בן קיסמא אימת בן דוד בא אמר להם זאת תורת העולה."},{"passage_id":"vayikru1_7b259e25_p2","passage_content":"ונראה בהקדם לבאר דברי הכתוב בפרשת לך (בראשית ט\"ו) ויאמר ה' אלקים במה אדע כי אירשנה, ונלאו כל חכמי לב להבין איך יתכן כזאת באברהם אע\"ה ראש המאמינים שישאל אות מאת הקב\"ה שיאמת דבריו. ורש\"י ז\"ל פירש ד\"א במה אדע לא שאל לו אות אלא אמר לפניו הודיעני באתה זכות יתקיימו בה אמר לו הקב\"ה בזכות הקרבנות. וקשה שאין פירושו מתיישב בלשון הכתוב דכתיב במה אדע כי אירשנה משמע ששאל אות על הבטחת ירושת הארץ, ואלו לפירש\"י ז\"ל הול\"ל במה אירשנה, ואז היה מקום לפרש במה אירשנה באיזה זכות. וגם יש להקשות לפירש\"י ז\"ל למה חפץ אברהם לדעת באיזה זכות ירשו ישראל את הארץ, והלא כיון שהקב\"ה הבטיח לו שירשו ישראל את הארץ, ודאי הוא שיסבב הקב\"ה שיהיו בידי ישראל הזכותים הצריכים לירושת הארץ, וגם אם לא יזכו יורישם הקב\"ה את הארץ למען שמו הגדול, כמאה\"כ (ישעי' מ\"ח) למעני למעני אעשה."},{"passage_id":"vayikru1_7b259e25_p3","passage_content":"ונראה לפרש כוונת שאלת אברהם אבינו ע\"ה, כי ודאי הוא שהאמין בכל לבו שתתקיים הבטחת השי\"ת וירשו ישראל את הארץ, אלא ששאל באתה זכות ירשוה, כי ידע אאע\"ה שאי אפשר שתתקיים הבטחת ירושת הארץ אלא בהגיע הזמן שחפץ הקב\"ה לגאלנו, וקודם זמן זה יש סכנה גדולה ואיסור נורא בעשיית פעולה כל שהיא בדחיקת הקץ, וחשש פן יטעו ישראל בדבר זה, וירצו לירש את הארץ טרם בוא הזמן, כי עלולים ישראל מאד לטעות בזה, וכאשר מצינו שאפילו בגלות מצרים שהיה זמן קצוב ארבע מאות שנה, טעו בני אפרים ויצאו קודם הזמן, ואף שהיו צדיקים גדולים וטעו בחשבון, אעפי\"כ כיון שעברו על השבועה שלא ידחקו את הקץ נענשו כדאיתא בשה\"ש רבה (פ\"ב י\"ח), וא\"כ כל שכן בגלות החל הזה שאין אדם יודע מתי יהיה קץ הפלאות, ומקרא מפורש הוא בנבואת דניאל (פי\"ב) סתום הדברים וחתום הספר, ודאי הוא שאפשר לבוא לידי טעות, וכאשר כן היה שהטעו כמה משיחי שקר את ישראל כי הגיע זמן הגאולה, ולכן שאל אאע\"ה באיזה זכות אירש את הארץ, כי ע\"י שידעו ישראל מה הוא הזכות הדרוש כדי שיזכו אל הגאולה, יהיה להם סימן מובהק שהגיע זמן הגאולה, כשיראו שיש בידם זכות זה, ולא יטעו בגאולות שקר."},{"passage_id":"vayikru1_7b259e25_p4","passage_content":"והשיב לו הקב\"ה בזכות הקרבנות, כי הקרבנות הם אות וסימן אמיתי כי הגיע הזמן לירושת הארץ, כי טרם ביאת המשיח ובנין ביהמ\"ק אין הקרבנות נוהגין, וכמו שהבאנו בספרנו ויואל משה (מאמר ב' סי' כ\"ט) דברי שו\"ת בנין ציון (סי' א') שהאריך לבאר מהכתובים ומן התלמוד שבזמן החורבן אי אפשר להקריב קרבנות לפי שאין ביהמ\"ק בנוי. והנה כתב הרמב\"ם ז\"ל בהלכות מלכים (פי\"א ה\"ד) וז\"ל ואם יעמוד מלך מבית דוד הוגה בתורה ועוסק במצוות כדוד אביו כפי תורה שבכתב ושבעל פה ויכוף את כל ישראל לילך בה ולחזק בדקה אם עשה והצליח ובנה מקדש במקומו וקבץ נדחי ישראל הרי זה משיח ודאי ויתקן כל העולם לעבוד את ה' ביחד שנא' כי אז אהפוך אל העמים שפה ברורה לקרוא כולם בשם ה' ולעבדו שכם אחד, עכ\"ל הקדוש. נמצא כי הקרבת קרבנות הוא סימן מובהק לביאת משית כמ\"ש הרמב\"ם ז\"ל כי מסימני מלך המשיח הוא שיבנה בית המקדש במקומו. וזאת השיב הקדוש ברוך הוא לאברהם אע\"ה בזכות הקרבנות, פירוש כי כשיבנה ביהמ\"ק ויקריבו שם קרבנות זה הוא סימן על הגאולה האמיתית, וכל זמן שלא שבו כל ישראל בתשובה ולא נבנה ביהמ\"ק לא יתכן שתהיה הגאולה האמיתית. (ועיין בדברנו לעיל פ' לך דף של\"ד ושל\"ה)."},{"passage_id":"vayikru1_7b259e25_p5","passage_content":"ועפ\"י זה יתבארו לנו דברי המדרש שאלו תלמידיו את ר\"י בן קיסמא אימת בן דוד בא, כלומר ששאלו ממנו אות וסימן אימתי יהיה זמן הקץ האמיתי, כדי שלא יטעו בגאולות של שקר, השיב להם זאת תורת העולה, כלומר כאשר יבנה ביהמ\"ק ויקריבו בו קרבנות, סימן מובהק הוא לביאתו. וגם לפי מה שדרשו ז\"ל פסוק זה על לימוד התורה, י\"ל כי רמז להם כי זה יהיה בידם לסימן מובהק, כאשר יעסקו כל ישראל בתורה ויעשו תשובה שלמה, אות הוא אל הגאולה האמיתית."},{"passage_id":"vayikru1_7b259e25_p6","passage_content":"ובדרך זה י\"ל דברי רש\"י ז\"ל אין צו אלא זירוז מיד ולדורות, דכיון שבפרשה זו מרומז סוד עת הגאולה כמו שהשיב ר\"י בן קיסמא לתלמידיו, על כן כתיב צו לשון זירוז, כי בענין הגאולה צריך זירוז גדול בכל הדורות שלא יתפסו בגאולות של שקר. ור\"ש בא להוסיף על דברי ת\"ק, כי עיקר הזירוז הוא על הגאולה האחרונה שלא נודע זמנה, שלא נאמר בה זמן קצוב כמו בגאולות הקודמות, וז\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, דאמרו ז\"ל (סנהדרין צ\"ז ע\"א) אין בן דוד בא עד שתכלה פרוטה מן הכיס, ואף שנאמרו במאמר זה פירושים שונים, מ\"מ פשטות פירושו הוא שטרם ביאת המשיח יהיה חסרון כיס, ועל כן קאמר שביותר הוצרך הכתוב לזרז שלא יטעו בגאולות של שקר, במקום שיש בו חסרון כיס, היינו בגאולה האחרונה, שתכלה הפרוטה מן הכיס. הבוכ\"ע יעזור שנזכה להיות דבוק בדרך התורה והאמת בקדושה ובטהרה, ובמהרה נזכה לראות בישועת כל ישראל ושמחתן, בנחת ובשמחה ובהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו בב\"א."}]},{"dvar_torah_id":"vayikru1_1fee6e04","title":"איסור גזל בהקרבת עולה","summary":"הכתוב מזהיר על איסור גזל גם בהקרבת עולה, שהיא כליל לה'. אף שקרבנות אחרים יש בהם חלק לבעלים, עולה אינה נחשבת לגזל. יש להתרחק מגזל בכל מצב, כדי שלא יפגע בנפש האדם ובזרעיו לדורות.","contents":[{"passage_id":"vayikru1_1fee6e04_p1","passage_content":"או יאמר לפרש דברי רש\"י ז\"ל אין צו אלא זירוז מיד ולדורות, ויתבארו גם דברי ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, וקשה שהרי איכא נמי מצוות אחרות שיש בהם חסרון כיס. ונראה לפרש עפ\"י דברי המדרש תנחומא (סי' א' הובא לעיל בדברינו) וז\"ל אמר הקב\"ה קיימו מה שכתוב למעלה מן הענין ואח\"כ זאת תורת העולה למה כי אני ה' אוהב משפט שונא גזל בעולה (ישעי' ס\"א) אפילו בעולה מה כתיב למעלה מן הענין והיה כי יחטא ואשם והשיב את הגזלה אשר גזל ואח\"כ זאת תורת העולה וכו' אם בקשת להקריב קרבן לא תגזול לאדם כלום למה כי אני ה' אוהב משפט שונא גזל בעולה ואימתי אתה מעלה עולה ואני מקבלה כשתנקה כפיך מן גזל וכו', עכ\"ל. ונראה דהמדרש דייק לה מדחזרה תורה לכתוב תשלום פרטי דיני עולה בריש פ' צו, ולמה לא נכתבו דינים אלו בפרשת ויקרא, במקום שצוה הכתוב על הקרבת עולה כי שם מקומם, אלא כוונת הכתוב לסמוך פרשת עולה לדיני גזל האמורים בסוף פרשת ויקרא. אמנם אכתי צריך ביאור מדוע השמיענו הכתוב בקרבן עולה דוקא שאין להקריבה מממון גזל, והלא כל הקרבנות כך דינם שאסור להקריבם מממון גזל."},{"passage_id":"vayikru1_1fee6e04_p2","passage_content":"ונראה לבאר הענין עפ\"י מה דאיתא בגמ' (סוכה ל' ע\"א) וא\"ר יוחנן משום רשב\"י מאי דכתיב כי אני ה' אוהב משפט שונא גזל בעולה משל למלך בשר ודם שהי' עובר על בית המכס אמר לעבדיו תנו מכס למוכסים אמרו לו והלא כל המכס שלך הוא אמר להם ממני ילמדו כל עוברי דרכים ולא יבריחו עצמן מן המכס אף הקב\"ה אמר אני ה' וגו' שונא גזל בעולה ממני ילמדו בני ויבריחו עצמן מן הגזל. ופירש\"י ז\"ל שונא גזל בעולה, בעולה שאתם מביאים לי אני שונא את הגזל שאתם גוזלים אותם ואעפ\"י שהכל שלי ואף מתחלה שלי היתה, ע\"כ. וביאר המהרש\"א ז\"ל דלכך נקט בקרא קרבן עולה שכולה כליל והכל שלו, אבל חטאת ואשם ושאר קרבנות ודאי דגזלה גמורה היא, כיון דנאכלין, ולא הוה דומה למשל כלל, וזה שדקדק רש\"י לפרש ואע\"פ שהכל שלי ואף מתחלה שלי היתה, ר\"ל שהכל שלי שכולה קריבה לגבוה, ומתחלה עולם ומלואו שלו הוא, והוי ממש דומה למשל, עכ\"ל המהרש\"א."},{"passage_id":"vayikru1_1fee6e04_p3","passage_content":"ועפ\"י זה יתבאר ע\"נ מה שסמך הכתוב פרשת גזל לדיני עולה ולא לשאר קרבנות, להשמיענו רבותא דאעפ\"י שעולה כולה כליל ואין לבני אדם חלק בה אסור להקריבה מן הגזל, דאילו בשאר קרבנות שיש לבני אדם חלק בהם פשיטא שאינם באים מן הגזל, וזאת כוונת התנחומא באמרו כי אני ה' שונא גזל בעולה, אפילו בעולה, פירוש לא מיבעיא בשאר קרבנות שיש לבני אדם חלק בהם, פשיטא שאסור להקריבם מן הגזל, אלא אפילו בעולה דכולה לגבוה סלקא מ\"מ הקב\"ה שונא את הגזל."},{"passage_id":"vayikru1_1fee6e04_p4","passage_content":"ובדרך זה נבוא לבאר פירש\"י ז\"ל אין צו אלא זירוז מיד ולדורות. כי הנה מפרשה זו שמענו כמה חמור איסור גזל, עד שאף קרבן עולה שאין בני אדם נהנים ממנה אסור להקריב מן הגזל, ומינה נילף שעאכו\"כ חייב האדם לשמור עצמו מאיסור גזל במקום שיש לו הנאה בדבר. וצא ולמד עד היכן מגיע פגם הגזל, ממה שכ' בספה\"ק אגרא דפרקא (אות קכ\"ו) בשם מהרמ\"מ זלה\"ה על מה שהוא מן התימה, שאנחנו רואים הילדים בקטנותם הולכים לבית רבם, ומתמידים בלימוד תורתם, ומתפללים בכוונה ועונים איש\"ר, ומישרים אורחותם, ואח\"כ כשמתגדלים מתהפכים ח\"ו במדות גרועות, ומבטלים התורה והתפלה וכיוצא, ומאין יתהוה זה הרי התורה שלמדו בקטנותם, והוא הבל שאין בו חטא, היה מהראוי שתעמוד למשען להם וכו'. ואמר הוא ז\"ל שהוא על שאבותיהם האכילו אותם ממון גזל שסיגלו ע\"י מו\"מ שאינו באמונה וכו'. עיי\"ש הבאנו דבריו לעיל באורך. וז\"ש רש\"י ז\"ל אין צו אלא ל' זירוז מיד ולדורות, כלומר דמפרשת עולה שמענו זירוז להזהר מאד מפגם הגזל, שהרי לכך נסמכה פ' עולה לדיני גזלה, וכ\"ש במקום שהאדם נהנה חייב הוא להתרחק מן הגזל, וזהו שרמז רש\"י ז\"ל בדבריו שהוא לשון זירוז מיד ולדורות, שהגזל פוגם בנפש האדם מיד ולאלתר, וגם מזיק לדורות כי ע\"י שיתפטמו בניו מממון איסור יוולדו בנפשותיהם תכונות רעות ותאות גרועות, וע\"כ צריך זירוז גדול להנצל מאיסור גזל, ואז יהי' זרעו דור ישרים יבורך."},{"passage_id":"vayikru1_1fee6e04_p5","passage_content":"ובדרך זו יש לבאר דברי ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, דאין הכוונה שהוצרך הכתוב לזרז בעבור שיש לחוש שימנע האדם מלהקריב עולה, בעבור חסרון כיס הבא לו משריפתה, שאין לו חלק בה, שהרי יש כמה מצוות שיש בהם חסרון כיס מרובה ולא הוצרכה תורה לזרז בהן, אלא דהוה אמינא שלא נאסר להקריב מן הגזל כי אם קרבנות שיש לבעלים או לכהנים חלק בהם, מה שאין כן עולה שכולה כליל ואין לבני אדם חלק בה, יהא מותר להקריבה אף מן הגזל, על כן אמר ר\"ש ביותר הוצרך הכתוב לזרז שלא יקריבו מן הגזול במקום שיש בו חסרון כיס, פירוש בעולה שהיא נשרפת כליל ואין בני אדם נהנים ממנה כלל, כמו בשאר קרבנות, ולפיכך היה מקום לומר שיהא מותר להקריבה מן הגזל, שהרי הכל של הקב\"ה ואף מתחלה שלו היתה, על כן הוצרך הכתוב לזרז בה ביותר שלא יקריבוה מממון גזל."},{"passage_id":"vayikru1_1fee6e04_p6","passage_content":"ואפ\"ל עוד לבאר דברי רש\"י ז\"ל אין צו אלא לשון זירוז מיד ולדורות, אמר ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, בהקדם מה שכתב הכלי יקר ז\"ל לפרש מאה\"כ זאת תורת העולה הוא העולה על מוקדה כל הלילה עד הבוקר, עפ\"י מ\"ש המפרשים ז\"ל לפרש זאת תורת העולה דקאי על העוסק בתורת עולה שהוא כאילו הקריב עולה, והודיע לנו הכתוב שזמן העולה כל הלילה עד הבוקר, ללמד דעת את העם על צד הרמז, כמו שזמן הגאולה כל הלילה עד הבוקר, כך הזמן המוכן לזה שהעוסק בתורת עולה כאילו הקריב עולה הוא בזמן הגלות שנמשל ללילה, כי אז צריכין ישראל לשלם פרים שפתותיהם, עד הבוקר ולא עד בכלל, כי בזמן שיעלה בוקרן של ישראל אז יעלו על מזבח ה' פרים ממש וכו', ומ\"ש זאת תורת העולה הוא העולה, היינו דוקא כל הלילה בגלות, כשאין זבח ומנחה וכו', ויתכן להיות שע\"ז נאמר ולא ציויתי את אבותיכם ביום הוציאי אותם מארץ מצרים על דבר עולה וזבח (ירמי' ז) כלומר שלא נצטוו על הדברים של עולה וזבח, והיינו לימוד תורת הקרבן החשוב כאילו הקריבוהו בפועל, שהרי בצאתם ממצרים היה זמן בוקרן של ישראל, והיה בידם להקריב קרבנות בפועל, עכת\"ד הכלי יקר. וכ\"כ בספר פנים יפות, שלא הוצרך הכתוב לצוות שיעלה עסק התורה במקום קרבן, כ\"א על זמן שאין בהמ\"ק קיים, דאילו בזמן שבהמ\"ק היה קיים היה בידם להקריב קרבנות בפועל."},{"passage_id":"vayikru1_1fee6e04_p7","passage_content":"ויש להקשות על דבריהם מהא דאיתא במדרש תנחומא פ' זו (י\"ד) וז\"ל ראו כמה חביבה קריאת התורה לפני הקב\"ה שנא' צו את אהרן ואת בניו לאמר כלומר שיאמרו לבני ישראל ויתעסקו בקריאת העולה שאעפ\"י שמקריבין עולה עוסקין היו בקריאתה כדי שיזכו בקרבן עולה ובקריאתה. הרי מבואר שנצטוו ישראל לעסוק בתורת הקרבנות גם בזמן שביהמ\"ק היה קיים, אף שהיו מקריבים קרבנות בפועל."},{"passage_id":"vayikru1_1fee6e04_p8","passage_content":"ונראה לומר דהא דאיתא במדרש תנחומא שנצטוו ישראל לעסוק בתורת הקרבנות אף בזמן שהם מקריבין קרבן בפועל, קאי על אותם שאין יכולת בידם להקריב קרבנות בפועל, שהרי גם בזמן שבהמ\"ק היה קיים נמצאו אנשים שלא היה באפשרותם להקריב קרבן כראוי, כגון עני המביא קרבנו לה' עשירית האופה םולת למנחה, לפי שהוא בדלי דלות, ואין ידו משגת להביא דבר שיש בו רוח חיים, אשר הקב\"ה מתרצה בקרבנו רק לגודל חמלתו עליו, וכמו שהבאנו לעיל מ\"ש היערות דבש ז\"ל על דברי המד\"ר פ' ויקרא (פ\"ג ג') עה\"פ (ישעי' נ\"ה) ואל אלקינו כי ירבה לסלוח ויתר הקב\"ה מחילה אחת משלו ואיזה זה עשירית האיפה. ופירש כי הקרבן הוא תמורת אדם, וצריך ג\"כ להיות מורכב מרוח חיים וגשם, לכך תוכשר בהמה אשר נפש רוח חיים בקרבה, וא\"כ יש מהשאלה קרבן מנחה עשירית האיפה איך יוכשר לקרבן וכו', אבל התשובה היא כי חלק רוחני לה' דכתיב השמים שמים לה', וא\"כ עני זה שאון לו להקריב, וה' לרוב חמלתו חומל עליו ומוחל לו על חלק שלו שהוא חלק רוחני, ודי שמביא חלק גשמי, שהוא קמח ומלח דומם וצומת וחלק רוחני ה' מותר לו וכו', וז\"פ המדרש זה עשירית האיפה שאין בו חלק רוחני כלל ואין נאות כלל לקרבן, ואעפ\"כ ויתר הקב\"ה משלו ומחל על חלק גבוה, עכ\"ד ז\"ל."},{"passage_id":"vayikru1_1fee6e04_p9","passage_content":"היוצא מדבריו כי מה שמתרצה ה' במנחת העני, הוא רק לגודל חמלתו עליו, לפי שאין ידו משגת להביא יותר, אמנם זה ודאי שמה שויתר לו הקב\"ה, היינו רק על מה שהיה ראוי שיביא בפועל קרבן שיש בו רוח חיים, אבל מה שיש בכוחו לעשות כדי שיחשב לו כאילו הקריב קרבן שיש בו רוח חיים, מחוייב הוא לעשות. וא\"כ כיון שבידו לעסוק בתורת הקרבנות, ומעלה עליו הכתוב כאילו הקריב קרבן בפועל, ודאי חייב הוא בכך, כדי שיחשב לו כאילו הקריב דבר שיש בו רוח חיים, שהרי לגבי החיוב לעסוק בתורה אינו יכול להפטר בטענת שהוא עני, כי בלימוד התורה חייבים כל ישראל כאחד עניים ועשירים, ואדרבה אמרו ז\"ל (נדרים פ\"א ע\"א) הזהרו בבני עניים שמהם תצא תורה. נמצא כי העני המביא קרבנו לה' עשירית איפה היה חייב לעסוק בתורת הקרבן, ונחשב לו לימוד התורה כאילו הקריבו בפועל, ולא זו בלבד שנחשב לו כאילו הקריב קרבן בפועל, אלא שבכמה פרטים עדיף ומעולה לימוד תורת הקרבן מהקרבתו בפועל, שהרי הקרבן שהיו מקריבין בפועל לא היה קרב ע\"י הבעלים עצמם, אלא הכהנים הקריבו אותם, ובגמרא (נדרים ל\"ה ע\"ב) מיבעיא לן אי כהנים שלוחי דידן או רחמנא נינהו, עיי\"ש. ואף אם נאמר שלוחי דידן נינהו, מ\"מ בכ\"מ אמרינן מצוה בו יותר מבשלוחו (קידושין דף מ\"ב ע\"א), נמצא כי לצד זה עדיף לימוד דיני הקרבן מהקרבתו בפועל, שהרי ע\"י העסק בתורת הקרבן נחשב כאילו הקריב הוא עצמו קרבנו לה'. ועוד מעליותא איכא בלימוד תורת הקרבן, דהנה אמרו ז\"ל (זבחים דף ב' ע\"א) כל הזבחים שנזבחו שלא לשמן כשרים אלא שלא עלו לבעלים לשם חובה, ועליו להביא קרבן אחר לחובתו או לנדרו, ואיכא כמה אופנים שהקרבן פסול לגמרי, כדאיתא בזבחים (דף מ\"ו ע\"ב) לשם ששה דברים הזבח נזבח וכו' יע\"ש בגמ', ואילו הלומד תורת הקרבן חשוב ומרוצה לימודו אף אם הוא לומד שלא לשמה, כי בלימוד תורה אין פוסלת מחשבת שלא לשמה, כאמרם ז\"ל (פסחים נ' ע\"ב) א\"ר יהודה אמר רב לעולם יעסוק אדם בתורה ובמצוות אעפ\"י שלא לשמה שמתוך שלא לשמה יבא לשמה."},{"passage_id":"vayikru1_1fee6e04_p10","passage_content":"וזאת תורת העולה מדברנו כי גם בזמן שבהמ\"ק היה קיים היה שייך לימוד דיני הקרבנות, אף שהקריבו קרבנות בפועל, כדאיתא במדרש תנחומא שיזכו בקרבן עולה ובקריאתה. ועפ\"י זה י\"ל מה דקאמר רש\"י ז\"ל אין צו אלא זירוז מיד ולדורות פירוש כיון שפרשה זו היא ציווי שיעסקו גם בתורת הקרבנות, ע\"כ הוצרך הכתוב לזרז על לימוד התורה מיד בזמן שביהמ\"ק קיים ולדורות אחר החרבן, כי דברי תורה צריכים חיזוק. ור\"ש בא להוסיף על דברי ת\"ק וקאמר ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, כלומר דהא שזירז הכתוב על לימוד תורת הקרבנות בזמן שביהמ\"ק קיים היינו לדל שאין ידו משגת להקריב קרבן שיש בו רוח חיים, על כן הוצרך הכתוב לזרזו שיעסוק בתורת הקרבן, ונרצה לו לכפר עליו כאילו הקריב דבר שיש בו רוח חיים, אבל מי שמקריב קרבנו לה' מן הבהמה מן הבקר ומן הצאן, לא הוצרך הכתוב לזרזו שיעסוק בתורת הקרבן, וכמ\"ש המפרשים ז\"ל הנ\"ל זאת תורת העולה וגו' כל הלילה עד הבוקר, שהזמן שלמוד תורת העולה חשוב כקרבן הוא רק בזמן שא\"א להקריב קרבן בפועל."}]},{"dvar_torah_id":"vayikru1_3c7441e5","title":"","summary":"","contents":[{"passage_id":"vayikru1_3c7441e5_p1","passage_content":"דרוש לפרשת זכור"}]},{"dvar_torah_id":"vayikru1_a261167c","title":"תורת העולה ומלחמת עמלק","summary":"בפרשת צו נדונה תורת העולה, דיני הקרבנות והכנתם. המדרש עוסק במלחמת עמלק, תפקידו של משה, והקשר בין העולה לבין הגאולה. נדרשת זהירות מהתחברות עם הערב רב, והצורך בזכירת מעשה עמלק כדי למנוע חטאים ולזכות לגאולה שלמה.","contents":[{"passage_id":"vayikru1_a261167c_p1","passage_content":"וידבר ה' אל משה לאמר צו את אהרן ואת בניו לאמר זאת תורת העולה וגו'. דקדקו המפרשים על השנות תיבת לאמר פעמיים, דאם ללמד לאהרן ולבניו דיני עולה, הרי כתיב בפירוש צו את אהרן ואת בניו, ואם שיצוה את ישראל שיכינו העולה ומכשיריה ועצי המערכה, בחד לאמר סגי."},{"passage_id":"vayikru1_a261167c_p2","passage_content":"ב) זאת תורת העולה הוא העולה על מוקדה וגו'. צריך ביאור להבין כוונת הכתוב, שמפרש דבריו באמרו הוא העולה, וכי בלא\"ה לא הוה ידעינן שהעולה היא העולה. ובגמרא (זבחים פ\"ד ע\"א) למדו ג' מיעוטים ממקרא זה, מדכתיב זאת היא וה\"א דתיבת העולה. וזהו דרך דרש, אך בפשטות צ\"ב."},{"passage_id":"vayikru1_a261167c_p3","passage_content":"ג) בתנחומא ר\"פ זו איתא זאת תורת העולה זש\"ה (תהלים פ\"ט) כי מי בשחק יערוך לה' ידמה לה' בבני אלים וכו' זה בלעם שבקש להדמות להקב\"ה בבני אלים בבני אברהם יצחק ויעקב שהם אלי העולם ראה בלעם הרשע כמה היה ערום התחיל אומר את שבעת המזבחות ערכתי אמר משנברא אדה\"ר ועד עכשיו ז' מזבחות בנו ואני מקריב ז' כנגד כולן וכו' א\"ל הקב\"ה וכו' מה אתה מבקש להטעות את עצמך לפני שאקבל קרבן מן האומות שבועה וכו' שאיני מקבל קרבן אלא מישראל וכו' אמר להם הקב\"ה זאת תורת העולה ומי זאת עולה מן המדבר (שה\"ש ד') ומשה עלה אל האלקים (שמות י\"ט) ע\"כ. וצ\"ב מה תשובה השיבם הקב\"ה לאוה\"ע במקראות אלו, וכיצד יתבאר הכתוב זאת תורת העולה על ידי הפסוקים מי זאת עולה מן המדבר ומשה עלה וגו'."},{"passage_id":"vayikru1_a261167c_p4","passage_content":"ד) עוד איתא בתנחומא (סי' ב') הוא העולה על מוקדה זו מלכות אדום שעלתה עצמה שנא' (עובדיה א) אם תגביה כנשר וגו' ונידונת באש וכו' אמר הקב\"ה והיה בית יעקב אש וגו' ובית עשיו לקש ודלקו בהם ואכלום ולא יהי' שריד לבית עשיו כי ד' דבר (שם) ומה דבר ע\"י משה שנא' הוא העולה על מוקדה ואח\"כ ועלו מושיעים בהר ציון לשפוט את הר עשיו, עכ\"ד התנחומא. וצ\"ב שדורש מדכתיב הוא העולה ב' דרשות הרחוקות זו מזו כרחוק מזרח ממערב, דמעיקרא דרש היא העולה על ישראל, שנא' מי זאת עולה מן המדבר, ועל משה רבע\"ה שנא' ומשה עלה אל האלקים, והדר דרשיה על מלכות אדום שתדון באש, וכיצד תסבול משמעות המקרא ב' ענינים מנוגדים אלו."},{"passage_id":"vayikru1_a261167c_p5","passage_content":"ה) עוד איתא בתנחומא שם ולעוה\"ב כשהקב\"ה נפרע מעשיו מה עשיו עושה מתעטף בטליתו כזקן ויושב לו אצל יעקב מנין שכן כתיב אם וגו' בין כוכבים שים קנך ואין כוכבים אלא ישראל וכו' ע\"ש. והמדרש הזה קשה להבינו לפי פשוטו, מדוע יעשה עשיו ככה להעמיד פני צדיק, והלא ודאי אין הוא פתי עד כדי כך שיסבור כי בידו לרמות את הבוי\"ת, אשר לפניו נגלו כל תעלומות, ואין נסתר לפני כסא כבודו, ומכ\"ש זדון לבו של עשיו הרשע ודאי גלוי לכל, ולא יועילו לו ערמימותו וצביעותו, להצילו מדינה של גיהנם."},{"passage_id":"vayikru1_a261167c_p6","passage_content":"ו) אבא מארי זלה\"ה בספרו קדושת יו\"ט מביא מדרש פליאה שאלו תלמידיו את ר' יוסי בן קיסמא אימתי בן דוד בא א\"ל זאת תורת העולה, וצ\"ב."},{"passage_id":"vayikru1_a261167c_p7","passage_content":"ז) קרינו היום זכור את אשר עשה לך עמלק אשר קרך בדרך וגו'. דקדקו המפרשים דהוה סגי לכתוב זכור את אשר עשה עמלק, ותיבת לך יתירא לכאורה, שהרי הכתוב מבאר והולך כי לישראל עשה את כל המעשים האלה."},{"passage_id":"vayikru1_a261167c_p8","passage_content":"ח) אשר קרך בדרך וגו' בפסיקתא איתא וכ\"ה בתנחומא פרשת תצא (סי' ט') ר' יהודה אומר טמאך במשכב זכור כמה דאת אמר כי יהיה בך איש אשר לא יהי' טהור מקרה לילה. ר' נחמן אמר קראך ודאי מה עשה להם עמלק ירד לו לבית ארכיוון (מקום גניזת הכתבים) של מצרים נטל טימוסם של שבטים שהיה שמם חקוק עליהם ובא ועמד לו חוץ לענן והיה קורא ראובן שמעון אחוכון פוקו דאנן בעיין למעבד פרגמטיא עמכון וכיון שהיה יוצא אחד מהם היה הורגו רבנן אמרי הקירן לפני אוה\"ע משל לאמבטי רותחת שלא היתה בריה יכולה לירד לתוכה ובא בן בליעל אחד וקפץ לתוכה אע\"פ שנכווה אבל הקירה לפני אחרים כך כיון שיצאו ישראל ממצרים נפלה אימתן על כל אומה\"ע וכו' כיון שבא עמלק ונזדווג להם אע\"פ שנטל את שלו מתחת ידיהם הקירן לפני אוה\"ע. עכ\"ד המדרש. ולכולהו פירושי קשה, לר' יהודה דדריש אשר קרך טמאך צריך ביאור, דהנה מוני המצוות ה\"ה הרמב\"ם ז\"ל וכ\"ה בספר החינוך, מנו כאן ב' מ\"ע, חדא לזכור מה שעשה לנו עמלק, והב' להכרית זרע עמלק, וז\"ל הרמב\"ם ז\"ל בס' המצות (עשין קפ\"ט) הלא תראה שמואל בהתחילו לעשות המצוה הזאת איך עשה שהוא זכר תחלה מעשהו הרע ואח\"כ צוה להרגו וכו' ע\"כ. ולכאורה ראוי להבין מה תועלת תצמח בזכרנו את הגנאי והכיעור שעולל עמלק לישראל, שהכשילם בעבירה, הלא העיקר הוא לזכור את מצות הבוי\"ת למחות זכרו ולהכרית לו שם ושאר. גם דרשת ר\"נ קראך שהיה עמלק קורא את ישראל לצאת אל מחוץ לענן לעשות פרקמטיא אתו אינו מובן, איך עלתה בידו של עמלק להטעות את אותו דור דיעה, באמרו להם אחינו אתה, והלא הלכה בידוע הוא שעשיו שונא ליעקב, ואיך האמינו לו ונתפתו אליו לצאת חוץ לענן לעשות פרקמטיא, ולא עלתה על דעתם כי סכנה בדבר, וכי הוא אויב להם ומבקש רעתם. ועל מה דדרשי רבנן אשר קרך שהקירן לפני אומות העולם קשה, דמייתו משל לאמבטי רותחת וכו' ובא בן בליעל וקפץ לתוכה אע\"פ שנכווה הקיר אותה בפני אחרים, ולכאורה אין המשל שייך להכא, שהרי אומות העולם שמעו מה עלתה בסופו של עמלק, שהכוהו ישראל לפי חרב, וע\"י כך נתגדלו ישראל בעיניהם, וניתוספה להם אימה על אימתם, וכמו שדרשו ז\"ל עה\"פ וישמע יתרו מה שמועה שמע ובא קריעת ים סוף ומלחמת עמלק. הרי כי לא נתקררה אימתם של האומות מפני ישראל אחרי מלחמת עמלק, וצריך ביאור להבין דברי חכמים וחידותם."},{"passage_id":"vayikru1_a261167c_p9","passage_content":"ט) ויזנב בך כל הנחשלים אחריך. פירש\"י ז\"ל הנחשלים, הם חסרי כח מחמת חטאם שהיה הענן פולטם וכ\"ה בת\"י. אמנם במכילתא פ' בשלח איתא ר' אליעזר המודעי אומר ויבא עמלק שהיה נכנס תחת כנפי הענן וגונב נפשות מישראל והורגן. וצ\"ב שהרי הקב\"ה הקיף את ישראל בעננים להיות להם למחסה ולמסתור מפני צר ואויב, וכיצד נכנס עמלק וגנב נפשות מתחת כנפי הענן."},{"passage_id":"vayikru1_a261167c_p10","passage_content":"י) ולא ירא אלקים. פירש\"י ז\"ל עמלק לא ירא אלקים מלהרע לך. וכן דרשו חז\"ל במדרש דולא ירא אלקים קאי על עמלק. אמנם במכילתא פרשת בשלח איתא אחרים אומרים ולא ירא אלקים אלו ישראל שלא היו בידם מצוות. ולשני הפירושים קשה. לפירש\"י יש להקשות שהרי מעלת ירא אלקים לא תתיחס כי אם ליחידי סגולה בלבד, וכמו שמצינו באברהם אבינו ע\"ה, כי אחר שנתנסה בעשרה נסיונות ונמצא שלם בכולם, העיד הקב\"ה עליו עתה ידעתי כי ירא אלקים אתה, וא\"כ פליאה נשגבה היא, אשר בבוא הכתוב להודיע גודל רשעת עמלק, יאמר עליו כי לא ירא אלקים, וכי במה נחשב חסרון מעלת ירא אלקים לגבי עוצם הפלגת רשעתו של עמלק, הלא כמו זר נחשב האומר על רשע עריץ כמוהו, כי אינו ירא שמים. גם לדברי המכילתא דולא ירא אלקים קאי על ישראל צ\"ב, שהרי תועלת מצוה זו היא להזכיר רשעת עמלק ואיבתו לישראל, כדי שתהא עברתו שמורה נצח בלבנו, ולא נשכח לאבד זכרו, ומה לנו להזכיר חטאי ישראל, וכי לא יראו אלקים, והלא מפחיתים בכך את רשעת עמלק שהצר לישראל."},{"passage_id":"vayikru1_a261167c_p11","passage_content":"יא) והיה בהניח ה' אלקיך לך מכל אויביך מסביב וגו' תמחה את זכר עמלק וגו'. הרמב\"ם ז\"ל בסה\"מ שלו כתב דמצוה זו נוהגת בכל דור ודור שנמצא זרע עמלק בעולם מצווים אנחנו להכריתם ולאבד זכרם. וק\"ז זלה\"ה בישמח משה פ' תצא הכריח בדעת הרמב\"ם ז\"ל, דאין מצוה זו מוטלת על כל יחיד, כי אם היא חובת הציבור בלבד, ואין זה כמו לאו דלא תחי' כל נשמה שמועל על כל יחיד, דהתם הוזהרנו על כל נשמה ונשמה בפני עצמה, משא\"כ הכא נצטווינו למחות זכר עמלק לגמרי, וכל זמן שאין בידינו להכרית מארץ זכרם, לא שייכא המצוה כלל להרגם. ועיי\"ש שהאריך להביא ראיות לדבר. ולהלן יתבאר עוד ענין זה. אמנם צ\"ב מה שתלה הכתוב מצוה זו בהניח ה' לישראל מכל אויביהם מסביב, משמע דאם אין להם מנוחה עדיין מכל שונאיהם אף שיש בידם למחות זכרו פטורים הם ממצוה זו. והוא תמוה למה לא יתחייבו למחות זכרו, אם הדבר בכוחם. ועוד דע\"כ ליכא למימר הכי, שהרי מצינו שנצטוו ישראל במצוה זו בימי שאול ושמואל, אף שעדיין לא היתה להם מנוחה מכל אויביהם מסביב, ופלשתים עדיין היו נלחמים בם. וכן יש להפליא על מה שדרשו בספרי פרשת תצא והיה בהניח ה' אלקיך לך מכל אויביך מסביב, שלא יאגוד עליך אגודה, וצ\"ב מה כוונתו בזה."},{"passage_id":"vayikru1_a261167c_p12","passage_content":"יב) בפרקי דר\"א (פמ\"ד) איתא אמרו ישראל משה רבינו כתיב זכור את יום השבת לקדשו וכתיב זכור את אשר עשה לך עמלק היאך יתקיימו שניהם זה זכור וזה זכור א\"ל משה לא דומה כוס של קונדיטון לכוס של חומץ זה כוס וזה כוס אלא זה זכרהו לקדשו ולענגו שנא' זכור את יום השבת לקדשו וזה זכרהו להוממו ולאבדו וכו'. וצ\"ב להבין כוונת השאלה והתשובה, וכי לא ידעו ישראל ההבדל שבין שני הזכירות, דבשבת כתיב לקדשו, ובעמלק נאמר תמחה את זכר עמלק."},{"passage_id":"vayikru1_a261167c_p13","passage_content":"יג) בתנחומא פ' תצא (ס\"ה) דרשו עה\"כ זכור את אשר עשה לך עמלק. ר' תנחומא פתח זכרוניכם משלי אפר לגבי חומר גביכם (איוב י\"ג) אמר הקב\"ה לישראל אותן ב' זכירות שכתבתי לכם בתורה הוו זהירין תמחה את זכר עמלק זכור את אשר עשה לך עמלק משלי אפר משולי אפר אם זכיתם אתם בניו של אברהם אבינו שהמשיל עצמו כאפר שנא' ואנכי עפר ואפר ואם לאו לגבי חומר גביכם התקינו עצמכם לשעבודה של מצרים שנא' וימררו את חייהם בחומר וגו'. וצ\"ב מה ענין קיום זכירות אלו למה שאמר אברהם אנכי עפר ואפר, ולמה תהי' מדת העונש על ביטולם להיותם משועבדים למצרים. ועוד כיצד יתכן לומר התקינו עצמכם לשעבודה של מצרים, ומה שהיה כבר היה."},{"passage_id":"vayikru1_a261167c_p14","passage_content":"יד) בפסיקתא (פיסקא פ' זכור) וכ\"ה בתנחו' (פ' תצא סי' ט) איתא כתוב אחד אומר תמחה את זכר עמלק וכתוב אחד אומר כי מחה אמחה (שמות י\"ז) כיצד יתקיימו שני כתובים הללו עד שלא פשט ידו בכסא להחריב ירושלים תמחה כיון שפשט ידו בכסא מחה אמחה. וצ\"ב דלפי דרשה זו היה ראוי שיקדים הכתוב תמחה ואח\"כ יכתוב כי מחה אמחה, ובקרא כתיב להיפך, דבפ' בשלח כתיב כי מחה אמחה, ובפ' תצא כתיבתמחה. ואף דאמרו חז\"ל אין מוקדם ומאוחר בתורה, מ\"מ טעמא בעי בכל מקום שאיחרה תורה המוקדם, וכ\"ש הכא דהיה ראוי להפך הסדר, כדי למילף מיניה דרשה זו."},{"passage_id":"vayikru1_a261167c_p15","passage_content":"טו) עוד איתא בתנחומא שם (סי' ט') זכור את אשר עשה לך עמלק ר' לוי פתח גערת גוים אבדת רשע (תהלים ט') גערת גוים זה עמלק וכו' אבדת רשע זה עשיו אם יאמר לך אדם יעקב הוא בכלל אמור לו אבדת רשעים אין כתיב כאן אלא אבדת רשע. והוא תמוה מאד מי הוא זה אשר יעלה על דעתו לומר כי גם יעקב ח\"ו בכלל מחיית עמלק ועשיו, עד שהוצרך הכתוב להוציאו, אתמהה."},{"passage_id":"vayikru1_a261167c_p16","passage_content":"טז) במכילתא ס\"פ בשלח ר' אליעזר אומר נשבע המקום בכסה\"כ שלו שאם יבא א' מכל האומות שבעולם להתגייר שיקבלוהו ומעמלק וביתו לא יקבלוהו שנא' (שמואל ב' א') ויאמר דוד אל הנער המגיד אי מזה אתה ויאמר בן איש גר עמלקי אנכי וכו' מיד ויאמר דוד דמך בראשך כי פיך ענה בך. והקשו המפרשים ממה שאמרו ז\"ל בסנהדרין (צ\"ו ע\"ב) מבני בניו של המן למדו תורה בבני ברק, ואם אין מקבלין גרים מעמלק, איך יתכן שמבני בניו של המן למדו תורה בבני ברק, וכן הקשה בעיון יעקב שם והניח בצ\"ע."},{"passage_id":"vayikru1_a261167c_p17","passage_content":"וכדי לבא לביאור הענין, נציעה נא שיטות הפוסקים במ\"ע דזכירת מעשה עמלק, ונבארם אחת לאחת בעזהי\"ת. הנה כבר כתבנו לעיל בדברינו, דכל מוני המצוות מנו בפרשת זכור ב' מ\"ע ול\"ת אחת. וז\"ל הרמב\"ם בספר המצוות (עשין קפ\"ח) שצוונו להכרית זרע עמלק וכו', והוא אמרו יתעלה תמחה את זכר עמלק וכו'. ואח\"כ כתב (בעשין קפ\"ט) שצוונו יתברך לזכור מה שעשה לנו עמלק בהקדימו להרע לנו וכו' והוא אמרו יתעלה זכור את אשר עשה לך עמלק יכול בלבבך כשהוא אומר לא תשכח הרי שכחת הלב אמור הא מה אני מקיים זכור שתהא שנאתו בפיך. עכ\"ל בספר המצוות. מבואר מזה כי בענין מעשה עמלק איכא ב' מצות עשין ולא תעשה אחת לא תשכח בלב. וכ\"כ הרמב\"ם בספר היד (פ\"ה מה' מלכים ה\"ה) מצות עשה לאבד זכר עמלק שנא' תמחה את זכר עמלק ומצות עשה לזכור תמיד מעשיו הרעים ואריבתו כדי לעורר איבתו מפי השמועה למדו זכור בפה לא תשכח בלב, עכ\"ל."},{"passage_id":"vayikru1_a261167c_p18","passage_content":"והנה במצות עשה דתמחה את זכר עמלק, שנצטוינו להכריתם ולאבד מארץ זכרם, כ' בהגהות מיימוני בשם סה\"מ דמצוה זו אינה נוהגת עד לימות המשיח שנא' והיה בהניח ה' אלקיך לך מכל אויביך מסביב וגו' תמחה את זכר עמלק. ע\"כ. ויש חולקים עליו וכמבואר בדברי הרמב\"ם שמצוה זו נוהגת לדורות בכל דור ודור שימצא אפשרות לקיימה עיי\"ש. ובאמת אפילו לדבריו ז\"ל אין בידינו לקיים מצוה זו בזה\"ז, שאין בידינו למחותם לגמרי ולאבד זכרם, ותו דאין ידוע לנו אחה אומה מוצאה מעמלק, שכבר עלה סנחריב ובלבל את כל העולם כאמרז\"ל (ידים פ\"ד מ\"ד), וכל דפריש מרובא פריש, ואין כאן זכר עמלק שכבר אבד זכרו. ועוד טעמא שאין בידינו לקיים מצוה זו, שהרי מבואר בדברי חז\"ל שמצוה זו נוהגת רק אחר הקמת מלך לישראל כדאי' בגמ' (סנהדרין כ' ע\"ב) שלש מצות נצטוו ישראל בכניסתן לארץ למנות להם מלך וכו' ולהכרית זרע עמלק. עכ\"פ מכל טעמים אלו אין בידינו לקיים מצוה זו בזה\"ז, ותתקיים לעת\"ל לימות המשיח, כי השי\"ת יאבד זכרם וזכר שרם הוא הס\"מ, ואף שנתבלבלו בין האומות, קמי שמיא גליא היכן הם, ואז תתקיים מחייתם בשלימות. וכבר הבאנו לעיל דברי ק\"ז זלה\"ה ביש\"מ דאין במציאות בזה\"ז לקיים מצוה זו מטעם אחר."},{"passage_id":"vayikru1_a261167c_p19","passage_content":"אמנם במצות עשה שנצטוינו לזכור מה שעשה לנו עמלק דעת הרמב\"ם ז\"ל שהיא מצוה תמידית ונוהגת בכל עת, כמבואר בדבריו מצות עשה לזכור תמיד מעשיו וכו' מפי השמועה למדו זכור בפה וכו. עכ\"ל. וכן מורה משמעות הפסוק דכתיב זכור את אשר עשה לך עמלק, דזכור הוא לשון הוה, כמו שפי' רש\"י ז\"ל בפ' יתרו זכור את יום השבת וגו' זכור לשון פעול כמו אכול ושתו וכו' וכן פתרונו תנו לב לזכור תמיד את יום השבת שאם נזדמן לך חפץ יפה תהא מזמינו לשבת. וכן פירש\"י בפ' פנחס עה\"כ צרור את המדינים ולו' צרור כמו זכור ושמור לשון הוה. וכתבו הרא\"ם והגו\"א דזכור וצרור אינם לשון ציווי דא\"כ הו\"ל להיות נקוד בשוא הזיין ולא בקמץ, אלא הוא מקור, ולכך נכתב בלשון מקור להורות על פעולה המתמדת, עיי\"ש. וכמו כן ה\"נ מ\"ע דזכור את אשר עשה לך עמלק היא מצוה תמידית, שלא ימוש זכרונו מלבנו בכל עת וזמן. אמנם מסקנת רוב הפוסקים דליכא חיוב מדאורייתא לזכור מעשה עמלק בפה בכל יומא, וסגי במה שקוראים פ' זכור בשבת שלפני הפורים, וז\"ל ספר החינוך מצוה תר\"ג. ואל הזכירה הזאת בלב ובפה לא ידענו בה זמן קבוע בשנה או ביום כמו שנצטוינו ביציאת מצרים הזכירה בכל יום ובכל לילה והטעם כי זכירת יצי\"מ הוא עיקר בדת כמו שהרחבנו את הדבור ע\"ז בכמה מקומות אבל טעם זכירת מעשה עמלק אינו רק כדי שלא תשכח שנאתו מלבנו ודי לנו בזה לזכור הענין פעם אחת בשנה וכו' ע\"כ. והמהר\"ם שיק ז\"ל בביאורו לתרי\"ג מצוות (מצוה תר\"ה) נתן טעם לדבר בשם מורו הגה\"ק בעל חתם סופר זלה\"ה דסתם שכחה י\"ב חדש על כן צריך לזכרה אחת בשנה שלא תשכח מלבנו."},{"passage_id":"vayikru1_a261167c_p20","passage_content":"והרב בית יוסף ז\"ל באו\"ח סי' תרפ\"ה כתב דקריאת פרשת זכור היא דאורייתא, ממה דאיתא בגמ' מגילה (דף י\"ח ע\"א) אתיא זכירה זכירה כתיב הכא והימים האלה נזכרים ונעשים וכתיב התם כתוב זאת זכרון בספר מה להלן בספר אף כאן בספר וממאי דהאי זכירה היא דלמא עיון בעלמא לא ס\"ד דתניא זכור יכול בלב כשהוא אומר לא תשכח הרי שכחת הלב אמור הא מה אני מקיים זכור בפה, עכ\"ל הגמ'. הרי לך דזכירה בפה לקריאה בס\"ת קאמר, וכתב הסמ\"ק שזהו בשבת שלפצי הפורים שקורין פ' זכור עכ\"ד הב\"י. אך אינו מבאר מהיכא ילפינן דחובת הקריאה היא דוקא פעם אחת בשנה, וכי זמן הקריאה הוא בשבת שלפני הפורים דוקא."},{"passage_id":"vayikru1_a261167c_p21","passage_content":"ומצאתי מקור לזה ממ\"ש ז\"ל בגמ' (מגלה ל' ע\"א) דצריך להקדים זכירה לעשייה וילפי לה מהכתוב והימים האלה נזכרים ונעשים, מבואר דכן היתה קבלת חז\"ל ואסמכוה אקרא, דחיוב הזכירה לפני עשי' דפורים היא, וכל דברי קבלה הלכה למשה מסיני הם, כמו שאמרו ז\"ל עד דלא אתי יחזקאל מאן אמרינהו אלא גמרא גמיר ואתי יחזקאל ואסמכוהו אקרא. וביותר לפי מה שכתב בירושלמי (מגלה פ\"א ה\"ה) דהמגילה הזאת נאמרה למשה מסיני. וכתב ביפ\"מ שם דנמסרה רק ליחידי סגולה, וק\"ז הישמח משה זלה\"ה כתב דהיתה המצוה למסרו רק ליחיד ראש הדור, וכן דור אחר דור היה רק יחיד שידע מזה, א\"כ אפשר שחז\"ל קבלו דבר זה בהללמ\"ס שמצות זכירה היא לפני עשיה, ובשבת שלפני פורים דוקא (ועי' בדברנו לעיל פ' ויקרא דף צ\"ה עיי\"ש באורך) ולפי\"ז מה שאמר הכתוב זכור את אשר עשה לך עמלק וזכור הוא לשון הוה הרי דחיובו תמידי, צריך לומר כמו שפירש\"י ז\"ל בפ' תצוה עה\"כ להעלות נר תמיד אעפ\"י שחיובו אינו אלא בכל לילה ולילה ג\"ז נקרא תמיד כמו שאתה אומר עולת תמיד ואינה אלא מיום ליום, וה\"נ אף שחיוב הזכירה הוא מזמן לזמן ג\"ז קרוי תמיד, ולהלן נרחיב את הדיבור בזה."},{"passage_id":"vayikru1_a261167c_p22","passage_content":"והנה הרמב\"ן ז\"ל בפ' תצא הביא תחלה דרשת הספרי הנ\"ל זכור בפה. ואח\"כ כתב וז\"ל ולא ידעתי מה הוא הזכירה הזה בפה אם לאמר שנקרא פ' עמלק בציבור ונמצינו למדין מן התורה דבשבת שניה של אדר קורין פ' זכור ויהי' סמך למגלת אסתר מן התורה והנכון בעיני שהיא לומר שלא נשכח מה שעשה עמלק וכו' ונספר זה לבנינו ולדורותינו לומר כך עשה לנו הרשע וכו', עכ\"ל. לכאורה מוכח ממסקנת דבריו שדעתו נוטה לומר דמצות עשה דזכור בפה לא קאי על קריאתה בציבור דוקא, אלא שהמצוה לספר בכל עת מעשי עמלק לבנינו ולדורותינו עד עולם, ואין לה זמן מוגבל וקבוע. והיותר נראה לומר כי הרמב\"ן ז\"ל לא חזר בו ממה שכתב בתחלת דבריו, דיש כאן סמך מן התורה לקריאת פ' זכור ומקרא מגלה, אלא כוונתו לומר דתרוייהו איתנייהו בה, על דרך הפשט כוונת הכתוב שנספר בכל עת לבנינו ולדורותינו כך עשה לנו הרשע, וסיפור זה אין לו זמן קבוע, אלא שאעפ\"כ אינה מצוה תמידית ולא מצינו שיחייב הכתוב בו בכל יום כסיפור יציאת מצרים. ואפ\"ל כמו שנתן החינוך טעם לחלק בין זכירה זו לזכירת יצי\"מ דהתם הזכירה עצמה היא עיקר גדול בדת, אבל טעם זכירת עמלק אינה אלא כדי שלא נשכח מה שעשה לנו, ותספיק הזכרתו מזמן לזמן. ועל דרך הדרש יש כאן סמך לפ' זכור מה\"ת, כמו שדרשו ז\"ל להקדים זכירה לעשייה, ואתיא בגז\"ש זכירה זכירה."},{"passage_id":"vayikru1_a261167c_p23","passage_content":"ובאופן אחר יש לבאר טעם שלא נצטווינו לזכור מעשה עמלק בכל יום כשם שנצטווינו לזכור יצי\"מ בכל יום. ונראה עפ\"י מה דאיתא בפסיקתא (וכ\"ה בתנחומא פ' תצא) זכור את אשר עשה לך עמלק א\"ר ברכיה משל למה\"ד דומה למלך שהי' לו כרם והקיפו גדר והושיב בו המלך כלב נשכן אמר המלך כל מי שיבא ויפרוץ הגדר ישכנו הכלב לימים בא בנו של מלך ופרץ את הגדר נשכו הכלב כל זמן שהיה המלך מבקש להזכיר חטא של בנו שפרץ הגדר אומר לו זכור אתה היאך נשכך הכלב כך כל זמן שהקב\"ה מבקש להזכיר חטאן שלישראל שחטאו ברפידים שנא' היש ה' בקרבנו אמר להם זכור את אשר עשה לך עמלק אשר קרך בדרך, ע\"כ. מבואר להדיא כי נצטווינו לזכור מעשה עמלק כדי שנזכר ע\"י כך את חטאינו שגרמו לביאתו."},{"passage_id":"vayikru1_a261167c_p24","passage_content":"והנה כתבו תלמידי הבעש\"ט ז\"ל בשמו וכ\"כ הרה\"ק מלובלין זי\"ע שמה שאמר הכתוב (תהלים נ\"א) וחטאתי נגדי תמיד אין הכוונה שיחשוב בכל עת תמיד בחטאיו, כי בחינה זו מביאה לידי עצבות, ותמנעהו מלעבוד את השי\"ת עבודה מעולה וחשובה, שהיא מעלת עבודת השי\"ת בשמחה כדכתיב (תהלים ק') עבדו את ה' בשמחה. אלא הכוונה שיחשוב בעוונותיו מזמן לזמן, באופן שלא יסיח דעתו מהם, ויעשה תשובה עליהם, עכת\"ד ז\"ל. וצריך לומר דמה שאמר הכתוב וחטאתי נגדי תמיד, הכוונה כמו שפירש\"י ז\"ל כל לילה ולילה קרוי תמיד, דדבר הבא נחמן לזמן קרוי נמי תמיד, וה\"נ יחשוב בחטאיו מזמן לזמן בלבד, ולא יהרהר בהם בכל עת, ועאכו\"כ בחטאים של עריות ודומיהן, ודאי שלא ישים האדם לבו ומחשבתו עליהם כשירצה לשוב, כי ע\"י כך גורם רעה לנפשו, שיבא לידי מחשבות והרהורים ח\"ו, וע\"כ לומר שאין כוונת הכתוב וחטאתי לנגדי תמיד שיהרהר בפרטיות במעשה הרע, דכלל גדול הוא שנפשו של אדם נמשכת אחרי מחשבתו, אם מהרהר בדברים קדושים ועבדות השם יתברך, בזה מקדש נפשו ומוחו, ואם ח\"ו מהרהר בעבירות או בתאות רעות ר\"ל מטמא את נפשו ח\"ו. וצריך לברוח ממחשבות כאלו, ולא ישתמש בהם אף אם כוונתו לעבודת הבוי\"ת, כמו שכתב בספה\"ק יושר דברי אמת (הבאתי דבריו בספרי ויואל משה מאמר אי סי' קפ\"א) בדבר שנתגלו כתבים של הקדוש מהרד\"ב זלה\"ה וכו' שכתב בכ\"מ שמאהבה רעה שבאה לאדם יכול לאחוז באהבת הבורא בחשבו ק\"ו וכו' וכתב הוא ז\"ל שא\"א ללמוד ק\"ו זה אם לא יהי' מופשט מגשמיות כי אם הוא דבוק בגשמיות ובתאוות ומקבל תענוג מהם ח\"ו יפול בשוחה עמוקה אם לא ישמור את עצמו מאד להרהר בהם וכו'. וכן הבאתי שם בשם התניא זלה\"ה, עיי\"ש. וע\"כ לומר בכוונת הכתוב וחטאתי נגדי תמיד שיחשוב בחטאיו בדרך כלל, שידע בנפשו כי חטא והמרה את פני יוצרו יתברך, ויתמרמר על זאת, ויתחרט חרטה גמורה מעומקא דלבא על העבר, ויקבל קבלה גמורה על להבא שלא ישוב לכסלה עוד. אבל לא יהרהר כלל וכלל בפרטי המעשים הרעים ההם, ואף בדרך זו לא יתמיד עיונו בהם שמביא לידי עצבות, ובדרך כלל מזיק לנפש להרהר בחטאים, ע\"כ די שיחשוב בחטאיו מזמן לזמן, באופן שלא יסיח דעתו מלשוב עליהם, וגם זה קרוי תמיד כמ\"ש רש\"י ז\"ל שכל דבר הבא מזמן לזמן קרוי תמיד."},{"passage_id":"vayikru1_a261167c_p25","passage_content":"ועפ\"י האמור נשכיל בטעם הדבר שלא נצטוינו בתורה הק' להתמיד בזכירת מעשה עמלק בכל יומא, כי ענין זכירה זו היא לזכור חטאם של ישראל שגרם לביאתו, כדאי' במכילתא, ולא יאות לנפש להתמיד בזכירה זו. וגם לפי דרשת חז\"ל אשר קרך טמאך כמד\"א כי יהי' בך איש אשר לא יהי' טהור וגו'. לא טוב לנפשו היפה לחשוב במעשה המכוער ההוא, שבו החטיא עמלק את ישראל. ולפיכך די לנו בהזכירנו מעשה עמלק בקריאה בצבור אחת בשנה, כדי שלא ישכחו מעשיו מלבבנו כל השנה, ולהשניא מעשיו הרעים בעינינו, ולזכור חטאינו שגרמו לביאתו. ויהי' ענין הזכירה לזכור מעשיו הרעים בדרך כלל, לא פרטיות המעשים. ואף שאין בכוחינו לקיים מ\"ע דמחיית עמלק בזמן הזה כמבואר לעיל, אמנם כל כוחו של עמלק הוא הס\"מ, שהוא השר שלו, וע\"י חטאי ישראל הוא מתגבר ללחום עמהם, כדאי' במד\"ר (שמות פכ\"ו ג') כי בעבור שאמרו ישראל היש ה' בקרבנו לכך ויבא עמלק, וע\"י שנזכור מעשי עמלק ונשוב על חטאינו שגרמו ביאתו, שזהו טעם זכירת מעשה עמלק, ע\"י כך נחליש כוחו הרע. והעיקר להרבות במצוות ובמע\"ט שהם כגירא בעינא דשיטנא. וכאשר נעשה כל המוטל עלינו, ככל מה שבכוחינו לעשות, ישלים הבוי\"'ת למחותו לגמרי, וכדאיתא בפםיקתא אמרו ישראל לפני הקב\"ה רבון העולמים אחה אומר לנו הוו זהירים למחות את זכר עמלק ב\"ו אנו לשעה אנו אתה שאתה חי וקיים לעולמי עולמים הוי זכור אמר להם הקב\"ה בני אין לכם אלא להיות קוראים פרשת עמלק בכל שנה ומעלה אני עליכם כאילו אתם מוחים שמו מן העולם."},{"passage_id":"vayikru1_a261167c_p26","passage_content":"ולדרכנו יבואר הפרדר\"א (קושיא י\"ב) כתיב זכור את יום השבת לקדשו וכתיב זכור את אשר עשה לך עמלק היאך יתקיימו שניהם זה זכור וזה זכור. ונראה לומר דכוונת הקושיא כי מצות זכור את יום השבת חיובה תמידי, כמו שפירש\"י ז\"ל זכור לשון פעול וכו' תנו לב לזכור תמיד את יום השבת שאם נזדמן לך חפץ יפה תהא מזמינו לשבת, ע\"כ. וכתב הרמב\"ן ז\"ל שכן היא שנויה במכילתא וכו' ועל דרך הפשט אמרו שהוא מצוה שנזכור תמיד בכל יום את השבת שלא נשכחהו וכו' וטעם לקדשו שיהא זכרוננו בו להיותו קדוש בעינינו כמ\"ש וקראת לשבת עונג לקדוש ה' מכובד. ובמכילתא ר' יצחק אומר לא תהא מונה כדרך שאחרים מונים אלא תהא מונה לשם שבת ופירושו שהגויים מונים בימי השבוע לשם הימים עצמם ויקראו לכל יום שם בפני עצמו או על שמות המשרתים כנוצרים וכו' וישראל מונים כל הימים לשם שבת א' בשבת שני בשבת וכו' כי זה מן המצוה שנצטוינו לזכרו תמיד בכל יום, עיי\"ש שהאריך הרמב\"ן ז\"ל. עכ\"פ מצוה זו חיובה תמידי לזכור את השבת בכל יום תמיד. ובספה\"ק נועם מגדים פ' יתרו דקדק בלשון הכתוב זכור את יום השבת לקדשו, דהול\"ל זכור לקדש את יום השבת, וביאר באופן א' עפ\"י הכתוב (יחזקאל מ\"ו) שער החצר הפנימית הפונה קדים יהי' סגור ששת ימי המעשה ובשבת יפתח וגו', ר\"ל דבשבת נפתחין אורות, וקדושת השבת מוסיף קדושה, וזכירת השבת תהי' לקדשו לאדם הזוכרו."},{"passage_id":"vayikru1_a261167c_p27","passage_content":"אמנם במ\"ע זכור את אשר עשה לך עמלק, ע\"כ אין הכוונה שיזכרהו ויעמיק מחשבתו בו תמיד, כאשר נתבאר לעיל, ואפשר שזו היתה שאלת ישראל למשה רבינו ע\"ה זה זכור וזה זכור, ותרוייהו בסגנון אחד נאמרו, וכיצד יתקיימו שניהם, והרי אין זכרונם שוה, שהרי זכור את יום השבת פירושו לזכרו בכל יום, משא\"כ זכירת מעשי עמלק, שזכרונה בכל יום מזקת לנפש האדם, ועל כך השיבם משה אינו דומה כוס של קונדיטון לכוס של חומץ, זה כוס וזה כוס, אלא זה זכרהו לקדשו ולענגו שנא' זכור את יום השבת לקדשו, דלפי שזכירתו מוספת קדושה בנפש האדם, ע\"כ חיוב הזכירה בו תמיד בכל עת, משא\"כ זכירת מעשי עמלק הוא להומו ולאבדו, על פשעיו כי עצמו, ולא טוב לנפש להתבונן במעשי החטא, אפי' של אחרים, וע\"כ מה שאמה\"כ זכור לשון הוה הכוונה לזכרו מזמן לזמן, וגם זה קרוי תמיד, כמו שפירש\"י ז\"ל כל לילה ולילה קרוי תמיד, הרי כי תמיד יתפרש גם על דבר הבא מזמן לזמן, אף שאינו בכל עת, וע\"כ לומר דתיבת תמיד מתפרשת לפי הענין, פעמים אשר פירוש \"תמיד\" היינו ברציפות ממש בלי הפסק, ויש אשר גם דבר הבא מזמן לזמן יכנהו הכתוב תמיד, וה\"נ זכור את אשר עשה לך עמלק היינו זכירה מזמן לזמן, ואעפ\"כ כתיב זכור לשון הוה."},{"passage_id":"vayikru1_a261167c_p28","passage_content":"וכדי לבא לביאור שאר המדרשים נקדים עוד דברי הזה\"ק הובא בילקוט ראובני פ' תצא וז\"ל תמחה את זכר עמלק אילין בכורי ערב רב מעורבים בישראל עלייהו איתמר תמחה את זכר עמלק דלא ישתאר מנהון שריד ופליט וכו' ומיד דאיתמחון מן עלמא אז הוחל לקרוא בשם ה', עכ\"ל. ואיתא בזה\"ק פ' בראשית (דף כ\"ה ע\"א) חמש מינין אינון בערב רב ואינון נפילים וכו' עמלקים ועלייהו איתמר תמחה את זכר עמלק ומלחמה לה' בעמלק מדר דר. וכתב באור החמה שם דאף באלו הנולדים מזרע ישראל יתרמי ששורש נשמותיהם מסטרא דעמלק יעיי\"ש. ובזה נבא לבאר דברי המכילתא ר' אליעזר אומר ויבא עמלק שבא בגילוי פנים לפי שכל הביאות שבא לא בא אלא במטמוניות שנא' אשר קרך בדרך אבל ביאה זו לא בא אלא בגילוי פנים. ולכאורה לא מצינו שבא עמלק קודם לכן, ומה הכוונה שכל הביאות בא במטמוניות. ועוד שהרי ישראל היו מוקפים בענני הכבוד, ואיך יתכן שנכנס לתוכם בחשאי ובמטמוניות."},{"passage_id":"vayikru1_a261167c_p29","passage_content":"אמנם הנה עמלק לא היה יכול לבוא עד עתה להלחם עם ישראל מפאת היותם מוקפים ענני הכבוד, גם שרו של עמלק הוא הס\"מ לא היה יכול לבוא אליהם בגלוי פנים להסיתם לעבירה, כי בעת צאת ישראל ממצרים היו במדרגה גבוהה מאד. אלא שיעץ עמלק מזמות להרע לישראל ולהחטיאם באמצעות הערב רב שהם משרש עמלק, והם מעורבים בתוך בני ישראל, ולא נזהרו ישראל מלהתחבר עמהם, ובזה עלתה בידו של עמלק לגנוב לבבות ישראל ולהכניס בהם ספיקות באמונה, עד שמקצתם באו להרהר אחרי המקום ואמרו היש ה' בקרבנו אם אין. ואלו שנתפסו לדעותיהם פלטן הענן לחוץ, ומיד בא עליהם עמלק בגלוי פנים, וכמו שמבואר בתרגום יונתן פ' תצא וז\"ל והוה קטיל בכון כל דהוה מהרהר למסטי בתר מימרי הינון גובריא משבטא דבית דן דהוה בידיהון פולחנא נוכראה והוה עננא פליט יתהון. ובזה מבואר המכילתא שכל הביאות שבא עליהם לא בא אלא במטמוניות, כי לא היה יכול ללחום עם ישראל בגלוי להיותם מסובבים בענני הכבוד שהיו להם למחסה ולמסתור, גם לא היתה לשר שלו שליטה עליהם לגודל מדרגתם, אלא שבא בערמתו להפיל את ישראל ברשתו ע\"י הע\"ר המעורבים בתוכם, ולא נשמרו ישראל מלהתחבר עמהם, וע\"י כך עלתה בידו להחלישם מאמונתם, ומיד נפלטו מחוץ לענן ובא עליהם בגלוי פנים."},{"passage_id":"vayikru1_a261167c_p30","passage_content":"ויתבארו בזה גם דברי המכילתא פ' בשלח שהי' נכנס תחת כנפי הענן וגונב נפשות מישראל. דבאמת עמלק עצמו לא היה יכול להכנס תחת כנפי הענן, וגם הערב רב היו מחוץ לעננים כמבואר בזוה\"ק, אלא שהכניסו בישראל הרהורי מינות וע\"ז ע\"י שהתחברו להם, עד שנפשם לשאול הגיעה היש ה' בקרבינו אם אין. וז\"כ המכילתא שהיה גונב נפשות ע\"ד מאה\"כ (בראשית ל\"א) ותגנוב את לבבי, שהיה מכניס בנפשותם הרהורי ע\"ז ונתקם ממקור הקדושה, ועי\"ז היתה לו שליטה לבוא עליהם ולהלחם בהם. ומבואר כן בזה\"ק פ' תשא (קצ\"א ע\"ב) שהערב רב היו מופרשים מישראל והיו מחוץ לעננים אלא סגיאין הוו מישראל דאשתתפו בהדייהו בלבא. ר\"ל שהכניסו בהם הרהורי ע\"ז ומינות, וזה היה פגם מעשה העגל."},{"passage_id":"vayikru1_a261167c_p31","passage_content":"ובזה יובנו גם דברי הפסיקתא (קושיא ח') דדריש אשר קרך קראך שעמד חוץ לענן והיה קורא ראובן שמעון אחוכון פוקו דאנא בעיין למעבד פרגמטיא עמכון וכיון שהיה יוצא אחד מהם היה הורגו. ולכאורה הכי לא ידעו דלאו אחוהון הוא, אלא מזרע עשו השונא ליעקב. אמנם דא עקא שכבר היה לו לעמלק כח ואחיזה בקרב אותן מישראל שכבר הכניס בהם דיעות נפסדות, והיתה לו שייכות עמהן, ע\"י שהתגנב בלבבם, וע\"י כך הועילה קריאתו ויצאו אליו. ואפשר שהיתה הקריאה אליהם ע\"י הע\"ר שהיו ג\"כ מישראל, והם אמרו לישראל ראובן ושמעון אחוכון פוקו, והאמינו להם אלו שהיתה להם התחברות עמהם, ואח\"כ התנפל עמלק עליהה והרגם. ובזה א\"ש מה שדרשו במדרש ולא ירא אלקיה על עמלק ובמכילתא איתא ולא ירא אלקים אלו ישראל. דאון הכוונה על עמלק עצמו שהוא רשע עריץ, ולא שייך לומר עליו שלא היה ירא אלקים, כי מפחיתים בכך רשעתו, אלא הכוונה על הערב רב, ששורש נשמתם היה מזרע עמלק, ויראת אלקים לא נגע בלבבם, וע\"י התחברותם עם ישראל, החלישו גם את ישראל מיראתם, ושני המדרשים בקנה אחד עולים וכוונה אחת להם."},{"passage_id":"vayikru1_a261167c_p32","passage_content":"ובדרך זו נלך לבאר מה שהתנה הכתוב קיום מצוה זו בהניח ה\"א לך מכל אויביך מסביב ודרשו ז\"ל בספרי שלא יאגוד עליך אגודה (קושיא י\"א). ונראה בהקדם מ\"ש בזה\"ק פ' בשלח (ס\"ה ע\"ב) דמלחמת עמלק היה קרבא לעילא וקרבא לתתא ועיקר המלחמה היתה ע\"י הס\"מ שרו של עשיו ועמלק, עיי\"ש. וכתב האלשיך הקדוש ס\"פ תצא עפ\"י אמרם ז\"ל (שמות רבה פכ\"א ה' ועי' ילקוט ישעי' רמז תי\"ח) דאין אומה נופלת למטה עד שיפיל הקב\"ה שרה למעלה כמה דאת אמרת (ישעי' כ\"ד) יפקוד ה' על צבא המרום במרום ואח\"כ ואת מלכי האדמה באדמה. אמנה ידוע כי אין שרו של עמלק ועשיו כיתר השרים, כי א\"א לו ליפול אם לא כשאין בישראל עוונות, ועל כל עוון אשר חטא ביד ישראל הוא מוסיף בו כח ואומץ ר\"ל, ואיככה נוכל לו, ואיך יפול משמים אם אנו ח\"ו מחזיקים אותו בעוונותינו, ע\"כ עיקר המלחמה שנצטוינו שנעשה כל היכולת להתגבר על היצה\"ר וכוחותיו, שהם גירא דיליה, דהוא הס\"מ הוא יצה\"ר, ונשמור עצמינו מכל נדנוד חטא ועון, כדי שלא יהי' להם מקוה לשלוט בנו, וע\"י זהירות בקיום המצוות נחליש כוחותם, ואז יפקוד ד' על צבא מרום ויפיל שרו של עמלק, עכת\"ד ז\"ל."},{"passage_id":"vayikru1_a261167c_p33","passage_content":"והנה כל כוחו של עמלק לשלוט בישראל ולהלחם בם הוא באמצעות הערב רב, כמו שביארנו לעיל, דע\"י הע\"ר עלתה בידו המזמתה לגנוב נפשות ישראל, ומלחמה זו נוהגת בכל דור ודור, כדאי' בזה\"ק פ' בראשית (דף כ\"ה ע\"א) דאשתארו מנהון בגלותא רביעאה אינון רישין בקיומא סגי ואינון קיימין על ישראל כלי חמס וכו' ואלין אתמר בהון תמחה את זכר עמלק וכו' עיי\"ש. מבואר מזה דעיקר תכסיסי מלחמתו של עמלק לשלוט בישראל הם כוחות הערב רב, ומעתה הגם שאין בידינו למחות זכר עמלק, דאין אומה נופלת מלמטה עד שיפיל הקב\"ה שרה למעלה, אבל עכ\"פ עלינו להשמר מאד שלא ניתן בידו כח להתגבר עלינו, והוא ע\"י שנתרחק בכל יכלתנו מן הע\"ר שהם כלי חמס שלו. ואם אנו נעשה את אשר ביכלתנו, הקב\"ה ילחם לנו ויעשה את שלו למחות את זכר עמלק. אבל כל זמן שיש לישראל התחברות עם הע\"ר, לא יפיל הקב\"ה שרו של עמלק, כי עוונות ישראל מחזקים כוחו כמ\"ש האלשיך הקדוש."},{"passage_id":"vayikru1_a261167c_p34","passage_content":"ובזה י\"ל דברי הספרי שדרש במאה\"כ בהניח ה\"א לך מכל אויביך מסביב שלא יאגוד עליך אגודה. דהנה תנן במס' אבות (פ\"ג מ\"ו) עשרה שיושבין ועוסקין בתורה שכינה שרויה ביניהם וכו' ומנין שאפי' שלשה שנא' ואגודתו על ארץ יסדה, כך הוא גירסת רש\"י והרע\"ב ז\"ל, ופירש\"י אין אגודה אלא בג' שכן מצינו בג' מינים שבלולב שהיו נאגדין כאחד עכ\"ל. והנה אמרו ז\"ל במד\"ר פ' אמור (פ\"ל י\"א) רמז האגודה שבלולב וז\"ל מה אתרוג זה יש בו טעם וריח כך ישראל יש בהם בני אדם שיש בהם תורה ומע\"ט וכו' מה ערבה זו אין בה טעם ואין בה ריח כך ישראל יש בהם בנ\"א שאין בהם לא תורה ולא מע\"ט וכו' אמר הקב\"ה יקשרו כולם אגודה אחת והן מכפרים אלו על אלו וכו' ע\"כ. וכבר כתבנו (עיין בדרושים לחג הסוכות) דלכאורה לא נצטווינו לעשות רמז לאיזה דבר כי אם בזמן שאי אפשר לקיימו בפועל, דכל היכא דאפשר לקיימו, ודאי יותר ראוי לקיימו בפועל, מלהזכירו ברמז בלבד. וא\"כ יש להתבונן בטעמא דמילתא שנצטווינו לעשות רמז בלבד להתקשרות עם אותן שאין בהם לא תורה ולא מע\"ט, ע\"י האגודה שבלולב, והלא אם רצון הבוי\"ת שיתקשרו אלו עם אלו, היה לו לצוותינו לעשות כן בפועל. אמנם מכאן ראי' כי בהתקשרות עמהם איכא סכנתא, דיש חשש אמשוכי אבתרייהו ושמא ילמדו ממעשיהם, ונמצא קלקלתו מרובה על תקנתו, ע\"כ אסור להתקשר עמהם בפועלי ולא נצטווינו לעשות כן כ\"א על צד הרמז ע\"י האגודה בלולב, וענינה כלפי שמיא, שתצטרף תשובתם עם תשובת הרבים, ויתכפרו אלו עם אלו."},{"passage_id":"vayikru1_a261167c_p35","passage_content":"ועוד רמז טמון בכך, שאין נאגדים יחד כ\"א הג' מינים, משא\"כ האתרוג שיש בו טעם וריח, והרומז על בעלי תורה ומעשים טובים, לא נצטוינו לאגדו עמהם אפי' ע\"ד הרמז, רק שנוגעין מעט זה בזה בשעת הברכה. והרי זה מוכיח ועד, עד כמה צריך להזהר מי שיש בידו מצוות ומע\"ט, מלהתחבר ומלהתקשר עם אותם שאין בידם מצוות ומע\"ט, ועל אכו\"כ שעליו להתרחק מחברת הרשעים. ואמרו ז\"ל בסנהדרין (דף ק\"א ע\"ב) בירבעם בן נבט שע\"י שהושיב רשע אצל צדיק עלתה בידו להטעות גם את הצדיקים ולהמשיכם אחריו. ועל דרך זה היתה מלחמתו של עמלק להמשיך את ישראל אחריו, ע\"י שיתחברו עם הע\"ר, והם הם תחבולותיו ותכסיסי מלחמתו בכל דור ודור, לגנוב לבבות בני ישראל ע\"י ההתחברות לרשעים, ומביאים להם מן התורה ראיות בפשטים של דופי, שהתחברות לרשעים יש בה תועלת ותיקון, וראיתם מאגודה שבלולב שאמר הקב\"ה יתקשרו אלו עם אלו, ובזה מטעין אחריהם. ואפ\"ל שלזאת רמז הכתוב באמרו והי' בהניח ה\"א לך מכל אויביך מסביב, כלומר שתהי' לך נייחא ומנוחה מן הע\"ר, ולא תהי' מסובב בהם ובחבורתם, אז הגיעה העת שתמחה את זכר עמלק, כי יתננו ה' אלקיך בידך, ואבד תאבד את זכרו מתחת השמים. אבל כל זמן שלא תהי' לישראל מנוחה שלמה מאויביהם, הם הע\"ר שיש להם עדיין התחברות עמנו, לא ימחה זכר עמלק מכל וכל. וז\"ש הספרי שלא יאגוד עליך אגודה, ר\"ל שלא תתקשר ומתחבר עמהם, דוגמת אגודה שבלולב, דמיניה ילפינן דאין אגודה אלא בג'. וכאשר נתבאר דאין לעשות אגודה זו כ\"א בדרך רמז, אבל חלילה ללמוד משם לעשות עמהם התחברות בפועל. ודבר זה הוא מתנאי המצוה שכדי שתתקיים מחיית עמלק יש להזהר שלא יאגוד עליך אגודה, שלא תהי' לנו התחברות עם הערב רב רק עם יראי ה' וחושבי שמו, ואז נזכה למחות זכר עמלק, לא זולת."},{"passage_id":"vayikru1_a261167c_p36","passage_content":"ולדרכנו יתבארו גם דברי התנחומא (קושיא י\"ג) ר\"ת פתח זכרוניכם משלי אפר לגבי חומר גביכם וכו' משלי אפר משולי אפר אם זכיתם אתם בניו של אברהם אבינו שהמשיל עצמו כאפר ואם לאו וכו' התקינו עצמכם לשעבודה של מצרים וכו'. ונראה עפ\"י מה שכתבנו (עיין בדברנו לעיל פ' וירא דף שמ\"ט) עה\"פ ויען אברהם ויאמר הנה נא הואלתי לדבר אל ה' ואנכי עפר ואפר פירש\"י ז\"ל וכבר הייתי ראוי להיות עפר ע\"י המלכים ואפר ע\"י נמרוד לולא רחמיך אשר עמדו לי, ע\"כ. ולכאורה צ\"ב להבין שייכות הך מילתא שהיה ראוי להיות עפר ואפר אל מה שהתחנן ולימד זכות על סדום, וכי יש בכך איזה תוספת זכות, דמפני שהיה ראוי להיות עפר ואפר תנצל סדום."},{"passage_id":"vayikru1_a261167c_p37","passage_content":"ופירשנו עפ\"י המבואר בשער הפסוקים להאריז\"ל פ' שמות כי הנצה\"ק שנפלו אל הקליפות בק\"ל שנה שפירש אדה\"ר מאשתו היו כולם נשמות קדושות עליונות מבחי' הדעת ונתערבו בקליפות וצריכות גלגולים רבים לצרפם וללבנם עד תום חלאתם מהם ע\"י גלגולים רבים וכו' והתחלת גלגולם היה בדור המבול וכו' ולא תקנו אלא עוד קלקלו ונמחו מן העולם וכו' ואח\"כ נתגלגלו בדור הפלגה וכו' ואח\"כ באנשי סדום וכו' ופעם רביעי במצרים בדור הגלות ואז התחילו לתקן וכו' עיי\"ש באריכות. היוצא מזה כי באנשי סדום שנאבדו לפי שעה היו טמונות נשמות קדושות עליונות, וחזרו ונתקנו בס' רבוא ישראל כשרים וצדיקים אחר שנצטרפו ונתלבנו בכור הברזל במצרים, וזכו לקבל התורה, והם יסוד ושורש כללות האומה הישראלית. ובזה פירשנו מה שהועיל אברהם אבינו ע\"ה בתפלתו על אנשי סדום, כי בכח תפלתו תמתיק ענשם שלא יאבדו לנצח, ולא יכרתו נשמותיהם מענף עץ החיים, ופעל בכך הצלה להם ולכל דורות ישראל, שהיו נשמותיהם שבויות בתוכם. וזהו שהתפלל אאע\"ה חלילה לך להמית צדיק עם רשע, ר\"ל שאם יאבדו אלו לנצח ולא תהי' להם תקנה עולמית, יאבדו עמהם גם נשמות הצדיקים שבתוכם."},{"passage_id":"vayikru1_a261167c_p38","passage_content":"ונקדים עוד מ\"ש ביפ\"ת ר\"פ תולדות על הא דאי' במד\"ר התם (פס\"ג ב') אברהם לא ניצל מכבשן האש אלא בזכותו של יעקב וכו' הה\"ד (ישעי' כ\"ט) כה אמר ה' אל בית יעקב אשר פדה את אברהם יעקב פדה את אברהם. והקשה ביפ\"ת תימה למה לא היה אברהם כדאי להנצל בזכות עצמו שמסר נפשו על קידוש השם, ומדוע הוצרך לזכותו של יעקב דוקא. גם למה לא ניצל בזכותו של יצחק, וביאר כי שורת הדין נותנת שכל המוסר נפשו למיתה על קדושת שמו יתברך אין ראוי לו שיצילהו השי\"ת, כי טוב לו השלימות הגדול הזה, וזהו הטוב ושלימות התועלת הראוי לו, וכל אלו שניצולו היה לאיזה סיבה הצריכה להם, הא בלא\"ה אין להצילם, ולזה כאשר מסר אברהם נפשו והפילוהו לכבשן האש, היה ראוי שישרף כי זהו הטוב הראוי לו, אלא מפני משך הזרע הטהור שעדיין לא יצא ממנו ניצול. ולהכי נקט יעקב שהוא שלשלת היחס אשר היתה מטתו שלמה, ובזכות דורות ישראל הכשרים והצדיקים ניצול אברהם מכבשן האש, עכת\"ד ז\"ל. ובזה מבואר מה שאמר אברהם בתפלתו על אנשי סדום ואנכי עפר ואפר, ופירש\"י ז\"ל כבר הייתי ראוי להיות עפר ע\"י המלכים ואפר ע\"י נמרוד לולא רחמיך שעמדו לי. פירוש שמן הדין היה ראוי שלא אהי' ניצול, אלא אשרף על קדושת שמך, כי זהו השלימות הגדול, ומה שניצלתי הוא רק כדי להעמיד דורות ישראל כשרים וצדיקים, ולכן נפשי בשאלתי ועמי בבקשתי חלילה לך להמית צדיק עם רשע, וכאשר נתבאר שהתפלל להמתיק דינם של אנשי סדום שלא יאבדו לנצח, אלא תהי' עדיין תקנה לנשמותיהם, כשיחזרו להתגלגל בבני ישראל, ויצטרפו בשעבוד מצרים. שהרי אם ח\"ו לא תהי' להם תקנה עולמית, ויאבדו בתוכם הנשמות הקדושות הטמונות בקרבם, א\"כ למה לי חיים, הרי מוטב היה אילו נעשיתי עפר ע\"י נמרוד ואפר נרי המלכים, כי זהו השלימות והאושר הגדול עלי אדמות, למסור את הנפש על קדושת השם הנכבד והנורא."},{"passage_id":"vayikru1_a261167c_p39","passage_content":"ועפי\"ז נבוא לבאר דברי התנחומא (קושיא י\"ג), דהנה ידוע מה דאיתא בספה\"ק דכל הגליות הם השלמה לגלות מצרים, כי לפי שלא נשלם שם בירור הניצה\"ק עד תומם, מפני שיצאו לפני הזמן ולא יכלו להתמהמה, על כן היו צריכים להשתעבד בגליות עדי יהי' התיקון השלם על ידיהם. נמצא מזה כי גלות מצרים הוא תחלה וראש לכל הגליות, שכולם השלמה אליו. וזה שדרש בתנחומא אמר להם הקב\"ה לישראל אותם ב' זכירות שכתבתי לכם בתורה הוו זהירין בהן זכור את אשר עשה לך עמלק תמחה את זכר עמלק אם זכיתם הרי אתם בני של אברהם אע\"ה שהמשיל עצמו כאפר ואם לאו וכו' התקינו עצמיכם לשעבודה של מצרים. והכוונה כי הנה אברהם אע\"ה התפלל רק על בנים עובדי ה' שומרי תורה ומצוות, ובעבור כן ניצול מכבשן האש. והנה תועלת זכירת מעשה עמלק היא למען יזהרו בני בישראל מהתחברות עם הע\"ר, כוחותיו של עמלק, העומדים על ישראל להסיתם לעבירה, ולזאת אמר אם אתם זהירים בזכירת מעשה עמלק, ובתמחה את זכר עמלק, ע\"י שאתם מופרשים ומובדלים בתכלית ההתבדלות והריחוק מן הערב רב, אזי אתם בניו של אאע\"ה שאמר אנכי עפר ואפר, שהרי למען בנים כשרים וצדיקים כיו\"ב התפלל אאע\"ה, שהי' ראוי להיות עפר ואפר, אלא ניצול כדי להעמיד דורות קדושים, ואם לאו, שאינכם מובדלים מן הע\"ר, הכינו עצמכם לשעבודה של מצרים, כלומר שעליכם עדיין להצטרף ולהזדכך בכור הגליות, שהם השלמה לשעבודה של מצרים, עד שיתבררו כל הנשמות הקדושות ויודחו כל כוחות הרע, ויתפרדו כל פועלי און."},{"passage_id":"vayikru1_a261167c_p40","passage_content":"ועתה יתבארו גם דברי הפסיקתא (קושיא י\"ד) כתוב א' אומר תמחה את זכר עמלק וכתוב א' אומר מחה אמחה עד שלא פשט ידו בכסא תמחה כיון שפשע ידו וכו' מחה אמחה והקשינו דלפי זה למה הקדים הכתוב מחה אמחה האמור בפ' בשלח לתמחה האמור בפ' תצא. אמנם הנה שרו של עשיו ועמלק השטן הוא יצה\"ר הוא מה\"מ, וגם אילולא היה עושה את הדבר הרע הזה לישראל בצאתם ממצרים, היה הס\"מ נמחה מן העולם כמו שיהיה לעתיד, ולא עוד אלא שאילו לא חטאו ישראל במדבר היה עולם התיקון מיד, והיה נמחה לאלתר. ואז לא היו ישראל מצווים במצות תמחה את זכר עמלק, כי הבוי\"ת בידו למחות זכרו, ואינו צריך לפעולתינו. אבל לפי שחטאו ישראל לאמור היש ה' בקרבנו אם אין, ע\"י שהתחברו עם כוחותיו של הס\"מ, הם כחות הע\"ר שהכניסו בהם דיעות נפסדות וספיקות באמונה, לכן נצטווינו לזכור את אשר עשה לנו עמלק בדרך בצאתנו מצרים, אשר קרך בדרך שצננך מן האמונה השלמה, שהיתה חרותה על לוח לבכם, ולכן כדי לתקן פגם זה עלינו לזכור מעשיו וההתחברות עמו שגרמה לחטאינו, וע\"י כך נהי' זהירים להתרחק ממנו ומגונדא דיליה, כמבואר בתנחומא, דמייתו משל לבנו של מלך שפרץ את הגדר ונשכו הכלב כל זמן שהיה המלך מבקש להזכיר חטא של בנו אומר לו זכור אתה היאך נשכך הכלב כך הקב\"ה מבקש להזכיר חטאן של ישראל שחטאו ברפידים אמר להם זכור את אשר עשה לך עמלק אשר קרך בדרך וכו'. מבואר דזוהי תכלית הזכירה שישים האדם אל לבו מה הגיע לישראל ע\"י התחברותם עם הע\"ר, וכמו שדרשו בספרי יכול בלב כשהוא אומר לא תשכח הרי שכחת הלב אמור הא מה אני מקיים זכור בפה, עכ\"פ מבואר שצריך שימה אל הלב, ובלא\"ה לא יצא ידי חובת המצוה, אלא שמיתורא דקרא ילפינן שצריך להזכיר גם בפה."},{"passage_id":"vayikru1_a261167c_p41","passage_content":"היוצא מזה כי מה שנצטוו תמחה את זכר עמלק בא להם מחמת שחטאו ונכשלו על ידו, ואילולא כן היה הקב\"ה בעצמו מאבד זכרו, ולא היה צורך לפעולתינו. והוא כעין מה שמבואר בגמ' נדרים (כ\"ב ע\"ב) אלמלא חטאו ישראל לא ניתן להם אלא ה' חומשי תורה וספר יהושע בלבד וע\"י שחטאו ניתוספו להם ספרי נביאים וכתובים שיש בהם רבוי תוכחה על חטא לצורך תיקון נפשם. וה\"נ נוספה להם מצות מחיית עמלק, וזכירת מעשה עמלק, לצורך תיקון נפשם."},{"passage_id":"vayikru1_a261167c_p42","passage_content":"ובזה מובן מה שהקדים הכתוב מחה אמחה תחלה בפ' בשלח והדר כתיב תמחה בפ' תצא. דמתחלה כך היה רצון הבוי\"ת למחות זכר עמלק מבלי פעולתינו, אלא שגרם החטא ונצטווינו במחייתו כדי לתקן פגם ההתחברות עמו. אך אחרי שפשט ידו בכסא והחריב את ביהמ\"ק, יתנקם בו השי\"ת, ויקיים בו מחה אמחה מבלי פעולתינו. וכאשר יסד הפייטן ביוצר לשבת זכור עד שאתה מצוונו הזכר לך אתה זכור את אשר עשו לך זכור ה' את יום זבולך זכור כסא כבוד גדלך וכו' יותר משעשו לצו עשו לך. וזה ביאור דברי התנחומא עד שלא פשט ידו בכסא תמחה, שהרי אנו נצטווינו במחייתו כדי לתקן פגם החטא, אך כיון שפשט ידו בכסא מחה אמחה. וא\"ש מה שאמר הכתוב זכור את אשר עשה לך עמלק, ודקדקנו דתיבת לך יתירא. והשתא יובן היטב, דהנה על מה שחטא עמלק והמריד כלפי השי\"ת, הרי כבר אמור בפ' בשלח כי מחה אמחה, אך הכא שנאמר ציווי לישראל תמחה את זכר עמלק, על כן דקדק לומר זכור את אשר עשה לך עמלק, שהחטיא אותך, על כן מוטלת עליך המצוה למחות זכרו, כדי לתקן פגם החטא, ולהתעורר בתשובה."},{"passage_id":"vayikru1_a261167c_p43","passage_content":"ובדרך זו נבא לבאר המדרשים בפרשתנו. ותחלה יתבארו דברי התנחומא וז\"ל לעוה\"ב כשהקב\"ה נפרע מעשיו מה עשיו עושה מתעטף בטליתו כזקן ויושב לו אצל יעקב וכו'. והוא פלאי וכי כל כך שועה הוא עשיו הרשע, עד שחושב בדעתו כי יעלה בידו לרמות את השי\"ת כביכול. ובספה\"ק דגמ\"א פ' וישלח מביא דברי המדרש הללו וכתב שכעי\"ז מצוי גם בעוה\"ז בעוה\"ר שנתרבה השקר בעולם וכל אחד רוצה לעלות במעלות שלומי אמוני ישראל ורואה שהם מלובשים בגדי לבנים בשבת ולובשים טלית בע\"ש במנחה ואומר היות אהיה כמוהו, עיי\"ש שמפרש בדרך זו מאה\"כ הצילני נא מיד אחי מיד עשיו, אבל בגוף דברי המדרש לא ביאר כלום."},{"passage_id":"vayikru1_a261167c_p44","passage_content":"ונראה לפרש דברי התנחומא עפ\"י מה שכתבנו (עי' בדברנו להלן פ' אחרי) לתרץ קושית ק\"ז זלה\"ה בישמח משה על החרוז בזמירות לשבת ראותו כי כן האדומי העוצר יחשוב לו בבצרה וכו' והוא מיוסד על מאמרם ז\"ל (מכות י\"ב ע\"א) ג' טעיות עתיד שרו של אדום לטעות וכו'. ולכאורה מאחר שאנו מזמרים זאת מדי שבת בשבתו, והשטן הוא היצה\"ר שומע דברינו, א\"כ כיצד יטעה בכך, והרי אנו מודיעים ומגלים זאת מראש, והדבר גלוי לפניו. ותירץ הוא ז\"ל כי בעת שישראל מזמרין יחשוב לו בבצרה, סבה הוא מאת ד' לשלח את השטן לבל ישמע זאת, למען יתקיים מאמרם ז\"ל כי עתיד הוא לטעות, עיי\"ש באורך. והנה הדברים ראויים למי שאמרן, כי לפום דרגא דיליה נאמרו, שהיה בכח קדושתו לדחות את השטן ולגרשו, לבל ימצא בשעה שמזמרין חרוז זה. אך לאו הכל זוכים לכך, ומי יוכל עוד להתפאר כי גם אצלו לא ימצא השטן בעת שמזמרין זאת, וא\"כ השטן שומע כאשר אומרים חרוז זה, ועוד כי מאמר זה מקורו בגמרא ערוכה ויש הלומדים מאמר זה שלא לשמה, ויבא גם השטן להתיצב בתוכם, ואיך נעלם ממנו ענין זה והוא לא ידע כי טעות בידו, אחרי שמעו רבים אומרים כי עתיד הוא לטעות."},{"passage_id":"vayikru1_a261167c_p45","passage_content":"וביארנו דהנה כך היא מדתו ית' למדוד לאיש כמדתו וכגמול ידיו ישולם לו מדה כנגד מדה. ולכן לפי שהשטן מטעה את ישראל בעוה\"ז בהצלות בדויות ומזוייפות, שממקור הרשע מוצאם ומשורש הטומאה כידוע, על כן יפרע ממנו הקב\"ה מדה כנגד מדה, להטעותו בהצלה מזוייפת, וישתבש לחשוב על בצרה שהיא קולטת כבצר. וכו'. ועד\"ז ביארנו מאמר הגמ' בר\"ה (דף ט\"ז ע\"א) למה תוקעין ומריעין כשהן יושבים לערבב השטן ובתוספות שם (ד\"ה כדי) הביא דברי הירושלמי כד שמע קול שופר זמנא חדא בהיל ולא בהיל וכד שמע תניין אמר ודאי זהו שיפורא דיתקע בשופר גדול ומטא זימניה למתבלע ומתערבב וכו'. ולכאורה אינו מובן שהרי השען הוא ערום ובעל תחבולות, ומשגה חכמים ונבונים ומפילם ברשתו אשר טמן להם, וכיצד יטעה טעות כזו, וחיל ורעדה יאחזוהו בשמעו קול השופר, וביותר תמוה איך הוא כסיל שונה באולתו בכל שנה ושנה. וביארנו (עיין בדרושים לר\"ה) דאין טעות זו בדרך הטבע, כי אם כך סגולת מצות השופר, להטעות את השטן ולבהלו לחשוב כי הגיע הזמן אשר בו יעמוד למשפט לפני רבון העולם, והוא עפ\"י מה שכתב הרמב\"ן ז\"ל בפ' בחקתי כי אין בטבע שיבואו גשמים ויהי' שלום לנו מן האויבים וכו' בעשותינו החוקים והמצוות אבל הם נסים נסתרים ומסגולת קיומם של המצוות, עכת\"ד ז\"ל. ועונש זה מגיע אל השטן מדה כנגד מדה על אשר הוא משיב חכמים אחור ודעתם יסכל לומר לרע טוב, בערמותיו ובתחבולותיו. וכמו שידוע מה שפירש הבעש\"ט מאמר הגמרא בפ' כלל גדול (דף ע\"ה ע\"א) שוחט משום מחייב משום צובע, וכתבו התוספות שם אשוחט דעלמא קאי. וביאר דשוחט דעלמא רומז על השטן, ושאלת הגמרא היא משום מאי מחייב לעתיד לבא על אשר הטעה את הבריות והסיתם לרע, והלא לכך נברא, וה' שלחו לעשות את כל זאת. ומשני משום צובע פירוש שהוא מראה פנים לומר על עבירה שהיא מצוה, והבריות טועים אחריו וחושבים כי מצוה הם עושים, ועל כך לא נצטווה. ע\"כ. ולזאת ענוש יענש במדה כנגד מדה, ויטעה גם הוא טעות אשר למראית עין אין בו מקום לטעות."},{"passage_id":"vayikru1_a261167c_p46","passage_content":"ועד\"ז יובנו דברי התנחומא כשהקב\"ה נפרע מעשו עתיד הוא להתעטף כזקן ולשבת אצל יעקב והקב\"ה יורידו משם. ויתבאר עפ\"י מ\"ש בדגמ\"א הנ\"ל כי מצינו דוגמתו בעוה\"ז שמתרבה השקר ומתעטפים בטלית להתדמות אל הצדיקים. וזה פרי מעשהו של השטן, להסית בני אדם לשנות טעמם, ולהתעטף במעטה החסידות, ולהעמיד פני צדיק, כדי להטעות את הבריות אחריהם. ולזאת יהי' ענשו של שרו של עשיו מדה כנגד מדה, וענוש יענש לטעות ולחשוב כי תועיל לו מדת הצביעות, וההתעטפות במלבוש החסידות להנצל מעומק הדין, ולכן יעשה בערמה ויתלבש בטלית כזקן וישב לו אצל יעקב, והקב\"ה ישיב לו אם תגביה כנשר ואם בין כוכבים שים קנך ואין כוכבים אלא ישראל משם אורידך אמר ה', ולא יהי' שריד לבית עשיו."},{"passage_id":"vayikru1_a261167c_p47","passage_content":"ועתה נבא לבאר דברי התנחומא (קושיא ט\"ו) גערת גוים זה עמלק אבדת רשע זה עשיו אם יאמר לך אדם יעקב בכלל אמור לו אבדת רשעים אכ\"כ אלא אבדת רשע. ע\"כ. והוא תמוה מאד מי יעלה על דעתו לומר כי אף יעקב בכלל, דאיצטריך קרא למיעוטיה, ויובן בהקדם מה שכתבנו (בדרוש לפורים) לישב מה שהקשו המפורשים (קושיא ט\"ז) על אמרם ז\"ל מבני בניו של המן למדו תורה בבני ברק דזה סותר לכאורה לדברי המכילתא פ' בשלח שאין מקבלים גרים מעמלק. וביארנו עפ\"י המבואר באורך בכתבי האריז\"ל כי ע\"י חטא אדה\"ר נתפזרו ניצוצות הקדושה ונשבו אל הקליפות, ובמה תהי' תקנתן להחזירן למקורן ושרשן ע\"י שיתגיירו או שתתגלגל נשמה זו בזרע ישראל, עכדה\"ק ז\"ל. ולפי זה יש לחקור במה תהי' תקנתן של אותם הנשמות הקדושות השבויות בתוך זרעו של עמלק, וכיצד יחזרו למקורן ושרשן, והרי הקב\"ה חפץ חסד הוא ולא ידח ממנו נדח. ואפשר כי הבוי\"ת נוטל אותם הנשמות מבור שבים בזרע עמלק, ונוטעם ע\"י גלגול באומה אחרת, שמקבלים מהם גרים, ומשם יתגיירו ויחזרו למקורן ושרשם. והוא כעין אמרם ז\"ל (גיטין ל\"ה ע\"א) עמון ומואב טהרו בסיחון, או אפשר שהם חוזרים לכלל ישראל בבחינת גלגול ועבור נשמות, דאף שאין בידינו לקבל גרים מזרע עמלק, אכן טעמא דמילתא משום שאין אתנו יודע שורש נשמתו, אם הוא ראוי להתקבל, אבל כלפי שמיא גליא מקור הנשמות ושורש מחצבתם, אם הם נצר זדון מזרע עמלק, או אם ממקור הקדושה מוצאם אלא שנשבו לבין הקליפות. ואם אמנם מקורן הוא מבחינת הקדושה, אזי הקב\"ה מקבלם ומחזירם בבחינת גלגול לזרע ישראל."},{"passage_id":"vayikru1_a261167c_p48","passage_content":"ובבחינה זו אפ\"ל מאמרם ז\"ל מבני בניו של המן למדו תורה בבני ברק, עפ\"י מ\"ש האריז\"ל ז\"ל כי גלגול יקרא בבחי' בן ופירש בזה אמרם ז\"ל צדיק וטוב לו צדיק בן צדיק. וה\"נ הכוונה כי הנשמות הקדושות שהיו עשוקות ושבויות בזרעו של המן חזרו ונתגלגלו בזרע ישראל ונתגיירו, וא\"ש שאין זה מתנגד לדברי המכילתא, דאף שאין מקבלין גרים מזרע עמלק, היינו שאין בכח ב\"ד לקבלם, אבל הבוי\"ת מקבלם אם שורש נשמתם מישראל."},{"passage_id":"vayikru1_a261167c_p49","passage_content":"ובזה נבוא לביאור התנחומא גערת גוים זה עמלק וכו' אבדת רשע זה עשיו. פירוש כי מנותקים הם משורש הקדושה, ובסופו של דבר יחפרו ויאבדו, ושמא יאמר לך אדם אף יעקב בכלל, היינו אותם הנשמות הנטמעים ביניהם ששרשם מישראל, אף הם יאבדו עמהם ח\"ו, אחרי שאין מקבלים מהם גרים. או אפ\"ל הכוונה גם על בני ישראל שנמשכו אחריהם ונתפסו להתחבר להם, ע\"י כובד הגלות וקושי הנסיונות, ושמא תאמר שאבד סברם ח\"ו ושוב אין להם תקנה, אף אתה אמור לו אבדת רשעים אין כתיב כאן אלא אבדת רשע, דאין אלו בכללן, והבוי\"ת המסבב כל הסבות אשר בידו נפש כל חי ורוח כל בשר איש, יסבב שיהי' להם תיקון, ויחזרו אל הקדושה, כי שם ביתם."},{"passage_id":"vayikru1_a261167c_p50","passage_content":"ועל פי האמור נבוא לבאר הני תרי מדרשי בתנחומא (קושיא ג' ד') שדרשו היא העולה על מוקדה דקאי על משרע\"ה דכתיב ומשה עלה אל האלקים וגו', ועל ישראל דכתיב מי זאת עולה מן המדבר, והדר דרשו הוא העולה על מוקדה, על מלכות אדום שעתידה להשרף באש שנא' ולא יהי' שריד לבית עשיו וגו'. ונראה בהקדם מה שכתבנו לעיל בדברינו לבאר מד' פליאה שאלו תלמידיו את ר\"י בן קיסמא אימתי בן דוד בא אמר להם זאת תורת העולה. דכוונת שאלתם היתה במה יזכו ישראל לביאת בן דוד, והשיב להם זאת תורת העולה, והוא ע\"ד שדרשו מקרא זה בתנחומא דקאי על לימוד תורת העולה, והיינו שבזכות לימוד התורם יזכו לגאולה, וכן איתא נמי במד\"ר פ' צו אין הגליות מתכנסות אלא בזכות תנוי שנא' גם כי יתנו בגוים עתה אקבצם, היוצא מזה כי בכח לימוד התורה יכנע שרו של עשיו הוא הס\"מ, ויתוקן עולם במלכות שדי. ובזה מבוארים הני דרשות בתנחומא עה\"פ זאת תורת העולה דקאי על ישראל ועל משה. והכוונה שבזכות האורה שמסר משה לישראל מפי הגבורה, יזכו ישראל לגאולה שלמה, ואז יהיה בית עשיו לקש וישרף על מוקדה, והכל תלוי במה שישראל יתדבקו בתורה."},{"passage_id":"vayikru1_a261167c_p51","passage_content":"ובאופן אחר יתבאר המדרש שאלו תלמידיו את ר' יוסי בן קיסמא אימתי ב\"ד בא השיב להם זאת תורת העולה. ויתבארו גם דברי התנחומא הנ\"ל שדרש היא העולה על משה וישראל ועל מפלת עשיו. ונראה בהקדם לפרש דרשת התנחומא בפרשתן זש\"ה היטיבה ברצונך את ציון תבנה חומות ירושלים ואח\"כ אז תחפוץ זבחי צדק עולה וכליל אם אין ישראל מקריבין קרבנות אין ציון וירושלים נבנית לפי שאין נבנית אלא בזכות קרבן עולה וכו' ע\"כ. וכבר הבאנו דברי התנחומא הללו בדרושים הקודמים, והוא קשה מאוד להלמו, דתלה בנין ציון וירושלים בהקרבת קרבנות, והדברים הפוכים לכאורה, דלא שייך להקריב קרבנות בזמן החורבן, ועל כרחך שבנין ציון וירושלים יוקדם להקרבת העולה. ונראה לבארו עפ\"י מ\"ש בסה\"ק ערבי נחל פ' שלח בשם המקובלים שהקשו הלא נודע כי המקריב קדשים בחוץ חייב כרת, כי אין ראוי להקריב קרבנות אלא במקום אשר בחר לו ה', הוא בית המקדש אשר בירושלים, ולא במקום אחר שקדושתו פחותה, כמבואר במס' כלים (פ\"א מ\"ו) דא\"י נחלקת לעשר קדושות, ועאכו\"כ שאין להקריב קרבנות בחו\"ל, דטומאת ארץ העמים אינה סובלת קדושת הקרבן. ולפי זה קשה כיצד הקריבו ישראל קרבנות במשכן, בכל מ' שנה שהיו במדבר. ותירצו ע\"ד מה שאמרו ז\"ל (ב\"ר פס\"ט ג') שקפל הקב\"ה כל א\"י והניחה תחתיו, וה\"נ נתגלגלה עמהם קדושת א\"י וקדושת הר הבית בכל מקום שהלכו, ומקום המשכן הוא מקום המקדש ממש. עכ\"ד עיי\"ש באורך."},{"passage_id":"vayikru1_a261167c_p52","passage_content":"והנה הראב\"ד ז\"ל כתב בפירושו לעדיות (פ\"ב מ\"ט) כי בעת ביאת המשיח לא יכנסו ישראל לארץ מיד אלא מתחלה יוליכם הקב\"ה למדבר העמים ככתוב בנבואת יחזקאל (פ\"כ) והבאתי אתכם אל מדבר העמים וגו'. ופירש\"י והרד\"ק הוא המדבר שהלכו בו ארבעים שנה, וכן כתוב בנבואת הושע (פ\"ב) והולכתיה המדבר, עיי\"ש. ונקדים עוד דהנה מבואר בזה\"ק כי משרע\"ה אשר גאל את אבותינו ממצרים הוא עתיד להיות הגואל גם לעתיד. ודרש לה ממאה\"כ (קהלת א) מה שהיה הוא שיהי' ר\"ת משה. וידוע מה שכ' האור החיים הק' בפ' ויחי שאין זה סותר אל המבואר כי דוד המלך ע\"ה יהי' הגואל כמאה\"כ (יחזקאל ל\"ז) ועבדי דוד מלך עליהם, דשניהם צדקו יחדיו, כי נשמת משה כלולה מכל ישראל, והגואל העתיד תהי' נשמתו כלולה מנשמות משה ודוד גם יחד, עיי\"ש."},{"passage_id":"vayikru1_a261167c_p53","passage_content":"ועפ\"י זה נבוא לביאור התנחומא הנ\"ל שאין ציון וירושלים נבנית אלא בזכות קרבן עולה. דהנה בזמן שיהיו ישראל במדבר, ומשרע\"ה ודוד המלך ע\"ה מנהיגים אותם, ואליהו זל\"ט אתם עמם, ודאי שתהי' במקום ההוא קדושת א\"י וקדושת הר הבית, וכיון שכן יהי' בידם להקריב שם קרבנות, כשם שהקריבו ישראל במדבר בצאתם ממצרים, ובזכות אותם הקרבנות ציון וירושלים נבנית, וזהו שאמר הכתוב היטיבה ברצונך את ציון, פירוש בעת שיעלה ברצונו הפשוט לבנות את ציון, אז תחפוץ זבחי צדק עולה וכליל, הם הקרבנות שעתידים ישראל להקריב במדבר העמים, ובזכות זה יבנו ציון וירושלים. ודבר זה הוא סימן מובהק אל הגאולה, שבתחלה יקריבו ישראל קרבנות, ואח\"כ יבנו ציון וירושלים, וזולת זאת לא יתכן שתהי' גאולה אמיתית."},{"passage_id":"vayikru1_a261167c_p54","passage_content":"ובדרך זה נלך לבאר המדרש תנחומא הנ\"ל שדרש מאה\"כ הוא העולה על משה וישראל, ואח\"כ דריש ליה על מלכות אדום שתשרף באש. ויתבאר בהקדם מ\"ש המהר\"ל מפראג זלה\"ה לתת טעם למנהג פתיחת הדלת בליל פסח לכבוד אליהו זל\"ט, שהוא כדי להשריש בלבות הקטנים אמונה שלמה בגאולה אמיתית, שלא יתפתו אחרי גאולה של שקר, והסימן הוא כי בטרם בוא הגואל, יבוא אליהו זל\"ט לבשר ביאתו, ואחרי כן יתגלה משיח צדקינו, עכ\"ד. וכבר הארכנו בענין זה בספר ויואל משה מאמר שלש שבועות ושם (בסי' נ\"ד) הבאתי מ\"ש הפליתי לחלק דזה שיבוא אליהו לבשר ביאת המשיח הוא רק אם תהי' הגאולה בבחי' בעתה, אבל אם תהי' הגאולה בבחי' אחישנה אולי יחיש הקב\"ה ביאת המשיח, מבלי שתקדים לו בשורת אליהו זל\"ט."},{"passage_id":"vayikru1_a261167c_p55","passage_content":"ברם אכתי איכא סימנים מובהקים שלא יבואו לטעות בגאולות של שקר. חדא מה שנתבאר לעיל כי מבואר בזוה\"ק כי משרע\"ה יהי' הגואל לעתיד, וזהו סימן מובהק לגאולה כאשר יבוא משרע\"ה, ויקבץ נדחי ישראל אל מדבר העמים, ויקריבו שם קרבנות. ועוד שהרי מצינו בגמרא סנהדרין (צ\"ט ע\"א) א\"ל ההוא צדוקי לר' אבהו אימתי אתי משיח א\"ל לכי חפו לכו חשוכי להנהו אינשי א\"ל מילט קא לייטת לי א\"ל קרא כתיב (ישעי' ס') כי הנה החשך יכסה ארץ וערפל לאומים ועליך יזרח כבוד ה' וכבודו עליך יראה. הרי לך סימן מובהק אל הגאולה האמיתית, כאשר תהי' הכנעת כל האומות, ולא יהי' שריד לבית עשיו, אז תהי' הגאולה השלימה. ומכאן תשובה לאותם האומרים כי יתכן שתהי' הגאולה ברשיון האומות עפ\"ל. שהרי מבואר בנבואת ישעיה אשר בעת הגאולה יגדע קרן האומות, והחושך יכסה אותם."},{"passage_id":"vayikru1_a261167c_p56","passage_content":"היוצא מזה כי בידינו שני סימנים מובהקים לגאולה האמיתית, חדא שיקבץ משרע\"ה את ישראל למדבר העמים ויקריבו שם קרבנות, והב' שישבר רום קרנם של האומות ויכרת מארץ זכרם. ובזה אפשר לפרש מאמר הכתוב צו את אהרן ואת בניו לאמר (קושיא א') דתיבת לאמר דרשו חז\"ל בכמה מקומות אמירה לדורות, ונתן הכתוב בכאן סימנים מובהקים לדורות האחרונים, למען ידעו אימת תתקיים זאת תורת העולה לעת\"ל, שתבנה ירושלים ויחזרו להקריב בה קרבנות, לזאת אמר הוא העולה, ודריש ליה בתנחומא על ישראל דכתיב בהו מי זאת עולה מן המדבר, ועל משה דכתיב ביה ומשה עלה אל האלקים. וה\"פ כאשר יתקבצו ישראל למדבר העמים ומשרע\"ה רעיא מהימנא מנהיגם, אזי הוא סימן מובהק אל הגאולה. ויבואר בזה גם אידך דרשא בתנחומא דהוא העולה על מוקדה קאי על מלכות אדום שתשרף באש. כי הוא זה הסימן השני אל הגאולה העתידה, בעת אשר תתבטל כליל מלכות הרשעה, אזי יתרומם קרן ישראל ותהיה הגאולה האמיתית."},{"passage_id":"vayikru1_a261167c_p57","passage_content":"ובזה מבוארת היטב כוונת המדרש שאלו תלמידיו את ר' יוסי בן קיסמא אימת בן דוד בא, כלומר שבקשו ממנו תנה לנו מופת, למען נדע אימתי תהי' הגאולה האמיתית, השיב להם זאת תורת העולה, כלומר בעת שיתקיימו ב' סימנים שדרשו ז\"ל המרומזים במקרא זה כמבואר, אז אות הוא אל הגאולה האמיתית. והבוכ\"ע יעזור שנזכה למחיית עמלק בשלימות, ויתגלה לעינינו הגואל האמיתי במהרה ונתרומם ונזכה לעבוד השי\"ת באמת, ולראות בישועת כל ישראל ושמחתן, וננצל מכל צרה וצוקה ונזכה לישועה שלימה במהרה בהתגלות כבוד שמים עלינו במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru1_f962d4fc","title":"","summary":"","contents":[{"passage_id":"vayikru1_f962d4fc_p1","passage_content":"דרוש לשבת שחל בו פורים דמוקפין"}]},{"dvar_torah_id":"vayikru1_0e69431c","title":"תענית אסתר וחשיבות התפילה","summary":"הדבר תורה עוסק בגזירת תענית אסתר ובסיבותיה, תוך הדגשת הצורך בתשובה ובתפילה. נידונה השאלה מדוע לא בטלה הגזרה לגמרי, והובהר כי הקטרוגים על ישראל נמשכים, ולכן יש לקבוע מעמדות לתפילה ולימוד תורה בכל דור ודור.","contents":[{"passage_id":"vayikru1_0e69431c_p1","passage_content":"וידבר ה' אל משה לאמר צו את אהרן ואת בניו לאמר זאת תורת העולה הוא העולה על מוקדה וגו'. פירש\"י ז\"ל אין צו אלא לשון זירוז מיד ולדורות אמר ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס, ע\"כ. וצ\"ב מה טעם הוצרך הכתוב לזרז בהקרבת העולה כי היא נוהגת מיד ולדורות, והלא כל המצוות נוהגות בכל עת, וגם הקרבת העולה בכללן. גם הא דקאמר ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס צ\"ב שהרי יש הרבה מצוות שקיומן תלוי בהפסד ממון רב ולא הוצרכה תורה לכתוב בהם לשון זירוז."},{"passage_id":"vayikru1_0e69431c_p2","passage_content":"ב) תנן בריש מסכת מגלה (ב' ע\"א) מגלה נקראת בי\"א בי\"ב בי\"ג בי\"ד בט\"ו וכו'. ובגמרא שם איתא היכא רמיזא אמר ר' שמן בר אבא אמר ר' יוחנן אמר קרא לקיים את ימי הפורים האלה בזמניהם זמנים הרבה תיקנו להם וכו' ופריך ואימא תריסר ותליסר ומשני כדאמר ר' שמואל בר יצחק י\"ג זמן קהלה לכל היא ולא צריך לרבויי, ע\"כ. ופירש\"י זמן קהלה לכל היא הכל נקהלו להנקם מאוביהם בין בשושן בין בשאר מקומות וכו', הלכך לא צריך קרא לרבויי שיהא ראוי לקריאה, דעיקר הנס בו היה. אמנם הרא\"ש ז\"ל הקשה על פירש\"י ז\"ל והביא דברי הירושלמי ריש מגלה דקאמר י\"ג יום מלחמה הוא מוכיח על עצמו שאין בו ניחה, וסבירא ליה למימר שדברי הירושלמי המה לאחדים עם הא דאיתא בגמרא דידן י\"ג זמן קהלה לכל הוא, דזמן קהלה נמי פירושו שנקהלו למלחמה. ואח\"כ כתב ולא נהירא לר\"ת דהו\"ל למימר זמן מלחמה היא וכו', ופירש רבינו תם זמן קהלה לכל היא שמתאספין הכל לתענית אסתר ובאים בני הכפרים לעיירות לומר סליחות ותחנונים לפי שבו נקהלו לעמוד על נפשם והיו צריכים רחמים מכאן נראה לר\"ת סעד לתענית אסתר שאנו עושין כמו שעשו בימי מרדכי ואסתר כשנקהלו היהודים לעמוד על נפשם ולא מצינו לו סמך בשום מקום אלא בכאן וכו'. עכ\"ד הרא\"ש ז\"ל. וכדברי ר\"ת מבואר להדיא במדרש תנחומא פרשת בראשית (סי' ג' ומקורו משאלתות דר' אחאי פ' ויקהל) שבשלשה עשר באדר נקהלו היהודים בעריהם וגזרו בו תענית ומשם רמז לתענית אסתר וכ\"ה הר'ן ז\"ל מדברי השאלתות."},{"passage_id":"vayikru1_0e69431c_p3","passage_content":"היוצא מזה כי תקנה קדומה היא להתענות בי\"ג אדר, זכר לדברי הצומות וזעקתם, בעת אשר נקהלו היהודים לעמוד על נפשם ולשלוח יד במבקשי רעתם. ולכאורה קשה למה יתענו תענית זה לעולם, והרי נתקבלה תפלתם לפני הקב\"ה ונהפוך הוא אשר ישלטו היהודים המה בשונאיהם, וא\"כ היה ראוי להפוך להם יום זה למשתה ושמחה ויו\"ט. וכמו שמצינו בימי בית שני שכל התעניות שנתקנו על החרבן נהפכו להם לששון ולשמחה ולמועדים טובים, ורק אחר שחרב בית שני חזרו התעניות למקומן, והבטיחנו השי\"ת ע\"י עבדיו הנביאים (זכרי' ח') צום הרביעי וגו' יהיה לבית יהודה לששון ולשמחה ולמועדים טובים. וכן נפסקה הלכה בשו\"ע כי כאשר התענו על כל צרה שלא תבא ואח\"כ בטלה הגזרה עשו את הימים האלה ימי משתה ושמחה, ומאי שנא תענית אסתר שעדיין נשארה גזרת התענית במקומה, אף אחר שבטלה הצרה."},{"passage_id":"vayikru1_0e69431c_p4","passage_content":"ונראה לבאר הענין בהקדם לפרש מאמר תמוה במסכת מגילה (דף י\"ב ע\"א) וז\"ל שאלו תלמידיו את רשב\"י מפני מה נתחייבו שונאיהם של ישראל שבאותו הדור כליה אמר להם אמרו אתם א\"ל מפני שנהנו מסעודתו של אותו רשע אמר להם א\"כ שבשושן יהרגו שבכל העולם אל יהרגו אמרו לו אמור אתה אמר להם מפני שהשתחוו לצלם (פירש רש\"י בימי נבוכדנצר) אמרו לו וכי משוא פנים יש בדבר (היאך זכו לנס) אמר להם הם לא עשו אלא לפנים אף הקב\"ה לא עשה עמהם אלא לפנים וכו'. עכ\"ל הגמ'."},{"passage_id":"vayikru1_0e69431c_p5","passage_content":"והנה המאמר הזה כולו פלאי, וכבר נתחבטו המפרשים לבוא אל כוונתו, וחתרו ליישבו בפנים שונים זה בכה וזה בכה, ועדיין לא מצאה ידם די באר כוונת המאמר, דבר דבור על אפניו. ונציג נא תחלה את הספיקות הנופלים בהבנת מאמר זה. חדא למה מיאן רשב\"י לענות על שאלת תלמידיו, אלא אמר להם אמרו אתם, דמשמע מזה שידע כי יש להם תשובה על שאלתם, ומנין ידע זאת. גם אין זה מדרך המוסר שיסרב הרב להשיב לשאלת תלמידיו. ועוד קשה דמהכא משמע שרשב\"י דחה לגמרי את הטעם שנתנו תלמידיו, שנתחייבו על שנהנו מסעודתו של אותו רשע, משום הקושיא אלא מעתה שבשושן יהרגו שבכל העולם אל יהרגו, ונראה מסוגיית הגמרא דכוותיה דרשב\"י נקטינן, ותימה דבמדרשי חז\"ל מפורש יוצא שעיקר הגזירה היתה משום שנהנו מסעודתו של אותו רשע כדאיתא באסתר רבתי (פ\"ז וכ\"ה בילקוט אסתר רמז תתרנ\"ז) וז\"ל המן הרשע בעלילה גדולה בא על ישראל וכו' אמר המן לאחשורוש אלקיהם של אלו שונא זמה העמד להם זונות ועשה להם משתה וגזור עליהם שיבואו כולם ויאכלו וישתו ויעשו כרצנם וכו' כיון שראה מרדכי כך עמד והכריז עליהם וא\"ל אל תלכו לאכול בסעודתו של אחשורוש שלא הזמין אתכם אלא ללמד עליכם קטיגוריא וכו' ולא שמעו לדברי מרדכי והלכו כולם לבית המשתה וכו' ואכלו ושתו ונשתכרו ונתקלקלו וכו' באותה שעה רץ אליהו זל\"ט אצל אבות העולם ואצל משה בן עמרם א\"ל מפני מה א\"ל מפני שנהנו מסעודתו של אותו רשע ובעבור זאת נגזרה עליהם גזרה לכלותם מן העולם ולאבד זכרם וכו', עיי\"ש. מבואר להדיא כי בעבור שנהנו מסעודתו של אותו רשע באה עליהם גזירת כליה, וזה שלא כדברי רשב\"י בגמ', שדחה טעם זה וסבר שנתחייבו כליה בעון שהשתחוו לצלם, וצ\"ב ליישב שלא יסתרו דברי חז\"ל במדרש למסקנת הגמרא במגלה."},{"passage_id":"vayikru1_0e69431c_p6","passage_content":"ותו יש להתבונן במה שהקשו תלמידי רשב\"י וכי משוא פנים יש בדבר שאלה זו מה טיבה. הא אנן קיי\"ל (רמב\"ם פ\"ג מהלכות תשובה הי\"ד) אין לך דבר העומד בפני התשובה, וישראל עשו תשובה כהוגן, כמבואר בכתוב לך כנוס את כל היהודים וגו' וצומו עלי שלשת ימים וגו' ונתקבלה תשובתם לפני שוכן מרומים והעביר את הגזרה, בעבור ששבו ישראל אליו בכל לבם, וא\"כ אין כאן משוא פנים, אלא שכך היא המדה שהתשובה מועלת להסיר חרון אף."},{"passage_id":"vayikru1_0e69431c_p7","passage_content":"וגדולה מזו מצינו דפעמים הקב\"ה מאריך אפו אפילו במקום שלא עשה עדיין תשובה, וכמו שכתב הרמב\"ם ז\"ל (פ\"י מהלכות יסודי התורה ה\"ד) דמה שנתנה תורה סימן להבחין בנביא שקר אשר ידבר הנביא בשם ה' ולא יהיה הדבר ולא יבא הוא הדבר אשר לא דברו ה' וגו', היינו דוקא אם הבטיח על טובה ולא באה הטובה שאמר, אז בידוע שהוא נביא שקר אבל בדברי הפורעניות שהנביא אומר אם לא עמדו דבריו אין בזה הכחשה לנבואתו וכו', שהקב\"ה ארך אפים ורב חסד ונחם על הרעה, ואפשר שעשו תשובה ונסלח להם כאנשי נינוה או שתלה להם כחזקיה, ע\"כ. מבואר מזה כי כך מדתו של הקב\"ה להאריך אפו אולי ישובו, וכן אמה\"כ בפ' תשא וינחם ה' על הרעה אשר דבר לעשות לעמו. וא\"כ לכאו' קושית תלמידי רשב\"י מעיקרא ליתא, דאף אילו לא היו ישראל עושים תשובה אין כאן משום משוא פנים, אלא שדרכו יתברך לרחם על בריותיו ולהאריך אפו אולי ישובו מדרכם הרעה."},{"passage_id":"vayikru1_0e69431c_p8","passage_content":"ונראה לבאר כוונת המאמר הלזה עפ\"י דרכו של בעל ספר מנות הלוי, שכתב דתלמידי רשב\"י תמהו לכאורה כי עוון ההשתחויה לצלם רב ועצום ממה שאכלו בסעודת אחשורוש, ואעפ\"כ לא נענשו בעת שהשתחוו לצלם, ומדוע איפה נגזרה עליהם גזרת כליה בשעה שהשתתפו בסעודתו של אחשורוש, שאין זה חטא גדול כ\"כ, גם לפי הנראה אין ראוי להענישם בכליון חרוץ בעבור חטא זה שהשתתפו בסעודה. וזהו שאמרו מפני מה נתחייבו שונאיהם של ישראל שבאותו הדור כליה, נקטו באותו הדור לשלול טעם האומר כי נתחייבו כליה בעבור שהשתחוו לצלם, דא\"כ היה להם להתחייב בדור הקודם בעת שהשתחוו לצלם, ומדוע נתלה להם עד אותה מעשה. ואם נאמר שנתחייבו בעבור שהשתתפו בסעודת אחשורוש, גם זו קשה להלמה, דאין בזה כדי להתחייב כליה, והרשב\"י ראה והבין מתוך קושיתם כי יש בפיהם תשובה אחרת לשאלתם, ע\"כ אמר להם אמרו אתם את הטעם הנראה לכם, והם השיבו לו מפני שנהנו מסעודתו של אותו רשע, נתכוונו בזה להגדיל אשמת ישראל, שלכאורה הוא פלא שיבא עליהם עונש חמור כ\"כ בעון ההשתתפות בסעודה, לכן אמרו מפני שנהנו כלומר שלא היו אנוסים במצות המלך להשתתף באותה סעודה אלא אדרבה המלך גזר לעשות כרצון איש ואיש זה המן ומרדכי, והשתיה כדת אין אונס מיין נסך, ומרדכי מכריז שלא ילכו שם, ולפי שלא הוכרחו והלכו מעצמם הם חייבים כליה. וזהו שאמרו מפני שנהנו שהלכו לסעודה מרצונם הטוב, כי זדון לבם השיאם להשתתף בסעודה. ועוד הגדילו אשמה זו באמרם מסעודתו של אותו רשע, ואין הכוונה להודיענו שאחשורוש רשע היה, אלא בא לומר שנתכוונו לאכול בסעודת רשע ופשע, דאף אם היו שם מאכלות כשרים, ולא התגאלו בפת בג המלך וביין משתיו, מ\"מ היה להם למנוע עצמם מללכת שמה מפני כוונת הסעודה, וכאמרם ז\"ל (מגילה י\"א ע\"ב) עה\"פ כשבת המלך אחשורוש על כסא מלכותו לאחר שנתישבה דעתו אמר בלשאצר מנה וטעה אנא חשבנא ולא טעינא מנה שבעין שנה אמר השתא ודאי תו לא מיפרקי. וכן לכל שאר הטעמים הנאמרים בגמרא שם בכוונת אותה סעודה היה להם לישראל להרחיק נדוד ולברוח לבלתי המצא באותה סעודה. ובהדיא אמרינן בגמרא (ע\"ז ח' ע\"א) תניא ר\"ש בן אלעזר אומר ישראל שבחוצה לארץ עובדי ע\"ז בטהרה הם כיצד כותי שעשה משתה לבנו וזימן את כל היהודים אשר בעיר אע\"פ שאוכלים ושותים משלהם ושמש שלהם עומד עליהם מעלה עליהם הכתוב כאילו אכלו מזבחי מתים שנאמר וקרא לך ואכלת מזבחו וכו', ע\"כ. אלו תוכן דברי בעל מנות הלוי, יע\"ש באורך מה שביאר את שארית המאמר, וקישור הדברים שעברו בין רשב\"י לתלמידיו בזה."},{"passage_id":"vayikru1_0e69431c_p9","passage_content":"ולי נראה ללכת בדרכו של בעל מנות הלוי, אך נבאר באופן אחר מה שהקשו תלמידי רשב\"י עליו וכי משוא פנים יש בדבר ותשובתו אליהם הם לא עשו אלא לפנים וכו'. דהנה בעל מנות הלוי ז\"ל הניח הנחה סוברת דאף דאזיל ומודה רשב\"י לדברי תלמידיו, שנתחייבו כליה בעבור הסעודה, אלא שחלק עליהם במה שהיו סבורים שנתחייבו בעבור ההשתפות בסעודה בלבד, דא\"כ קשה שבשושן יהרגו על כן הוסיף רשב\"י לתת טעם לחיובם, משום שהשתחוו לצלם בימי נבוכדנצר. אך כיון שדבר הצלם היה באונס תלה להם הקב\"ה ולא הענישם, עד בוא החטא שנהנו מסעודתו של אותו רשע, והיתה השתתפותם בסעודה מרצונם הטוב באין אונס. על כן כיון שהיה בסעודה זו ענין ע\"ז כמו שנתבאר מדכתיב וקרא לך ואכלת מזבחו, חזר ונתעורר עליהם גם החטא הקדום שהשתחוו לצלם, ונצטרפו ב' החטאים יחד לחייבם כליה."},{"passage_id":"vayikru1_0e69431c_p10","passage_content":"ויתבאר הענין ביתר ביאור עפ\"י מה שאמרו ז\"ל בבן סורר ומורה (סנהדרין ע\"ב ע\"ב) תניא ריה\"ג אומר וכי מפני שאכל זה תרטימר בשר וכו' יצא לבי\"ד ויסקל אלא הגיעה תורה לסוף דעתו סוף שמגמר נכסי אביו ואינו מוצא ויוצא לפרשת דרכים ומלסטם את הבריות. והקשה הרא\"ם ז\"ל בפרשת תצא דהכא מבואר שדנין את האדם ע\"ש סופו, וזה סותר להא דאיתא בב\"ר (פנ\"ג י\"ט) שהיו מלאכי השרת מקטרגין על ישמעאל רבש\"ע מי שעתיד להמית בניך בצמא אתה מעלה לו באר והוא משיבם עכשיו מה הוא צדיק או רשע א\"ל צדיק א\"ל לפי מעשיו של עכשיו אני דנו וכו', עיי\"ש. הרי שאין דנין את האדם אלא לפי מעשיו באותה שעה, ותירץ לחלק בין התחיל בעבירה ללא התחיל, דגבי ישמעאל שעדיין לא התחיל באותה שעה באותה עבירה של צמא לא מינה ולא מקצתה, על כן דנו אותו לפי מעשיו באותה שעה, משא\"כ בבן סורר ומורה שכבר התחיל באיסור, ע\"כ דנין אותו ע\"ש סופו."},{"passage_id":"vayikru1_0e69431c_p11","passage_content":"ועל דרך זה יתבאר גם לענינינו, כי הנה אמת נכון הדבר שחלות הגזרה היתה בשעה שהשתתפו בסעודתו של אותו רשע, אך סבת הדבר שגרמה לישראל להכשל ולהנות בסעודה זו היתה משום שכבר קדם להם החטא שהשתחוו לצלם, וע\"ד שכתב הרמ\"ע ז\"ל בעשרה מאמרות בשם האריז\"ל (הובא בילקוט ראובני פ' בראשית) כי אדה\"ר חטא תחלה באונס שחוה הביאה לו מן הפרי ואח\"כ התחיל היצה\"ר לקלקל עד שאכל ברצון, ע\"כ. וה\"נ היה תחלת החטא במה שהשתחוו לצלם, ואף שהיה באונס מ\"מ רושם הפגם נרשם בנפשותם, והביא לידי כך שנכשלו בסופו של דבר להשתתף בסעודתו של אותו רשע ברצונם הטוב."},{"passage_id":"vayikru1_0e69431c_p12","passage_content":"ונמצא כי זה וזה גרם, דבעת שחטאו להשתתף בסעודתו של אותו רשע, נפקדו ונענשו אף על החטא הקודם שהשתחוו לצלם ביני נ\"נ. כי חטא זה שנהנו מסעודתו של אותו רשע, בא בסבת החטא הקדום שהשתחוו לצלם באונס, ונצטרפו שניהם יחד להביא עליהם גזרת כליה. ושלא תקשה שהרי לא נהנו מסעודתו של אותו רשע כי אם היהודים אשר בשושן, ושאר היהודים אשר במדינות המלך מה עשו, שיגיע עליהם עונש כליה. לאו קושיא היא זו, דכיון שהיה עליהם עון שהשתחוו לצלם, על כן בזמן שנפקדו היהודים אשר בשושן על מה שהוסיפו לחטוא במה שנהנו מסעודתו של אותו רשע, ונצטרפו ב' החטאים יחד לגזור עליהם עונש כליה, נפקדו עמהם אף היהודים אשר בכל מדינות המלך, שהרי גם עליהם היה החטא הקדום שהשתחוו לצלם. והוא כעין מה דאיתא במד\"ר פ' בראשית (פ\"ה ט') הובא ברש\"י ז\"ל תני ר' נתן ג' נכנסו לדין וד' יצאו מחוייבין אדם חוה ונחש נכנסו לדין ונתקללה הארץ עמהם וכו'. ולמה נתקללה וכו', שעברה על הציווי שכך אמר לה הקב\"ה וכו' עץ פרי מה הפרי נאכל אף העץ נאכל והיא לא עשתה כן אלא ותוצא הארץ וגו' הפרי נאכל והעץ אינו נאכל, לפיכך כשנתקלל האדם על עוונו נפקדה גם היא על עוונה. וה\"נ יש לומר לענינינו, דלפי שכבר היה על כלל ישראל אותו עוון שהשתחוו לצלם, על כן בזמן שנפקדו היהודים אשר בשושן על עוונם שנהנו מסעודת אחשורוש, ונזכר להם גם החטא הקדום שהשתחוו לצלם, נפקדו גם שאר היהודים על עוון זה. ומה גם שעוון ההשתחוי' לצלם היה הגורם למה שנכשלו ליהנות מסעודת אותו רשע כמבואר, וכיון שנכשלו ישראל אשר בשושן הבירה, אף שהיה שם מרדכי הצדיק וסנהדרין וחכמים יודעי העתים, ולא הועילו כל האזהרות שהזהירן מרדכי שלא ילכו לאותה סעודה, עאכו\"כ שבמשך הזמן היו נכשלים גם היהודים אשר בשאר המדינות להיות נהנים מע\"ז ברצון לבם, שהרי גם בידם היה הפגם מאותו עון שהשתחוו לצלם, ואם גבירה לוקה שפחה לא כ\"ש, ועל כן נגזרה גזרה על כל ישראל."},{"passage_id":"vayikru1_0e69431c_p13","passage_content":"תוכן הדברים דאף רשב\"י סבר שנענשו על שנהנו מסעודתו של אחשורוש, אלא שהבין מתוך דברי תלמידיו כי הם דוחים לגמרי את הטעם שהשתחוו לצלם, וזה מוכח ממה שאמרו מפני מה נתחייבי ישראל שבאותו הדור וכו', משמע שבאו לשלול את עון ההשתחויה לצלם שהיה בדור הקודם, ולכן הקשה על דבריהם א\"כ שבשושן יהרגו שבכל העולם אל יהרגו, ועל כרחך לומר שנצטרף להם גם מה שהשתחוו לצלם בימי נ\"נ, אלא שלא נענשו על זה לאלתר משום שהיה באונס, ותלה להם עד שנהנו מסעודתו של אותו רשע מרצונם הטוב, ואז חזר ונתעורר החטא הקודם, ויצאה הגזרה על כל ישראל."},{"passage_id":"vayikru1_0e69431c_p14","passage_content":"אמנם תלמידי רשב\"י לא הבינו אמיתות כוונתו, אלא סברו כי הוא דוחה לגמרי את טעמם, וס\"ל שנענשו רק על שהשתחוו לצלם. ולזאת חזרו והקשו על דבריו וכי משוא פנים יש בדבר, וכוונת קושיתם נראה דאם אמנם נגזרה הגזירה רק בעבור שהשתחוו לצלם, א\"כ כל ישראל שוים בחטא זה, ומדוע לא התעוררו לתשובה כי אם היהודים אשר בשושן, כמו שאמר הכתוב לך כנוס את כל היהודים הנמצאים בשושן וגו' וצומו עלי וגו', ולא מצינו שהתענו וחזרו בתשובה היהודים אשר בשאר מדינות המלך. ולפי מה שהבינו הם בדברי רבם שכל חטאם היה מה שהשתחוו לצלם, היה מן הצורך שיתעוררו בתשובה גם היהודים אשר בשאר המדינות, שהרי כולם נכשלו בחטא זה בשוה. וזהו שהקשו וכי משוא פנים יש בדבר, ולא נתכוונו להקשות על מה שנתבטלה הגזרה, שהרי הרבה גזרות נתבטלו מעל ישראל וכך דרכו של הקב\"ה לרחם על בריותיו ולהשיב מהם חרון אפו. אלא שהוקשה להם דכיון דלא ניחא ליה לרשב\"י לומר שנענשו על שנהנו מםעודתו של אותו רשע, משום שלא היו כל ישראל בחטא זה, והוצרך לחפש ולתור אחרי עון קדום זה שהשתחוו לצלם, משום שבעון זה הושוו כל ישראל. א\"כ כשם שהיה הטון ההוא שוה בכולם, ה\"נ היה ראוי שהתעוררות התשובה תהי' בכולם בשוה, ומדוע לא נתאספו להתעורר בתשובה כי אם היהודים אשר בשושן, וכי משוא פנים יש בדבר, שלא הוצרכו שאר היהודים לחזור בתשובה כדי לבטל רוע הגזירה."},{"passage_id":"vayikru1_0e69431c_p15","passage_content":"וכאשר ראה רבם כי לא עמדו על כוונת דבריו, השיב להם הם לא עשו אלא לפנים אף הקב\"ה לא עשה עמהם אלא לפנים. והכוונה בזה על היהודים אשר בשאר מדינות המלך, שלא היה בידם כי אם אותו עון שהשתחוו לצלם באונס, וחטא זה אינו אלא לפנים, שהרי היו אנוסים ולבם לא היה נכון עמהם להשתחוות לע\"ז, ולפיכך היה די להם בעונש זה שנגזרה עליהם הגזרה לפנים, ובכך נתכפר להם עוונם, ומיד נתבטלה מהם הגזרה לגמרי. אכן היהודים אשר בשושן, שנוסף להם עוד החטא החמור שנהנו מסעודתו של אותו רשע, והסכימו בלבם לע\"ז כמבואר, לכן הוצרכו לתענית ולתשובה לכפר על עוונם, דכיון שחטאם לא היה לפנים, אלא שנהנו והסכימו בלבם לע\"ז, על כן אף הגזרה שנגזרה עליהם לא היתה לפנים, והוצרכו להתעורר בתשובה כדי להעביר את רוע הגזרה."},{"passage_id":"vayikru1_0e69431c_p16","passage_content":"ובזה מיושב גם מה שהקשינו ממסקנת הגמרא דס\"ל כרשב\"י שנענשו על שהשתחוו לצלם, על הא דאיתא במדרש חז\"ל שחטאם היה שנהנו מסעודתו של אותו רשע. והשתא לק\"מ דאף רשב\"י מודה דהא והא איתנייהו, דעיקר הגזרה היתה על שנהנו מסעודתו, אלא שנפקדו גם על העוון הקדום שהשתחוו לצלם, ולפיכך היתה הגזרה על כל ישראל."},{"passage_id":"vayikru1_0e69431c_p17","passage_content":"ועתה נבא לבאר טעם שקבעו חכמים תענית זו לדורות, ולא בטלוהו גם אחר שנתהפכו להם ימים אלו לשמחה ולששון. ונראה עפ\"י מ\"ש ק\"ז זלה\"ה (בישמח משה על נ\"ך) בחינה נוראה עה\"פ וימי הפורים האלה לא יעברו מתוך היהודים וזכרם לא יסוף מזרעם. כי באמת גזרה זו לא בטלה לגמרי, כי הגזרה חלה אז על כמה נפשות מישראל שהיו אז בעולם בי\"ג אדר, ששברו אויבי היהודים לשלוט בהם, אבל אילו היתה הגזרה מתקיימת ח\"ו אז היה כליה ח\"ו, לכן כשניחם אח\"כ הבוכ\"ע על הרעה ובטלה הגזרה, מ\"מ מדת הדין אינו חוזר בריקניא, וניתנו לו נפשות אלו בפזרון, כאשר באמת כן היה הריגות רבות ר\"ל בזמנים שונים. ובזה פי' הפסוק וימי הפורים האלה לא יעברו מתוך היהודים, ר\"ל לא יפטרו בלא כלום ועדיין הגזרה קיימת, וא\"ת א\"כ מאי ארוחנא בזה שנדחתה הגזרה, אם בסופו של דבר היא מתקיימת, לזאת אמר שהיתה תועלת בדחית הגזרה למען וזכרם לא יסוף מזרעם, שלא תאבד שארית ישראל, כי אילו היתה מתקיימת הגזרה בימי אחשורוש לא היה נשתייר משונאיהם של ישראל שריד ופליט ח\"ו, על כן צדקה עשה ה' עמנו שדחה את הגזרה בו בפרק, והיא מתקיימת מעט מעט במשך הדורות באורך הגלות. עכ\"ד הקדושים."},{"passage_id":"vayikru1_0e69431c_p18","passage_content":"היוצא מדברינו כי גזירת ימי הפורים לא בטלה לגמרי אלא שנדחתה לזמן מאוחר יותר, ובכל שנה ושנה באותו הפרק שבו נגזרה הגזרה, חוזר ומתעורר בשמים קיטרוג הס\"מ על ישראל בעבור אותו החטא ובעוה\"ר עדיין השטן הזה מרקד בינינו, שהרי ישראל שבאותו הדור נתחייבו כליה על שנהנו מסעודתו של אותו רשע והסכימו לע\"ז בלבם. ועתה בדור השפל הזה אותו החטא מושרש בקרב רבים מישראל, שנהנים ממעשי הרשעים ומסכימים עמהם בלב. השי\"ת ירחם על עמו ישראל בשפלות המר הזה, אשר קמו על ישראל תרבות אנשים חטאים כופרים ומורדים בה', שכל מגמתם להסית ולהדיח את כלל ישראל מדת תוה\"ק, ולהעבירם על אמונתם ודתם, ולקחו לעצמם ממשלה למרוד בה' ובתורתו הקדושה, ועדיין נמצאים יהודים הנהנים מסעודתו של אותו רשע, וששים ושמחים במעשי הרשעים הללו הכופרים בעיקר, השם יצילנו מהם ומהמונם. השי\"ת ירחם עלינו ויצילנו מכל צרה וצוקה, ונוושע במהרה תשועת עולמים, כי גזירת ימי הפורים כבר נתקיימה בסכום הנפשות שהיו בזמן הגזרה בימי מרדכי ואסתר, כי סבלנו הריגות די והותר וכבר כשל כח הסבל, וחוששני שכבר נהרגו בזמן הגלות נפשות בסכום רב יותר ממה שהיו בשעת הגזרה. ואף בדורנו אנו נשמדו בחרבן הנורא שעבר על ראשנו הרבה יותר נפשות ממה שהיו באותו זמן, הבוי\"ת יעזור שננצל מכאן ולהבא מכל צרה וצוקה."},{"passage_id":"vayikru1_0e69431c_p19","passage_content":"ועתה מבואר טעם שקבעו חז\"ל תענית אסתר לדורות, כי הנה בכל שנה מתעורר בשמים קטרוג על ישראל, כשם שהי' קיטרוג למעלה באותה העת, כדאיתא במד\"ר עה\"פ בלילה ההוא נדדה שנת המלך נדדו עליונים נדדו תחתונים. דאף שהעם היו חושבים כי כל הגזירה היתה בעצת המן לאחשורוש, מ\"מ עיקר התעוררות הקיטרוג היתה בשמי מעלה, כאשר גילו לנו חז\"ל שהשטן עמד לקטרג מאד על ישראל, ורצה להכניע את כוחות הקדושה תחתיו. ועל כן זקוקים ישראל לרחמי שמים מרובים בימים אלו, אשר אותו הקטרוג חוזר ומתעורר בשמים, כי הגזרה לא בטלה לגמרי, כמ\"ש ק\"ז זלה\"ה, ויש לדאוג שלא להסיח דעת מלבקש רחמים בימים אלו. ולכוונה זו קבעו חז\"ל את יום י\"ג באדר ליום תענית, וזמן קהלה לכל הוא, שבו נקהלים היהודים להרבות בתפלות ובתחנונים, שיתבטל הקטרוג המתעורר בשמים. ועלינו לדבק עצמנו בכח הקדושה ולקבל על עצמנו עול מלכות שמים ועל תורה, ובזה נעורר רחמים על ישראל, על הכלל ועל הפרט שיוכלו להתקיים."},{"passage_id":"vayikru1_0e69431c_p20","passage_content":"ועתה נחזור לבאר דרשת התורת כהנים אין צו אלא זירוז מיד ולדורות. בהקדם הא דתנן במס' תענית (כ\"ו ע\"א) אלו הן מעמדות לפי שנאמר צו את בני ישראל ואמרת אליהם את קרבני לחמי (שהתמיד בא מן השקלים של כל ישראל) היאך קרבנו של אדם קרב והוא אינו עומד על גביו התקינו נבאים הראשונים כ\"ד משמרות על כל משמר ומשמר היה מעמד של כהנים לויים וישראלים הגיע זמן המשמר לעלות הכהנים והלויים עולין לירושלים וישראל שבאותו משמר מתכנסין לעריהם (ופירש\"י ז\"ל מתכנסין לעריהם. ומתפללין על קרבן אחיהם שיתקבל ברצון ומתענין ומוציאין ס\"ת ביום תעניתם) וכתב ק\"ז זלה\"ה בתפלה למשה עה\"פ (תהלים ם\"ט) טבעתי ביון מצולה ואין מעמד וזלה\"ק. ר\"ל משום זה טבעתי וגו' באריכות הגלות הואיל ואין מעמד, דהגם שבית המקדש חרב אבל מה שאפשר לכם דהיינו המעמדות שהיו בזמן שביהמ\"ק היה קיים למה לא עשיתם, לכך נתארך הגלות. וזה ברור ואמת, עכ\"ד הקדושים. וכוונתו דכשם שבזמן שביהמ\"ק היה קיים היו מזמנין אנשים קבועים שהיו פנויים מכל עסק ועוסקים בתורה ויושבים בתענית ומרבים בתפלות ובתחנונים על כלל ישראל, כן מוטל עלינו בזמן הגלות ליחד אנשים שיהיו פנויים לעסוק בתורה ובתפלה עבור כלל ישראל, ועל אשר חסרנו אלה ארכו ימי הגלות ועדיין ב\"ד לא בא."},{"passage_id":"vayikru1_0e69431c_p21","passage_content":"ועפ\"י דברי קדשו נראה לבאר מאה\"כ זאת תורת העולה וגו'. דהנה פרשה זו מיירי בעולת התמיד של צבור הקריבה בשחרית ובין הערבים, כדדרשו ז\"ל הוא העולה על מוקדה כל הלילה קאי על הקטר אברים ופדרים של תמיד בין הערבים שהם כשרים כל הלילה להקרבת ואח\"כ הרים את הדשן וערך מערכה להקרבת תמיד של שחר, ולא היה דבר קרב לפני תמיד של שחר, וכיון שעולת התמיד היא קרבנן של כל ישראל היו צריכין למנות עליו אנשי משמר ואנשי מעמד, דהיאך קרבנו של אדם קרב והוא אינו עומד על גביו. וזהו שרמז הכתוב באמרו זאת תורת העולה, שתהיה הקרבת העולה כתורה וכהלכה, ומכלל ההלכות הנוהגות בעולה היא שיהיה האדם עומד ע\"ג קרבנו בעת הקריב אותה, ולכן צריך שיעמידו על התמידין אנשי משמר ומעמד שיעסקו בתורה ובתפלה, ואז יתקבל קרבנם לרצון לפני ה'."},{"passage_id":"vayikru1_0e69431c_p22","passage_content":"ועל פי האמור יתבאר מה שדרשו ז\"ל אין צו אלא זירוז מיד ולדורת, דהנה הנועם מגדים כתב לבאר מאה\"כ צו ולאמר דהנה התוספות ז\"ל כתבו בקידושין פרק האומר (ס\"ב ע\"ב) בהא דאחז\"ל גר צריך שלשה משפט כתיב ביה וכתבו דלחומרא מקשינן להודאות ולהלואות דבעינן ג' והקשו דא\"כ נבעי מומחין ותירצו בשם הר\"ר נתנאל ז\"ל דזה לא יתכן דבגר כתיב לדורותיכם דמשמע עד עולם בלי הפסק והרי עתה בחו\"ל ליכא מומחין. עכ\"ד התוספות. ובאמת דבר זה הוא תלמוד ערוך בידינו במס' כריתות (דף ח' ע\"ב), אך לא מטעם קושייתם, דפריך הש\"ס אהא דאמרינן גר מחוסר כיפורים עד שיזרוק עליו הדם משום ככם כאבותיכם כו' ופריך הש\"ס א\"ה האידנא לא נקבל גרים ומשני דכתיב וכי יגור אתכם וגו', ועי' ברש\"י לדורותיכם אע\"ג דליכא מקדש. ולפי זה יקשה לנו במאה\"כ צו בהאי ענינא דעולה דאיך שייך בזה לדורות, דבזמן שאין ביהמ\"ק קיים מאי איכא למימר. אמנם מצינו לחז\"ל בשלהי מנחות כל העוסק בתורת עולה כאילו הקריב עולה וכו', והיינו לדורות וכו' ר\"ל אמירה דזאת תורת העולה היא העולה הרי זה ממש כמקריב עולה על מוקדה על המזבח והיא היא, ובהיות כן אמירה זו נהוג כל הלילה, ר\"ל בכל אורך גלותינו המכונה לילה כידוע, עד הבוקר אור ביאת משיחנו במהרה, ושייך שפיר צו לדורות. עכ\"ד הנועמ\"ג."},{"passage_id":"vayikru1_0e69431c_p23","passage_content":"והנה דבריו בזה הם בדרך דרש, עפ\"י מה שאמרו ז\"ל דזאת תורת העולה קאי על לימוד הפרשה, ולזה נאמר צו לשון זירוז מיד ולדורות דעל לימוד תורת העולה צריך להזהיר אף לאחר החורבן. אך עפ\"י פשטות הכתוב, דקאי על קרבן עולה לא יכונו דבריו. אמנם לפי דרכינו יש ליישב אמרם מיד ולדורות אף לפי פשטות הכתוב, דקאי אקרבן עולה בפועל, דאפ\"ה שייך לזרז עליו לדורות. ואף שבעוה\"ר חרב ביהמ\"ק ובוטל התמיד, מ\"מ הרי מחלקי המצוה הוא שנעמיד מעמדות לעסוק בתורת בעת הקרבת העולה, ודבר זה עדיין בידינו לעשות אף בזה\"ז, לקבוע מעמדות שיהיו פנויים ממשא ומתן ועוסקים בתורה ותפלה בעבור כלל ישראל, כשם שהיו עושים בזמן שביהמ\"ק היה קיים, שהעמידו מעמדות בעת הקרבת התמידין, וילפינן לה מדכתיב תשמרו להקריב לי במועדו. וא\"ש מה דנקט קרא צו לשון זירוז מיד ולדורות, כי בענין המעמדות הוצרך הכתוב לזרז בין בזמן שביהמ\"ק היה קיים, ואף לדורות שחרב ביהמ\"ק מוטל עלינו ענין המעמדות, כמבואר בתפל\"מ."},{"passage_id":"vayikru1_0e69431c_p24","passage_content":"וע\"ד זה תתבאר גם דרשת ר\"ש ביותר צריך הכתוב לזרז במקום שיש בו חסרון כיס. כי קביעת המעמדות יש בו חסרון כיס גדול עד מאד, שצריכין ישראל להחזיק אנשים מיוחדים פנויים מעסקי מו\"מ ועוסקים בתורה ובתפלה בכל עת, (עיי ב\"י או\"ח סי' תקל\"ט ובשו\"ע שם סעיף ה' ובטור יור\"ד סיי ש\"פ) ביטול מו\"מ אין לך חסרון כיס גדול מזה. ולכן כיון שציוה הכתוב על קביעת המעמדות כדילפינן מזאת תורת העולה, הוצרך לזרז עליו ביותר, משום שיש בו חסרון כיס גדול."},{"passage_id":"vayikru1_0e69431c_p25","passage_content":"היוצא מזה כי מוטל עלינו להתאמץ בתפלות ובתחנונים ולעסוק בתורה בכל יום ויום, כשם שהיו ישראל עושין בזמן שביהמ\"ק היה קיים, שתקנו מעמדות בעת הקרבת התמידין, וביותר צריך להתאמץ בכך בימי הפורים האלו שזמן קהלה לכל הם, וישראל מתכנסים לבקש רחמים מאת הבוי\"ת שיזכו להתגבר על שונאיהם העומדים עליהם לכלותם, כי בכל דור ודור עומדים ישראל בקשרי המלחמה עם זרע המן ועמלק, וכמ\"ש האלשיך כי אין עיקר המלחמה עם עמלק אלא עם השר שלו בשמי מעלה, וכאמרז\"ל (שהש\"ר פ\"ח ט\"ו) עה\"פ יפקוד ה' על צבא המרום במרום ואח\"כ ואת מלכי האדמה באדמה, ומלחמה זו עם שרו של עמלק הוא שטן הוא יצה\"ר היא מלחמה תמידית, כי יצרו של אדם אורב לו בכל תנועה ותנועה ובכל פסיעה ופסיעה, והבחירה חפשית ביד האדם לעשות רצון הבורא בכל תנועה ופסיעה ובכל מחשבה ודבור, וחלילה להיפך בידו לעשות בכל תנועה ומחשבה את אשר שנא ה'. ואם חפץ האדם לעשות רצון בוראו, מוטל עליו לדעת ולזכור בכל עת כי מלחמה תמידית לו עם יצרו, ועל כל צעד ושעל הוא מתנכל לו להחטיאו, וזוהי המלחמה הבלתי פוסקת שיש לכל בר ישראל עם הסט\"א וכוחותיו, כל חד וחד לפום דרגא דיליה. וזה אפ\"ל בדרשתם ז\"ל אין צו אלא לשון זירוז מיד ולדורות, כי בא הכתוב לזרז את ישראל שיהיו מוכנים בכל עת ללחום עם יצרם ע\"י תורתם ותפלתם, והוצרך הכתוב לזרז בזה מיד ולדורות, כי מלחמה לה' בעמלק מדור דור, וישראל עומדים תדיר בקשרי המלחמה, ועלייהו דידהו רמיא להתגבר על הס\"מ בזכות תורתם ותפלתם. ועל כן ימי הפורים הם ימי שמחה, כי ע\"י שמחה יתעלו ישראל, וחכו לעבוד את הבורא יתברך באמת, וע\"י כן יעלה בידם לנצח במלחמת היצר. והבוכ\"ע יעזור שנזכה לעשות רצונו, ולהתדבק בדרך האמת, ועל זה צריכים רחמי שמים בכל פרט ופרט, והבוכ\"ע יעזור שנזכה להכנעת כוחות הטומאה ולהתגברות כוחות הקדושה, יראו עינינו וישמח לבנו בהתגברות כח הקדושה וישועת ישראל, והתרוממות קרן התורה וישראל, ובהתגלות כבוד שמים עלינו במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru1_b4ad1853","title":"","summary":"","contents":[{"passage_id":"vayikru1_b4ad1853_p1","passage_content":"דרוש לשבת הגדול"}]},{"dvar_torah_id":"vayikru1_6c0002a1","title":"תורת העולה והחלפת הזמנים","summary":"בפרשת העולה נלמד על הקשר בין הקרבנות לישראל, ועל כך שהקב\"ה מחליף את סדרי הזמנים לגאולה. שבת הגדול מסמל את ההתעוררות לקדושה, ובו נתקבלה התורה. עיקרון זה מורה על כוחות התשובה והגאולה המהירים בזכות שמירת שבת.","contents":[{"passage_id":"vayikru1_6c0002a1_p1","passage_content":"ויאמר ה' אל משה לאמר צו את אהרן ואת בניו לאמר זאת תורת העולה הוא העולה על מוקדה על המזבח כל הלילה עד הבוקר וגו'. במדרש תנחומא (סי' א') איתא זאת תורת העולה זש\"ה כי מי בשחק יערוך לה' ידמה לה' בבני אלים (תהלים פ\"ט) וכו' זה בלעם הרשע שביקש להדמות להקב\"ה בבני אלים בבני אברהם יצחק ויעקב שהם אילי העולם איל הקב\"ה מה אתה מבקש להטעות עצמך שאקבל קרבן מן האומות אין אתה יכול שבועה היא וכו' שאיני מקבל קרבן אלא מישראל לכך נאמר צו את אהרן ואת בניו לאמר והאומות אומרים מה הוא כך שישראל מקריבין ומקטירין אמר להם הקב\"ה זאת תורת העולה ומי זאת עולה מן המדבר (שה\"ש ד') ומשה עלה אל האלקים (שמות י\"ט). והוא פלאי מה תשובה השיבם הקב\"ה לאומות העולם על שאלתם מה הוא כך שישראל מקריבין ומקטירין, באמור להם מקראות הללו זאת תורת העולה מי זאת עולה מן המדבר ומשה עלה אל האלקים, ומה חיבור ושייכות יש בין המקראות הללו."},{"passage_id":"vayikru1_6c0002a1_p2","passage_content":"ב) עוד איתא בתנחומא (סי' ב') ד'א צו את אהרן וכו' אמר הקב\"ה כל מי שהוא מעלה עצמו סופו לילך באש שנאמר הוא העולה על מוקדה וכו', ומונה והולך במדרש את האומות שנתגאו וסופן נשרפו באש, ואח\"כ דרש היא העולה על מוקדה זו מלכות אדום שעלתה עצמה שנאמר אם תגביה כנשר ואם בין כוכבים שים קנך וגו' (עובדיה א'), ונדונית באש שנאמר חזי הוית עד די קטילת חיותא והובד נשמה ויהיבת ליקידת אשא (דניאל ז') אמר הקב\"ה והיה בית יעקב לאש ובית יוסף להבה ובית עשיו לקש וסיומא דקרא ולא יהיה שריד לבית עשיו כי פי ה' דבר והיכן דבר ומה דבר ע\"י משה שנא' היא העולה על מוקדה ואח\"כ ועלו מושיעים בהר ציון לשפוט את הר עשיו, עכ\"ד התנחומא. וצ\"ב דכללא היא שהדרש צריך להיות מקושר עם פשטות הכתוב, והכא מה שייכא דרשה זו, שעתידה מלכות אדום להשרף באש, לפרשת קרבן עולה."},{"passage_id":"vayikru1_6c0002a1_p3","passage_content":"ג) אבא מארי זלה\"ה בקדושת יו\"ט מביא מדרש פליאה וזה תוארו, שאלו תלמידיו את רבי יוסי בן קיסמא אימת בן דוד בא אמר להם זאת תורת העולה, וצ\"ב."},{"passage_id":"vayikru1_6c0002a1_p4","passage_content":"ד) שבת שלפני הפסח קורין אותו שבת הגדול. ובשולחן ערוך הרב התניא יהיב בה טעמא, משום שנעשה בו נס גדול כדאיתא (בפסיקתא דר\"כ פיסקא ויהי בחצי הלילה ס\"ה) שפסח מצרים היה מקחו מבעשור וכו' ואותו היום שבת היה וכו' וכשלקחו ישראל פסחיהם באותו שבת נתקבצו בכורי מצרים אצל ישראל ושאלום למה הם עושים כך אמרו להם זבח פסח הוא לה' שיהרוג בכורי מצרים הלכו בכוריהם אצל אבותיהם ואצל פרעה לבקש מהם שישלחו את ישראל ולא רצו ועשו הבכורות עמהם מלחמה והרגו הרבה מהם וז\"ש (תהלים קל\"ו) למכה מצרים בבכוריהם וקבעו נס זה לזכרון לדורות וקראוהו שבת הגדול וכו', ע\"כ. והנה ידוע מה שהקשה מרן הבית יוסף (סימן תכ\"ט) מה טעם קבעו זכרון הנס ליום השבת, ולא ביום שאירע בו, הוא העשירי לחדש ניסן, בין שחל בחול בין שחל בשבת, וכבר נאמרו ונשנו בזה טעמים הרבה, ותלו זייניהו עליו כל שלטי הגבורים הלא בספרתם, ואף אנו אמרנו בזה כמה טעמים, ולדרכנו יתבאר טעם נוסף למה שנקבע זכרון הנס ליום השבת דוקא."},{"passage_id":"vayikru1_6c0002a1_p5","passage_content":"ה) בבני יששכר (מאמרי חדש ניסן מאמר ג') הביא מדרש פליאה (המוזכר בספר צפנת פענח) וזה לשונו, האדם שעשה עבירה וחזר בו ועשה תשובה הקב\"ה מוחל לו כל עוונותיו ולכך נקרא שבת הגדול, עכ\"ל. והוא פלאי."},{"passage_id":"vayikru1_6c0002a1_p6","passage_content":"ו) בפרשת בא החדש הזה לכם ראש חדשים ראשון הוא לכם לחדשי השגה. יל\"ד בכפל הלשון דכתיב החדש הזה לכם ראש חדשים, והדר כתיב ראשון הוא לכם. ורבים מן המפרשים ביארו פ' זו בדרכים שונים, וע' פנים לתורה, ואף אנן נימא בה מילתא."},{"passage_id":"vayikru1_6c0002a1_p7","passage_content":"ז) עוד יל\"ד דפתח הכתוב לומר לכם ראש חדשים, הקדים תיבת לכם לאומרו ראש חדשים, ואח\"כ שינה ואמר ראשון הוא לכם, וצ\"ב להבין טעם השינוי מרישא לסיפא."},{"passage_id":"vayikru1_6c0002a1_p8","passage_content":"ח) להלן בפרשת בא, ליל שימורים הוא לה', להוציאם מארץ מצרים הוא הלילה הזה לה' שימורים לכל בני ישראל לדורותם. ויל\"ד טובא בהך קרא שהוא כפל ענין לכאורה, דקאמר ליל שימורים הוא לה', וחזר ואמר הוא הלילה הזה לה' שימורים לכל בנ\"י וגו' ובתרגום יונתן פירש סיפא דהך קרא על הגאולה העתידה שתרגם וכן למיפרקהון מגלוותהון לדריהון."},{"passage_id":"vayikru1_6c0002a1_p9","passage_content":"ט) ויאמר משה כה אמר ה' כחצות הלילה אני יוצא בתוך מצרים. בגמרא (ברכות ד' ע\"א) איתא וכיון דמשה הוה ידע (פלגא דלילא אימת הוה) למה ליה למימר כחצות ומשני משה קסבר שמא יטעו איצטגניני פרעה ויאמרו משה בדאי הוא וכו' (לכן אמר כחצות דמשמע סמוך לו או לפניו או לאחריו). ולכאורה הך מילתא תמיהא טובא, דמה מקום היה לחששו של משה שיטעו האיצטגנינים ויאמרו עליו שהוא בדאי, והלא באותה שעה היו המצרים טרודים באבלם כי אין בית אשר אין בו מת, ולבם בל עמהם לכוון את השעה אם היתה המכה בחצות במכוון או לא כדי לערער על נבואתו של משה. ותו קשה שאם היה מקום לחשש זה שיחפשו האיצטגניגים עילה להטיל דופי בנבואתו של משה, אם כן מה תיקן חשש זה במה שאמר כחצות, הלא עדיין יש לחוש שיבואו עליו מצד אחר לפקפק באמיתות נבואתו, שהרי הוא אמר ומת כל בכור, ועיניהם לנוכח הביטו כי אין בית אשר אין שם מת, ואף אותם שלא נודע עליהם כי הם בכורים נפלו פגרים מתים, כמו שפי' רש\"י ז\"ל שהיו מצריות מזנות תחת בעליהן ויולדות מרווקים פנויים והיו להם בכורות הרבה וכו' כל אחד בכור לאביו. ע\"כ. ולא ראינו שנזהר משה בדבריו, שלא יאמרו עליו בדאי הוא, מחמת שמתו אף אותם שלא היה ידוע שהם בכורים, ומדוע איפה עשה תיקון רק לחשש הנזכר, שלא יאמרו עליו בדאי הוא מחמת שלא ידעו לכוון זמן חצות, וזהו חשש רחוק כדאמרן, דלא מסתברא שיעלה כזאת על דעתם בשעת צרתם."},{"passage_id":"vayikru1_6c0002a1_p10","passage_content":"וכל אלו באחת יבוארו על פי מה שכתב בספר נזר הקדש פרשת ויחי (פצ\"ח ג') לבאר הא דאמר הכתוב בפרשת בא ויהי מקץ שלשים וארבע מאות שנה ויהי בעצם היום הזה יצאו כל צבאות ה' ממצרים, והתמיהה מפורסמת שהרי לא היו בארץ מצרים אלא רד\"ו שנה וכו' ובפרקי דר' אליעזר וכן במדרש חזית (שהש\"ר פ\"ב י\"ט) אמרו דבאמת יצאו קודם זמנם, אלא שדילג הקב\"ה על הקץ בזכות אבות וכו'. וקשה איך אמר ויהי מקץ ת\"ל שנה וגו' ויהי בעצם היום הזה וגו', שהרי באמת עדיין לא נשלם חשבון ת\"ל שנה. וגם קשה הא דכתיב בענין הגאולה (ישעי' ס') אני ה' בעתה אחישנה ואמרינן בחלק (צ\"ח ע\"א) זכו אחישנה לא זכו בעתה, וקשה וכו' דא\"כ הול\"ל בעתה או אחישנה, דכל חד קאי על זמן אחר אם יזכו יחיש הקב\"ה את הקץ, ואם לא תהי' הגאולה בעתה הקבוע, אבל כי כתיב בעתה אחישנה משמע דחדא מילתא הוא, שאף בעתה אחישנה, ובאמת זה קשה להולמו כי הם כשני הפכים בנושא אחד, ותירץ הנזה\"ק דכולהו בחדא מחתא מחתינהו, עפי\"מ שכתבו חכמי האמת שכל עת וזמן יש לו מזל ושר מיוחד הממונה עליו למעלה בעולם הגלגלים, וכן יש גבוה מעל גבוה בעולם העליון עולמו של הקב\"ה, שעל כל עת וזמן ממונה עליו מדה מיוחדת המאירה בו, וכל המדות של סדר הזמנים הם משתלשלים מצירופי אותיות התורה וכו', והם באים כסדרם זא\"ז וכו', ולכן בכל עת וזמן יש הנהגה אחרת בעולם כפי בחינת המדה המאירה בשעתו, ולעולם זמן הקץ אינו אלא בעת רצון המיוחד לו כדכתיב (ירמיה מ\"ח) כה אמר ה' בעת רצון עניתיך וביום ישועה עזרתיך, וכיו\"ב מצינו בגאולת מצרים דכתיב ליל שימורים הוא לה' ואמרינן (ר\"ה י\"א ע\"ב) שהוא משומר ובא מששת ימי בראשית, כי נקבע מתחלה הקץ בעת רצון המיוחד לו. ובכן יפלא לכאורה איך יתכן שהקב\"ה מדלג על הקץ, הרי אין הגאולה אלא בעת רצון המיוחד לעת קץ, ויתיישב עפ\"י צחות לשון חכמינו הקדמונים בתפלת ערבית ובתבונה משנה עתים ומחליף את הזמנים ומסדר את הכוכבים וכו', דלכאורה יפלא הרי הזמן אין בו ממש, ואיך יתכן לומר שהוא מחליף את הזמנים, וחילוף זה מה טיבו, אלא הענין כי זה נאמר על המידות העליונות הממונים על הזמנים, כל אחד בזמנו המיוחד לו, וע\"ז אמר כי לפעמים בהיות צורך השעה בעולם לעורר מידה טובה ישועה ורחמים בעת וזמן שאינו מוכן לו, אזי בתבונה משנה עתים ומחליף את הזמנים, כלומר שהוא מחליף את המהות של סדר הזמנים, שהמדה הטובה הראויה לשמש בזמן מאוחר לפי סדר צירוף אותיות, הוא מחליפה ומשנה סדרה להעמידה בזמן מוקדם, וכן בענין זה משתנה גם סדר הזמנים למטה בעולם הגלגלים במערכת הכוכבים והמזלות, וע\"כ אמר ומסדר את הכוכבים במשמרותיהם ברקיע כרצונו, כלומר שמשנה סדר הנהגת כוכבים ומזלות, כדי להקדים עת רצון בעולם לצורך שעה כחפצו ורצונו. וממילא היינו דדרשינן מדלג על ההרים שהוא מדלג על הקץ, כלומר שהוא מדלג המדות של סדר הזמנים, לקבוע מדת עת רצון המאוחר, להקדים זמנו להביא ישועה וגאולה שלא בעונתה. וא\"כ היינו דכתיב בגאולת מצרים ויהי מקץ ת\"ל שנה ויהי בעצם היום הזה, כלומר אע\"פ שאז לא היה אלא זמן של רד\"ו שנה לגלות מצרים, מ\"מ זמן הקץ של ת\"ל שנה, דהיינו מדרגת ומדת העת רצון המיוחד לו, כבר היה בעצם היום הזה של רד\"ו שנה, כי נשתנה מדת סדר הזמנים להקדים המאוחר וכו'. וכיוצא בזה אמר בענין הגאולה העתידה אני ה' בעתה אחישנה, כלומר בעתה של הקץ האחרון, הוא המדה של עת רצון המיוחד לו בה, ג\"כ אחישנה לגאולה קודם זמנה, כי אדלג על הקץ להקדים מדת עת רצון המיוחד לה, לסדרה שלא במקומה קודם זמנה, כדי למהר ולהחיש הישועה, עכת\"ד ז\"ל, עיי\"ש באריכות דבריו שיישב בהקדמה זו כמה ענינים תמוהים בדברי חז\"ל."},{"passage_id":"vayikru1_6c0002a1_p11","passage_content":"היוצא מדבריו כי בגאולת מצרים החליף הקב\"ה את מדת סדר הזמנים, והעתיק את עת רצון המיועד לגאולה, שהיה ראוי להיות בגמר ת\"ל שנה, והקדים להביאו באותו זמן שעלה ברצונו לגאול את ישראל, בתום מאתים ועשר שנה לגלות מצרים. ברם אכתי פש גבן לבירורי אימתי נעשה חילוף סדר הזמנים הלזה, ומסתברא למימר שהחלפה זו נהייתה בשבת שלפני ט\"ו בניסן, שהרי מבואר בזה\"ק (יתרו פ\"ח ע\"א) כל ברכאן דלעילא ותתא ביומא שביעאה תליין, א\"כ נמצא שכאשר יש צורך להשפיע טובה וישועה במשך ימות השבוע, מתחיל שפע זה מיום השבת הקודם, שהרי ביום השבת קדש נמשכות ההשפעות של כל ימות השבוע. ובזה יש לתת טעם שקורין לשבת שלפני פסח שבת הגדול, דמכיון שבשבת זו נשתנו סדרי הזמנים, ונקבע הזמן הראוי לגאולה לליל חמשה עשר בניסן שבאותו הזמן, הוי כאילו כבר היתה הגאולה בפועל באותו שבת, וכמו שכתב המהר\"ל ז\"ל כי מעת קביעת זמן הגאולה הוי כאילו כבר היתה הגאולה בפועל. ובר מן דין הרי כבר נראו נצני הגאולה בשבת קדש זה, שלקחו בנ\"י את אלהיהם של מצרים לנגד עיניהם לשחטם במצות הבורא עליהם, והמה חרקו בשיניהם ולא יכלו לפצות פה נגדם, ונס גדול ונגלה כגון דא לא יתכן שיהיה אלא כשכבר התחילה התעוררות הגאולה, וא\"כ מסתברא לומר שכבר היתה התחלפות הזמנים והקדמת העת רצון והמזל הראוי לגאולה בשב\"ק זה. והיינו טעמא שנקרא שמו שבת הגדול, כי בו היתה השתנות הזמנים שדילג הקב\"ה על הקץ, והקדים להביא שעת רחמים ועת רצון המיועד לגאולה. והנה יחד עם חילוף המדות של סדר הזמנים בגבהי מרומים, נתחלפו גם סדרי הזמנים למטה בעולם הגלגלים, במערכת הכוכבים והמזלות, כמבואר בנזר הקדש בביאור נוסח התפלה ומחליף את הזמנים ומסדר את הכוכבים וכו'. ולפי זה היתה השתנות זמני הזריחה והשקיעה ביום השבת מיום ו' שלפניו, שהרי זמני הזריחה והשקיעה של יום השבת נקבעו עפ\"י מדת ימי הגאולה, שהיו מיועדים להיות ביותר משני מאות שנה לאחר מכן, ולא יתכן שיהיו זמני הזריחה והשקיעה באותו עשירי בניסן העתיד להיות לאחר מאתים שנה, שוים לזמני הזריחה והשקיעה של אותה שנה שעמדו בה, שהרי ישראל מונים חדשים ושנים לימות הלבנה, שהם פחותים י\"א יום מימות החמה, ועל כן מעברים שנים כדי להשוות חשבון הלבנה לשנות החמה, כמו שדרשו ז\"ל (סנהדרין י\"ג ע\"ב) מדכתיב שמור את חדש האביב, ואפילו הכי לא תמצא לעולם שיהיו שוים במכוון שנות הלבנה לשנות החמה, וא\"כ לא יתכן שיהיה זמן הזריחה והשקיעה בניסן זה שוה לזמן הזריחה והשקיעה שעתיד להיות בחדש ניסן במאתים שנה לאחריו, ובעל כרחך ששינה הקב\"ה והחליף גם את סדר המזלות והכוכבים במשמרותיהם ברקיע, על פי מדות הזמנים שנקבעו באותו שבת, וכן נתחלפו זמני הזריחה והשקיעה לפיהם."},{"passage_id":"vayikru1_6c0002a1_p12","passage_content":"ועפי\"ז יתבאר ע\"נ טעם שחשש משה לומר בחצות משום שמא יטעו איצטגניני פרעה ויאמרו משה בדאי הוא. כי הנה מאז העשירי בניסן נשתנו סדרי הזמנים וזמני הזריחה והשקיעה כדאמרן, וממילא נשתנה גם זמן חצות הלילה, והמכה באה עליהם בחצות הלילה עפ\"י החשבון שנתחדש עתה ע\"י חילוף הזמנים, אמנם איצטגניני פרעה לא ידעו מכל אשר נעשה, שנתחלפו הזמנים, אלא הם הלכו עפ\"י החשבון של זמן הזריחה והשקיעה של אותו חדש ניסן שעמדו בו, ועפ\"י חשבונם המוטעה היה שוה זמן חצות ליל ט\"ו לחצות לילה שלפני י' ניסן, וע\"כ חשש משה כי כאשר יראו איצטגניני פרעה שלא באה המכה בחצות על פי חשבונם, יאמרו משה בדאי הוא שהרי הפרש גדול יש בין זמן חצות הלילה שהם מחשבים, לבין זמן חצות האמיתי שנשתנה ע\"י חילוף הזמנים. וא\"ש דלא היה מקום לחשוש שיבואו איצטגניני פרעה להעליל על משה עלילות ברשע, כי לא היה זמן חצות מכוון, שהרי הם היו טרודים בצרתם, ולא היו פנוים לכוון הזמן כדי לבקש עילה למצוא עלילה, כי משה בדאי הוא, אלא שחשש משרע\"ה כי הם לפי תומם יראו כי לא באה המכה בחצות, אלא זמן רב לפניו או לאחריו, על כן יטענו כי משה בדאי הוא, מדהתחילה המכה זמן רב לאחר חצות או זמן רב לפניו. ואילו היו טוענים כן היה משרע\"ה אנוס לגלות להם סוד חילוף הזמנים, וזהו ענין שלא ניתן לגלות לאוה\"ע, ולא זו בלבד אלא אפילו סוד העיבור אסור לגלות להם, כדאמרינן בכתובות (דף קי\"א ע\"א) שלא יגלו את הסוד (ועיין שם בתוספות ד\"ה שלא יגלו ועי' להלן פרשת תזריע בדרוש לפרשת החדש שהארכנו בזה), ולפיכך אמר משה כחצות, שמשמעה סמוך לו או לפניו או לאחריו, ואז לא יהיה להם פתחון פה לומר עליו בדאי הוא, אף שאין זמן המכה בחצות במכוון עפ\"י חשבונם."},{"passage_id":"vayikru1_6c0002a1_p13","passage_content":"ובזה יש לבאר כוונת הכתוב ליל שימורים הוא לה' וגו' הוא הלילה הזה לה' שימורים לכל בני ישראל לדורותם (קושיא ח'), דהכי פירושו ליל שימורים הוא לה', שהוא משומר ועומד לגאולה, כמו שפירש בנזה\"ק שאותו עת רצון המיוחד לגאולה הרי הוא משומר וקבוע במרומים, ולכאורה קשה שהרי נגזר עליהם להיות ת\"ל שנה בגלות מצרים, וא\"כ עדיין לא נשלם הזמן, לזאת אמר הוא הלילה הזה לה', פירוש שנגאלו בליל זה עצמו שהיה משומר ועומד לגאולה, אלא שהחליפו הקב\"ה והקדים להביאו כדי להחיש גאולת ישראל. ומסיים קרא שימורים לכל בני ישראל לדורותם, ותרגם יונתן וכן למפרקהון מגלוותהון לדריהון, פירוש דאף בזמן הגאולה העתידה אם יזכו בני ישראל להיות נגאלים לפני הזמן שנקבע לגאולת ימהר ויחיש הקב\"ה גאולתם ופדות נפשם, ע\"י שיקדים להביא את הזמן המוכן לגאולה."},{"passage_id":"vayikru1_6c0002a1_p14","passage_content":"ובדרך זה יבואר גם כפל דברי הכתוב בפ' החדש, ומה ששינה לשונו מרישא לסיפא דפתח לומר החדש הזה לכם ראש חדשים ואח\"כ אמר ראשון הוא לכם. ולכאורה הול\"ל גם בסיפא לכם הוא ראשון, כמו שהקדים ברישא תיבת לכם לראש חדשים (קושיא ו'). ונראה דהנה מבואר במדרשי חז\"ל כי הקב\"ה מסר את קידוש החדשים ועיבור השנים וקביעת זמני המועדות לידי ישראל, והכי איתא במד\"ר פרשת בא (פט\"ו כ\"ג) לא נתתי ראשי חדשים אלא לכם שנאמר החדש הזה לכם, עוד איתא התם (שם פט\"ו כ') כשהיו רבותינו נכנסים לעבר את השנה נכנסים י' זקנים וכו' מה שהן גוזרין הקב\"ה מסכים עמהם, שנאמר (תהלים נ\"ז) אקרא לאלקים עליון לא\"ל גומר עלי, ע\"כ. וידוע מה שכתב הרמב\"ם ז\"ל בסה\"מ שלו (מ\"ע קנ\"ג) דקידוש החדש צריך להיות בארץ ישראל ואילו הנחנו על דרך משל שבני ישראל יעדרו מארץ ישראל בזמן מן הזמנים הוי זה מחיית אותות האומה ובטל חלילה ע\"י זה קידוש חדשים ועיבור שנים וסדרי מועדות, ע\"כ. ולפי זה יש לשאול שהרי אותו זמן שהיה מוכן ועומד לגאולה לאחר כלות ארבע מאות ושלשים שנה לשבת בני ישראל בארץ מצרים, עדיין לא נקרא שם חדש ניסן עליו, שהרי עדיין לא נתקדש אותו חדש ניסן העתיד להיות אחרי שני מאות שנה ע\"י בני ישראל, וצריך לומר דאף דהקב\"ה מסר לישראל קידוש חדשים ועיבור שנים, מ\"מ אותו זמן המיועד לגאולה לא מסר בידם, שהרי רק לפניו יתברך היה גלוי וידוע אימת יהיה אותו זמן, על כן קידוש חדש ניסן זה שבו תהיה הגאולה מסור בידי הקב\"ה בלבד. וזהו שאמר הכתוב החדש הזה לכם ראש חדשים, הקדים תיבת לכם, להורות כי קידוש אותו חדש ניסן שבו עמדו מסור ביד ישראל, וכאשר יעשו הם יסכימו עמהם בשמים, אמנם לא כל אותו חדש מסור ביד ישראל, שהרי בחדש ניסן זה יהיו עתים שיתחלפו, ויקבע במקומם זמן חדש ניסן העתיד להיות מאתים שנה אח\"כ, ואותו זמן אינו מסור בידי ישראל, אלא משמים קדשוהו, על כן חזר הכתוב לומר ראשון הוא, כלומר אותו זמן שיחול בו חילוף, הוא מקודש מעצמו, שכבר קדשוהו שמים ואח\"כ ימסר לכם, והבן."},{"passage_id":"vayikru1_6c0002a1_p15","passage_content":"ונראה לומר טעם על שנקרא שבת זה בשם שבת הגדול, וגם יתבאר מה שקבעו זכרון הנס לשבת דוקא, ולא ליום שאירע בו הנס, הוא העשירי לחדש ניסן. ויתבאר עפ\"י מה שכתב ק\"ז זלה\"ה בישמח משה פרשת תזריע בשם הבית שמואל אחרון לבאר אמרם ז\"ל (ערכין ט\"ז ע\"ב) הוא הבדיל בין איש לאשתו לפיכך אמרה תורה בדד ישב, ופירש עפ\"י מ\"ש המדרש שמואל במאה\"כ והנה נרפא נגע הצרעת מן הצרוע, ותו\"ד דכתבו חכמי הרופאים שהצרעת בא מתגבורת מרה שחורה, ומרה שחורה בא מהתבודדות, והרפואה של תגבורת מרה שחורה שילך בין בני אדם, וא\"כ מצורע היה ראוי לו שישב בין בני אדם, והתורה אמרה בדד ישב, אך נגעים באים על לה\"ר, ורפואתו יפשפש במעשיו, וע\"י זה יתרפא מצרעתו, וז\"ש והנה נרפא נגע הצרעת מן הצרוע, פירוש מפעולתו של הצרוע, שהוא עצמו עשה מעשה שפשפש במעשיו ושב ורפא לו, עכ\"ד המדרש שמואל. והנה הרמב\"ם ז\"ל כתב (בפירושו לאבות פ\"ה משנה ו') במה שדרשו ז\"ל (שמו\"ר פכ\"א ו') א\"ל הקב\"ה וכו' אני הוא שהתניתי עמו כך התניתי עמו תחלה שאני קורעו שנאמר וישב הים לפנות בקר לאיתנו לתנאי שהתניתי עמו בתחלה וכו', ע\"כ. וביאר הכונה כי הקב\"ה לא רצה שיהיה שינוי טבע אחרי בריאת העולם, ולכן התנה עם הים בשעת הבריאה שיקרע בפני ישראל, ולא הוי שינוי טבע. ובזה יש לתת טעם להא דאיתא (פסחים נ\"ד ע\"א) שבעה דברים קדמו לעולם וחדא מינייהו היא התורה, דתורה אמרה דברים שהם שלא כדרך הטבע, כגון במצורע בדד ישב, שהוא למעלה מן הטבע, והשי\"ת לא רצה שיהיה שינוי טבע אחר הבריאה, לפיכך תורה קדמה לעולם, וע\"כ היה דרך טבע בבריאה כך."},{"passage_id":"vayikru1_6c0002a1_p16","passage_content":"וז\"פ הגמרא מפני מה אמרה תורה במצורע בדד ישב אינו שואל טעם הדבר, אלא הקשה קושיא מפני מה אמרה תורה במצורע שרפואתו לשבת בבדידות, והוא נגד הטבע, דדרך הטבע שישב המצורע בין אנשים, ואין השי\"ת חפץ בשינוי טבע, לז\"א הוא הבדיל וכו' ותשובתו הוא שישב בדד, ואף שהוא נגד הטבע, לכך אמר \"לפיכך אמרה תורה\", וכיון שנכתב בתורה, ותורה קדמה לבריאה, לפיכך דרך הטבע הוא כך. ועפ\"י דרך זה יש להתבונן, שהרי הכא היה הזמן הקבוע לגאולה, אחרי תום ארבע מאות ושלשים שנה לגלות ישראל במצרים, אלא שדילג הקב\"ה על הקץ, והחליף סדרי הזמנים, וגם נשתנה מהלך צבא השמים השמש והירח והכוכבים, עפ\"י הזמן שנתחלף והוקדם כמבואר, ולכאורה זהו שינוי חוקי הטבע ושידוד המערכה, ותגדל התמיהה שהרי אין הקב\"ה משנה סדרי הטבע שקבע לעולם בשעת הבריאה, וכמו שנתבאר מדברי הרמב\"ם ז\"ל, וכיצד נשתנו סדרי הזמנים בגאולת מצרים. ונראה לומר ביאור ענין זה, עפ\"י מה שכתב האור החיים הק' בפ' בראשית, במאה\"כ ויכל אלקים ביום השביעי, ותוכן דבריו כי בשעת הבריאה לא ברא ה' כח בעולם זולת לעמוד בששת ימים, וזולת זה היום היה העולם חרב בגמר ששת ימים וחוזר לתוהו ובוהו, ובאמצעות שבת העולם עומד. ופירש בזה אמרם ז\"ל כל המקדש את השבת ואומר ויכולו כאילו נעשה שותף להקב\"ה במעשה בראשית, ולכאורה מי שמע כזאת שיבא אדם וישתתף בדבר שכבר נגמרה מלאכתו וכו', ולמה שפירשתי אמת יהגה חכם וכו', כי להיות שהשבת היא המקיים העולם ששת ימים, ואחר עבור ששת ימים יבא שבת אחר ויחייהו ויקיימהו עוד ששת ימים אחרים, ולך לדעת כי מציאות השבת הוא קיומו המקיים אותו וכו', ולזה כל המקדש את השבת, פירוש מקיים ושומר קדושתו, באמצעות זה ישנו לשבת, ובאמצעותו מתקיים העולם. הראית לדעת כי הוא המקיים העולם, ואין לך שותף גדול מזה כדין וכהלכה וכו'. עכת\"ד האה\"ח הקדוש ז\"ל. ועפ\"י זה יש מקום להניח, כי מכיון שבכל שבת ושבת ישנה התחדשות הבריאה לימים עוד ששה, א\"כ יתכן שבאותו שבת שלפני ליל ט\"ו בניסן שבו יצאו ישראל ממצרים, התנה הקב\"ה עם מערכת השמים וכסיליהם שבאותה שבוע יתחלפו הזמנים, ויקדים לבא סדר הזמן של חמשה עשר בניסן העתיד להיות בעוד מאתיים שנה לאחר מכן, שהוא המוכן להיות בו הגאולה. והשתא שוב לא הויא החלפת הזמנים שינוי בחוקי הטבע ושידוד המערכה, שהרי כיון שהותנה כן בשבת, הוי זה כאילו היה התנאי מאז תחלת הבריאה, כיון שבכל שבת העולם עומד להיות חרב ושומם, לולא זכות שמירת שבת המקיימת ומחדשת בריאתו. ואף בעת שהיו בני ישראל משועבדים במצרים היו שומרים שבת, וכמו שכתב באה\"ח הקדוש שם וז\"ל, ולך לדעת כי מיום ברוא אלקים אדם לא חסר העולם שומר שבת, וכו' ואפילו במצרים היו שומרי שבתות. ע\"כ. וכדאיתא במדרש (שמות רבה פ\"א ל\"ב) וירא בסבלותם ראה שאין להם מנוחה הלך ואמר לפרעה מי שיש לו עבד אם אינו נח יום אחד בשבוע הוא מת ואלו עבדיך אם אין אתה מניח להם וכו' הלך משה ותיקן להם את יום השבת לנוח, ע\"כ. וכיון שכן הרי בזכות ששמרו ישראל את השבת נתקיימה הבריאה, ולא הוי החלפת הזמנים כשדוד המערכות. והיינו טעמא שנקבע זכרון הנס ליום השבת דווקא, משום שבשבת נעשתה החלפת הזמן, לצד שבו מתחדשת הבריאה, ולא הוי כשינוי הטבע, ומשם כך נקרא שמו שבת הגדול, כי באותו שבת התנה הקב\"ה שיתחלפו הזמנים ויקדים לבא זמן הגאולה."},{"passage_id":"vayikru1_6c0002a1_p17","passage_content":"ועוד יש לתת טעם עפ\"י דרך זו על שנקרא שבת זה בשם שבת הגדול, עפ\"י מה דאיתא בזה\"ק (אמור דף צ\"ה ע\"א) החילוק שבין שבת לימים טובים, דקדושת המועדות תלויה בהתעוררות תחתון של בני ישראל, ועל כן כתיב בהו מקרא קדש, משא\"כ השבת קדושתו קביעא וקיימא, ומן השמים מקדשים אותו, ואינו תלוי באיתערותא דלתתא, על כן השבת קרוי קדש, ולא מקרא קדש. ובספה\"ק סדורו של שבת האריך בזה, שהמועדים תלויים במעשי בני ישראל, דקידוש החדשים ועיבור השנים מסור בידיהם, משא\"כ הארת השבת נשפעת מן השמים, ולפיכך נוסח התפלה ביו\"ט מקדש ישראל והזמנים, ובשבת הנוסחה היא מקדש השבת, ולא מזכירין את ישראל."},{"passage_id":"vayikru1_6c0002a1_p18","passage_content":"והנה נחזי אנן, התינח המועדות שישראל מקדשין מסורים בידם, והתעוררות הקדושה בהם באה באמצעות מעשיהם, אבל לא יתכן לומר כן על אותו חמשה עשר בניםן שבו יצאו ישראל ממצרים, שהרי אותו מועד לא נתקדש עדיין ע\"י בני ישראל, כדאמרן שהקב\"ה החליף את סדר הזמנים והקדים להביא את הזמן שהיה עתיד להיות מאתיים שנה לאחר מכן, ולא שייך לומר שקדושת אותו מועד נשפעה ע\"י מעשי בני ישראל. וע\"כ לומר שהארת והשפעת אותו יום טוב באה מן השמים, בלא איתערותא דלתתא כלל, והיתה קדושתו דוגמת קדושת השבת, שאינו תלוי בפעולות בני ישראל, כי אם מן השמים מקדשים אותו. ובזה מצאנו טוב טעם על שקורין שבת זה בשם שבת הגדול, כי לפי שהחלפת הזמנים והקדמת זמן הגאולה נעשו בשבת זו, מטעמא דאמרן לעיל, א\"כ נמצא שבשבת זו ירדה הארת והשפעת הקדושה גם לאותו ליל ט\"ו בניסן, יחד עם השפעת קדושת השבת הנשפעת מלעילא, ועל כן נקרא שבת הגדול, כי היתה בו התעוררות קדושה גדולה במדה גדושה, חדא קדושת יום השבת, ועוד זאת אחרת התעוררות הקדושה לליל ט\"ו בניסן, שלא באה השפעת קדושתו ע\"י מעשי בני ישראל."},{"passage_id":"vayikru1_6c0002a1_p19","passage_content":"ועל פי מה שנתבאר לעיל בדברינו, כי לפי שבשבת מתחזקת ומתקיימת הבריאה, על כן שייך בו ענין החלפת העתים, הנה מקום אתי לבאר המדרש פליאה (קושיא ה') אדם שעבר עבירה וחזר בו ועשה תשובה הקב\"ה מוחל לו על כל עוונותיו לכך נקרא שבת הגדול, דהנה איתא בגמרא (שבת דף קי\"ח ע\"ב) אמר רבי חייא בר אבא אר\"י כל המשמר שבת כהלכתו אפילו עובד ע\"ז כדור אנוש מוחלין לו וכו'. והקשה הט\"ז בריש הלכות שבת במאי מיירי, אי בעשה תשובה א\"כ תשובה מהניא, ומה צורך לצרף זכות שמירת שבת לכפרה, ואי בלא עשה תשובה, ודאי שאין שמירת שבת מועילה להציל מכל חטאיו, ותירץ דלעולם בעשה תשובה, אלא דבתשובה בלחוד לא סגי לכפר על ל\"ת ועל כריתות ומיתות בית דין, כדאמרינן ביומא (דף פ\"ו ע\"א) ארבעה חילוקי כפרה שהיה ר' ישמעאל דורש וכו' עבר על ל\"ת ועשה תשובה תשובה תולה ויוהכ\"פ מכפר, לזאת אמר דהמשמר שבת כהלכתו, מהניא ליה זכות שמירת שבת, שתתקבל תשובתו מיד אפילו בעוע\"ז, ולא דיינינן ליה בארבעה חילוקי כפרה. עכ\"ד ז\"ל."},{"passage_id":"vayikru1_6c0002a1_p20","passage_content":"ונראה לי לבאר טעם הדבר, שזכות שמירת שבת מועילה שתתקבל התשובה לאלתר, עפ\"י מה שכתב אבא מארי זלה\"ה בקדושת יו\"ט פ' משפטים, לתת טעם לשבח להא דאיתא ביומא ד' חילוקי כפרה וכו' עבר על עשה ושב אינו זז משם עד שמוחלין לו עבר על ל\"ת ושב תשובה תולה ויוהכ\"פ מכפר וכו'. וביאר דאיתא בספה\"ק דמצוות עשה שרשם משם הוי\"ה ב\"ה, ואצל שם הוי\"ה אין שייך לומר זמן קבוע עד שיהיה יוהכ\"פ, כי שם הוי\"ה מורה על היותו יתברך בלתי בעל תכלית, אין סוף למעלה מהטבע והזמן, אבל מצוות ל\"ת שרשם משם אלקים המורה על הנהגה טבעית וזמנית, כמבואר בספרים (שלה\"ק מאמר תושב\"כ פ' בראשית) אלקים בגמטריא הטבע, ואף כי הכל הוא בהשגחה פרטית, עכ\"ז מורה על הנהגה טבעית ונחקק בזמן, לזה תשובה תולה, דלאו כל יומא זמניה, ויוהכ\"פ מכפר. עכת\"ד הק'."},{"passage_id":"vayikru1_6c0002a1_p21","passage_content":"מבואר מזה כי הך מילתא שתהא תשובה בלבד מכפרת, תליא במדת ההנהגה, אם הוא תחת הנהגה טבעית זמנית הבאה משם אלקים, או הנהגתו משם הוי\"ה שהוא למעלה מן הטבע והזמן, והנה נתבאר לעיל בדברינו, כי ביום השבת קדש שייכא החלפת הזמנים משום שבו מתחדשת ומתחזקת הבריאה לעוד ששה ימים. ואפשר דהיינו טעמא שהמשמר שבת כהלכתו מתקבלת תשובתו מיד לאלתר אפילו בעבר על ל\"ת, שהרי כל הטעם שאין התשובה מתקבלת מיד בעבר על ל\"ת, הוא משום שהם באים מכח שם אלקים, על כן הם תלויים בזמן, ולפיכך התשובה תולה עד בוא הזמן המסוגל וקבוע לכפרה, אמנם המשמר שבת כהלכתו שהוא המקיים את העולם, שייך בו ענין חילוף הזמנים, ולא הוי כשידוד המערכה, דהוי כאילו אתנו מעיקרא, ומשוה הכי מחליפין לו את זמן הכפרה שעתיד להיות לאחר זמן, ומקדימין אותו כדי שתתקבל תשובתו מיד."},{"passage_id":"vayikru1_6c0002a1_p22","passage_content":"ובזה מבוארים היטב דברי המדרש אדם שעבר עבירה וחזר בו ועשה תשובה הקב\"ה מוחל לו על כל עוונותיו וכו', דלכאורה תקשי איך נמחלין לו כל עוונותיו ע\"י שחזר בו ועשה תשובה, והלא תשובה בלחודה לא מהניא אלא בעשין, לזאת בא כמיישב לכך נקרא שבת הגדול וכמו שנתבאר שטעמו הוא משום שהקב\"ה התנה להחליף את סדר הזמנים בשבת זו, ולא הוי שינוי הטבע, משום שכך היא סגולת השבת, שבו מתקיימת ומתחזקת הבריאה. וזהו שאמר דבתשובה בלבד מוחלין לו על כל עוונותיו, היינו אם הוא משמר שבת כהלכתה, דבזכות השבת מקדימין לו את הזמן המסוגל לכפרה, ותשובתו מתקבלת מיד."},{"passage_id":"vayikru1_6c0002a1_p23","passage_content":"ומלבד הטעמים הנאמרים, עוד הנה מקום אתי לתת טעם לשבח על שנקרא שבת זה בשם שבת הגדול, עפ\"י מה שביארנו הא דאיתא במכילתא בפרשת החדש במאה\"כ ויאמר ה' אל משה ואל אהרן בארץ מצרים לאמר, צא ואמור להם מיד דברי ר' ישמעאל וכו', מבואר מזה דפרשה זו נאמרה להם מיד בראש חדש, וכן איתא להלן שם במכילתא דברו אל כל עדת בני ישראל הדיבור היה בראש חדש ולקיחה בעשור לחדש וכו'. ויש לתמוה דכיון דלא פרשו מע\"ז עד העשירי בניסן, כדאיתא התם במכילתא מפני מה הקדים לקיחתו של פסח לשחיטתו ארבעה ימים לפי שהיו ישראל שטופים בגילולים במצרים וכו' אמר להם משכו ידיכם מגילולים וקחו לכם מצוות, א\"כ כיצד הקדים לומר להם כל דיני הפסח מראש חדש, בעוד שלא היו פרושים מעבודה זרה, וכי מה ערך יש ללימוד התורה, בטרם טהרו לגמרי מכל שמץ ע\"ז. ותו דהך מילתא גופא תמיהא טובא שנצטוו לפרוש מגילולים בעשור לחדש, ומדוע לא נצטוו לפרוש מע\"ז מיד בר\"ח בעת שנאמרה להם הפרשה, והרי כל יומא שהיו עדיין שטופים בגילולי מצרים הויא פסידא דלא הדר."},{"passage_id":"vayikru1_6c0002a1_p24","passage_content":"ונראה לומר כי בראש חדש ניסן לא נאמרה להם פרשת החדש אלא כפשוטה, ולא הודיעם אז פרטי המצוה והדרשות הנלמדות מפרשה זו, והשתא לא קשה על שהקדים לאמר להם פרשה זו בעוד שלא טהרו לגמרי מע\"ז, דתורה שבכתב רשאים ללמוד אף עוע\"ז, וכמו שביאר היפה תואר בפרשת משפטים בהא דאיתא במד\"ר שם (פ\"ל ט') שא\"ל עקילס לאדריינוס דודו שהוא רוצה להתגייר כדי ללמוד תורה א\"ל לך ולמוד תורתן ואל תמול א\"ל עקילס אפילו חכם שבמלכותך וכו' אינו יכול ללמוד תורתן אם אינו מל וכו' ע\"כ. והקשה היפ\"ת שהרי מצינו עכו\"ם שלמדו תורה, כדאיתא בפרק שור שנגח (דף ל\"ח ע\"א) ר' מאיר אומר וכו' שאפילו נכרי ועוסק בתורה הרי הוא ככהן גדול, ותירץ לחלק בין תורה שבכתב לתורה שבע\"פ, דתורה שבעל פה לא ניתנה כי אם לישראל, ואין רשות ללמדה לעכו\"ם וכו'. עכ\"ד עיי\"ש באורך. והשתא א\"ש דנאמרה להם הפרשה כפשוטה בראש חדש, משום שכבר חל חיוב לימוד דיני הפסח, דשואלין ודורשין בהלכות הפסח שלשים יום קודם לפסח, אמנם דרשות חז\"ל הנלמדות מפרשה זו, לא ציווה אותם עד העשירי בניסן, שבו משכו ידיהם מעבודה זרה."},{"passage_id":"vayikru1_6c0002a1_p25","passage_content":"וטעמא דמילתא שלא נצטוו לקיים משכו ידיכם מע\"ז אלא בעשירי לחדש, ולא קודם לכן, היינו משום שעד אותו זמן לא יכלו לפרוש מע\"ז לגמרי, כדאיתא במכילתא שם ולא שמעו אל משה מקוצר רוח (שמות ו') וכי יש לך אדם שהוא מתבשר בשורה טובה ואינו שמח וכו' א\"כ למה נאמר ולא שמעו אל משה אלא שהיה קשה בעיניהם לפרוש מגילולי מצרים. אמנם באותו שבת שעיניהם ראו גודל הנס שנעשה להם בלקיחת הפסח, נתקרבו לעבודת השי\"ת, ופרשו לגמרי מע\"ז, והוא כעין הא דאיתא במסכת שבת (דף פ\"ח ע\"א) הדר קבלוה בימי אחשורוש ופירש\"י מאהבת הנס, וה\"נ מגודל חביבות הנס קבלו על עצמם בלב שלם לעבוד את הבוי\"ת, ולעקור לגמרי מלבם את תועבת מצרים."},{"passage_id":"vayikru1_6c0002a1_p26","passage_content":"והנה מלבד מה שהקשינו לעיל על מה ולמה לא נתחייבו במצות משכו וקחו לכם עד העשירי בניסן, עוד יש לתמוה שהרי בני ישראל כבר שמרו שבת במצרים, ועכשיו שנצטוו לקחת להם צאן למצוה בעשור לחדש שחל בשבת, הרי היתה לקיחתו כרוכה בחילול שבת בכמה מלאכות, חדא איסור מקח וממכר בשבת, והוצאת המעות מרה\"י לרה\"ר, ואיסור מעביר ד\"א ברה\"ר, וכן מה שקשרוהו לכרעי המיטה היה בו משום אב מלאכה דהקושר, וטעמא בעי מדוע נצטוו בכך ביום השבת דוקא, הלא מוטב היה אילו לקחוהו לפני השבת, שלא יבואו לידי חילול שבת בעבור זה."},{"passage_id":"vayikru1_6c0002a1_p27","passage_content":"ואפ\"ל עפ\"י מה שביארנו (בדרושים למועדים) כי כח קדושת השבת היתה מסייעת את ישראל לפרוש לגמרי מעבודה זרה של מצרים, ולהתדבק בבוי\"ת בכל נפשם ומאודם, ובפשטות אפ\"ל כי הזמן גרמא, שהרי בשבת היו פנויים מכל מלאכה וטירדה, והיה להם פנאי לשום אל לבם תוקף הנם שנעשה בלקיחת הקרבן פםח לעיני מצרים, ואילו היו מצווים לקחתו בימות החול, לא היו שמים על לב ענין הנס כ\"כ, כי היו טרודים בעסקיהם, ולבם בל עמם להתבונן מה גדלו מעשי ה' שהפליא נסיו עמהם. ואף שכבר לא היו משועבדים באותה העת למצרים, מ\"מ יתכן שהיו עובדים בשכר, או שהיו טרודים כמלאכת עצמם, משא\"כ בשבת שהיה להם יום מנוחה, נתנו אל לבם תוקף הנם, ומאהבת הנם התקרב לבבם אל השי\"ת, והשליכו איש שקוצי עיניו, ופרשו מע\"ז לגמרי. ואז באותו שבת התחילו משה ואהרן ללמוד עמהם תורה שבע\"פ, והודיעו להם פרטי דיני קרבן פסח ודרשות חז\"ל הנלמדות מפרשה זו, שהרי כבר היו ראויים לכך, אחרי שהסירו את אלהי הנכר מקרבם, ונתקרבו לעבוד את השי\"ת."},{"passage_id":"vayikru1_6c0002a1_p28","passage_content":"ובזה מצאנו טעם נכון על שנקרא שמו שבת הגדול, דהנה איתא בגמרא מגילה (כ\"ז ע\"א) ואת כל בית גדול שרף באש (מלכים ב' כ\"ה) ר' יוחנן וריב\"ל ח\"א מקום שמגדלין בו תורה וחד אמר מקום שמגדלין בו תפלה מ\"ד תורה דכתיב (ישעי' מ\"ב) ה' חפץ למען צדקו יגדיל תורה ויאדיר ומ\"ד תפלה דכתיב וכו', ומסיק בגמרא תסתיים דריב\"ל הוא דאמר מקום שמגדלין בו תורה דאמר ריב\"ל ביה\"כ מותר לעשות בית המדרש ש\"מ, עכ\"ד הגמרא, וכתבו התו' שם דהלכה כר' יהושע בן לוי, הרי מזה כי מקום תורה נקוב בשם הגדול, ועל כן קורין שבת זו בשם שבת הגדול, משום שבו התחילו ישראל ללמוד תורה שבע\"פ, כדאמרן שלמדו משה ואהרן עמהם את הדרשות בפ' קרבן פסח. ובזה מצאנו טעם נכון למנהגן של ישראל לדרוש בשבת הגדול בהלכות הפסח, להורות לעם ה' דרך ה' ואת המעשה אשר יעשון, ולכאורה הרי אמרו ז\"ל (פסחים ו' ע\"א) שואלין ודורשין בהלכות הפסח קודם לפסח ל' יום, ומדוע דורשים ברבים בשבת הגדול דייקא, ולפי דרכנו אפ\"ל כי מקור מוצא מנהג זה נובע ממה שהתחילו בני ישראל ללמוד את דרשות חז\"ל בשבת שלפני הפסח, כדאמרן שלא היה באפשר לאמר להם הלכות אלו שהם תושבע\"פ עד אותו שבת, משום שלא היו פרושים לגמרי מע\"ז."},{"passage_id":"vayikru1_6c0002a1_p29","passage_content":"ולדרכנו אפ\"ל דברי המכילתא (הובא ברש\"י ז\"ל עה\"פ וילכו ויעשו בני ישראל כאשר צוה ה' את משה ואהרן כן עשו, אף משה ואהרן כן עשו. ולכאורה הוא פלאי וכי יעלה על הדעת שמשה ואהרן לא יקיימו מצוות השי\"ת, לקחת להם שה לק\"פ, עד דאיצטריך קרא לאשמעינן שאף הם קיימו מצות השי\"ת כשאר ישראל. והשתא איש, דהנה נתבאר שכל מה שצוה הכ' משכו וקחו לכם בעשור לחדש, ולא חש משום חילול שבת הכרוך בכך, הוא משום שדוקא בשבת היה הזמן מסוגל להפריש את ישראל מע\"ז, ולא שייך לומר כן במשה ואהרן, שהרי כל שבט לוי הלכו בתורת ה' כל ימי היותם במצרים, ולא טעו בעבודה זרה, ולפיכך הוה אמינא שמוטב להם לקיים מצות לקיחת הפסח בימות החול, כדי שלא יצטרכו לחלל שבת בלקיחתו, על כן משמיענו הכתוב אף משה ואהרן כן עשו, שלקחו להם קרבן בשבת, משום שכך צוה הכתוב שתהיה הלקיחה בעשור לחדש דוקא, והיינו רבותייהו, דאף שלא היה שייך אצלם טעם הלקיחה בשבת כמו בכל ישראל, והיה מקום לומר כי מוטב להם לקיים מצוה זו בחול, משמיענו קרא אף משה ואהרן כן עשו, שקיימו מצות לקיחת הפסח בשבת, משום שכך צותה תורה."},{"passage_id":"vayikru1_6c0002a1_p30","passage_content":"ועפ\"י כל מה שנתבאר בענין נחזור לראש לבאר המדרשים הנ\"ל בפרשת השבוע, בהקדם דברי ק\"ז זלה\"ה בייטב לב פ' זו במאה\"כ זאת תורת העולה הוא העולה וצ\"ב דכתיב הוא העולה בוא\"ו וקרינן היא ביו\"ד וביאר דאיתא בתנחומא ר\"פ זו זאת תורת העולה מהו עולה אלא שהיא עולה ומכפרת וכו', כי בעת שעשה אברהם עולת האיל שנאמר והנה איל אחר, מהו אחר אלא אחר שהקב\"ה ראה כי בכל לבבו ובכל נפשו בא להעלות את יצחק בנו לעולה, ושלח לו את האיל וכו', באותה שעה הבטיחו הקב\"ה בעת שיעלו בניו עולות שיקבלם. ע\"כ. וביאר עפ\"י דברי ק\"ז זלה\"ה בישמח משה פרשת וארא עה\"פ אלקים יראה לו השה לעולה בני, דהול\"ל ראה מהו יראה, אבל הענין עפ\"י המבואר בתנחומא הנ\"ל, שבשעת העקידה הבטיחו הקב\"ה בעת שיעלו בניו עולות שיקבלם, וביאור הדברים דאז היה יצחק ממש לעולה, כנודע מדברי האר\"י הקדוש (לקוטי תורה פ' חיי שרה), שיצחק היה מתחלתו נשמת נוקבא, ובשעת העקידה פרחה ממנו ונתחלפה באיל, והוא קיבל נשמה מסיטרא דדכורא, ומאז נצמח דקרבן בהמה מכפרת על האדם, דהאבות היו פועל דמיוני, ומאז חשוב קרבן בהמה כאילו הקריב את עצמו, וז\"ש אברהם אלקים יראה לו לעתיד, השה לקרבן, כשיהי' קודם לעולה בני, עכ\"ד היש\"מ זלה\"ה. ובזה יתבאר זאת תורת העולה היא העולה ומכפרת, והטעם כי הוא העולה, כלומר שבאמת הוא עצמו העולה במסירות נפש לה', יחשוב בעיניו יתברך כי הוא בעצמו העולה, וע\"ז אמר התנחומא הטעם שזה נצמח מאברהם אבינו, שבא להקריב את יצחק בנו, ונחשב לו כאילו הקריבו ממש, וזה פועל דמיוני על העתיד לבניו בעת שיקריבו עולות כאילו הקריבו עצמם. עכת\"ד הייטב לב זלה\"ה."},{"passage_id":"vayikru1_6c0002a1_p31","passage_content":"היוצא מזה כי ענין הקרבנות היא חילוף נשמת האדם בקרבן, כשם שהיה גבי יצחק שנתחלפה נשמתו באיל, והנה לכאורה גם זה הוא ענין שידוד המערכות, שאין זה אלא ענין נסיי שתתחלף נפש בנפש, ויתכן שיש בהחלפה זו שינוי הטבע יותר מבהחלפת הזמנים, כי בהחלפת הנשמות תחלת הבריאה לא כן היתה, ולכאו' תקשה שאין הקב\"ה משנה טבע העולם, כמו שנתבאר לעיל מדברי הרמב\"ם ז\"ל, וכיצד תתחלף הנשמה בעת הקרבת העולה. אמנם יתבאר עפי\"מ שהובא לעיל מדברי ק\"ז זלה\"ה בשם הבית שמואל אחרון, דכיון שהדבר כתוב בתורה, והתורה קדמה לעולם הוי זה תנאי מעת תחלת הבריאה, ואין זה שינוי הטבע, ומשו\"ה אין בענין הקרבנות שינוי הטבע, מכיון שזה כתוב בתורה."},{"passage_id":"vayikru1_6c0002a1_p32","passage_content":"ובדרך זה יובן גם מנין החלפת הזמנים בעת גאולת מצרים, דלא הוי זה כשינוי הטבע, משום שכבר נכתב ענין זה בדברי הנביאים, דכתיב אני ה' בעתה אחישנה, וכמו שפירש בנזה\"ק כוונת מקרא זה, וכיון שכבר נתבאר בדברי הנביאים הרי כבר הותנה כן מאז טרם נברא העולם, שאם יזכו ישראל יתחלפו הזמנים ויוקדם זמן הגאולה, דתורה קדמה לעולם. ותו דאף בתורה נתבאר ענין זה, שאין הגאולה תלויה בזמן, כמאה\"כ ושבת עד ה' אלקיך וגו' ושב ה' אלקיך את שבותך וכ' הרמב\"ם ז\"ל (הל' תשובה) שכאשר יעשו ישראל תשובה מיד הן נגאלין, וא\"כ כבר כתוב הדר הוא בתורה הקדושה שזמן הגאולה תלוי במעשי בני ישראל, ושוב לא הויא החלפת הזמנים שידוד המערכה, שהרי התורה קדמה לעולם."},{"passage_id":"vayikru1_6c0002a1_p33","passage_content":"ובבחינה זו יתבאר גם הא דאיתא בסנהדרין (צ\"ח ע\"א) ששאל ריב\"ל את משיח אימת אתי מר והשיב לו היום ופירש אליהו זל\"ט כוונתו היום אם בקולו תשמעון, ואפ\"ל דהוקשה לו שהרי יש זמן קבוע אל הגאולה, וכיצד יתכן שתהיה הגאולה בכל יום, לזאת אמר היום אם בקולו תשמעון, שאם ישמעו בני ישראל בקול ה' יתברך, וישובו עדיו בכל לבבם, אזי תהיה החלפת הזמנים ויחיש הקב\"ה זמן גאולתינו ולא הוי שידוד המערכות מכיון שדבר זה נכתב בתורה שקדמה לעולם. וק\"ז זלה\"ה בישמח משה פ' שמות פירש מאה\"כ (צפניה ג') בשובי את שבותיכם לעיניכם אמר ה' כי באמת נכתב כמעט בכל מקום בתורה ובנביאים ובכתובים אימת יהיה קץ הגאולה, אך חייבה חכמתו ית\"ש שיתעלם מאתנו, ולא יתראה לעינינו ביאור אמירת הקץ, ולעת\"ל יתמהו הכל אחר שיתגלה הקץ יתגלה לעינינו שכבר אמר ה' ית\"ש בביאור, מתי יהיה הקץ והיינו בשובי את שבותיכם אז יהיה לעיניכם כי ה' אמר."},{"passage_id":"vayikru1_6c0002a1_p34","passage_content":"והשתא מבוארים היטב דברי התנחומא (קושיא א') זאת תורת העולה זש\"ה כי מי בשחק וגו' ידמה לה' בבני אלים זה בלעם הרשע שבקש להדמות וכו' א\"ל הקב\"ה מה אתה מבקש להטעות עצמך שאקבל קרבן מן האומות וכו' שאיני מקבל קרבן אלא מישראל וכו' ומה הוא כך שישראל מקריבין ומקטירין א\"ל הקב\"ה זאת תורת העולה ומי זאת עולה מן המדבר ומשה עלה אל האלקים. דהנה נתבאר בדברינו, כי ענין הקרבנות הוא החלפת הנשמה, וזהו שידוד המערכות לכאורה, ואין הקב\"ה משנה את הטבע, אלא דבישראל כיון שהם קבלו את התורה והתורה קדמה לעולם, לא הוי כשידוד המערכה, שהרי כבר נכתב כן בתורה שקדמה לעולם, אבל אוה\"ע שלא קבלו את התורה, לא שייך גבייהו ענין הקרבנות, שאין הקב\"ה משדד המערכה בעבורם. וזאת השיבם הקב\"ה, זאת תורת העולה, היינו פרשת עולה נוהגת רק במי זאת עולה מן המדבר, הם ישראל שקבלו את התורה בסיני, והטעם ומשה עלה אל האלקים, לקבל את התוה\"ק שקדמה לעולת על כן שייך בהו ענין הקרבנות."},{"passage_id":"vayikru1_6c0002a1_p35","passage_content":"ובדרך זה מבואר גם אידך מדרשא (קושיא ב') דדריש היא העולה על מוקדה זו מלכות אדום שעלתה עצמה וכו' אמר הקב\"ה והיה בית יעקב לאש וגו' ולא יהיה שריד לבית עשיו כי פי ה' דבר וכו' ומה דבר ע\"י משה שנאמר הוא העולה על מוקדה ואח\"כ ועלו מושיעים בהר ציון לשפוט את הר עשיו. ולכאורה הרי יש עת קבוע מראש לזמן הגאולה, אמנם הנה הגואל העתיד יהיה משרע\"ה כדאיתא בזה\"ק (ח\"ג דף ר\"פ) והוא יבא לגאול את ישראל בכח התורה, ולפיכך אף אם יחליף הקב\"ה את סדר הזמנים ויחיש את זמן הגאולה, אין זה שידוד המערכה, כיון שכך נכתב בתורה. ואתי שפיר דשייכא דרשה זו דמיירי במפלת מלכות אדום לעתיד לבא, להך קרא דזאת תורת העולה, שהרי במקרא זה רמוז ענין חילוף הנשמות, כמו שפירש קדושת זקיני היטב לב זלה\"ה, ולכאורה זהו שידוד המערכות, וע\"כ לומר דכיון שנכתב כן בתורה שקדמה לעולם לא הוי כשידוד המערכות, וזה רמוז בדברי הכתוב זאת \"תורת\" העולה, פירוש שענין העולה נכתב בתורה שקדמה לעולם, על כן \"הוא\" העולה מעלה עליו בעת הקריב את קרבנו, כאילו הוא עצמו קרב לעולת דנשמתו מתחלפת. ולפיכך סמך התנחומא דרשה זו שעתידה מלכות אדום שתשרף באש, להורות שאף הגאולה העתידה אינה תלויה בזמן, ואם יזכו ישראל יחליף הקב\"ה את סדר הזמנים."},{"passage_id":"vayikru1_6c0002a1_p36","passage_content":"ובזה יתבארו דברי המדרש פליאה (קושיא ג') שאלו תלמידיו את ר' יוסי בן קיסמא אימת בן דוד בא, שהיה רצונם לדעת אימתי הוא הזמן הקבוע לגאולה, על זאת השיב כי אין הגאולה תלויה בזמן מסויים, כי ברצותו יתברך יחליף את הזמן ויקדים להביא את הגאולה, ואין זה חילוף הזמנים, משום שכבר נכתב כן בתורה הקדושה, וזהו שהשיב להם זאת תורת העולה, כי משם ראיה שהקב\"ה מחליף נשמות, ואין זה שידוד המערכה, משום שכתוב כן בתורה הקדומה לעולם."},{"passage_id":"vayikru1_6c0002a1_p37","passage_content":"ויה\"ר שנזכה לעשות תשובה באמת לפני הבוכ'ע, ואז בודאי נזכה למהר ולהחיש ביאת משיח צדקינו, דבכל יומא זמניה הוא, שהקב\"ה מחליף את הזמנים, ולדאבון נפשינו אנו מונחים כעת בעומק הגלות, ועל כן התשובה שעושים לעת כזאת חשובה ביותר, וכאמרם ז\"ל אין מקבלים גרים לימות המשיח, והשי\"ת יעזור שנזכה לתשובה שלימה בימים הקדושים האלו ימי ניסן, שהם ימי הגאולה, והשי\"ת יאיר עיניהם ולבם של ישראל, שיקבלו על עצמם עול מלכות שמים באמת, ונהיה דבוקים בקדושה ובדרך האמת, והבוכ\"ע ישמח לבבינו ויאיר עינינו, שנתדבק בו באמת לאמיתו, ובמהרה נזכה לראות בישועת כל ישראל ושמחתן, ובהתרוממות קרן התורה וישראל, ובהתגלות כבוד שמים עלינו, במהרה בימינו אמן."},{"passage_id":"vayikru1_6c0002a1_p38","passage_content":"R"}]}]
