[{"dvar_torah_id":"devurim_939bcb73","title":"אין כאל ישורון ורוכב שמים","summary":"הדברים עוסקים בהבחנה בין אלוהי העמים לאלוהי ישראל, ובכוחו של הקב\"ה לעזור לישראל גם בעידן של הסתרה. יש להבין את הכוח שניתן לע\"ז ולסט\"א כניסיון לישראל, וההכרח להישען על אבינו שבשמים תמיד.","contents":[{"passage_id":"devurim_939bcb73_p1","passage_content":"אין כא-ל ישורון רוכב שמים בעזרך וגו', מעונה אלקי קדם וגו', פרש\"י ז\"ל דע לך ישורון שאין כא-ל בכל אלהי העמים ולא כצורך צורם, רוכב שמים הוא אותו אלקי שבעזרך וכו', מעונה אלקי קדם למעון הם השחקים, לאלקי קדם שקדם לכל אלקים וכו' עכ\"ל רש\"י ז\"ל, והדברים כפשוטן פליאים המה, מה שפי' ולא כצורך צורם, משמע שח\"ו ממש בהם, אלא שאינם כצורנו, והלא כולם אלילים אלמים הבל ותהו, ואיך שייך לחלק בדבר שאינו בסוג וערך דמיון כלל, ואמרו ז\"ל במד\"ר (פ' דברים) יתרו נתן ממש בע\"ז, שנאמר כי גדול ד' מכל האלהים, דמשמע שיש ח\"ו ממש בהם, וכמו\"כ כאן איך יתכן לומר כזה ולא כצורך צורם."},{"passage_id":"devurim_939bcb73_p2","passage_content":"גם מה שפי' רוכב שמים, אותו אלקי שבעזרך וכו', למעון הם השחקים לאלקי קדם שקדם לכל אלהים, צ\"ב הכוונה בזה, והלא הבוי\"ת כבודו מלא עולם, ומדוע תיארוהו רוכב שמים ולמעון הם השחקים, גם ראוי להבין באמרו אלקי קדם, מדוע תיארוהו ית' בתואר זה דוקא וכבר העירו מפוה\"ת בזה."},{"passage_id":"devurim_939bcb73_p3","passage_content":"ונל\"פ דמצינו בגמ' ע\"ז (דף נ\"ה ע\"א) שנותנין מן השמים כח לע\"ז לעשות נסים, והוא שאמרו שם, א\"ל רבא בר יצחק לרב יהודה, האיכא בית ע\"ז באתרין דכי מנגיב עלמא ולא אתי מטרא, מתחזי להו בחלמא, ואמר להו שחטו לי גברא ואייתא מטרא, שחטו לי' גברא ואתי מטרא וכו', א\"ל הכי אמר רב, מ\"ד אשר חלק ד' אלקיך אותם לכל העמים, מלמד שהחליקן בדברים כדי לטורדן מן העולם, והיינו דארשב\"ל וכו' בא לטמא פותחין לו, ובמס' תמיד (דף ל\"ב) שאל אלכסנדרוס מוקדון את זקני הנגב וכו', א\"ל שטנא נצח פרש\"י השטן הוא נוצח ומטעה בנ\"א, (ועיין בספרי עה\"ג מסי' י\"ד ואילך שהארכנו בביאור דרז\"ל בענין זה) וברור שמן השמים נותנין להם כח זה, כדי לנסות את ישראל, דא\"א שיהי' להם כח זולתו, דאין עוד מלבדו."},{"passage_id":"devurim_939bcb73_p4","passage_content":"אמנם כי כן, יפול לב האדם בקרבו, בראותו ההסתרה הגדולה כ\"כ, איך שנותנים מן השמים כח לע\"ז ולסט\"א לעשות נסים, ואין לנו כח כזה מצד הקדושה, וכבר אמרו ז\"ל אסתר סוף כל הנסים, וא\"כ יחשוב האדם, כבר אבדה תקותנו ואפס תוחלתנו, כי איך נוכל לעמוד נגדם, ולהתגבר לעומתם, אם ניתן להם כח חזק כ\"כ, ואנו אפיסי כח ואין לנו על מי להשען, אולם חלילה לחשוב מחשבה זו, וגם זה מעצת הסתת היצר, דבאמת בכל עת ובכל זמן, ואפי' כשההסתרה גדולה מאוד, הבוי\"ת משגיח על עמו ישראל, ומשתוקק להטיב להם, ולסייע בידם להתגבר על כוחות הסט\"א הלוחמים נגדם, וכמ\"ש ז\"ל הבא לטהר מסייעין אותו, ואלמלא הקב\"ה עזרו לא יכול לו, אלא שדרכי ההשגחה מסותרת ואין נגלית בארץ."},{"passage_id":"devurim_939bcb73_p5","passage_content":"וע\"ד שפירשתי מאמר המשנה (סוף סוטה) על מי יש לנו להשען על אבינו שבשמים, ומאמה\"כ למה יאמרו הגוים אי' נא אלקיהם, ואלקינו בשמים כל אשר חפץ עשה, עפימ\"ש רש\"י (בפ' חיי) שאמר אאנע\"ה, עכשיו הוא אלקי השמים ואלקי הארץ וכו', אבל כשלקחני מבית אבי הי' אלקי השמים ולא אלקי הארץ, שלא היו באי עולם מכירים בו, ושמו לא הי' רגיל בארץ עכ\"ל, ובעוה\"ר עכשיו אינו ניכר התגלות אלקותו ית' רק בשמים, וז\"ש למה יאמרו הגוים אי' נא אלקיהם, לפי שאלקינו בשמים כל אשר חפץ עשה, שרק בשמים נגלה אלקותו ויכולתו ית', שכל אשר חפץ עשה, אבל בארץ ההסתרה גדולה מאוד, ולא זכינו להתגלות אלקותו עדיין."},{"passage_id":"devurim_939bcb73_p6","passage_content":"ועד\"ז יל\"פ מאמרם ז\"ל סוף מס' סוטה, שתיארו חז\"ל המצב הנורא בעיקבתא דמשיחא, שלא יהי' מורה ומנהיג, והסתרת פנים יהי' גדולה מאוד, וסיימו דבריהם על מי יש לנו להשען על אבינו שבשמים, ולכאורה אין מידה זו מיוחדת לדור האחרון בלבד, ונוהגת ומחוייבת בכל הדורות, מבריאת העולם ועד סוף כל הדורות, שאין לנו להשען כי אם על אבינו שבשמים, ומ\"ט חשבוהו רז\"ל, במצב הדורות של עיקבתא דמשיחא בלבד, אמנם בדורות הקודמים, הי' ניכר התגלות אלקותו ית' גם בארץ, ע\"י צדיקי הדורות שהרגילו שמו ית' בפי הבריות, ולעומת זה הי' גם דרכי ההשגחה, וכח אלקותו ית' גלוי בארץ, כאמרם ז\"ל במדרש ד' צלך, כשם שהצל עושה מה שהאדם עושה, כך כביכול הקב\"ה, במידה שהאדם נוהג הוא מתנהג עמו, ועכשיו בעוה\"ר, ע\"י שאין הבריות מרגילים שמו ית' בארץ, גם הבוי\"ת מתנהג עם עולמו במידה זו, בבחי' אלקי השמים בלבד, אבל על הארץ לא נגלית התגלות אלקותו ית', ודרכי ההשגחה מסותרים, ונותנים מן השמים כח חזק לסט\"א ולע\"ז לעשות נסים, ואין בנו כח לעמוד ולהתגבר נגדם, אמנם בכל זאת צריך להתחזק ולדעת, כי אצלו ית' לא יצוייר השתנות ח\"ו, וההשתנות הוא רק מפאת המקבלים, שאין מעשינו ראויים וזכאים להוריד התגלות אלקותו ית' בארץ, ואין לנו להשען כי אם על אבינו שבשמים, שהבוי\"ת משגיח עלינו מן השמים, ומשתוקק להטיב לנו, ולסייע בידינו להתגבר על כוחות הטומאה ונסיונות העצומים, ומה שניתן מן השמים כח חזק לסט\"א ולע\"ז לעשות נסים, הוא רק לנסות אותנו אבל אם נאסוף כל כוחותינו, ונעשה כל שביכולתינו, נזכה להתגלות אלקותו ית' גם בארץ."},{"passage_id":"devurim_939bcb73_p7","passage_content":"ובזה יל\"פ בדברי קודש רש\"י ז\"ל, שמפרש אין כאל ישורון מלשון חוזק, דאל לשון חוזק וגבורה, כמ\"ש ואת אילי הארץ ועוד בכ\"מ, וצור פירושו חוזק וניצחון וגבורה, כמ\"ש רש\"י בפ' האזינו לפרש הפסוק, כי לא כצורנו צורם, לא להם ולאלהיהם הנצחון וכו' כל צור שבמקרא לשון סלע עיי\"ש, וז\"ש רש\"י ז\"ל, דע לך ישורון שאין כאל בכל אלהי העמים ולא כצורך צורם, ולא ניתן להם כח וגבורה, כי אם מה שנותנין להם מן השמים לנסותכם, וכל זה מצד ההסתרה, אבל באמת רוכב שמים אותו אלקי שבעזרך, וממכון שבתו השמים, משגיח על עמו ישראל להטיב להם, והבוי\"ת מחכה לתשובתן של ישראל, שייטיבו מעשיהם ונזכה להתגלות אלקותו גם בארץ, וז\"ש מעונה אלקי קדם, למעון הם השחקים, לאלקי קדם שקדם לכל אלהים, ואצלו ית' לא יצוייר השתנות ח\"ו, כי אני ד' לא שניתי, ואין חילוק אצלו ית' בין ימי קדם וימים של עכשיו, ובהכרח שסיבת ההסתרה רק מצידנו, ומזה תדע שלא כצורך צורם, שכל כח הסט\"א אינו כלום לעומת כח הקדושה, והכל תלוי במעשיך והבן."}]},{"dvar_torah_id":"devurim_86b00629","title":"","summary":"","contents":[{"passage_id":"devurim_86b00629_p1","passage_content":"ומשה בן מאה ועשרים שנה במותו לא כהתה עינו ולא נס לחה, פרש\"י ז\"ל לא כהתה עינו אף משמת עכ\"ל, וכתב האוהחה\"ק נתכוין הכתוב להסמיך מלת במותו, למאמר לא כהתה עינו, להעיר שאחר מיתה הוא אומר לא כהתה עינו, ובספרי פ' פנחס דרשו ז\"ל, בן מאה ועשרים שנה במותו לא כהתה עינו, בין טמא לטהור בין איסור להיתר, ולא נס לחה מעמלו בתורה עכ\"ד הספרי, ולכאורה יש סתירה לזה ממאמר רז\"ל (סוטה י\"ג ע\"ב) לא אוכל עוד לצאת ולבוא, מאי לצאת ולבוא, אילימא לצאת ולבוא ממש, והכתיב לא כהתה עינו וגו', א\"ר שמואל בר נחמני א\"ר יונתן לצאת ולבוא בדברי תורה, מלמד שנסתמו ממנו מעינות החכמה עכ\"ד הגמ', והוא סתירה לדברי הספרי מהיפך להיפך, ואיך יחלוקו במציאות, וכללא הוא בכל פלוגתת חז\"ל דאו\"א דא\"ח, וצ\"ב להשוות המאמרים."}]},{"dvar_torah_id":"devurim_5d21efb4","title":"הבנת הסתירה במיתת משה רבינו","summary":"במאמר זה נדונה השאלה כיצד יתכן שמשה רבינו שכח תלמודו ביום מותו, כאשר ישנן עדויות על עליית מדריגתו בשעת פטירתו. נבחנות דרכי ההבנה בין המדרשים והגמרא, והקשר בין משה לחכמי הדורות שלאחריו.","contents":[{"passage_id":"devurim_5d21efb4_p1","passage_content":"ומלבד קושית הסתירה, דברי הגמ' בעצמם צ\"ב, דאיך יתכן לומר כן במשרע\"ה אדון כל הנביאים ואב החכמים, ששכח תלמודו קודם מיתתו ח\"ו, והשבות יעקב זלל\"ה, בפירושו על עין יעקב עמד בקושיא זו, ונדחק בתירוצו עיי\"ש, גם ידוע דכל הצדיקים מעלתם גדולה מאד בשעת פטירתם, כמ\"ש בספה\"ק אגרא דכלה (פ' וילך) וזלה\"ק, מדריגת משה רבינו באותו היום, הי' מדריגה היותר גדולה מכל ימי חייו, ומה שלא הי' וכול להשיג כל ימי חייו, השיג ביום ההוא, ונקרא ביום ההוא איש האלהים, וכל ימיו הי' מצפה להשגה זו וכו', וכן מצינו לבוצינא דקדושה רשב\"י, דקאמר ביומא דהלולא דלי', אסהדנא עלי דכל יומא, דתאיבנא למחמי יומא דא עיי\"ש, וכן שמעתי ממגידי אמת שהרב הקדוש הבעש\"ט זלל\"ה אמר בשעת פטירתו, כעת אני יודע למה נבראתי וכוונת בריאתי, והמשכילים יבינו עכ\"ל האגרא דכלה, ומכ\"ש שלא יתכן לומר במשרע\"ה, שלא הי' יכול לצאת ולבוא בדברי תורה ביום הסתלקותו, וצ\"ב להבין דברי רז\"ל עפ\"י פשוטן, גם מצינו מפורש להיפך במס' תמורה (ט\"ז ע\"א) א\"ר יהודה אמר רב בשעה שנפטר משה רבינו לג\"ע, אמר לי' ליהושע שאל ממני כל ספיקות שיש לך וכו', גם אמרו ז\"ל במד\"ר (פ' וילך) באותו יום שנסתלק משרע\"ה כתב י\"ג תורות, י\"ב לשנים עשר שבטים, ואחת הניח בארון וכו', וא\"כ איך יתכן לומר שלא יכול לצאת ולבוא בדברי תורה ושנסתמו ממנו מעיינות החכמה, ועכ\"פ מדרז\"ל הללו, ישנו סתירה מפורשת לדברי הגמ' דסוטה הנ\"ל, וצ\"ב להשוות המאמרים."},{"passage_id":"devurim_5d21efb4_p2","passage_content":"ב) אאמו\"ר זלל\"ה בקדושת יו\"ט מביא מדרש, לא אוכל עוד לצאת ולבוא, הה\"ד ולא קם נביא עוד בישראל כמשה, עכ\"ד המדרש וצ\"ב."},{"passage_id":"devurim_5d21efb4_p3","passage_content":"ונ\"ל בביאור הענין, ובהקדם מה שפירשתי בדברי הספרי (פ' האזינו) ויבא משה וידבר את כל דברי השירה הזאת באזני העם וגו', נאמר כאן ויבא משה, ונאמר להלן וילך משה, אי אפשר לומר ויבא משה, שכבר נאמר וילך משה, ואי אפשר לומר וילך משה, שכבר נאמר ויבא משה, אמור מעתה בא דייתיקום שלו (פי' ממלא מקומו), והרשות נתנה ביד אחר עכ\"ד הספרי, ולכאורה עדיין הסתירה במקומה עומדת, דאחר שכבר כתוב וילך משה וגו' וניתן הרשות לממלא מקומו, איך יתקיים הפסוק ויבא משה וידבר את כל דברי השירה הזאת וגו', גם כל המפרשים נדחקו בביאור הכתוב וילך משה וידבר את כל הדברים וגו', כי לא פורש להיכן הלך, והליכה זו מה ענינה."},{"passage_id":"devurim_5d21efb4_p4","passage_content":"ופירשתי בהקדם מ\"ש ק\"ז הישמח משה זלל\"ה בהפטורת ראה, עה\"פ הטו אזניכם ולכו אלי (ישעי' נ\"ה), עפי\"מ שפירש הגה\"ק מניקלשבורג זלל\"ה, במאמה\"כ לכו בנים שמעו לי, כי לא די לשמוע בשעה שהחכם יושב ודורש לבד, כי אם שתלכו לביתכם, גם אז שמעו לי יראת ד' אלמדכם, שהשמיעה הזאת יביא לידי מעשה, וישאר רושמו גם לאחר זמן, וע\"כ אמר לכו בנים שמעו לי, שאחר הליכתכם עוד תשמעו לי, עכדה\"ק, וק\"ז זלל\"ה הוסיף נופך לבחינתו, והוא שלא תהי' פעולת השמיעה, רק לקבל את הנשמע בלבד, כי מי יודע לכוין מה שצריך להוכיח לכאו\"א בפרטיות, אלא ע\"י השמיעה יתעורר בחי' נפשם, ויתלהב ויתפקח, עד שמעצמה תתעורר על כל השייך לה בפרטיות, וזהו הפי' הטו אזניכם ולכו אלי, שתהיו בבחי' מהלכים, לילך ממדריגה למדריגה וכו' עיי\"ש."},{"passage_id":"devurim_5d21efb4_p5","passage_content":"והנה אמרו רז\"ל (במס' סוטה י\"ג ע\"ב) יש אומרים לא מת משה, כתיב הכא וימת שם, וכתיב התם ויהי שם עם ד', מה להלן עומד ומשמש, אף כאן עומד ומשמש עכ\"ד הגמ', ואפי' לאידך מ\"ד בגמ' שם, ודאי שלא הי' אצלו מיתה, אלא בחי' הליכה מעוה\"ז לעולם העליון, כמ\"ש האוהחה\"ק (פ' בחקתי) וזהו לשון קדשו, כי בהתעצמות האדם בעסק התורה, יכול להשיג באמצעותה שלא ירגיש במות, אלא כאדם ההולך ממקום למקום, וזהו אם בחקתי תלכו, שתהיו בבחי' הליכה, ולא יצוייר אצליכם בחי' מיתה כלל עכ\"ל, וע\"כ אמר הכתוב וילך משה, שהי' רק בבחי' הליכה ולא מיתה."},{"passage_id":"devurim_5d21efb4_p6","passage_content":"ועוד בחי' הליכה מצינו אצל משרע\"ה, וידבר את כל הדברים האלה אל כל ישראל, לרבות כל דורות ישראל, ואף שנסתלק ונסתר מעינינו, אבל דיבוריו הקדושים, ותורתו ותוכחתו נשארו חיים וקיימים, וכוחו טמון בתוה\"ק ועודנו חי עמנו, וכל מי שמבקש את האמת יש לו סייעתא דשמיא, וימצא בתוה\"ק כל אחד כפי בחינתו, ודיבוריו ותוכחתו הם בבחי' הליכה, כבחי' שכתב ק\"ז זלל\"ה, עה\"פ הטו אזניכם ולכו אלי, שתוכחת אמת ודיבורים קדושים, יש להם כח להשפיע, להיות בבחי' הולך ממדריגה למדריגה, ולפי\"ז מאמר וילך משה, קאי על האמור אח\"כ וידבר את כל הדברים האלה אל כל ישראל, דע\"י דיבוריו הקדושים שטמון בהם כוחות נפשו, נתקיים בו בחי' הליכה, שעדיין עומד ומשמש עם ד', ויפעלו דבריו להחזיר את ישראל לתשובה ולהדריכם בדרכי ד', וזהו וילך משה וידבר את הדברים האלה אל כל ישראל לרבות כל הדורות, ודיבורו ותוכחתו הם בבחי' הליכה, מדור לדור וכח נצחי עד עולם."},{"passage_id":"devurim_5d21efb4_p7","passage_content":"ואפ\"ל עוד בחי' בזה, עפימ\"ד בזוה\"ק דאתפשטותא דמשה בכל דרא ודרא, וביע\"ד (ח\"א דרוש ח') האריך בזה, וכתב כי נשמת משרע\"ה תמיד נקשר עם חכמי הדור ואדוק בהם, ונפשו קשורה בנפשם וכו', ואשר יערה ד' רוח ממרום על לומדי תורה, הוא למשה לבד, כי הוא עיקר הצינור המקבל וכו', ועל ידו ישפעו לישראל, להיות נשמתו כלול בהם, ובזה פי' מ\"ש ז\"ל משה רבינו לא מת, כי ניצוץ נשמתו עדיין מתדבק עם החיים עכ\"ד ז\"ל, אמנם משה רבינו בעצמותו נסתלק מאתנו לעולם העליון, ונעלם מעינינו, ויתגלה אלינו ברצות השם בביאת הגואל האמיתי, כמבואר במדרשי חז\"ל, ומ\"ש אתפשטותא דמשה בכל דרא ודרא, היינו רק ניצוץ מבחי' נשמתו נשאר אתנו, ודבוק בחכמי הדור ובצדיקי אמת."},{"passage_id":"devurim_5d21efb4_p8","passage_content":"ובזה יתקיימו שני הכתובים וילך משה וגו' ויבא משה, ויתבאר דברי הספרי הנ\"ל, ואין הכתובים מכחישים זה את זה, אלא שניהם על קוטב א' יסובבו, וזה וילך משה וידבר את הדברים האלה אל כל ישראל, שאף שנסתר מעינינו, עדיין הוא בבחי' הולך, ומשפיע ע\"י דיבוריו באמצעות חכמי הדור, כי הוא הצנור המקבל, ועל ידו נשפע לישראל כנ\"ל, וזהו ויבא משה וידבר וגו' כפי' הספרי, מעתה בא דייתיקים שלו (ממלא מקומו), היינו יהושע וכמו\"כ חכמי ישראל שבכל הדורות, וע\"י שכח נשמתו כלול בהם, עדיין הוא עומד ומצוה, ומוכיח את ישראל, וזהו ויבא משה וידבר וגו' והבן."},{"passage_id":"devurim_5d21efb4_p9","passage_content":"והנה מצינו במדרשי חז\"ל שנתגלה משרע\"ה אל צדיקי הדורות, כמ\"ש במדרש איכה, שירמיה הנביא דיבר עם משרנרה בעת החורבן, ומרדכי הצדיק בשעת הגזירה דיבר עם משרע\"ה, ושאול כי אסקי' לשמואל בנגידא עלה עמו משרע\"ה, והתנאים והאמוראים והאריה\"ק והבעש\"ט הק' בודאי הי' להם גילוי משרנרה באיזה בחי', ומקובל מפי מגידי אמת, שק\"ז הישמח משה זלל\"ה פעם א' בהקפה הד' דיבר אל משרע\"ה, ואמר אתה עד בדבר שלא חסרתי מתורתך כלום ואפי' כקוצו של יו\"ד, ומדוע ביישוני מן השמים שהייתי מצפה ומחכה כ\"כ על הגאולה ולא נעניתי עכדה\"ק, ולכאורה אחרי שהי' להם התגלות משרע\"ה שהוא מקור התורה, מדוע לא שאלו ממנו כל ספיקותיהם בהלכה."},{"passage_id":"devurim_5d21efb4_p10","passage_content":"ומדברי מרן הח\"ס זלל\"ה בתשו' (או\"ח סי' ר\"ח) יתבאר ענין זה, ותו\"ד שם, על הא דאמרי' בגמ' (ב\"מ פ\"ו ע\"א) ספק בהרת קדמה או שער לבן קדמה לבהרת, הוי קא מפלגי במתיבתא דרקיע, הקב\"ה אומר טהור, וכולהו מתיבתא דרקיע אמרי טמא, ואמרי מאן נוכח, נוכח רבה בר נחמני וכו', כי הוה קא ניחא נפשי' אמר טהור טהור וכו', עכ\"ד הגמ', ואיכא פלוגתא דתנאים בהא (בפ\"ה דנגעים) ות\"ק ס\"ל טמא עיי\"ש, והרמב\"ם ז\"ל (בפ\"ב מה' טומאת צרעת) פוסק כת\"ק דטמא, וכתב הכסף משנה ואע\"ג דקוב\"ה אמר טהור, לא בשמים הוא, ואע\"ג דאמרי מאן נוכח רבה בר נחמני ואיהו אמר טהור, יש לומר כיון דבשעת יציאת נשמה אמר הכי, הוי בכלל לא בשמים הוא עכ\"ד הכ\"מ זלל\"ה."},{"passage_id":"devurim_5d21efb4_p11","passage_content":"וכתב הח\"ס זלל\"ה דמדברי הכ\"מ אלו יצא דין חדש, דכל שאמרו ת\"ח סמוך לסילוקו מן העולם, הוא בכלל לא בשמים הוא, וזהו דבר חדש ותמי' ובלי טעם וסברא, אמנם לא צריכנא לזה, דהרי מבואר בגמ' ב\"מ שם, דרבה בר נחמני מת לבדו בשדה, ושום אדם לא הי' שם, ולא שמע ממנו אומרו טהור טהור וכו', ועל כן כל המעשה הזה נודע לחכמי ישראל בחלום או ע\"י אליהו שסיפר להם, והיינו לא בשמים הוא."},{"passage_id":"devurim_5d21efb4_p12","passage_content":"ויש כאן מקום לשאול, אכתי אם אמר אליהו, כך הורה זקן פלוני בארץ ולא בשמים, למה לא נאמין לאליהו, וכה\"ג אמרי' בעירובין (מ\"ג ע\"א) הני שב שמעתתא דאמרינהו בצפרא דשבתא קמי' דר\"ח בסורא, בפניא דשבתא קמי' דרבא בפומבדיתא, מאן אמרן לאו אלי' אמרן עיי\"ש, וא\"כ ה\"נ אי ס\"ד דמאי דאמר רבה בשעת מיתה הילכתא כוותי', אמאי לא נאמין עדותו של אלי' דהכי הוי בארעא, ולא בשמים הוא."},{"passage_id":"devurim_5d21efb4_p13","passage_content":"אולם הא דלא בשמים הוא, ושאין הנביא רשאי לחדש דבר מעתה, הוא יסוד ושורש כל התורה כולה, דאל\"ה אין כאן תורה כלל, דהרי כבר הי' לעולמים (כמ\"ש במס' שבת קט\"ז ע\"ב) דאמר ההוא מינא, מיומא דגליתכון אתנטלית אורייתא דמשה ואיתיהיבת ספרא אחריתי עיי\"ש, ואפשר יעשה אותות ומופתים ע\"י תחבולות וכישוף, ונביא ישמעאלים עשה כן, ושבתי צבי תר\"ו אמר שנתהפכו המצות, ונעשו מעשין לאוין ומלאוין עשין, ואפי' אם לא נאמין כן בכללות התורה, מ\"מ אין שום מצוה שתשאר במתכונתה, כל אחד יאמר חלמתי חלום שחלב זה אסור וזה מותר, וזה יאמר כך, וזה כך, ותפוג תורה, ע\"כ כללא כייל הקב\"ה, שאין הנביא רשאי לחדש שום מצוה מהישנות, וא\"א שיתבאר ויתפרש מן השמים שום מצוה, כי אם על דעת חכמי ישראל, וזהו צורך גדול."},{"passage_id":"devurim_5d21efb4_p14","passage_content":"וממילא אפי' יאמר אלי', בשם ת\"ח בארץ, ואין אנו יכולים לברר הדבר, כמו בעובדא דר\"ח ורבא בגמ' דעירובין הנ\"ל שהי' אפשר לברר, אבל היכי שאי אפשר לברר, כגון עובדא דרבה שכבר מת, ואלי' יאמר בשמו, אם נעשה מעשה עפ\"י עדותו של אלי' תפוג תורה, שכל א' יאמר נגלה לי בחלום, או אלי' אמר לי בשם פלוני ת\"ח, שאמר קודם מותו כך וכך, ע\"כ אין לפסוק הלכה על זה וכיוצא בו."},{"passage_id":"devurim_5d21efb4_p15","passage_content":"ומשו\"ה אין זה נוהג אלא אחר מיתת משרע\"ה, אבל במשרע\"ה בעצמו לא הי' חשש זה, והוא הי' בכוחו לחדש הלכה עפ\"י נבואתו, ולהוסיף ולשנות הלכה, כמ\"ש עמדו ואשמעה מה יצוה ד' לכם, ומפני שמשרע\"ה הוריד כל התורה מן השמים, ונתנה לנו עפ\"י נבואתו, כמו\"כ הי' בכוחו להורות הלכה, ולהוסיף עפ\"י נבואתו, וראי' ממגדף עיי\"ש, אבל אחר מיתת משרע'\"ה לא ניתנה רשות לחדש דבר עפ\"י נבואה, עכ\"ד הח\"ס זלל\"ה בתשו' שם, ובליקוטי שו\"ת (ח\"ו סי' צ\"ח) כתב בענין אלי' הנביא, דכשמתגלה בנשמתו הרי הוא מלאך, אעפ\"י שלומד תורה ומגלה דינים, אין לקבוע הלכה על פי דבריו, דהוי לי' כמו חלום ורוח נבואה, ואין משגיחים בבת קול, אך כשמתגלה בלבוש גופו הרי הוא מגדולי חכמי ישראל, ותשבי יתרץ קושיות ואבעיות, ואליו תשמעון כי מי כמוהו מורה, והני שב שמעתתא אם אמרו אלי', על כרחך בלבוש גופו אומרן, לכך קבעו הלכה עפ\"י דבריו עייש\"ד"},{"passage_id":"devurim_5d21efb4_p16","passage_content":"ובזה יבואר דרשתם ז\"ל לא אוכל עוד לצאת ולבוא בדברי תורה, מלמד שנסתמו ממנו מעיינות החכמה, דהנה אמרו ז\"ל במס' תמורה (ע\"ז ע\"ב) בשעה שנפטר משרע\"ה לג\"ע, א\"ל ליהושע שאל ממני כל ספיקות שיש לך וכו', ובאותו יום ניתנה לו עוד הרשות והכח, להורות עפ\"י הנבואה ולהכריע בספיקי הלכות, אבל על זמן שאח\"כ, אמר לא אוכל עוד לצאת ולבוא בד\"ת, ולהכריע בספיקי הלכות, ואף דגדולים צדיקים במיתתם יותר מבחייהם, אבל תורה לא בשמים הוא, וכן מ\"ש שנסתמו ממנו מעיינות החכמה, כלפי ישראל המקבלים תורתו, מושאל עליהם לשון סתימה, כי דבר שאי אפשר לבוא לידי התגלות נקרא סתימה, אבל הוא בעצמותו נשאר מעיין חכמה, וצנור המשפיע תורה וחכמה, לחכמי ישראל שבכל הדורות, כמ\"ש ז\"ל והובא לעיל דברי היע\"ד בזה עיי\"ש."},{"passage_id":"devurim_5d21efb4_p17","passage_content":"ומעתה אין כאן עוד סתירה בין הספרי לדברי הגמ' הנ\"ל, דמ\"ש בספרי לא כהתה עינו בין טמא לטהור בין איסור והיתר, ולא נס לחה מעמלו בתורה, זה אמת וברור, שנשאר מעיין החכמה אף אחר הסתלקותו כפרש\"י ז\"ל לא כהתה עינו אף משמת, והוא עיקר צינור המקבל, ומשפיע תורה לכל דורות ישראל כנ\"ל, ומ\"ש בגמ' דסוטה הנ\"ל, שנסתמו ממנו מעיינות החכמה, ולא אוכל עוד לצאת ולבוא בד\"ת, היינו להכריע בספיקי הלכות, כי מעתה התורה חתומה ניתנה, ותורה לא בשמים הוא, ואין נביא רשאי לחדש דבר מעתה ואפי' משרע\"ה, ואף דאתפשטותא דמשה בכל דרא ודרא, וא\"כ יהי' סברא דחכמי הדור ע\"י ניצוץ נשמת משה שכלול בהם, יהי' בכוחם להכריע הלכה עפ\"י הנבואה כמשרע\"ה, לזה אמר המדרש לא אוכל עוד לצאת ולבוא, הה\"ד ולא קם נביא בישראל עוד כמשה, דכח זה להכריע הלכה עפ\"י הנבואה, לא יהי' במציאות אחרי הסתלקותו, ולא יקום נביא כמוהו בבחי' זו, להורות ולחדש מצוה עפ\"י נבואתו, עד שיבוא גואל האמיתי, ואז יתגלה משרע\"ה לעיני כל ישראל, וינהלנו כימי קדם וכשנים קדמוניות, הרחמן הוא יזכנו לזה בב\"א."},{"passage_id":"devurim_5d21efb4_p18","passage_content":"R"}]}]
