[{"dvar_torah_id":"devurim_704d8be1","title":"מינוי שופטים ומשמעותו בתורה","summary":"בפרשת שופטים מצווה ה' למנות שופטים ושוטרים, תוך הדגשת חשיבות המינוי הנכון והצורך בצדק. המאמר עוסק בקישור בין מינוי השופטים לבין הגאולה, ומדגיש את תפקידם של הדיינים בהכוונת העם בדרך התורה.","contents":[{"passage_id":"devurim_704d8be1_p1","passage_content":"שופטים ושוטרים תתן לך בכל שעריך אשר ד' אלקיך נתן לך לשבטיך ושפטו את העם משפט צדק וכו', יל\"ד אמרו תתן לך, מלת לך מיותר."},{"passage_id":"devurim_704d8be1_p2","passage_content":"ב) בכל שעריך אשר ד' אלקיך נתן לך, ראוי להבין וכי מי לא ידע, כי הוא ית' הוא הנותן לנו את הארץ, וכבר הודיענו הכתוב ענין זה פעמים הרבה, ומה קישור יש בהודעה זו לפ' שופטים."},{"passage_id":"devurim_704d8be1_p3","passage_content":"ג) ושפטו את העם משפט צדק, פרש\"י מנה דיינים מומחים וצדיקים לשפוט צדק עכ\"ל, וכתב הרא\"ם, שעל כרחך הוא צווי על הממנים כדברי רש\"י ז\"ל, ולא יתכן לומר שהיא צווי על הדיינים שישפטו צדק, דא\"כ הול\"ל ושפטתם צדק בל' נוכח כמ\"ש הכתוב לא תטה משפט, לא תכיר פנים וכו', ועוד שכבר מוזהרין הם במקום אחר, שנאמר בצדק תשפוט את עמיתך, אלא ע\"כ דקאי על תתן לך, והוא צווי על הממנים שימנו דיינים מומחים עכ\"ל. אמנם לפי\"ז קשה, למה נאמר ושפטו את העם משפט צדק, דהרי אין דבר זה ביד הממנים לעשות אלא ע\"י גרמא, דע\"י שימנו דיינים מומחים, ישפטו הדיינים את העם משפט צדק, והול\"ל לשפוט את העם משפט צדק."},{"passage_id":"devurim_704d8be1_p4","passage_content":"ד) גם את העם מיותר, ומי לא ידע כי את העם ישפוטו הדיינים."},{"passage_id":"devurim_704d8be1_p5","passage_content":"ה) במדרש תנחומא דרשו שופטים ושוטרים תתן לך, אתה תמנה שופטים בכל שערים, וצ\"ב מה הוסיפו במדרש על פשוטו של מקרא."},{"passage_id":"devurim_704d8be1_p6","passage_content":"ו) עוד שם במדרש תתן לך ולא לאוה\"ע, עיין בעץ יוסף על התנחומא שפי' שישראל אינם מצווין למנות לאומה\"ע שופטים, ויש להבין מהיכי תיתי יהיו ישראל מצווים להעמיד שופטים בערכאותיהם, ולמה הוצרך הכתוב למעט זאת."},{"passage_id":"devurim_704d8be1_p7","passage_content":"ז) במדרש תנחומא ושפטו את העם משפט צדק, א\"ר יהודה ברבי שלו' שיהיו מטין ומלמדין עליהם זכות לפני הקב\"ה, ממי אתה למד מגדעון וכו', הוי ושפטו את העם משפט צדק, שיהיו מלמדין זכות על הדור ע\"כ, וצ\"ב דלמה הוציאו הפסוק מפשוטו, דמיירי במשפט הדיינים, כדמוכח מהמשך הכתובים לא תטה משפט, לא תכיר פנים ולא תקח שוחד, וכו'."},{"passage_id":"devurim_704d8be1_p8","passage_content":"ח) בישמח משה (פ' משפטים) דקדק על ב' שינוים שבין פ' משפטים לפ' שופטים, והוא ששם נאמר כי השוחד יעור פקחים, ובפ' שופטים כתיב כי השוחד יעור עיני חכמים, ועוד כי שם כתיב ושוחד לא תקח, וכאן כתיב לא תקח שוחד, וטעמא בעי למה שינה הכתוב בלשונו מהכא להתם."},{"passage_id":"devurim_704d8be1_p9","passage_content":"ט) ויסלף דברי צדיקים, פרש\"י דברים המצודקים משפטי אמת עכ\"ל, וכתב הגור ארי' דא\"א לומר דקאי על דברי הדיינים, דר\"ל שיגרום השוחד שידבר הדיין דברים שהם מעותים, דממנ\"פ אם יסלף הדיין דבריו בטעות ובשוגג, הרי כבר נאמר שהשוחד יעור עיני פקחים, ואם יעשה כן במזיד אין זה צדיק אלא רשע, ע\"כ פרש\"י דברים המצודקים שיסלף משפטי התורה שהם מצודקים ומשפטי אמת, עכ\"ד. אבל א\"כ קשה דהי\"ל לומר דברים המצודקים, ומדוע כתבה תורה לישנא דמשתמע בענין אחר וכן הקשה באלשיך הק'."},{"passage_id":"devurim_704d8be1_p10","passage_content":"י) וע\"ק דאין זה מסלף דברים המצודקים, אלא מחליף דברים המצודקים של תורה, ואומר במקומם דברים המסולפים של עצמו."},{"passage_id":"devurim_704d8be1_p11","passage_content":"יא) צדק צדק תרדוף ראוי להבין כפל הלשון."},{"passage_id":"devurim_704d8be1_p12","passage_content":"יב) למען תחי' וירשת את הארץ וכו', פרש\"י והוא בגמ' (סנהדרין ל\"ב) כדאי הוא מנוי הדיינים הכשרים להחיות את ישראל ולהושיבן על אדמתם ע\"כ, וכתב המזרחי דע\"כ למען תחי' מוסב למעלה שופטים ושוטרים תתן לך וכו' למען תחי' וירשת את הארץ כפרש\"י, וא\"א לומר דמוסב על צדק צדק תרדוף דסמיך לי', דזה הוא מצוה פרטית ואזהרה לבעלי דינים כמו שפרש\"י, ולא ישיג בזה שכר כללי קיום ישראל בארצם, עכ\"ד וכן כתב הגור ארי', אבל קשה דא\"כ אין מקושר סוף הפסוק לתחלתו, והול\"ל למען תחי' וירשת לעיל מני' אצל שופטים ושוטרים תתן לך, ולמה נכתבה כאן שלא במקומה."},{"passage_id":"devurim_704d8be1_p13","passage_content":"יג) כי יפלא ממך דבר למשפט וכו' וקמת ועלית אל המקום אשר יבחר ד' וכו', לא תסור מן הדבר אשר יגידו לך ימין ושמאל, פרש\"י אפי' אומר לך על ימין שהוא שמאל ועל שמאל שהוא ימין וכו', ודרשו כן מיתורא דקרא דלא הול\"ל ימין ושמאל, אלא לא תסור מן הדבר אשר יגידו לך, או לא תסור ימין ושמאל מן הדבר אשר יגידו לך אלא ע\"כ לדרשא אתי', ובספרי איתא הגירסא, אפי' נראים בעיניך על שמאל שהוא ימין ועל ימין שהוא שמאל שמע להם ע\"כ, ור\"ל שידמה בעיניו שאומרים על ימין שהוא שמאל וכו', ומבואר בגמ' (סנהדרין דף פ\"ח) אפי' הוא אומר מפי הקבלה, וב\"ד הגדול אומרים מפי הסברא כך הוא בעינינו, נהרג אם לא שמע להם כדי שלא ירבו מחלוקת בישראל עיי\"ש, אולם בירושלמי דהוריות (פ\"א ה\"א) איתא יכול אם יאמרו לך על ימין שהוא שמאל ועל שמאל שהוא ימין תשמע להם, ת\"ל ללכת ימין ושמאל, שיאמרו לך על ימין שהוא ימין ועל שמאל שהוא שמאל ע\"כ, ורוב מפרשי הירושלמי פירשו דהירושלמי פליג על הספרי ועל התלמוד בבלי, אמנם ראוי להבין באיזה סברא פליגי, ומהו שורש פלוגתתן, גם כיון ששניהם מקרא א' למדו איך נשמע מפסוק א' דבר והפוכו, ואם נאמר דלא פליגי אהדדי, צ\"ב איך אפשר לקיים שתי הדרשות מבלי שיהי' סתירה ביניהם."},{"passage_id":"devurim_704d8be1_p14","passage_content":"יד) הרמב\"ם ז\"ל (בפ\"א מה' ממרים ה\"ב) כתב וז\"ל כל מי שאינו עושה כהוראת ב\"ד הגדול שבירושלים עובר בל\"ת, שנא' לא תסור זמן הדבר אשר יגידו לך ימין ושמאל וכו', א' דברים שלמדו אותם מפי השמועה והם תושבע\"פ, וא' דברים שלמדום מפי דעתם באחת מן המדות שהתורה נדרשת בהם, וא' דברים שעשאום סייג לתורה, והם הגזרות והתקנות והמנהגות, כל א' מאלו הג' דברים מצוה לשמוע להם, והעובר על כל א' מהם עובר בל\"ת וכו', ופלא שהשמיט רבינו הרמב\"ם הלכה זו דאם אומר לך על ימין שהוא שמאל, ועל שמאל שהוא ימין ולא העתיק לא דברי הספרי והבבלי, ולא דברי הירושלמי וצ\"ב."},{"passage_id":"devurim_704d8be1_p15","passage_content":"טו) כי תבא אל הארץ אשר ד' אלקיך נתן לך וירשתה וישבת בה ואמרת אשימה עלי מלך ככל הגוים אשר סביבתי, שום תשים עליך מלך אשר יבחר ד' אלקיך, לא תוכל לתת עליך איש נכרי אשר לא אחיך הוא, במס' סנהדרין (דף כ' ע\"ב) פליגי ר' יהודה ור' נהוראי, ר\"י אומר ג' מצות נצטוו ישראל בכניסתן לארץ, להעמיד להם מלך וכו', ר' נהוראי אומר לא נאמרה פרשה זו אלא כנגד תרעומתן, שנא' ואמרת אשימה עלי מלך, פרש\"י לא נאמרה פרשה זו דשום תשים עליך מלך משום מצוה, אלא שגלוי לפניו שעתידין להתרעם על כך וכו', כמ\"ש ואמרת אשימה עלי מלך, והרמב\"ם בה' מלכים (פ\"א ה\"א) פוסק כר' יהודה דמצות עשה למנות מלך, וג' מצות נצטוו ישראל בכניסתן לארץ, דתניא ברייתא כוותי', וראוי להבין דאם הוא מ\"ע למנות מלך, למה אמר הכתוב ואמרת אשימה עלי מלך, דנראה כאלו תלוי הדבר באמירתן, והלא אפי' בלא אמירתן הוא חיוב ומצות עשה, ובאמת זהו ראיתו של ר' נהוראי מפני שנא' ואמרת אשימה וכו', ומשם למד שלא נאמרה מצוה זו אלא כנגד תרעומתן, גם אמאי לא הקשו בגמ' ואידך, כמו שדרך הש\"ס בכ\"מ."},{"passage_id":"devurim_704d8be1_p16","passage_content":"טז) שום תשים עליך מלך, יל\"ד על כפל הלשון שום תשים ויספיק באחת מהם."},{"passage_id":"devurim_704d8be1_p17","passage_content":"יז) לא תוכל לתת עליך איש נכרי אשר לא אחיך הוא, ואמרו בספרי זו מצות לא תעשה ע\"כ, וא\"כ מה שנאמר לא תוכל פירושו יכול אתה אבל אינך רשאי, אבל צ\"ב מדוע כתבה תורה אזהרה זו בלישנא דמשתמע בענין אחר, וגם הוא אריכות לשון, הול\"ל לא תתן עליך איש נכרי, כמו שנאמרה האזהרה ברוב לאוין שבתורה, ובודאי לאיזה כוונה כתבה תורה כן."},{"passage_id":"devurim_704d8be1_p18","passage_content":"יח) לבלתי רום לבבו מאחיו ולבלתי סור מן המצוה ימין ושמאל וכו', ראוי להבין דימין ושמאל מיותר הוא, ויספיק לומר ולבלתי סור מן המצוה, ולא שייך למידרש כאן דרשתם הנ\"ל, אפי' אומר לך על ימין שהוא שמאל, דזו אזהרה שלא יסור ממצות התורה, ולא על הוראת ב\"ד נאמרה, וא\"כ ימין ושמאל למאי אתא."},{"passage_id":"devurim_704d8be1_p19","passage_content":"יט) לבלתי רום לבבו מאחיו, דקדק ק\"ז הייטב לב זלל\"ה, וכי למי שאינו מלך מותר לו לרום לבבו, ועוד מאחיו ל\"ל, ומאי נפק\"מ אם הוא מאחיו או לא, והלא בכל אופן ולכל אדם אסור, ותועבת ד' כל גבה לב, ופי' הוא ז\"ל ע\"ד אומרם ז\"ל (נדה ל' ע\"ב) שמשביעין את האדם אפי' כל העולם כולו אומרים עליך שצדיק אתה, הי' בעיניך כרשע, וכבר פירשו מאמרם אוי לו לאדם שהעולם מטעין בו, לא אמרו טועין בו, כי מה לו לעשות, אך למי אוי, למי שהעולם מטעין \"בו\", היינו מכניסין טעות בלבו שיסבור שהוא באמת כמו שמחזיקין אותו, וזה שאמר הכתוב כאן לבלתי רום לבבו מאחיו, היינו שלא יתגאה בלבו מכח מה שאחיו מנשאים אותו למלוך עליהם, רק ידע האמת בלבו בחינתו ומדרגתו עכת\"ד ז\"ל, אמנם עדיין צ\"ב דיאמר הכתוב לבלתי רום לבבו, ויהי' משמעותו בכל אופן ואופן, ומלת מאחיו מיותר."},{"passage_id":"devurim_704d8be1_p20","passage_content":"כ) גם יש להבין מימרא דגמ' הנ\"ל, ואפי' כל העולם כולו אומרים עליך צדיק אתה וכו', דע\"כ כיון שמשביעין האדם בכך, א\"כ ודאי שיש במציאות דבר כזה, דאל\"ה לא היו משביעין מן השמים בכך, ואיך אפשר לקרב דבר זה אל השכל, שכל העולם כולו יחשבהו לצדיק ואעפ\"כ הוא רשע."},{"passage_id":"devurim_704d8be1_p21","passage_content":"קודם שנבוא לבאר הענין נקדים קושיא גדולה, שתמהו עלי' כל הראשונים והאחרונים, והוא כיון דנצטוו ישראל במ\"ע למנות להם מלך, וכן מוסכם בגמ' ורוב הפוסקים והרמב\"ם מכללם, וא\"כ למה האשים שמואל הנביא את ישראל על ששאלו מלך, כמ\"ש (שמואל א' ח') וירע הדבר בעיני שמואל כאשר אמרו תנה לנו מלך לשפטנו וגו', ועוד אמר (שמואל א' י\"ב) ודעו וראו כי רעתכם רבה אשר עשיתם בעיני ד' לשאול לכם מלך, הלא לפי הנראה שאלו כהוגן וכמצות התורה עליהם, ורבו הדיעות והתירוצים בענין זה כאשר נבאר קצתם להלן בע\"ה."},{"passage_id":"devurim_704d8be1_p22","passage_content":"והרמב\"ם ז\"ל בה' מלכים (פ\"א ה\"ב) הקשה ג\"כ קושיא זו וז\"ל, מאחר שהקמת מלך מצוה, למה לא רצה הקב\"ה כששאלו מלך משמואל, ותירץ לפי ששאלו בתרעומת, ולא שאלו לקיים את המצוה, אלא מפני שקצו בשמואל הנביא, שנא' לא אותך מאסו כי אותי מאסו וכו' עכ\"ל, אבל באמת אינו נמצא טעם זה בפסוקים, שנא' וירע הדבר בעיני שמואל כאשר אמרו תנה לנו מלך לשפטנו, ובפ' שלאחרי' כתיב ודעו וראו כי רעתכם רבה אשר עשיתם בעיני ד' לשאול לכם מלך, משמע דעיקר החטא הי' על ששאלו מלך, ולפי טעם הרמב\"ם ז\"ל העיקר חסר מן הספר, ואדרבה הפסוקים מורים להיפך, כי על עצם שאלת המלך הי' הקצף, וכן הקשה האלשיך הק'."},{"passage_id":"devurim_704d8be1_p23","passage_content":"בגמ' סנהדרין (דף כ' ע\"ב) תניא ר\"א אומר זקנים שבדור כהוגן שאלו, שנאמר תנה לנו מלך לשפטנו (שמואל א' ח') אבל עמי הארץ שבהן קלקלו, שנא' והיינו גם אנחנו ככל הגוים וכו', עכ\"ד הגמ' ראוי להבין דא\"כ לא הי' ראוי לומר וירע הדבר בעיני שמואל על דברי הזקנים כי אם אחר פסוקי ההמון האמור אח\"כ, והיינו גם אנחנו ככל הגוים, ועוד כי גם מה שאמרו ככל הגוים אין זה רע, כי הלא המה דברי התורה, שנא' אשימה עלי מלך ככל הגוים אשר סביבותי, וב' קושיות אלו הקשה ג\"כ האלשיך הק', ועוד שא\"כ הול\"ל וירע בעיני שמואל כאשר אמרו תנה לנו מלך לשפטנו ככל הגוים, אבל כפי שנאמר בפסוק תנה לנו מלך לשפטנו הם דברי זקנים, משמע דגם דבריהם הורע בעיניו."},{"passage_id":"devurim_704d8be1_p24","passage_content":"ויש שנתנו טעם דחטאם הי', אע\"ג דהקמת מלך מצוה אבל בחייו של שמואל לא הי' להם לשאול, וזה הי' פגיעה בכבוד שמואל הנביא, וטעם זה כתב גם הרמב\"ן ז\"ל בפ' ויחי, אמנם גם על טעם זה קשה, דהרי כל מצות המלך ע\"ד כן נאמרה שיהי' עפ\"י נביא, כמ\"ש בספרי אשר יבחר ד' אלקיך בו עפ\"י נביא, הרי דגם כשיש נביא אמת נוהג מצוה זו, והתורה לא חילקה בין נביא לנביא, וק\"ז הייטב לב זלל\"ה האריך בענין זה, וז\"ל בקיצור, הרבה תירוצים נאמרו ע\"ז, והיותר נוח לקבל הן דברי מהר\"י ז\"ל בעקידה, שכתב שאמרו שלא כהוגן שימה לנו מלך לשפטנו, והמשפט לאלקים הוא ר\"ל להדיינים, ואין זה נוגע למלך, ובפרט שהוא דבר הנוגע אל כבודו של שמואל, כי הוא הי' השופט בימים ההם וכו'."},{"passage_id":"devurim_704d8be1_p25","passage_content":"אולם גם על טעמו של בעל העקידה תמה ק\"ז זלל\"ה, במה שגזר אומר כי ענין משפט לא שייך למלך, דהלא מצינו בדוד ויהי דוד עושה משפט וכו', ובשלמה כתיב אז תבואנה שתי נשים וכו', ובתהלים משפטיך למלך תן וכו' ועוד הרבה פסוקים, ולבסוף כתב הוא ז\"ל טעם, כי הי' כוונתם בלתי רצוי', ולא לתכלית המועיל, כי אם למען שיהי' להם לכבוד ולתפארת בעיני העמים, שגם הם כיתר העמים אשר יש להם מלך עייש\"ד, אבל גם טעם זה צ\"ב כיון דסוף סוף הקמת מלך מצוה, הרי קיימו מצות עשה שבתורה, אלא שעשו אותה שלא לשמה, ומדוע חרה אפו של שמואל בהם, והלא העושה מצוה להתכבד בו אין זה מעשה רע, אדרבה הרי אמרו חז\"ל (פסחים דף נ' ע\"ב) לעולם יעסוק אדם בתומ\"צ אע\"פ שלא לשמה שמתוך שלא לשמה בא לשמה."},{"passage_id":"devurim_704d8be1_p26","passage_content":"ואפשר לתת טעם ולהסביר כל הענין, דהנה בפסוק נאמר שום תשים עליך מלך אשר יבחר ד' אלקיך בו, ובתרגום יונתן פי', תתבעון אולפן מן קדם ד', ומבתר כדין תמנון עליכון מלכא, דאין מעמידין מלך אלא א\"כ שואלין בנביא תחלה, וכן מבואר בספרי, וכ\"כ הרמב\"ם ז\"ל להלכה (פ\"א מהל' מלכים ה\"ג) אין מעמידין מלך בתחלה אלא עפ\"י ב\"ד של ע\"א ועפ\"י נביא, ואפשר שזה כוונת הכפל, שום תשים עליך מלך, שתהא שימה מאת הנביא ובהסכמת סנהדרין תחלה, ואח\"כ תשים עליך מלך."},{"passage_id":"devurim_704d8be1_p27","passage_content":"וחקרתי לדעת, דלפי\"ז בבית שני שכבר פסקה נבואה, ולא הי' אפשר להעמיד מלך עפ\"י נביא, א\"כ לא תהי' נוהג מצות הקמת מלך כלל, או אפשר דהחיוב להעמיד מלך עפ\"י נביא, אינו אלא כ\"ז שלא פסקה הנבואה מישראל, אבל לאחר שפסקה הנבואה, אפשר דעדיין הקמת מלך מצוה, או אפשר דעיקר המצוה רק ע\"י נביא, ובזמן שאין נביא, כל ענין הקמת מלך רשות ולא מצוה."},{"passage_id":"devurim_704d8be1_p28","passage_content":"והנה קצתו אפשר להכריע מדברי הרמב\"ן ז\"ל עה\"ת, שהקשה כיון דמצות התורה להעמיד מלך רק עפ\"י נביא ואשר יבחר ד' אלקיך בו, א\"כ מה טעם הכתוב להזהיר, לא תוכל לתת עליך איש נכרי אשר לא אחיך הוא, והרי השם לא יבחר בעובדי כוכבים, ולא יסכים הנביא בשם ה' למנותו, ואזהרה זו למה, ותירץ כי בדעת רבותינו יש בכתוב הזה תנאי נסתר, וכה יאמר שום תשים עליך מלך שיבחר השם בו עפ\"י נביא, אם תוכל לעשות כן שיענך ד' בנביאים, אבל איש נכרי לא תוכל לתת עליך לעולם עכ\"ד הרמב\"ן ז\"ל."},{"passage_id":"devurim_704d8be1_p29","passage_content":"נמצא לפי\"ד דאזהרת לא תוכל לתת עליך איש נכרי, נאמרה על הזמן אחר שפסקה הנבואה מישראל, ופשוט מיהא פלגא, שעדיין ענין הקמת מלך נוהגת, אולם אין הכרע בדברי הרמב\"ן ז\"ל אם הוא מצוה או רשות בזמן שאין נביא, ובאמת אין זה נפק\"מ לדינא, כי מה דהוה הוה, ואין בזה נפק\"מ אפי' הלכתא למשיחא, כי לעתיד יחזור הנבואה לישראל, ואז יהי' הקמת המלך עפ\"י נביא."},{"passage_id":"devurim_704d8be1_p30","passage_content":"עכ\"פ מבואר מכל הנ\"ל דבזמן שיש נביא אין ממנין מלך אלא אם כן שאלו בנביא תחלה, וכמ\"ש התרגום יונתן תתבעון אולפן מן קדם ד', ובתר כן תמנון, והנה במס, ברכות (נ\"ה ע\"ב) א\"ר יוחנן ג' הקב\"ה מכריז עליהן בעצמו, ואלו הן רעב ושובע ופרנס טוב, ויליף להו כולהו מקראי, פרנס טוב מנין, דכתיב ויאמר ד' אל משה ראה קראתי בשם בצלאל וכו', עוד למדו שם מפסוק זה, א\"ר יצחק אין מעמידין פרנס על הצבור אא\"כ נמלכין בצבור, שנא' ראו קרא ד' בשם בצלאל וכו', א\"ל הקב\"ה למשה, לך אמור לישראל הגון עליכם בצלאל ע\"כ, וכבר ביארנו בדברינו (פ' חקת), דזה הי' טענת קורח שערער על משה רבינו, מפני שמינה את אהרן ואת אליצפן עפ\"י נבואה לבד, ולא הי' נמלך בצבור כלל, ובאמת לא הי' אפשר במינוים אלו להימלך בצבור ולמנות עפ\"י רוב דיעות הממנים, כי א\"א לצרף למנין הרוב רק אותן שאומרים דעתן לש\"ש בלי נגיעה, כמבואר ברמ\"א (חו\"מ סי' קס\"ג) וז\"ל כל צרכי צבור שאינן יכולים להשוות עצמן ילכו אחר הרוב, ויקבלו עליהם שכל א' יאמר דעתו לש\"ש, ומטילין חרם ע\"ז וכו' ע\"כ ברמ\"א ז\"ל, ועוד כמה ראיות ע\"ז מובא בדברינו שם, ולפי\"ז כל הענין דנמלכין בצבור אינו בירור גמור, כי אין בידינו להבחין בדעת הבוחרים אם כוונתן לש\"ש, ואולי אין כאן רוב מאותן האומרים דעתם לש\"ש, אלא בלית ברירה סמכינן על דעת הרוב, כשאי אפשר למנות עפ\"י נביא, וע\"כ כיון שראה משרע\"ה במחלוקת קרח שרובם יש להם נגיעה, ומבקשים גדולה ושררה לעצמן, כ\"כ לא הי' נמלך בצבור, כי א\"א לצרף דעתם למנין הרוב, ועשה עפ\"י נבואה לבד, ובמנוי בצלאל הי' צווי הקב\"ה לימלך בישראל, כי לא הי' להם נגיעה במנוי זה, ודעת הרוב הי' בירור גמור, ואע\"פ שנתברר התמנותו ע\"י נבואה, צוה ד' להיות נמלכים בצבור להורות הלכה זו דצ\"ל נמלכים בצבור."},{"passage_id":"devurim_704d8be1_p31","passage_content":"וכמו\"כ בהתמנות שאול המלך, שהי' צווי ד' אל שמואל הנביא שמע בקולם והמלכת עליהם מלך, (שמואל א' ח') ולא צוהו להיות נמלכים בצבור, כי ראתה חכמתו ית' שאין לסמוך על דעת הצבור בהתמנות זו, כי הי' כוונתם רעה כמו שנבאר להלן, ואפשר שלא יהי' רובם דעתם לש\"ש, ע\"כ צוה ד' למנותו עפ\"י נביא לבד, ואח\"כ כשכבר נתמנה עפ\"י נביא, ובני בליעל ביזוהו וערערו עליו, אבל רוב ישראל היו שווין בדעתם לש\"ש כמו שנבאר להלן, אז צוה הקב\"ה לקבץ את כל העם לחדש את המלוכה מדעת העם."},{"passage_id":"devurim_704d8be1_p32","passage_content":"ואפשר דבזמן דאיכא נביא ואפשר לבחור עפ\"י נביא, הנבואה מכרעת יותר מדעת הצבור, כי הנבואה הוא בירור גמור משא\"כ נמלכין בצבור אינה בירור גמור כנ\"ל, אבל לאחר שפסקה הנבואה וא\"א למנות עפ\"י נביא, אז מצות התורה עלינו להיות נמלכים בצבור, ואם יאמרו דעתם לש\"ש, ויבחרו מלך הראוי עפ\"י דיני התורה, וילכו אחר הרוב כמצות התורה אחרי רבים להטות, אז הקב\"ה מסייען להשיג דעת עליון, ויבחרו במלך אשר יבחר ד' בו."},{"passage_id":"devurim_704d8be1_p33","passage_content":"נמצא ב' המימרות קיימים גם יחד, ואין סתירה ביניהם, מ\"ש רז\"ל אין מעמידין פרנס אלא אם כן נמלכים בצבור, וגם מאמר רז\"ל (ברכות נ\"ח ע\"א) אפי' ריש גרגותא מן שמיא מנו לי', ומ\"ש ג' דברים הקב\"ה מכריז עליהם בעצמו, וא' מהם פרנס טוב, דהנה אם עושין כדין ובוחרין כפי מצות התורה, אז הקב\"ה מסייען, ודעת הצבור מכוונין אל אשר יבחר ד' בו, וז\"ש הכתוב שום תשים עליך מלך, אפי' כשאתה בעצמך תשים עליך מלך לאחר שפסקה הנבואה, אבל יהי' אשר יבחר ד' אלקיך בו, כשתעשה עפ\"י התורה, אז תמנה אותו אשר יבחר ד' בו, ולהיפך ח\"ו אם בוחרים מלך שלא כדת של תורה, שלא עפ\"י נביא בזמן שיש נביא, או אם ממנים איש נכרי אשר לא אחיך הוא, ואפי' הוא ישראל, אלא שאינו אחיך במצות, נכלל בלאו זה דלא תוכל לתת עליך איש נכרי אשר לא אחיך הוא, וכמ\"ש הרמב\"ם ז\"ל (פ\"א מה' מלכים ה\"ז), וכל מי שאין בו יר\"ש, אע\"פ שחכמתו מרובה, אין ממנין אותו למינוי מן המינויין שבישראל עכ\"ל, ואפי' כל ישראל מסכימים עליו, אין עליו דין מלך כלל עפ\"י התורה, וכל האמור בפ' מלך אין נוהג בו, כי תנאי כתבה תורה במצות המלך, שום תשים עליך מלך אשר יבחר ה' אלקיך בו, ונבאר להלן, דממשמעות הכתוב נלמד, דאפי' אי עביד לא מהני, ואין במעשיהם ממש ואין לו דין מלך כלל."},{"passage_id":"devurim_704d8be1_p34","passage_content":"ויש להביא ראי' ע\"ז, מדברי התוס' סנהדרין (דף כ' ע\"ב) שכתבו דלא הי' לאחאב דין מלך, כיון שלא מלך מאת המקום עיי\"ש, ולכאורה הוא פלא, דמבואר בירושלמי דהוריות (פ\"ג ה\"ב) שעד יהוא בן נמשי יש להם דין מלך, ולאחר דורות של יהוא בלסטיות היו נוטלין אותה, ואין להם דין מלך עוד, ואחאב הי' קודם דורו של יהוא, וא\"כ עדיין דין מלך עליו, אבל נראה דעת התוס' ז\"ל, כיון שעבד ע\"ז ולא הי' עושה מעשה עמך, לא הי' רצון המקום במלכותו, וע\"כ כתבו התוס' שלא מלך מאת המקום, ועיין בספרי ויואל משה (מאמר א' סי' קל\"ג) שם הבאתי ראיות מדברי הילקוט (פ' משפטים) ומהרלב\"ג ז\"ל (מלכים א') ומדברי התומים, שמפורש בדבריהם שאחאב לא הי' לו דין מלך, מפני שלא הי' נוהג מעשה עמך."},{"passage_id":"devurim_704d8be1_p35","passage_content":"ופרשתי מאמר המובא בבעה\"ט (פ' במדבר) אין אדם נעשה שוטר מלמטה אלא א\"כ נעשה רשע מלמעלה, ולכאורה הוא פלא וכי כל שוטר בהכרח שיהי' רשע אתמהה, והלא השוטרים צדיקים היו עפ\"י הרוב, כמ\"ש בתנחומא (פרשה זו) שהם המה מקיימין המשפט בישראל, כי אם אין שוטר אין שופט וכו', וא\"כ מדוע החליטו רז\"ל שהם רשעים בהכרח, גם יל\"ד מהו הלשון מלמטה, דאין לו מובן ומיותר הוא, ואפ\"ל עפ\"י דברי האלשיך הק' (פ' שלח) עה\"פ נתנה ראש ונשובה מצרים, כי כוונת הערב רב הי' בזה, כי אם הם בעצמם ימנו אותו לראש עליהם, ולא עפ\"י הנביא במצות השם, אז יהי' משועבד להם לעשות כרצונם וחפצם, ויטה לכל אשר יחפוצו, כדרך כל ראש שנושא פנים לאשר מינה אותו, גם יחוש לעבור על דבריהם, פן יעבירו אותו מגדולתו, וע\"כ אמרו נתנה ראש ונשובה מצרימה, כי הוא בודאי יציית לנו לשוב מצרימה, לא כן משה ואהרן וכל ראש שיתמנה עפ\"י ד', לא יציית אלינו לעולם לעבור על דברי השם עכת\"ד ז\"ל."},{"passage_id":"devurim_704d8be1_p36","passage_content":"גם מצינו בגמ' יבמות (ס\"א ע\"א) על כהן גדול שמינהו המלך להיות כה\"ג, אמרו שם נתמנה לא קתני אלא מנהו, אמר רב יוסף קטיר קחזינא הכא, ופרש\"י קשר של רשעים אני רואה כאן, שלא הי' ראוי לכך, אלא שנתן ממון ומינוהו עכ\"ל, עכ\"פ נקראו קשר של רשעים ואינו מן המנין, וכל התמנות שהוא שלא עפ\"י תורה, אין עליו דין מינוי כלל, והמתמנה על ידם אין לו דין מלך או נשיא וכהן גדול, אלא שהבוי\"ת לא מנע הבחירה מבני אדם, ומניחין להם לבחור כרצונם, אבל מן השמים אין מסכימים לדעתם, ואין נותנים להנבחר בדרך זה, השפעה וסיוע להנהיג את העדה, ולבסוף נעשה רשע כי משוחד הוא להם, ולכל אשר יחפוצו יטה, ואין לו סייעתא דשמיא להנהיג את העדה ע\"ד האמת, ובהכרח נעשה רשע."},{"passage_id":"devurim_704d8be1_p37","passage_content":"ובזה יתבאר מאמר הבעה\"ט הנ\"ל, אין אדם נעשה שוטר מלמטה, ר\"ל כשמינוהו לשוטר רק מלמטה ע\"י בחירת בנ\"א, שלא עפ\"י התורה ובכוונה רעה, ואינו מן השמים רק מלמטה, אז בהכרח שנעשה רשע מלמעלה כנ\"ל, ועפ\"י רוב גם מעיקרא הי' רשע, וע\"כ לא הסכימו עליו מן השמים, כי לא הי' ראוי עפ\"י התורה.."},{"passage_id":"devurim_704d8be1_p38","passage_content":"ואפשר להבין בזה דברי רבותינו בעלי התוס' (בפ' תשא) שהוקשה להם, כיון דישראל לא לשם ע\"ז נתכוונו, כי אם להיות להם מנהיג במקומו של משה, כמש\"ה כי זה משה האיש לא ידענו מה הי' לו, א\"כ למה עשה אהרן את העגל, הי\"ל למנות להם מנהיג, כלב או נחשון עד שיבא משה רבינו, ותירצו ז\"ל, דהי' אהרן מתיירא אם ימליכוהו עליהם, כשיבוא משה ויורידוהו מגדולתו, תרבה הקטטה ביניהם ויבואו לידי שפיכות דמים, אבל את העגל כשבא משה שרפו באש ולא באו לידי קטטה, והקשו עוד, למה לא הי' אהרן עליהם לראש עד שיבוא משה, ואח\"כ ירד מגדולתו בעצמו ולא יהי' קטטה, ותירצו דהי' אהרן מתיירא שמא יקשה בעיני משה, ועוד אמר אהרן אם לא אתן עליהם ראש, הם יתנו מעצמם ויבואו לידי קטטה עכת\"ד ז\"ל."},{"passage_id":"devurim_704d8be1_p39","passage_content":"אולם עדיין צ\"ב, דסוף סוף למה הכניס אהרן את עצמו ואת כל ישראל לסכנה עצומה כזו, וכי בשביל שהי' ירא מהקפדת משרע\"ה, הלא בודאי משה רבינו לא יקפיד, כאשר יראה שעשה לטובת הצלת ישראל, גם הלא אהרן מסר נפשו בעד הצלת ישראל, ולמה השיב ידו אחור מפני יראת משה, גם הי' אפשר להמליך עליהם מנהיג צדיק אשר ירד מגדולתו כשיבוא משה, ופירשתי כיון שלא נצטוה מפי הגבורה ומפי הנביא למנות מנהיג, ועכ\"ח צריך להיות נמלכים בצבור, והי' אהרן מתיירא דלפי מדריגתם שהי' עומדים בה, והערב רב היתה כוונתם רעה, ואם הם יבחרו בעצמם מנהיג, יהי' גרוע הרבה מהעגל, לפי שהוא בעל בחירה."},{"passage_id":"devurim_704d8be1_p40","passage_content":"ולדרכנו יתבאר יותר, כיון דאהרן הי' נביא אמת, וידע שמשה רבינו לא מת, ומן השמים אין מסכימים למנות מנהיג, ואם ממנים מלמטה בלי הסכמת השי\"ת, בעל כרחך נעשה רשע, כמ\"ש ז\"ל אין אדם נעשה שוטר מלמטה עד שנעשה רשע מלמעלה, ע\"כ לא בחר להם מנהיג, דאפי' יבחר להם צדיק, יהי' מי שיהי' בע\"כ נעשה רשע, ועוד יש חשש שפיכת דמים, ע\"כ בחר יותר לעשות העגל."},{"passage_id":"devurim_704d8be1_p41","passage_content":"ומעתה יבואר כי זה הי' חטאם בימי שמואל במה ששאלו מלך, על שאמרו שימה \"לנו\" מלך, שיהי' המלך לנו, ר\"ל משועבד לנו, ואנו נבחר מעצמינו שלא עפ\"י נביא, ואז יהי' המלך שלנו, ויטה לכל אשר נחפוץ, ובזה עברו על דברי השי\"ת שצונו בתוה\"ק שום תשים עליך מלך אשר יבחר ד' אלקיך בו, ודרשו בספרי עפ\"י נביא, גם הי' כוונתם רעה שיתרצה להם המלך לכל אשר ירצו עשות, וע\"כ אמרו חז\"ל לא בקשו להם מלך אלא לעבוד ע\"ז, וזה שאמר הכתוב וירע בעיני שמואל כאשר אמרו תנה \"לנו\" מלך לשפטנו, כי זה הי' הדבר הרע, שחרה אפו של שמואל עליהם, מפני שאמרו תנה \"לנו\" מלך, שלא עפ\"י תורה ובכוונה רעה, גם הי' פגיעה בכבוד שמואל, שלא רצו למנות המלך עפ\"י נביא, וע\"כ אמר ד' לא אותך מאסו כי אותי מאסו ממלוך עליהם, כי הי' כוונתם רעה לפרק מעליהם עולו ית', ולבסוף כשעשו תשובה ואמרו כי אם מלך יהי' \"עלינו\" היינו שיהי' עלינו למשול בנו, אז בקשו עפ\"י התורה שיהי' עפ\"י נביא והוא ימשול בהם ולא יהי' משועבד אליהם, ע\"כ הסכים הקב\"ה לבקשתם שנא' ויאמר ד' אל שמואל שמע בקולם והמלכת להם מלך, ודרך זה יתפרש היטב בדברי הפסוקים ובמאמרי חז\"ל, גם אפשר להעמיס כ\"ז בדברי הראשונים ובתירוצם."},{"passage_id":"devurim_704d8be1_p42","passage_content":"ועתה מה שכתבה תורה \"ואמרת\" אשימה עלי מלך, אין זה מתנאי המצוה כי הקמת המלך מ\"ע הוא, ואין תלוי באמירתן כלל, אבל מחויבים בה בכל אופן, ואפי' אם לא יאמרו כן, וכמו שהקשינו לעיל, אולם מאמר זה אזהרה הוא לישראל, כמו כי תאמר בלבבך, ור\"ל פן תאמר אשימה עלי מלך, שאתה בעצמך תרצה לבחור לך מלך שלא עפ\"י נביא, כמו שרצו לעשות בימי שמואל, ע\"כ הזהירה התוה\"ק שום תשים עליך מלך אשר יבחר ד' אלקיך עפ\"י נביא."},{"passage_id":"devurim_704d8be1_p43","passage_content":"ולדרכנו יתורץ קושיתנו הנ\"ל, מדוע כתבה תורה הצווי בלשון לא תוכל לתת עליך איש נכרי, הול\"ל לא תתן עליך איש נכרי, אלא שלא תאמר הואיל ונבחר מלך זה מדעת הצבור ועפ\"י רוב ישראל, ע\"כ יסכים הקב\"ה אל הרוב, כמ\"ש בב\"מ (דף נ\"ט ע\"ב) בתנורו של עכנאי, שאמר הקב\"ה נצחוני בני, והסכים הקב\"ה לדעת הרוב עיי\"ש, אולם אם הרוב נוטים מדעת התורה, אז קשר רשעים הוא ואינו מן המנין, ואין זה רוב שאמרה תורה לילך אחריו, וכמ\"ש בגמ' סנהדרין (דף כ\"ו ע\"א) גבי חזקי' ושבנא, הוי מסתפי חזקי' אמר דלמא ח\"ו נטי' דעתי' דקוב\"ה בתר רובא וכו', בא נביא ואמר לו לא תאמרון קשר, לכל אשר יאמר העם הזה קשר, כלומר קשר רשעים הוא ואינו מן המנין, ופרש\"י אל תחשוב שיהא מנינו של שבנא מנין ליחשב רוב, ועיין במהרש\"א בח\"א שפי' אינו מן המנין הכוונה על הקב\"ה, שהקב\"ה לא יכנס במנין הרוב שלהם ולא יסכים עמהם, ועיין בספרי ויואל משה (מאמר א' סי' קרו) בארתי ענין זה באריכות."},{"passage_id":"devurim_704d8be1_p44","passage_content":"וע\"כ כתבה תורה לא תוכל לתת עליך איש נכרי, שלא תאמר אי עביד מהני, שאע\"פ שלא עשו כמצות התורה אעפ\"כ כיון דעביד עביד ואי עביד מהני, כמ\"ש בריש תמורה דפליגי בזה אביי ורבא, אי עביד מהני או לא, ומסקנת הגמ' דלא פליגי אלא בריבית קצוצה, ובכל התורה כולה איכא מקום דמהני ואיכא דלא מהני, וכאן הי' סברא לומר דמהני, דיסכים הקב\"ה לדעת הרוב, ע\"כ כתבה תורה לא תוכל לשון שלילה, לומר שהיא מן הנמנע, שתתן עליך איש נכרי, וכל מעשיך לא יועילו כלום, ואין לו דין מלך כלל לשום דבר, כי כן רצון הבוי\"ת שדעת התורה יכריע על דעת הרוב שאינו עפ\"י התורה, ואפי' אם כל ישראל ימנו מלך שלא עפ\"י נביא ושלא עפ\"י תורה, לא יועילו במעשיהם כלום, ומעתה לא יספיק הכתוב לומר לא תתן עליך איש נכרי, שאז הי' אפ\"ל דאי עביד מהני, ע\"כ כתבה תורה בלשון שלילה דאינו במציאות ואין לו דין מלך כלל."},{"passage_id":"devurim_704d8be1_p45","passage_content":"וראי' לפירוש זה מצאתי בספרי (פ' תצא) לא יוכל לבכר את בן האהובה וגו', מלמד שאינו רשאי לבכר, יכול לא יהי' רשאי לבכר, ואם בכר יהי' מבוכר, ת\"ל לא יוכל לבכר, הא אם בכר אינו מבוכר ע\"כ בספרי, וכמו\"כ כאן כוונת הכתוב להורות דאי עביד לא מהני ולא יועילו במעשיהם כלום."},{"passage_id":"devurim_704d8be1_p46","passage_content":"עוד נרמז במה ששינה הכתוב לכתוב לא תוכל במקום לא תתן, להורות כי אם תבקש לעשות רצונו ית', ולמנות מלך עפ\"י מצות התורה ואשר יבחר ד' בו, אז לא יעלה אפי' בדעתך ליתן עליך איש נכרי, או אשר לא אחיך הוא במצות, ואם יעלה בדעתך למנות שלא עפ'\"י תורה, או להשתתף בבחירות שהם כנגד התורה ולמנות עוברי עבירה, תדע שמעשיך אינם רצוים למקום, וצריך אתה להתבונן עליהם ולהטיב מעשיך, כי אלמלא הי' מעשיך רצויים, לא הי' עולה אפי' בלבך רעיון זה לתת עליך איש נכרי אשר לא אחיך במצות, כי מנוי זה יש בכוחו להשחית הרבה, ולגרום העברת הדת, ועל הכלל כולו יצא, וכתבה תורה זה למבחן, כי בזה תוכל לבחון את לבבך, ומדריגתך אשר אתה עומד בה, וזהו הפי' שום תשים עליך מלך אשר יבחר ד', ואם אתה רוצה לעשות כפי אשר יבחר ד' ולעשות רצונו ית', אז לא תוכל לתת עליך איש נכרי, לא יהי' בכוחות נפשך מציאות לזה."},{"passage_id":"devurim_704d8be1_p47","passage_content":"עוד ירמוז הכתוב, שאם תבקש האמת לעשות כדת של תורה, ולמנות את אשר יבחר ד' בו, אז מן השמים יסייעוך ולא תכשל ולא תשגה ליתן עליך איש נכרי אשר לא אחיך הוא במצות, כי אע\"פ שאין הקב\"ה מונע הבחירה מבני אדם, אבל הבא לטהר מסייעין אותו, ולא תוכל לתת עליך איש נכרי, כי יסייעו אותך מן השמים שלא תכשל."},{"passage_id":"devurim_704d8be1_p48","passage_content":"ויבואר מאמר הכתוב לבלתי רום לבבו מאחיו ויתורצו הדקדוקים שהבאנו לעיל (קושיא י\"ט), דלהלן נאמר וכתב לו את משנה התורה וגו' והיתה עמו וקרא בו כל ימי חייו, ופי' החתם סופר זלל\"ה, דכל קורות ימי חייו יקרא בתורה עכ\"ד ז\"ל, והתוה\"ק מזהיר למלך שיתנהג עפ\"י התורה, ומלכותו תלוי' בזה, כי באם לאו לא יבחר ד' בו, ואין הקב\"ה מסכים לממלכתו, ואין נותנים לו השפעה מן השמים, ואין לו דין מלך כמבואר לעיל, וזה מאמר הכתוב לבלתי רום לבבו \"מאחיו\", שלא יתגאה בלבבו לחשוב, כיון שאחיו המליכוהו, ודעת רוב ישראל מסכימים עמו, יתקיים במלכותו בהחלט, ואף אם אינו מתנהג עפ\"י התורה, ע\"כ הזהיר עליו הכתוב שלא יאמר כן, כי אין דעת הרוב מכריע כלל נגד דעת התוה\"ק, אלא והיתה עמו וקרא בו כל ימי חייו למען ילמד ליראה את ד' וגו', ורק אז יתקיים במלכותו, כמ\"ש ולמען יאריך ימים על ממלכתו הוא ובניו וכו'."},{"passage_id":"devurim_704d8be1_p49","passage_content":"ואפשר לרמוז בכתוב עוד עפי\"מ שכתב רש\"י ז\"ל (פ' ויצא) עה\"פ ויאמר יעקב לאחיו, הם בניו שהי' לו אחים ניגשים אליו לצרה ולמלחמה, וזה מאמר הכ' לבלתי רום לבבו מאחיו, שאל יבטח בלבו על אחיו לצרה, שיעזרוהו בעת צרתו, ואל יחזק את לבבו לאמר שע\"י אוהביו ואחיו, תתחזק המלוכה בידו ויתגבר על שונאיו, ע\"כ הזהירה אותו התוה\"ק שלא יחשוב כן, אלא לבלתי סור מן המצוה ימין ושמאל, ואז יאריך ימים על ממלכתו הוא ובניו וגו', ורק לד' הישועה ויאריך על ממלכתו רק ע\"י שמירת התוה\"ק, וכל אוהביו לא יועילו כלום אם מד' יסור את לבבו."},{"passage_id":"devurim_704d8be1_p50","passage_content":"ואפשר לפרש מ\"ש הכתוב ולבלתי סור מן המצוה ימין ושמאל, והדקדוקים נפרטו לעיל (קושיא י\"ח), ויובן עפ\"י מ\"ש רז\"ל, עה\"פ וכל צבא השמים עומד עליו מימינו ומשמאלו (מלכים א' כ\"ב) וכי יש שמאל למעלה, והלא נאמר ימין ד' רוממה ימין ד' עושה חיל וכו', אלא אלו מיימינים ואלו משמאילים, מיימינים מלמדים זכות, משמאילים מלמדים חובה, עכ\"ל רש\"י ז\"ל, והנה מלך ישראל ומנהיגי ישראל צריך שיהי' בהם ב' מידות הללו, שיהיו מוכיחים את העם ומלמדים חובתם בפניהם, ויהיו גודרי גדר ועומדים בפרץ, ולא יחניפו להם להצדיק מעשיהם בעיניהם, כי זה גורם לחורבן ותקלה גדולה, כמו שהי' בימי נביאי הבעל ובימי חורבן בהמ\"ק, שנאמר נביאיך חזו לך משאות שוא ולא גילו על עונך וכו', וזה גרם לחורבן בית אלקינו, וכלפי שמיא צריכים ללמד זכות על ישראל, וכמבואר במדרש רבה (דברים א') שאמר הקב\"ה כביכול, משה הוכיחני אחר ישראל, והוכיח לישראל אחרי, לישראל אמר אתם חטאתם, להקב\"ה אמר למה ד' יחרה אפך בעמך וכו' עכ\"ד המדרש."},{"passage_id":"devurim_704d8be1_p51","passage_content":"אבל מנהיגים לא טובים מהפכים הסדר, וע\"י שמחניפין בעיני העם, ומלמדים זכותם בפניהם, ואינם מוכיחין אותם, ממילא מעוררין עליהם קטרוג למעלה, ונמצא עליונים למטה, לימוד זכות שצריך להיות למעלה, הם אומרים אותו למטה לפני העם, ותחתונים למעלה, הזכרת עונותיהם שצ\"ל למטה נעשה למעלה ר\"ל, וזהו מאמר הכתוב ולבלתי סור מן המצוה ימין ושמאל, שמצווה המלך על ב' דברים אלו, שהם ימין ושמאל, להיות מלמד זכות כלפי שמיא, ולהוכיחם על פניהם, אבל אל יסור ממנה להפך הסדר, ואז יאריך ימים על ממלכתו וגו'."},{"passage_id":"devurim_704d8be1_p52","passage_content":"ועפי\"ז אפשר להבין הפסוקים מ\"ש באבשלום (שמואל ב' ט\"ו) ויאמר אבשלום מי ישימני שופט בארץ ועלי יבוא כל איש אשר יהי' לו ריב ומשפט והצדקתיו וגו' ויגנב אבשלום את לב אנשי ישראל, והנה ראוי לשים לב, איך יתכן שכל הבא לפניו יצדיקהו, האם אפשר לזכות שטרא לבי תרי, ואם אחד יצדק עכ\"ח שכנגדו יתחייב, ורש\"י ז\"ל תיקן זה במקצת, ופי' עפ\"י התרגום ואדינני' בקושטא, והצדקתיו פירושו שאעשה לו משפט צדק, אבל א\"כ קשה איך גנב עי\"ז את לב בנ\"י, שהרי דוד עשה צדקה ומשפט כאשר העידו הפסוקים עליו, וידעו כל ישראל בו, וד' עמו, וא\"כ מאי רבותי' יותר שעי\"ז גנב את לב בנ\"י, וכי האמינו לו שהוא ישפוט בצדק יותר מדוד אביו."},{"passage_id":"devurim_704d8be1_p53","passage_content":"ואפ\"ל עפ\"י מ\"ד במשנה אבות (פ\"א מ\"ח) כשיהיו בעלי דינים עומדים לפניך יהיו בעיניך כרשעים, וכשנפטרים מלפניך יהיו בעיניך כצדיקים כשקבלו עליהם את הדין, וכתב התוס' יו\"ט אבל שניהם צדיקים לא, שא\"כ יחפש בטענותיהם וידין כל אחד לכף זכות, ולא ירד לאמיתת הדין עכ\"ל, אולם אבשלום אמר ועלי יבוא כל איש אשר יהי' לו ריב והצדקתיו, ר\"ל יהי' בעיני כצדיק, ואין הכוונה שאצדיקנו בדינו, כי א\"א לזכות שטרא לבי תרי, אלא אפי' יהי' חייב בדינו, יהי' בעיני כצדיק ואהפך בזכותו, ובזה גנב אבשלום את לב אנשי ישראל, כיון שהחניף להם ועשאן כולם צדיקים, ע\"כ אהבו אותו, כי בטבע העם מרוצים לדברי חנופה כאלה, ומחשבים גם אותו לצדיק מדה כנגד מדה, ומחניפים לו כדרך שהוא מחניף להם."},{"passage_id":"devurim_704d8be1_p54","passage_content":"ומעתה יבואר מימרא דגמ' נידה (דף ל' ע\"ב) הנ\"ל שמשביעין את העובר במעי אמו תהי צדיק ואל תהי רשע, ואפי' כל העולם כולו אומרים לך צדיק אתה הי' בעיניך כרשע (עיין קושיא כ' לעיל) ולדרכנו יבואר כי כשכל העולם כולו אומרים עליך צדיק אתה, אין זה כ\"א ע\"י חנופה, שאתה מצדיק את כל העולם כולו בפניהם, ע\"כ מחניפים גם לך, ואומרים עליך צדיק אתה, ע\"כ הי' בעיניך כרשע, כי זה סימן שאתה רשע ומעשה חנופה בידך, כי לצדיק אמת יש עליו חולקים, והסט\"א והקליפות והערב רב מחרחרים עליו ריב, וא\"א שכל העולם כולו יאמרו עליך צדיק אתה אלא באופן הנ\"ל, וע\"כ הי' בעיניך כרשע."},{"passage_id":"devurim_704d8be1_p55","passage_content":"ובזה יבואר מ\"ש רז\"ל (בסוטה מ\"א ע\"ב) א\"ר אלעזר כל אדם שיש בו חנופה, אפי' עוברין שבמעי אמן מקללין אותו, שנא' (משלי כ\"ד) אומר לרשע צדיק אתה יקבהו עמים יזעמוהו לאומים, ואין לאום אלא עוברין עכ\"ד הגמ', ולכאורה למה דוקא על עבירה דחנופה מקללין אותו העוברין שבמעי אמו, ולא על עבירות אחרות החמורות יותר, ואפשר על כי משביעין אותם במעי אמן, אפי' כל העולם כולו אומרים עליך צדיק אתה הי' בעיניך כרשע, ומציאות מאמר זה הוא רק ע\"י חנופה כאשר בארנו, ומרגישים בהפסד שאפשר לצמוח ע\"י חנופה, להטעות את כל העולם ולעשות אותם צדיקים, וזה גורם להמנע מהם דרכי התשובה וע\"כ מקללין את המחניף כשעודן במעי אמן, כי משיגין כבר את הנסיונות והצער שיגרם לעולם על ידו, אבל בשאר עבירות אינם מרגישין עדיין בנסיונות הדור, רק בעבירה זו דחנופה בלבד, כיון שמשביעין אותן עליו, ע\"כ הם יודעים בהפסידה ומקללין את החונף."},{"passage_id":"devurim_704d8be1_p56","passage_content":"ונחזור לבאר מאמר הכתוב לא תסור מן הדבר אשר יגידו לך ימין ושמאל, ודברי הספרי והירושלמי הנ\"ל, דנראה כחולקין זע\"ז, ולכאורה שניהם מקרא א' למדו, ואיך נשמע מפסוק א' דבר והיפוכו, ונראה דאפשר להשוותן ולא פליגי אהדדי כלל, ודברי שניהם נלמד מקרא, ונקדים מ\"ש בכלי יקר, טעם על דרשת חז\"ל שאפי' אומר לך על ימין שהוא שמאל תשמע לו, ולכאורה קשה להבין מדוע צותה התורה ככה, לשמוע להוראת ב\"ד הגדול, אפי' אם אומרים דעתם היפך המקובל לנו, וכמ\"ש בגמ' (סנהדרין דף פ\"ח) אפי' הוא אומר מפי הקבלה, וב\"ד הגדול אומרים מפי הסברא כך הוא בעינינו, נהרג אם לא שמע להם, וראוי לשים לב ע\"ז, ותו\"ד לתרץ, בהקדם מ\"ש חז\"ל (חגיגה ג' ע\"ב) שמא יאמר אדם הואיל והללו מטהרין והללו מטמאין הללו אוסרין והללו מתירין, האיך אני לומד תורה מעתה, ת\"ל נתנו מרועה א', א-ל א' נתנן וכו', אף אתה עשה אזנך כאפרכסת וכו', וקשה הלא הדרא קושיא לדוכתא, וסוף סוף האיך אני לומד תורה."},{"passage_id":"devurim_704d8be1_p57","passage_content":"וביאור הדבר, שבכל דבר טומאה וטהרה, יש כמה פנים לטמאו וכמה פנים לטהרו, ואם התורה טהרתו, הוא מפני שהצדדים המראים פני טהרה, הם מרובים יותר מהסברות המראים פני טומאה, והוא הדין בדבר אסור ומותר וכשר ופסול, ומטעם זה אמרו רז\"ל סנהדרין (דף י\"ז ע\"א) שאין ממנין לסנהדרין עד שיודע לטהר השרץ מן התורה, וטעמו של דבר שאם לפעמים צריכים להוראת שעה, לפסוק נגד התורה משום עת לעשות לד' הפרו תורתך, אז יכול החכם או הנביא, לצרף לסברת עת לעשות, אותן מיעוט הסברות שכבר נדחו מחמת הרוב, ולילן אחר המיעוט, כהוראת אלי' בהר הכרמל, אבל אם אין החכם או הנביא יודע שום סברא אל ההיפך, אז לעולם לא יוכל לטהרו אפי' בהוראת שעה, וכן אם הב\"ד שלמטה פוסקים טהור על דבר שהוא טמא מן התורה, הואיל שיש סברות גם לטהרו, ע\"כ סמוך רובא של ב\"ד שלמטה שהסכימו לטהרו, אל מיעוט סברות שיש בלא\"ה לטהרו, ואיתרע רובא של טומאה, כי נתן ד' כח לב\"ד של מטה לעשות סברות לכאן ולכאן, ונתרבו הסברות הנוטין לטהרה וכו', ומטעם זה ראוי לקבל מהם, אפי' אומרים על ימין שהוא שמאל וכו', מצד אותן הסברות הנוטין גם לצד שמאל עכת\"ד."},{"passage_id":"devurim_704d8be1_p58","passage_content":"ונקדים עוד דברי הריטב\"א ז\"ל בערובין (דף י\"ג ע\"ב) על מ\"ש רז\"ל שם או\"א דברי אלקים חיים, וז\"ל הריטב\"א שאלו רבני צרפת ז\"ל, האיך אפשר שיהיו או\"א דא\"ח, זה אוסר וזה מתיר, ותירצו כי כשעלה משה למרום, הראו לו על כל דבר ודבר מ\"ט פנים לאיסור ומ\"ט פנים להיתר, ושאל להקב\"ה ע\"ז, ואמר שיהא מסור לחכמי ישראל שבכל דור ודור, ויהי' הכרעה כמותם ע\"כ, ורש\"י ז\"ל בכתובות (דף נ\"ז ע\"א) הסביר ענין זה, דאלו ואלו דברי אלקים חיים, וז\"ל דכי פליגי תרי אמוראי בדין, או באיסור והיתר, כל חד אמר הכי מסתבר טעמא, אין כאן שקר, וכל חד סברא דידי' קאמר, מר יהיב טעמא להיתירא, ומר יהיב טעמא לאיסורא, מר מדמי מילתא למילתא הכי, ומר מדמי לי' בענינא אחרינא, ואיכא למימר אלו ואלו דברי אלקים חיים, דזמנין דשייך האי טעמא, וזמנין דשייך האי טעמא, שהטעם מתהפך לפי שנוי הדברים בשינוי מועט עכ\"ל, עכ\"פ מבואר בדברי רש\"י ז\"ל, עצם סברת הכלי יקר, דנתנה תוה\"ק כח לחכמי הדור לדון כסברתם, ולדחות סברות החולקים, ויהי' הלכה כמותם, כי זה המכוון בדברי רז\"ל שאמרו אד'א דא\"ח, אבל בלי סברא א\"א אפי' לחכמי הדור להכריע נגד המקובל."},{"passage_id":"devurim_704d8be1_p59","passage_content":"ומעתה מ\"ש בספרי אפי' אומר לך על ימין שהוא שמאל שמע להם, וכן מ\"ש בגמ' סנהדרין הנ\"ל, אפי' הוא אומר מפי הקבלה, וב\"ד הגדול אומרים מפי הסברא, נהרג אם לא שמע להם, זה מיירי כשיש סברא לכאן ולכאן ויש ימין ושמאל, ואז אע\"פ שנראה בעיניך, שסברתך הוא ימין וקרובה יותר אל האמת, צותה עלינו התוה\"ק, שסברת הב\"ד מכרעת, ואתה מחויב לשמוע לדבריהם, אע\"פ שנראה בעיניך שהוא שמאל, ואפי' אם רוב הסברות נוטים היפך מדבריהם, אבל כיון שעכ\"פ מיעוט הסברות נוטים אל דבריהם, סמוך רובא של הב\"ד למיעוט הסברות, והו\"ל רובא כדברי הכלי יקר ז\"ל."},{"passage_id":"devurim_704d8be1_p60","passage_content":"אבל אם אין להם לב\"ד הגדול סברא להחזיק דבריהם, אין בכוחם לחלוק על המקובל אצלינו, או על סברות הרוב שכבר נפסק להלכה על פיהם, ומזה מיירי הירושלמי, באופן דאין בו סברא לכאן ולכאן, וב\"ד הגדול רוצה לפסוק הלכה בלי סברא, אז אין בכוחם לדחות דברי הראשונים, או הלכה המקובלת אצלינו ואין אתה מחויב לשמוע להם, וע\"כ אמרו בירושלמי שיאמרו לך על ימין שהוא ימין ועל שמאל שהוא שמאל, אבל לדחות ההלכה המקובלת אין בכוחם, כי בירושלמי מיירי שאין להם סברא לסייע דבריהם."},{"passage_id":"devurim_704d8be1_p61","passage_content":"ושניהם מפסוק א' למדו, שנא' לא תסור מן הדבר אשר יגידו לך ימין ושמאל, וכוונת הכתוב עפ\"י דרשת חז\"ל, כשיש לימין ב' סברות, ר\"ל על ימין שהוא ימין ועל ימין שהוא שמאל, וכן לשמאל ב' סברות, אז ב' הסברות אלו ואלו דא\"ח, וצותה התורה לשמוע אל הב\"ד, אפי' על ימין שהוא שמאל, וכן להיפך, אבל אם אין לך סברא אלא על ימין שהוא ימין ועל שמאל שהוא שמאל, אז א\"א לומר על ההיפך שהוא דא\"ח, כי לא נתנה התורה רשות לדון בלי סברא כלל, ובלי קבלה אמיתית, וע\"כ אל תשמע רק כשאומרים על ימין שהוא ימין ועל שמאל שהוא שמאל כי זהו סברא אמיתית ולא ההיפך."},{"passage_id":"devurim_704d8be1_p62","passage_content":"וכ\"ז לא שייך אלא בימי חכמי התלמוד, שאז הכריעו הלכות עפ\"י הסברא, ומרוחב בינתם ניתנה להם הכח, לחדש תקנות וגזירות, ולהכריע בדיני התורה עפ\"י סברתם, אבל אחר חתימת התלמוד שנתמעטו הלבבות, אין בידינו לחדש שום דבר מדעתינו, ולא להכריע בדיני התורה עפ\"י סברתינו, ומחויבין אנו לילך אחר הכרעת חכמי הש\"ס והגאונים ז\"ל."},{"passage_id":"devurim_704d8be1_p63","passage_content":"וא\"ש מה שהשמיט הרמב\"ם ז\"ל הלכה זו דאפי' אומר לך על ימין שהוא שמאל תשמע לו, ולא הזכיר לא דברי הספרי ולא הירושלמי, כי לפי מה שבארנו לעיל, לא שייך הלכה זו אלא אם הב\"ד מכריעין עפ\"י הסברא שבידם, ובימי הרמב\"ם ז\"ל לא הי' בכוחם עוד להכריע בדיני התורה מסברת דעתם, ע\"כ לא הי' נפק\"מ עוד בהלכה זו, ולא נקטי' הרמב\"ם להלכתא למשיחא, כי לעתיד יתרבה הדעת ולא יהיו עוד ספיקות בהלכה, כמ\"ש ולא ילמדו עוד איש את רעהו (ירמי' ל\"א), וא\"כ כל ענין הלכה זו לא הי' נוהג אלא לפני חתימת התלמוד, ומה דהוה הוה, וע\"כ השמיט הרמב\"ם הלכה זו."},{"passage_id":"devurim_704d8be1_p64","passage_content":"נחזור לבאר ענין מנוי השופטים שהתחלנו בו, והנה מנוי השופטים נוהג בכל זמן ואפי' בחו\"ל ולאחר החורבן, ואפי' להרמב\"ן ז\"ל דס\"ל, דבחו\"ל ובזמן הזה אין אנו חייבין במצות מנוי שופטים מן התורה, אבל כי יהי' ריב בין אנשים ויצעק המעוות בדינו, עכ\"ח יעמידו אנשים הראוים לשפוט ונגשו אל המשפט, והנה צותה עלינו התוה\"ק למנות השופטים, ע\"י שיהיו נמלכים בצבור, כמבואר בגמ' הנ\"ל דאין ממנין פרנס על הצבור אא\"כ נמלכים בצבור, וכבר בארנו לעיל דבזמן שאין נביא, ע\"כ כל מינוים שבישראל יהי' ע\"י שנמלכים בצבור."},{"passage_id":"devurim_704d8be1_p65","passage_content":"והזהירה אותנו התוה\"ק שנמנה השופטים כדת של תורה, ולכוונה טובה כדי להעמיד הדת על תילה, ואז נזכה לכוין דעת עליון, ולבחור באותו שופט אשר ד\" אלקיך נותן לך לשבטיך, כמאמר הגמ' הנ\"ל ג' דברים הקב\"ה מכריז עליהם בעצמו וא' מהם פרנס טוב, ואמרו ז\"ל אפי' ריש גרגותא משמיא מוקמי לי', אבל אם צבור הממנים, הם משוחדים ח\"ו בהעמדת השופטים בנגיעה שלא לש\"ש, אז לא יהי' להם סייעתא דשמיא, ולא יכוונו לאותם שהם ממונים מן השמים, אלא יכשלו להעמיד שופטים שאינם מהוגנים, וכמו שבארנו לעיל אין אדם נעשה שוטר מלמטה אא\"כ נעשה רשע מלמעלה, וזה עון פלילי ועונש לכל הדור וגם לממנים, כמו שאמרו ז\"ל כל המעמיד דיין שאינו הגון כאלו נוטע אשירה וכו'."},{"passage_id":"devurim_704d8be1_p66","passage_content":"וזה מאמר הכתוב שופטים ושוטרים תתן לך, ופי' בתנחומא אתה תמנה אותם, ר\"ל שיהיו נמלכין בצבור ונבחרין מדעת הקהל, וע\"כ נאמר תיבת לך, ר\"ל לדעתך, אבל תבחר שופטים כאלה אשר ד' אלקיך נותן לך, שתמנה כדין של תורה ובלי נגיעה, ורק לעשות רצונו ית', ואז תזכה לכוון רצונו ית' ותבחר באותן שהם ממונים מן השמים."},{"passage_id":"devurim_704d8be1_p67","passage_content":"ואפשר לומר דמ\"ש הכתוב ושפטו את העם משפט צדק קאי ג\"כ על הממנים, דעפ\"י הרוב ראשי העדה הם הממנים עפ\"י דעת הקהל, ולפעמים אם יהיו משוחדים בהעמדת השופטים בנגיעה שלא לש\"ש, אז לא יתחשבו עם דעת הקהל, ויבחרו בשופט גם נגד רצונם, או יכריחו את העם להסכים לדעתם, ולפעמים יבחרו בשופטים שאינם הגונים, וגורמים רעה רבה לעם, ע\"כ הזהירה תורה אל ראשי העדה הממנים, ושפטו את העם משפט צדק, שלא יעשו משפט מעוקל לעם, ולעוות משפטם נגד דעתם וטובתם, אלא יבחרו בצדק כפי דעתם, וכפי דת של תורה."},{"passage_id":"devurim_704d8be1_p68","passage_content":"ועתה נבאר שינוי הלשונות שבין פ' שופטים לפ' משפטים המובא לעיל (קושיא ח'), דהנה כתב הרמב\"ם ז\"ל בס' המורה (ח\"א פ\"ב) כי מלת פקח, לא תפול בשום פנים, אלא על ענין גלות הידיעה, כמ\"ש ותפקחנה עיני שניהם וידעו כי ערומים הם, או ויפקח אלקים את עיניה הנאמר בהגר, וכמוהו רבים, ור\"ל שנגלה להם דבר מה שלא ידעו עד הנה עכ\"ד, והנה לא מצינו בשום מקום מלה זו, מורה על חכמת התורה והשגת אלקות, אלא בכל מקום מוצאו, מורה ידיעת וגלות דברים טבעיים, כמו בפסוקים הנ\"ל, וכמ\"ש בגמ' אי פקח שמעון יטעון כך וכך, אבל מלת חכמה מורה בכ\"מ על חכמת התורה, וחז\"ל נקראו חכמים, ובלשון הגמ' חכמים אומרים, ולא אמרו פקחים אומרים."},{"passage_id":"devurim_704d8be1_p69","passage_content":"ואפ\"ל לדרכנו כי מ\"ש בפרשה זו לא תקח שוחד קאי ג\"כ על הממנים, שלא יהיו משוחדים בהעמדת השופטים, הן ע\"י שוחד ממון או שוחד דברים, או איזה נגיעה שלא לש\"ש, כי השוחד יעור עיני חכמים קאי ג\"כ על הממנים, וקראם הכ' חכמים, אפשר כי בדורות הראשונים בחרו העם בעצת החכמים, ושמו לראשי העם, אלה החכמים בחכמת התורה, והזהירה אותם התוה\"ק כי ע\"י השוחד יאבד חכמת חכמיו, ויסלפו אורחות דרכם, ויכשלו בהעמדת דיין שאינו הגון, ולא די שיעברו על דעת הצבור למנות שלא כרצונם, אלא לבסוף יעברו גם על דעת עצמם, והשוחד יעור עיניהם, ולא יכלו לראות האמת."},{"passage_id":"devurim_704d8be1_p70","passage_content":"ומ\"ש ויסלף דברי צדיקים ולא נאמר דברים המצודקים כקושיתנו הנ\"ל, אפ\"ל לדרכנו דקאי על ראשי העדה, דע\"י שהם משוחדים מסלפים דבריהם ואומרים היפך האמת, ומיראה פן לא יתקבל דבריהם על לב הצבור, תולים את עצמם באילן גדול, ומלבישים דבריהם בדברי צדיקים אמיתיים, נמצא שמזכירים דברי צדיקים, אבל מסלפים אותם, ואומרים בהם פשטים שאינם אמת, וכ\"ז גרמת השוחד, ע\"כ הזהיר הכתוב על השוחד, כי הוא יסלף דברי צדיקים."},{"passage_id":"devurim_704d8be1_p71","passage_content":"אמנם בפ' משפטים מ\"ש שוחד לא תקח, הוא צווי על הדיינים, ואפשר דמיירי מדיינים שנתמנו ע\"י שוחד, ע\"כ קראם הכתוב פקחים ולא חכמים, כי לא היו ראויים לאותו אצטלא, ואין בהם מחכמת התורה, אלא שנתמנו ע\"י שוחד, ויש בהם פקחות מידיעת הטבעיות, והזהירה התורה אותם, שלא יקחו שוחד כי השוחד יעור פקחים, והפקחות ג\"כ יאבד מהם, כמאמר הגמ' (כתובות ק\"ה) כל מי שלוקח שוחד אינו נפטר מן העולם בלא טירוף הדעת, ובזה יובן שנוי הלשונות שאמר שם ושוחד לא תקח, דאיסור שוחד התחיל בו עוד קודם קיחה, דנתמנה ע\"י שוחד, ושרשו מעבירה זו, ונקרא ע\"ש העבירה, ע\"כ הקדים הכתוב שם שוחד קודם קיחה, אבל כאן קאי האזהרה על הממנים, שלא יקחו שוחד במנוי הדיינים כנ\"ל, וע\"כ אמר לא תקח שוחד, דע\"י הלקיחה יהי' נקרא שוחד, דמטבע השוחד, להיות משחד לוקחי' ועל שם כך נקראת שוחד."},{"passage_id":"devurim_704d8be1_p72","passage_content":"ואפ\"ל דמ\"ש הכתוב צדק צדק תרדוף בכפל לשון, קאי ג\"כ על הממנים, שיעשו משפט צדק בהתמנות, כפי דעת הצבור וכפי דת של תורה, ויבחרו דיינים הגונים שישפטו את העם בצדק, וא\"כ ירדפו בזה ב' צדקות, שיבחרו בצדק בלי נגיעה, וג\"כ יגרמו לעשות משפט צדק ע\"י הדיינים."},{"passage_id":"devurim_704d8be1_p73","passage_content":"ולדרכנו יתבאר קישור הכתוב צדק צדק תרדוף למען תחי' וירשת את הארץ וגו', (עיין לעיל קושיא י\"ב), ונקדים מ\"ש בזוה\"ק פ' ויקהל (דף קצ\"ח) וז\"ל א\"ר אבא כתיב מן היום אשר הוצאתי את עמי את ישראל ממצרים לא בחרתי בעיר מכל שבטי ישראל ואבחר בדוד וגו', האי קרא לאו רישי' סיפא ולאו סיפא רישי', דכתיב לא בחרתי בעיר ואבחר בדוד, מאי האי עם האי, ואבחר בירושלים מבעי' לי', אלא כד קוב\"ה אית רעותא קמי' למבני קרתא, אסתכל בקדמיתא בההוא רישא דנהיג עמא דקרתא, ולבתר בני קרתא וכו', הה\"ד לא בחרתי בעיר עד דאסתכלנא בדוד, למהוי רעי' על ישראל וכו' עכ\"ל, עכ\"פ מבואר בדברי הזוה\"ק שלא בחר ד' בירושלים שישבו ישראל שמה, אלא כשיש מנהיגים טובים, שעל ידם מתנהגים ישראל בדרך הטוב, ורק בתנאי זו ירשו ישראל את הארץ, ועיין בספרי ויואל משה (מאמר ב' סי' מ\"ג) הארכתי בזה, ומבואר בטור חו\"מ (סי' א' ב') גודל מעלת משפט אמת, שמקרבת את הגאולה, שנא' שמרו משפט ועשו צדקה כי קרובה ישועתי לבוא וגו', ונאמר ציון במשפט תפדה וגו' (ישעי' א') והרבה פסוקים כמוהו, והכל רק ע\"י מנהיגי אמת, כמ\"ש שם ואשיבה שפטיך כבראשונה ויעציך כבתחלה אחרי כן יקרא לך עיר הצדק קרי' נאמנה, ולהיפך ח\"ו גורם חורבן בהמ\"ק וגלות ישראל, כמ\"ש ז\"ל במס' שבת (דף קל\"א) כל פורענות שבאה לעולם לא באה אלא בשביל דייני ישראל וכו', ואין הקב\"ה משרה שכינתו על ישראל, עד שיכלו שופטים רעים מישראל וכו'."},{"passage_id":"devurim_704d8be1_p74","passage_content":"ומעתה יתבאר קישור הפסוק על נכון, צדק צדק תרדוף, ולפי דרכנו קאי על הממנים, שימנו דיינים הגונים וצדיקים, וזה גורם הגאולה וירושת הארץ, ע\"כ אמר למען תחי' וירשת את הארץ כי זה תלוי בזה, ומעתה יתבארו גם דברי התנחומא כמ\"ש שופטים שוטרים תתן לך ולא לאוה\"ע, דהנה אמרו ז\"ל בספרי (פ' ראה) לא תעשון כן לד' אלקיכם, וכי תעלה על דעתך, שיהיו ישראל נותצין למזבחותיהם, אלא שלא תעשו כמעשיהם, ויגרמו עונותיכם ומעשיכם הרעים למקדש אבותינו שיחרב, ע\"כ בספרי, עכ\"פ מבואר דכינה הכתוב גרמת החורבן כמעשה, והזהירה עלי' בלשון עשי', ומבואר לעיל בכמה ראיות, דדיינים שאינם הגונים מעכבין את הגאולה, וגורמין חורבן בהמ\"ק וגלות ישראל ר\"ל, וזה גורם שהאומות שופטים אותם ולהיות נכנעים תחת ידיהם, וע\"כ הזהיר הכתוב, שופטים ושוטרים תתן לך אשר ד' אלקיך נותן לך, שתמנה שופטים הגונים, כפי דת של תורה, ואותם אשר יבחר ד', וע\"ז דרשו במדרש תתן לך ולא לאוה\"ע, שאם תמנה שופטים הגונים, תמהר את הגאולה בזכות המשפט כנ\"ל, ואז יהי' תתן לך ולא לאוה\"ע, שלא תהיה נכנע להשפט בדייני אוה\"ע ואז יתקיים למען תחי' וירשת את הארץ בב\"א."}]},{"dvar_torah_id":"devurim_880f9625","title":"המלצת זכות על ישראל במשפט","summary":"בביאור תוכחת משה לישראל, יש להלביש דברי מוסר באמירה רכה. המשפט צריך להיות מלווה בהמלצת זכות על ישראל, ולא להעריך צדקתם נגד רשעת הגויים. צדק צדק תרדוף, והדיינים צריכים להיות ראויים להשפעה אלקית.","contents":[{"passage_id":"devurim_880f9625_p1","passage_content":"עוד אפ\"ל בביאור הדקדוקים הנל, בהקדם מ\"ש ק\"ז הייטב לב זלל\"ה, עה\"פ והי' כקרבכם אל המלחמה ודבר אל העם ואמר אליהם שמע ישראל וגו' ויש להבין דפתח בדיבור לשון קשה, וסיים ואמר אמירה רכה, ויתבאר עפימ\"ד במדרש רבה, אלה הדברים אשר דבר משה וגו', זש\"ה מוכיח אדם אחרי, מה אחרי, אמר הקב\"ה משה הוכיחני אחר ישראל, והוכיח לישראל אחרי, לישראל אמר אתם חטאתם חטאה גדולה וגו', להקב\"ה אמר למה ד' יחרה אפך בעמך עיי\"ש, וביאור הדברים, ע\"ד שפי' בספה\"ק נוע\"א זלל\"ה, עה\"פ כה תאמרון לאדוני לעשו עם לבן גרתי וגו', ופרש\"י לא נעשיתי שר וחשוב, דבר אחר ותרי\"ג מצות שמרתי, ויל\"ד דהול\"ל לאדוני עשו והלמ\"ד של לעשו מיותר, גם מ\"ש תרי\"ג שמרתי תמוה, וכי בשביל זה ימצא חן בעיניו, אבל הענין דדרך הצדיק, בדברו עם ברא, ישכיל לדבר דבר על אופניו, שיהי' דבריו נשמעים במשמעותן כפשוטן, וגם שיהיו תוכן רצוף תפלה ותחנונים להמקום ב\"ה, והכוונה בזה להסתיר תפלתו ולהלבישה, למען לא יבינו המסטינים ולא יסטינו, וז\"ש כה תאמרון לאדוני הוא אדון הכל ית', וגם כפשוטן לעשו עם לבן גרתי, לעשו נאמרו הדברים כמשמען לא נעשיתי שר וחשוב, ד\"א להקב\"ה תרי\"ג מצות שמרתי עכ\"ד נוע\"א זלל\"ה."},{"passage_id":"devurim_880f9625_p2","passage_content":"והנה הכהן דבר אל העם דברי תוכחה ומוסר, וז\"ש ילך וישוב לביתו וכמבואר בספה\"ק, וז\"ש ונגש הכהן אין הגשה אלא תפלה וכו', והכוונה בשעה שידבר דבורים קשים דברי מוסר, ובדיבור זו עצמו יהי' מלובש אמירה רכה, והמלצת זכות על ישראל, וז\"ש שמע ישראל וגו', הכוונה הפשוטה אליהם לשמוע אל דברי תוכחה שלו וכו', ובקרב לבבו יהי' כוונתו לד' אמירה רכה, שמע ישראל שאפי' אין לישראל אלא זכות ק\"ש, כדאי הם להושיע אותם כדרשת חז\"ל, עכת\"ד הייטב לב זלל\"ה, וכעי\"ז פי' בספה\"ק קדושת לוי עה\"פ תחת אשר קנא לאלקיו ויכפר על בני ישראל עיי\"ש."},{"passage_id":"devurim_880f9625_p3","passage_content":"וכמו\"כ בענין המשפט, כבר הבאנו לעיל דברי ק\"ז הישמח משה זלל\"ה, ומבואר כן בספה\"ק, דא\"א להשיג עומק המשפט בשכל ודעת אנושי, כ\"א ע\"י השראת השכינה והשפעת אלקות, ומעתה אם זוכה הדיין להיות רוח אלקים בו, ואלקים ניצב בעדת א-ל, יש בכוחו להיות צדק ומשפט בדיבור א' נאמרו, דהיינו שמחויב לדון עפ\"י התורה ולהרשיע את הרשע, ולחייבו מיתה או מלקות כפי ענשו המגיע בב\"ד של מטה על חטאו, ובהתלבשות דבריו יתפלל עליו וימליץ זכות בעדו, שלא יענש בדיני שמים על חטאו, וכמו\"כ יש בכח הב\"ד, שדנין משפט צדק לאמיתה של תורה, להמליץ זכות בדיבורם על כלל ישראל, כמ\"ש לעיל דגדול כוחו של משפט צדק, שמביא את הגאולה ומציל את ישראל מחרב ומלחמה, כמבואר כן בפסוקים ובדרז\"ל, ובודאי יש בכח זכותה, להמליץ טוב על ישראל."},{"passage_id":"devurim_880f9625_p4","passage_content":"ויבואר בזה דברי התנחומא הנ\"ל ושפטו את העם משפט צדק, שיהיו מלמדין זכות על הדור (עיין לעיל קושיא ז') ואין המקרא יוצא מידי פשוטו דמיירי במשפט הדיינים להורות כדיני התורה, אבל בדיבורים אלו עצמן, יהי' מלובש בהם המלצת זכות על ישראל, ויתקשר עם המאמר אשר ד' אלקיך נתן לך הסמוך אליו, לפי שד' אלקיך נתן לך, ר\"ל המשפט צדק יהי' ע\"י השפעות אלקות, ע\"כ יש בכח אלה הדיבורים להמליץ זכות על ישראל, ולהיות צדק ומשפט בדיבור א'."},{"passage_id":"devurim_880f9625_p5","passage_content":"ועתה נבאר דברי התנחומא מ\"ש לך ולא לאומה\"ע (עיין קושיא ו') בהקדם מ\"ש בספה\"ק אגרא דכלה (פ' וירא) עה\"פ האף תספה צדיק עם רשע, ולכאורה מה הוי ס\"ד דאברהם חסידא קדישא, שהשי\"ת יספה ח\"ו צדיקים עם רשעים, ומי חשיד קוב\"ה ח\"ו, והנראה בזה, דהנה הצרפית אמרה לאלי' באת אלי להזכיר עוני, וביארו חז\"ל, שאמרה בטרם בואך אצלי, הייתי נחשבת לצדיקת בערך הרשעים, אבל כשבאת אצלי הנה בערכך כרשעה אחשב, הנה דעת לנבון מזה חסדי השי\"ת, אשר יחשוב האדם לצדיק בערך הרשעים, הגם שאינו צדיק באמת וכו', ובזה נבין טענת א\"א לפני הקב\"ה, ואמר האף תספה צדיק עם רשע, האם ח\"ו הכוונה לאסוף גם אותו האיש, אשר הוא צדיק עם רשע, היינו בחיבור רשע ובערכו נחשב לצדיק, ובזה רצה להמליץ זכות עליהם עכת\"ד עיי\"ש, וכמו\"כ מצינו שאמר הכתוב לא בצדקתך וביושר לבבך אתה בא לרשת את הארץ כ\"א ברשעת הגוים האלה, ובערך רשעתם אתם נחשבים לצדיקים."},{"passage_id":"devurim_880f9625_p6","passage_content":"אמנם יש לדרך הזה חסרון ומגרעת, דעי\"ז נזכר בהכרח רשעת הרשע וחטאיו, וזה מעלה חרון אף ח\"ו, ונחלש כח הזכות, וכמ\"ש במס' ר\"ה (ה' ע\"ב) מלך נכנס תחלה לדין מקמי דליפוש חרון אף, וכמו שפירשו בספה\"ק בהשפטו יצא רשע, ועי\"ז תפלתו תהי' לחטאה, וע\"כ הדרך היותר טוב והרצוי, אם יזכו ישראל שיזכר זכותן מצד עצמן, ולא יוצרך להעריך זכותם וצדקתם נגד רשעת הגוים, ויתבארו בזה דברי התנחומא הנ\"ל שופטים ושוטרים תתן לך, לך ולא לאומה\"ע, ר\"ל ע\"י שתמנה דיינים הגונים, ויהיו ראויים אל השפעה אלקית, יהי' בכוחם ובזכותם להמליץ טוב על ישראל, ולהעריך זכותם מצד עצמם, ולא בערך רשעת הגוים, וז\"ש תתן לך ולא לאומה\"ע, וז\"ש צדק צדק תרדוף, וכפל צדק בא להורות, שיהי' הצדק ולימוד זכות מצד הצדק והרחמים, ולא יצטרכו לעורר דין על הרשעים ולהעריך נגד רשעתם צדקתם של ישראל."}]},{"dvar_torah_id":"devurim_61b2a11e","title":"שאלת המלך בישראל ככל הגוים","summary":"במאמר זה נדונה שאלת מינוי המלך בישראל, וההבדל בין המלכות הראויה לבית דוד לבין המלכות של שאול. נידונה גם השפעת הבקשה למלך על הבחירה החופשית, וההבנה שישראל נענשו על כך שביקשו מלך שלא כהוגן.","contents":[{"passage_id":"devurim_61b2a11e_p1","passage_content":"באופן אחר אפ\"ל הדקדוקים הנ\"ל, בהעיר עוד במשה\"כ ואמרת אשימה עלי מלך ככל הגוים אשר סביבתי, הרמב\"ן ז\"ל דקדק, כי מה טעם שתאמר התורה במצוה, ככל הגוים אשר סביבתי, ואין ישראל ראויים ללמד מהם וכו', ותירץ הרמב\"ן דרמז הכתוב על העתידות, שכן הי' כששאלו להם את שאול, אמרו לשמואל שימה לנו מלך לשופטנו ככל הגוים, אבל אין זה מתנאי המצוה, ואדרבה אמירה זו היא שלא כהוגן, עכת\"ד, אמנם עדיין צ\"ב, דלמה יאמר הכתוב בצוותו על המצוה, מה שעתידין ישראל לעשות שלא כהוגן, ואין זה מפרטי המצוה, גם למה יאמר הכתוב בפירוש, שעתידין ישראל לעשות שלא כהוגן, והרי דיבורו ית' מכרחת הבחירה, וכל מה שנכתב בתורה הוא דיבורו ית', וא\"כ בטלה הבחירה."},{"passage_id":"devurim_61b2a11e_p2","passage_content":"ב) כבר הבאנו לעיל הקושיא שתמהו עלי' כל המפרשים, כיון דנצטוו ישראל במצות עשה למנות להם מלך, וכן מוסכם בגמ', וברוב הפוסקים והרמב\"ם מכללם, דזו מצות עשה להעמיד מלך עפ\"י נביא, א\"כ למה האשים שמואל הנביא את ישראל, כששאלו מלך, דכתיב (שמואל א' ח') וירע הדבר בעיני שמואל כאשר אמרו תנה לנו מלך לשפטנו וגו', וק\"ז הייטב לב זלל\"ה, כתב דהרבה תירוצים נאמרו ונשנו ע\"ז, והיותר נוח לקבל הן דברי מהר\"י בעקידה, שאמרו שלא כהוגן, שימה עלינו מלך לשפטנו, כי המשפט לאלקים הוא, ואין זה נוגע למלך עיי\"ש, (כבר העתקנוהו לעיל), ותי' הוא ז\"ל באופן אחר."},{"passage_id":"devurim_61b2a11e_p3","passage_content":"ומדברי הרמב\"ן כאן נראה ששאלו שלא כהוגן, מפני שאמרו לשופטנו ככל הגוים, וכן מבואר בגמ' סנהדרין (דף כ' ע\"ב) תניא ר\"א זקנים שבדור כהוגן שאלו, שנא' תנה לנו מלך לשפטנו וגו', אבל עמי הארץ קלקלו, שנא' והיינו גם אנחנו ככל הגוים, ושפטנו מלכנו ויצא לפנינו ונלחם את מלחמותנו, אמנם גם ע\"ז קשה, כי הלא המה דברי התורה בעצמה, שנא' אשימה עלי מלך ככל הגוים, שום תשים עליך מלך וגו', וכן הקשה באלשיך הק'."},{"passage_id":"devurim_61b2a11e_p4","passage_content":"כתב הרמב\"ן ז\"ל (בפ' ויחי) עה\"פ לא יסור שבט מיהודה וגו' וז\"ל כי יעקב המליך שבט יהודה על אחיו, והוריש ליהודה הממשלה על ישראל וכו', וענין שאול הי', כי בעבור שדבר שאלת המלכות בעת ההוא נתעב אצל הקב\"ה, לא רצה להמליך עליהם מן השבט אשר לו המלכות, שלא יסור ממנו לעולמים, ונתן להם מלכות שעה וכו', וזה הי' עונש החשמונאים שמלכו בבית שני, כי היו חסידי עליון וכו', אלא בעבור שמלכו ולא היו מזרע יהודה ומבית דוד, והסירו השבט והמחוקק לגמרי, והי' עונש מדה כנגד מדה, שהמשיל הקב\"ה עליהם את עבדיהם והכריתום עכ\"ד הרמב\"ן ז\"ל, אבל יש חולקים בזה, וס\"ל דלא יסור שבט מיהודה לאו צווי הוא, אלא ברכת אבינו הזקן, ולפי\"ז אין מגיע עדיין עונש בעברם ע\"ז, כללו של דבר רבו הדיעות והתירוצים בענין הזה, ומה שזה בונה זה סותר, ועדיין הדבר צ\"ב."},{"passage_id":"devurim_61b2a11e_p5","passage_content":"ג) בספרי א\"ר יהודה, והלא מצוה הוא מן התורה לשאול להם מלך, שנא' שום תשים עליך מלך וגו', ולמה נענשו בימי שמואל, מפני שהקדימו על ידם ככל הגויים אשר סביבותים וצ\"ב הכוונה, ומה קדימה יש כאן."},{"passage_id":"devurim_61b2a11e_p6","passage_content":"ד) עוד איתא בספרי שום תשים עליך מלך וגו' דרשו מכפל הלשון, מת המלך, מנה אחר תחתיו ע\"כ, וצ\"ב דלמה צריך לימוד ע\"ז, והרי כיון דמצות התורה למנות מלך, א\"כ מה לי ראשון או שני, ובודאי לא יפטרו ידי חובתן, בהקמת מלך א' על לעולם."},{"passage_id":"devurim_61b2a11e_p7","passage_content":"ה) עוד שם בספרי, כי תבוא אל הארץ אשר ד' אלקיך נתן לך ואמרת אשימה עלי מלך וגר, עשה מצוה זו האמורה בענין, שבשכרה תכנס לארץ, לכאורה צ\"ב, דמצות המלך אינו נוהג אלא בא\"י ולאחר ירושה וישיבה, כמשה\"כ וירשתה וישבתה בה, א\"כ איך תלה ביאת הארץ בזכותה, וכבר קדמה אלי' במעשה."},{"passage_id":"devurim_61b2a11e_p8","passage_content":"ו) להלן בפרשה כי הגוים האלה אשר אתה יורש אותם אל מעוננים ואל קוסמים ישמעו, ואתה לא כן נתן לך ד' אלקיך, דקדקו המפרשים דהלשון לא כן נתן וגו' צ\"ב, והול\"ל ואתה לא תשמע אליהם, ועיין באוהחה\"ק ובהרא\"ם וגו\"א."},{"passage_id":"devurim_61b2a11e_p9","passage_content":"ז) נביא מקרבך מאחיך כמוני יקים לך ד' אלקיך וגו', כתב הרא\"ם ז\"ל לא כמוני בנבואה הוא דקאמר, שהרי כתוב ולא קם נביא עוד בישראל כמשה, אלא כמוני שאני מקרבך ואחיך, וכן מבואר בדברי רש\"י ז\"ל, אולם גם תירוצו צ\"ב, דיספיק הכתוב לומר מקרבך מאחיך, ולמה הוצרך לדמיון כמוני, ואין הדמיון צודק, כי לא ישוו אליו שאר הנביאים."},{"passage_id":"devurim_61b2a11e_p10","passage_content":"ח) הרא\"ם והגו\"א הביאו עוד דרשת רז\"ל בספרי, כמוני מה משה מדבר דבר ואינו מתירא, וכן הוא אומר רק אל יוסף פרעה התל, כך כל הנביאים לא יהיו מתייראים וכו', וגם זה צ\"ב, דאם לפרט זה בא הכתוב להזהיר, הו\"ל להזכירו בפירוש, ולמה סתם בדמיונו, ומשום פרט זה לבד אינו ראוי שיקרא כמוני."},{"passage_id":"devurim_61b2a11e_p11","passage_content":"ולבאר ענין פרשת המלך נראה לומר דבר חדש בזה, דאפשר לצרף ב' הטעמים יחד, והוא טעם בעל עקידה שהי' שאלתם שלא כהוגן, במה שאמרו שימה עלינו מלך \"לשפטנו\" בצירוף הטעם שאמרו בגמ' סנהדרין הנ\"ל, מפני שאמרו,\"ככל הגוים\" וכמ\"ש גם הרמב\"ן ז\"ל, ובזה יוסרו כל הקושיות, וראשית דבר נבוא לתרץ קושית הרמב\"ן ז\"ל, דמה טעם יאמר הכתוב במצות ד' ככל הגוים אשר סביבותי, ואין ישראל ראויים ללמוד מהם, והאברבנאל הקשה קושיא זו ביתר ביאור, דלמה יתלה המצוה הזאת במנהג הגוים, אשר נצטווינו שלא נעשה כמעשיהם, ולא אמר כן במצות שופטים, עם היות מנוי השופטים מנהג הגוים ג\"כ ע\"כ קושיתו."},{"passage_id":"devurim_61b2a11e_p12","passage_content":"אמנם אפשר לחלק טובא, דמשפטי התורה הם משפטי ד' אמת צדקו יחדיו, ולא שייך בזה לומר ככל הגוים, דבגוים אין תורה, וחקים ומשפטים בל ידעום, ולא עשה כן לכל גוי, משא\"כ במצות המלך דעיקר מנוי המלך ללחום מלחמתנו, כמבואר בפסוק ויצא לפנינו ונלחם מלחמתנו וגו', והנה אלו זכו ישראל, לא היו צריכים למלחמה כלל, כמ\"ש רש\"י ז\"ל בפ' דברים, עה\"פ באו ורשו את הארץ וגו', אין מערער בדבר ואינכם צריכים למלחמה, אלו לא שלחו מרגלים לא היו צריכים לכלי זיין עכ\"ל, וכתב רש\"י ז\"ל (בפ' ויחי) עה\"פ כלי חמס מכרותיהם, אומנות זו של כלי רציחה, חמס הוא בידכם מברכת עשו היא, זו אומנות שלו, ואתם חמסתם אותה הימנו, וכמו\"כ כתב רש\"י ז\"ל (בפ' מטות) ואת בלעם בן בעור הרגו בחרב, הוא בא על ישראל והחליף אומנתו באומנתם שאין נושעים אלא בפיהם ע\"י תפלה ובקשה, ובא הוא ותפס אומנתם לקללם בפיו, אף הם באים עליו והחליפו אומנתם, באומנות האומות שבאין בחרב שנאמר ועל חרבך תחי'."},{"passage_id":"devurim_61b2a11e_p13","passage_content":"עכ\"פ החרב והמלחמה אינם מכלי אומנתם של ישראל, והשתמשו ישראל לפעמים לעת הצורך באומנות האומות, כמ\"ש ז\"ל מני' ובי' אבא ליזיל בי' נרגא, ואלו זכו ישראל ואלולא החטא, לא היו צריכים לא לחרב ולא למלחמה, והי' נצחונם בדרך נס נגלה, אלא לפי שגרם החטא הוצרך להיות מלובש בדרך הטבע, וע\"כ בזמן שהי' מלך ונביא, וישראל לחמו מלחמתם עפ\"י נביא ובמצות המלך, הרשה הכתוב להשתמש בחרב, ולשלוח מרגלים, ולהתנהג בתכסיסי מלחמה כאשר יעשו הגוים, כדי שיהי' מלחמה זה כנגד זה, כמ\"ש בספרי כי תצא למלחמה על איביך כנגד איביך, ומעתה בתכסיסי מלחמה מותר להתנהג ככל הגוים ולהשתמש באומנתם כמ\"ש ז\"ל, וא\"ש מ\"ש הכתוב במצות המלך, ככל הגוים אשר סביבותי, דעיקר מניית המלך ללחום מלחמתנו כמבואר בפסוק, וזו אומנתם של האומות, ושאלה הוא בידינו, וע\"כ אמר ככל הגוים וגו', אבל לא כן במשפטים דא\"א להתדמות אליהם כלל, דמשפטים בל ידעום, ואין להם משפטי סתורה כלל, ואנו נצטווינו להתנהג רק במשפטי התורה."},{"passage_id":"devurim_61b2a11e_p14","passage_content":"ובזה יתורץ קושית הרמב\"ן והאברבנאל, דמ\"ש הכתוב אשימה עלי מלך ככל הגוים אשר סביבותי, הכוונה ללחום מלחמתנו ככל הגוים, כי עיקר התמנות המלך ללחום מלחמות, ובדבר זה התירה התורה לעשות ככל הגוים, דמאחר שצריך להיות מלובש בטבע, צריך להתנהג בתכסיסי מלחמה כמותם, אבל לא אמר הכתוב כן במצות השופטים, אע\"פ שגם מנוי השופטים מנהג הגוים, כמו שהקשה האברבנאל, אבל אסור לנו להתדמות במשפטיהם אפי' במקצת."},{"passage_id":"devurim_61b2a11e_p15","passage_content":"ומעתה אפ\"ל כדברי בעל עקידה, שאמרו שלא כהוגן במ\"ש שימה עלינו מלך לשפטנו ככל הגוים, כי אלו אמרו לשפטנו לבד, לא הי' בזה עון, כאשר הקשה ק\"ז הייטב לב זלל\"ה, דענין המשפט שייך למלך, כמ\"ש ויהי' דוד עושה משפט וצדקה, וכן שלמה המלך וכו', וכמו\"כ אלו היו אומרים ככל הגוים לבד, לא הי' בזה עון, כמו שהקשה האלשיך הק', שהרי הכתוב אומר כן, אמנם כוונת הכתוב שילחום מלחמתם ככל הגוים, והתירה התוה\"ק לעשות כן, אבל הם אמרו לשמואל שימה עלינו מלך לשפטנו ככל הגוים, ומפני זה הי' רבה רעתם, ולבסוף נתרצה להם שמואל, כאשר אמרו ושפטנו מלכנו ויצא לפנינו ונלחם את מלחמותינו, והגם שאמרו גם בזאת הפעם ככל הגוים, אבל מפני שכללו בשאלתם ונלחם את מלחמותינו, ועל זה סובב מאמר ככל הגוים, ודבר זה התירה התורה, ע\"כ נתרצה להם שמואל, ובזה סרה גם קושיא הב' שהקשה ק\"ז הייטב לב זלל\"ה עיי\"ש."},{"passage_id":"devurim_61b2a11e_p16","passage_content":"ונבוא לבאר דברי הספרי הנ\"ל, עפימ\"ש בס' צמח דוד עה\"ת, בביאור הספרי שנענשו בימי שמואל, לפי שהקדימו ע\"י ככל הגוים, ותו\"ד לפרש, בהקדם מ\"ש הרמ\"ע מפאנו זלל\"ה (בס' ע\"מ מח\"ד ח\"ד פי\"ו) אלמלא ששאלו ישראל מלך שלא כהוגן, לא אכלוהו פגה למלכות ראשונה, ודוד ויהונתן, המלך והמשנה, היו מזומנים לעשות מלוכה של קיימא על ישראל, אבל מאסם מלכות שמים, והמכשלה של פסל מיכה שהי' ביניהם, גרמו להקים להם מלך שאול, כשמו כן הוא, מושאל לכתר מלכות לפי שעה, עכ\"ל הרמ\"ע ז\"ל, ופי' בס' צמח דוד דברי הרמ\"ע ז\"ל, דתרתי לריעותא הוי בהו, חדא ששאלו שלא כהוגן, דהיינו שהי' להם להמתין עד שיבוא דוד שהוא מיהודה, שלו היתה המלוכה ראוי', והם בקשו ושאלו מלך, קודם שיהי' ביהודה בן הגון למלכות, והשנית שאמרו ככל הגוים וכר, ובזה מאסו במלכות שמים, ובזה יבוארו דברי הספרי, ר' יהודה אומר וכו', ולמה נענשו בימי שמואל לפי שהקדימו על ידם ככל הגוים, ר\"ל ב' דברים, חדא שהקדימו לשאול להם מלך, כי הי' להם להמתין עד דוד הגדיל, שהוא ראוי ומשבט יהודה, ועוד שאמרו ככל הגוים כמואסים במלכות שמים, עיי\"ש שהאריך בביאור הפרשה לדרכו."},{"passage_id":"devurim_61b2a11e_p17","passage_content":"וכעי\"ז דעת הרמב\"ן ז\"ל (בפ' ויחי) דס\"ל דלא יסור שבט מיהודה הוא מצוה חיובית, וע\"כ לא הי' מלכות שאול אלא לפי שעה, וזה הי' גם עונש החשמונאים עיי\"ש, ואפשר שמה שהקדימו ישראל לשאול להם מלך, ולא המתינו על זרע דוד, אפשר שראו הכרח בדבר לחזק התורה ולהקים הדת על תלה, והי' בבחי' עבירה לשמה, והגם שנענשו עלי', מ\"מ מצוה קא עבדי, וכמ\"ש התוס' ב\"ק (דף צ\"א ע\"ב) במתענה בשבת תענית חלום שקורעין גזר דינו של ע' שנה, ונפרעין ממנו תענית של שבת, וכן בנזיר שנקרא חוטא שציער עצמו מן היין, אבל המצוה גדולה מהעבירה, ומקבלים שכר עלי' עיי\"ש."},{"passage_id":"devurim_61b2a11e_p18","passage_content":"ובהקדמה זו יתבארו דברי הספרי הנ\"ל, עשה מצוה זה שבשכרה תכנס לארץ (עיין לעיל קושיא ה') דלכאורה קשה כיון שהוא מצות עשה להעמיד להם מלך, מדוע נתעכבו ישראל מלקיים מצוה זו, והרבה שנים עברו מכיבוש הארץ עד ששאלו מלך בימי שמואל, ולדרכנו יתורץ שפיר דלא יסור שבט מיהודה הוא מצוה חיובית, והמלכות ראוי' לדוד ולזרעו, ועיקר מצות מלך נאמרה על מלכות בית דוד, שלהם ראוי' המלוכה, וא\"ש שנמנעו ישראל מלמנות מלך מיד בביאתם לארץ, ואח\"כ בימי שמואל כשבקשו להם מלך נענשו ע\"ז, כמ\"ש הרמב\"ן ז\"ל מפני שבקשו ושאלו מלך לפני הזמן, וטרם הגיעה מלכות בית דוד, ואיתא בזוה\"ק פ' ויקהל (דף קצ\"ח) א\"ר אבא מן היום אשר הוצאתי את ישראל ממצרים, לא בחרתי בעיר מכל שבטי ישראל ואבחר בדוד וגו', כד קוב\"ה אית רעותא קמי' למבני קרתא, אסתכל בקדמיתא בההוא רישא דנהיג עמא דקרתא וכו', הה\"ד לא בחרתי בעיר, עד דאסתכלנא בדוד למהוי רעיא על ישראל וכו' (עיין לעיל), עכ\"פ לפי\"ז עיקר כניסת הארץ, הי' על דעת כן שיהי' דוד מלך ורועה ישראל, ומלכות דוד הוא הגורם לירושת הארץ, וז\"ש בספרי עשה מצוה זו שבשכרה תכנס לארץ, דמצות מלך על מלכות דוד נאמרה, ובשכרה יירשו ישראל את הארץ."},{"passage_id":"devurim_61b2a11e_p19","passage_content":"ואפשר לבאר עוד קושית הרמב\"ן ז\"ל, דמה טעם יאמר הכתוב ואמרת אשימה עלי מלך ככל הגוים וגו' (עיין קושיא א') ויובן בהקדם מ\"ש בספה\"ק נועם אלימלך (פ' בהר) עה\"פ וכי תאמרו מה נאכל בשנה השביעית וגו' וצויתי את ברכתי לכם וגו', ותו\"ד ז\"ל דכשהאדם נופל ממדריגתו, ואין לו בטחון ח\"ו בבורא ב\"ה, המשגיח אמיתי וזן ומפרנס בריוח בלי הפסק כלל, אז עושה האדם ההוא במחשבתו אשר לא מטוהרה, פגם חלילה בעולמות העליונים, ונפסק השפע חלילה, וצריך השי\"ת ב\"ה לצוות מחדש השפע, שתלך כמו מתחילת הבריאה, וז\"ש וכי תאמרו מה נאכל וגו', פי' כאשר תאמרו כך, אז תטריחו אותי וצויתי את ברכתי וגו', לצוות מחדש על השפעת הברכה, והתוה\"ק מלמדת לאדם דרכי השם שיהי' שלם בבטחונו על אלקיו ולא יאמר כן, עכת\"ד ז\"ל."},{"passage_id":"devurim_61b2a11e_p20","passage_content":"וכמו\"כ בענין המלך, דאלו הי' שלימים בבטחונם בהשי\"ת, לא היו צריכים לשאול מלך מיד, והי' יכולים להמתין על מלכותו של דוד, אלא לפי שהי' יראתם ממלחמת הגוים, ובקשו מלך שילחום מלחמתם בתכסיסי מלחמות ככל הגוים, ואמירה זו שאמרו, שימה עלינו מלך ככל הגוים, הי' פגם במדת הבטחון, והשגחה הוא סבת הדבקות, וע\"כ הי' הצורך להם להתנהג בדרך הטבע, והיו צריכים למלך מיד, שילחום מלחמתם בתכסיסי המלחמה, ולא יכלו להמתין על מלכותו של דוד, אבל לפי שהמלכות ישראל הוכן לדוד ולזרעו עד עולם, ע\"כ לא הי' מלכות שאול מתקיימת אלא לפי שעה, וכשמת שאול מלך דוד וזרעו אחריו עד עולם, ובזה יבואר מאמה\"כ ואמרת אשימה עלי מלך ככל הגוים אשר סביבותי, אם תאמר כן, אז שום תשים עליך מלך, וכפל שום תשים, מורה על משימות הרבה, שלא יהי' מלכות נצחי אלא לפי שעה."},{"passage_id":"devurim_61b2a11e_p21","passage_content":"ובזה יתבאר דברי הספרי שדרשו שום תשים, מת המלך מנה אחר תחתיו, ואין כוונת דרשתם ז\"ל להורות על הצווי, דפשיטא הוא, דאם מת המלך צריך למנות אחר תחתיו כקושיתנו לעיל, אמנם הכוונה דנרמז בכפל שום תשים, שיזדמן להם כן, ומ\"ש מת המלך כוונו אל שאול, ומנה אחר תחתיו על דוד, שלזרעו יהי' המלכות עד עולם, וכל המניח בן ממלא מקומו, כאלו לא מת, וגם לעתיד יתקיים מלכות ביד דוד לעולם, ומעתה מ\"ש הכתוב ואמרת אשימה עלי מלך ככל הגוים, אין זה מתנאי מצות המלך, וא\"צ לומר דרמז הכתוב על העתידות כדברי הרמב\"ן ז\"ל, דאין דרך הכתוב להחליט את מעשה הרע שיעשו ישראל, דעי\"ז נתבטל הבחירה כקושיתנו לעיל, אמנם תלה הכתוב באם יאמרו כן, ועדיין נשאר הבחירה חפשי, והתוה\"ק מלמדת דרכי השם שלא יאמרו כן, שאם יאמרו ככל הגוים, יהיו נענשים על זה, ויצטרכו למשימות הרבה כנ\"ל, ובזה נתבאר ענין פרשת המלך."},{"passage_id":"devurim_61b2a11e_p22","passage_content":"ובזה יבואר דברי התנחומא הנ\"ל, שופטים ושוטרים תתן לך וגו' לך ולא לאומה\"ע, דלפי שבפרשת המלך, אמר הכתוב אשימה עלי מלך ככל הגוים, והתיר הכתוב להתנהג בתכסיסי מלחמה ככל הגוים, בזמן שהי' עפ\"י מלך ונביא, ע\"כ הוצרך למעט, דבמשפטים אסור כל התדמות ואפי' משהו מן המשהו למשפטי הגוים, וכמ\"ש לעיל, דזה הו' הפגם לפי שאמרו לשפטנו ככל הגוים, וכמ\"ש ק\"ז הייטב פנים זלל\"ה, ודתיהם שונות מכל העם, שזה עיקר ויסוד הדת להיות שונות מכל עם, וז\"ש בתנחומא תתן לך ולא לאומה\"ע."},{"passage_id":"devurim_61b2a11e_p23","passage_content":"ומ\"ש הכתוב אשר ד' אלקיך נתן לך יובן, עפימ\"ש ק\"ז הישמח משה זלל\"ה (בפ' משפטים) בשם ס' חן טוב הטעם דאשר תשים לפניהם ולא לפני הדיוטות ועובדי כו\"מ, ואפי' דנין כדין תורה, לפי שעומק הדין אינו מושג אלא בהיות ד' עם השופט, ומלמדו להועיל לכוון הדין כהלכה, וכדכתיב והי' ד' עם השופט, ואם אין הבוב\"ה בשעת המשפט יכשל הדיין וכו', לכן כתיב מגיד דבריו ליעקב וגו' לא עשה כן לכל גוי ומשפטים בל ידעום, כי אין השכינה שורה על אוה\"ע, וזה הטעם לפניהם ולא לפני עכו\"ם עיי\"ש בחן טוב, ובזה יבואר שופטים ושוטרים תתן לך ולא לאוה\"ע, שלא להתדמות במשפטים לדרכי אומה\"ע כלל, ונתן טעם אשר ד' אלקיך נותן לך, שלענין המשפטים צריך השפעת אלקים, וא\"א להשיג עומק הדין לכוון ההלכה לאמיתה, אלא בהיות ד' עם השופט, וע\"כ לא עשה כן לכל גוי ומשפטים בל ידעום, ולזה הזהירה התורה לך ולא לאומה\"ע."},{"passage_id":"devurim_61b2a11e_p24","passage_content":"ועד\"ז יבואר מ\"ש הכתוב נביא מקרבך כמוני יקים לך ד' אלקיך (עיין לעיל קושיא ז'), ונקדים מ\"ש הגור ארי' בביאור דברי הספרי, כמוני כמו שאני מדבר ואינו מתיירא וכו', כך כל הנביאים לא יהיו מתייראים וכו', וז\"ל המהר\"ל זלל\"ה, המדרש הזה יש בו ענין נפלא וכו', דכאשר לא ירא הנביא, ענין זה הוא מפני כי דבר רוח אלקים עליו, שהם דברי קדוש ונורא על כל בשר ודם, וע\"כ לא הי' הנביא מתיירא מבשר ודם, וזהו הוראה על שנבואתו נבדלת אלקית וכו', וז\"ש משה רבינו דאע\"ג דמדריגות הנביאים האחרונים לא היו כמו משה, אבל בענין זה יהיו שווים אליו, ויהיו כמוני, שדברי אלקים חיים בקרבם, וע\"כ לא יהיו מתייראים כמוני, עכת\"ד הגו\"א ז\"ל, מבואר מדבריו, דבפרט זה ההכרח, שישתוו אליו כל הנביאים, דזה הוראה על נבואתם שדברי אלקים חיים בקרבם, ואפשר לבאר גם עפ\"י פשטות, שפרט זה הכרח, ומתנאי הנבואה, שלא יהי' הנביא מושפע משום אדם או מיראתו, דאל\"כ אינו ראוי שיחול עליו השפעת אלקית, ואינו זוכה לנבואה אמיתית."},{"passage_id":"devurim_61b2a11e_p25","passage_content":"ובזה יבואר דברי הספרי והפסוק נביא מקרבך כמוני, שזה מתנאי הנביא שיהי' בדבר זה כמוני, הגם שלא ישוה בשום מדריגה כמשה רבינו, אבל דבר זה הוא הכרח, שלא יירא משום אדם כמו משרע\"ה, כדי שלא יהי' מעורב בנבואתו שום השפעה אחרת, זולת השפעת אלקית, וז\"ש נביא מקרבך כמוני יקים לך ד' אלקיך, שיהי' כמוני, ואשר יקים לך ד' אלקיך, שיהי' לו השפעה אלקית וראוי לנבואה."},{"passage_id":"devurim_61b2a11e_p26","passage_content":"על דרך זה אפ\"ל שופטים ושוטרים תתן לך בכל שעריך אשר ד' אלקיך נתן לך, לפי שדבר המשפט צריך להיות ע\"י השפעה אלקית, לכוון ההלכה לאמיתה, וע\"כ אמר הכתוב אשר ד' אלקיך נתן לך, שלא יהי' מעורב בו שום השפעה אחרת, רק אשר ד' אלקיך נתן לך, דאם יהי' מעורב בו איזה נגיעה, או השפעה אחרת מאיזה בחי' שהוא, זה מונע ומעכב השפעת אלקית, ועל זה אתי' יתור הכתוב, למעוטי כל השפעות שבעולם זולת השפעת אלקית, שהוא הכרח למשפט אמת, ואז יתקיים ושפטו את העם משפט צדק."},{"passage_id":"devurim_61b2a11e_p27","passage_content":"ואפ\"ל עוד באופן אחר, לפרש דברי התנחומא הנ\"ל תתן לך ולא לאוה\"ע, עפימ\"ש רש\"י בירמי' (א' ה') עה\"פ נביא לגוים נתתיך, לישראל שהם נוהגים עצמם כגוים, כך נדרש בספרי בפ' שופטים, נביא מקרבך כמוני יקים לך ד' אלקיך, לך ולא לאומה\"ע, ומה אני מקיים נביא לגוים נתתיך, בבני ישראל שנוהגים מנהגי גוים עכ\"ל רשיז\"ל, ולדרכנו אפ\"ל שופטים ושוטרים תתן לך קאי על הממנים, ומיעוטא דלך לא לאוה\"ע, אתי' למעוטי שלא יהיו הממנים מתנהגים בדרכי הגוים, דאז לא יהי' ההתמנות עפ\"י התורה, ואלו שמתנהגים בדרכי הגוים, קראם הכתוב גוים בלשון מושאל כמ\"ש בספרי, ואפשר שגם זה נרמז בדרז\"ל לך ולא לאומה\"ע."},{"passage_id":"devurim_61b2a11e_p28","passage_content":"ולדרכנו יתבאר הכתוב צדק צדק תרדוף למען תחי' וירשת את הארץ, ופירש\"י והוא בגמ' סנהדרין (דף ל\"ב) כדאי הוא מנוי הדיינין הכשרים, להחיות את ישראל ולהושיבן על אדמתן (עיין לעיל בדרוש הקודם קושיא י\"א י\"ב וקושרת הרא\"ם בזה), ויובן כ\"ז עפימ\"ש רשיז\"ל בסוף הפרשה נפש בנפש עין בעין וגו' כי תצא למלחמה על איביך, סמך הכתוב יציאת מלחמה לכאן, לומר לך אם עשית משפט צדק, אתה מובטח שאם תצא למלחמה אתה נוצח, וכן דוד הוא אומר (תהלים קי\"ט) עשית משפט וצדק בל תניחני לעושקי עכ\"ל רש\"י ז\"ל, וכתב המהר\"ל בגו\"א, דיובן הסמיכות, עפי\"מ דאמרינן במתני' דאבות, חרב בא לעולם על ענוי הדין ועל עוות הדין ועל המורים בתורה שלא כהלכה, והסביר שם שעונש זו הוא מדה כנגד מדה עיי\"ש לדרכו, עכ\"פ מבואר במשנה דבעונש עוות הדין חרב ומלחמה באה לעולם ר\"ל, וידיעת ההפכים שווין, וע\"כ אם עשית משפט וצדק, אתה מובטח שאם תצא למלחמה אתה נוצח ותנצל מן החרב, וז\"ש דוד עשיתי משפט וצדק בל תניחני לעושקי עכת\"ד ז\"ל, ובזה יובן דברי הגמ' סנהדרין הנ\"ל, צדק צדק תרדוף למען תחי' וגו', כדאי הוא מנוי הדיינים הכשרים להחיות את ישראל וכו', דע\"י מנוי דיינים כשרים יהי' נעשה משפט צדק, וינצלו ישראל מחרב ומלחמה, ומסגולת המצוה להחיות את ישראל בזכותה, וז\"ש צדק צדק תרדוף למען תחי' וירשת את הארץ, שבזכות המשפט צדק תחי' וירשת, וינצלו ישראל מחרב ומלחמה."},{"passage_id":"devurim_61b2a11e_p29","passage_content":"ויבואר בזה דברי התנחומא הנ\"ל ושפטו את העם משפט צדק שיהיו מטין ומלמדין עליהם זכות לפני הקב\"ה וכו' (עיין לעיל קושיא ז') דע\"י שישפטו משפט צדק, בזה יהי' מטין ומלמדין עליהם זכות לפני הקב\"ה, וינצלו ישראל מחרב ומלחמה, ול\"ק קושיתנו הנ\"ל, דאין מקרא יוצא מידי פשוטו ומיירי במשפט הדיינים, אלא המשפט עצמו אם הוא עפ\"י התורה ומשפט צדק, בזה מטין ומלמדין זכות על ישראל."},{"passage_id":"devurim_61b2a11e_p30","passage_content":"ויתבאר לדרכנו כפל הכתוב צדק צדק תרדוף, עפימ\"ש הגו\"א (הובא לעיל) דמתנאי הנביא שיהי' כמוני ולא יירא משום אדם, וזהו הוראה שנבואתו נבדלת והשפעה אלקית בקרבו, וזה גם מתנאי הדיינים הכשרים, שלא יהי' עליהם שום השפעה שבעולם זולת השפעת אלקית, כמו שהבאנו לעיל דברי החן טוב, שעומק הדין לא יושג אלא בהשפעת אלקית, נמצא לפי\"ז דע\"י מנוי דיינים כשרים, ממשיכים על ישראל השפעת אלקית, ובקיום מצוה זו נכלל קיומה של כל התורה כולה בכלליות, דבזה שממנים דיינים כשרים, ממליכים על ישראל עול מלכות שמים, ומשעבדים כל תהלוכתם והתנהגותם תחת השפעת אלקית, ובזה נכלל קיומה של כל התורה כולה בדרך כלל, וע\"י השפעת אלקית יזכו לכוון את האמת בפרטיות בכל דין ומשפט, ולא יבואו לידי טעות, ורש צדק צדק תרדוף, כפל ב\"פ, שמנוי דיינין כשרים הוא כוונה כלליית, לרדוף אחר הצדק, ולהמשיך השפעת אלקית על ישראל, ואם יהי' מנוי הדיינים לכוונה טובה ולש\"ש, ימשיכו עליהם השפעה אלקית בכל פרט ופרט, ויעשו משפט צדק, ועי\"ז יזכו למען תחי' וירשת את הארץ, דכדאי הוא מנוי הדיינים הכשרים להחיות את ישראל כמו שבארנו לעיל."}]},{"dvar_torah_id":"devurim_7c60bb2d","title":"מינוי שופטים ושוטרים לכל שבט","summary":"בפרשת שופטים נדרש למנות שופטים ושוטרים לכל שבט ושבט, והובאו טעמים שונים לכך. יש להבין את הקישור בין המינוי להשראת השכינה, ואת הצורך בשופטים המתאימים לכל שבט לפי תכונתו, כדי להמשיך השפעת אלקות על המשפט.","contents":[{"passage_id":"devurim_7c60bb2d_p1","passage_content":"שופטים ושוטרים תתן לך בכל שעריך אשר ד' אלקיך נתן לך וגו', כבר דקדקנו במילת לך שהוא מיותר, גם אשר ד' אלקיך נתן לך מיותר, וכי מי לא ידע שהשי\"ת הוא הנותן לנו את הארץ, וכבר פירשנו בזה ועוד לאלקי מילין."},{"passage_id":"devurim_7c60bb2d_p2","passage_content":"ב) לשבטיך, פרש\"י מוסב על תתן לך, שופטים ושוטרים תתן לך לשבטיך בכל שעריך אשר ד' אלקיך נתן לך עכ\"ל, וה\"ז כמקרא מסורס, וכתב הרא\"ם ז\"ל דלא יתכן להיות דבוק מלת שבטיך עם נותן לך הסמוך אליו, כי מאחר שאמר אשר ד' אלקיך נותן לך, הרי כל שבטיך בכלל מלת לך, אלא מוסב על תחלת המקרא וכו' עכ\"ד, אמנם צ\"ב למה נאמרה הכתוב בדרך מסורס, וטעמא בעי."},{"passage_id":"devurim_7c60bb2d_p3","passage_content":"ג) לשבטיך, פרש\"י מלמד שמושיבין דיינים לכל שבט ושבט, ובכל עיר ועיר עכ\"ל, וכ\"ה בגמ' סנהדרין (ע\"ז ע\"ב), וכתב הרמב\"ן ז\"ל ולא ידעתי פי' דבר זה, כי כיון שמנינן ב\"ד בכל עיר ועיר, הרי בתי דינין רבים בכל שבט ושבט וכו', אולי בא לומר שאם היתה עיר א' לב' שבטים, כירושלים, שיש בה חלק ליהודה ובנימין, שיושיב בה ב' בתי דינים וכו', ויתכן לפרש שחייב הכתוב למנות ב\"ד על כל השבט, והוא ישפוט את כולם וכו', והגדולים שבהם בחכמה, יתמנו על כל השבט, ותחתיהם בכל עיר ועיר וכו', כדרך שסנהדרי גדולה ממונה על כל בתי דינין של כל ישראל, כך יהא ב\"ד אחד על כל שבט ושבט וכו', עיי\"ש שהאריך בענין, אמנם עדיין טעמא בעי, למה הי' צורך למנות ב\"ד הגדול לכל שבט, ומדוע לא יספיק בב\"ד הגדול של כל ישראל."},{"passage_id":"devurim_7c60bb2d_p4","passage_content":"ד) כתב הרמב\"ם ז\"ל בהל' סנהדרין (פ\"א ה\"א) מצות עשה של תורה, למנות שופטים ושוטרים בכל מדינה ומדינה, ובכל פלך ופלך וכו', וכתב הכ\"מ ודע דבגמ' סנהדרין ילפינן מקרא, שמעמידין שופטים ושוטרים לכל שבט ושבט, וצריך טעם למה השמיטו רבינו, וכן הקשה בלחם משנה, וכתב הכסף משנה לתרץ, דשמא ס\"ל להרמב\"ם, כיון דא\"י נתחלקה לי\"ב שבטים, כל מלכות שבט א' נקרא פלך, וכבר נכלל במ\"ש הרמב\"ם שמושיבין ב\"ד בכל פלך ופלך עכת\"ד, אמנם תירוצו דחוק, דהרי הרבה עיירות, שהי' בהן חלק לב' שבטים, כירושלים שנתחלקה ליהודה ובנימין, ולפי דינא דגמ' עושין בה ב' סנהדראות, כמ\"ש התוס' בגמ' דסנהדרין הנ\"ל, ואין זה נכלל במ\"ש הרמב\"ם לכל פלך ופלך, והו\"ל לומר לכל שבט ושבט כמו שנזכר בגמ'."},{"passage_id":"devurim_7c60bb2d_p5","passage_content":"גם האוהחה\"ק רוצה ליישב שיטת הרמב\"ם, וז\"ל ואולי שסובר הרמב\"ם, שכוונת רז\"ל שדרשו לשבטיך שצריך ב\"ד לכל שבט, הוא קודם שדרשו בכל עיר, אבל אחר שצריך לכל עיר, אין צורך עוד למנות לכל שבט עיי\"ש, והביא ראי' לזה שבגמ' דסנהדרין הנ\"ל, דרשו תיבת לשבטיך שהוא בסוף פסוק, קודם תיבת בכל שעריך שקדומה לה, וה\"ז מגיד, שלא בא חיוב לשבטיך אלא קודם חיוב בכל שעריך, אבל אחר שצוה בכל שעריך, למנות בכל עיר ועיר, אין מקום להצריך לשבטיך עכת\"ד. אולם באמת קשה לומר כן, דלמה הקדימו לדרוש את המאוחר בקרא, ודרשא זו אינה מתקיימת לפי המסקנא, הו\"ל לדרוש בתחלה המוקדם בקרא בכל שעריך למנות בכל עיר ועיר, ולא יצטרך עוד לדרוש בכל שבטיך."},{"passage_id":"devurim_7c60bb2d_p6","passage_content":"ה) עוד קשה דמצינו שמשרע\"ה מנה שרי אלפים שרי מאות ושרי עשרות, ולמה לא מנה ב\"ד לכל שבט ושבט, כמצות הכתוב לשבטיך."},{"passage_id":"devurim_7c60bb2d_p7","passage_content":"ו) במדרש רבה שופטים ושוטרים תתן לך וגו', ושפטו את העם משפט צדק, הלכה קרובו של אדם מהו שיהא מותר לו לישב בדינו, כך שנו חכמים אלו הן הקרובים אביו ואחיו וכו', וכשם שהקרוב פסול להעיד, כך הוא פסול לדון, ומה ראית לומר כן, ארשב\"י כתיב ונגשו הכהנים בני לוי וגו', ועל פיהם יהי' כל ריב וכל נגע, מקיש נגעים לריבים וריבים לנגעים, מה ריבים פרט לקרוב, אף נגעים כן, אמר רשב\"ג אל תהי מלגלג בדין, שהוא א' משלשה רגלי העולם, למה, ששנו חכמים על ג' דברים העולם עומד, על הדין ועל האמת ועל השלום, עכ\"ד המדרש, ראוי להבין מדוע אסמיכו חז\"ל הלכה זו, לפסוק שופטים ושוטרים תתן לך, וא\"א ללמוד מכאן דקרוב פסול לדון, ובש\"ס בבלי וירושלמי למדוה מלא יומתו אבות על בנים, וצ\"ב קישור דרשתם לכאן, גם צ\"ב אחר שנפשטה ההלכה דקרוב פסול לדון, אמר רשב\"ג אל תהי מלגלג בדין וכו', ומה\"ת לסלק אדעתן ללגלג, וצ\"ב הקישור."},{"passage_id":"devurim_7c60bb2d_p8","passage_content":"ולבוא אל הביאור, נקדים מ\"ש האוהחה\"ק (פ' פנחס) עה\"פ יפקוד ד' אלקי הרוחות לכל בשר איש על העדה, וזלה\"ק בתוך הדברים, אמרז\"ל שמשה רבינו ע\"ה, הי' שורש כל הנשמות של דור המדבר וכו', וזו היתה סיבה, שהפקיד והנפקדים נמזגו לגדר ההשתוות, וכל אחד הי' לו כלבבו, וזהו ג\"כ הטעם שצוה ד' עשות שופטיך לשבטיך וכו', לפי שהשבט יתקרב בתכונה לענפיו וכו', וז\"ש יפקוד ד' אלקי הרוחות לכל בשר איש על העדה, פי' שהקב\"ה יודע רוחו של כל בשר וגדר תכונתה, תמנה אחד שיהי' טבעו שוה בתכונה לכל העדה וכו', ותתמזג עם כולן, ואיש כזה אינו בנמצא, זולת אם יהי' אדם כמשה, שכל ישראל הם ענפיו, והוא שורש לכולן וכו', עיי\"ש המשך דבריו."},{"passage_id":"devurim_7c60bb2d_p9","passage_content":"עכ\"פ דלא לנו מרגניתא, להבין קצת בטעם עליון ב\"ה, במה שצוה למנות ב\"ד הגדול לכל שבט ושבט, וכעי\"ז כתב ק\"ז הייטב לב זלל\"ה, לשבטיך לפי ערך של שבטיך, על דרך שפירשו ז\"ל, דור דור ודורשיו דור דור ושופטיו, כי השופט לפי ערך הדור וכו' עייש\"ד."},{"passage_id":"devurim_7c60bb2d_p10","passage_content":"ויתבאר עוד בפנימיות הענין, עפימ\"ש בסוף הקדמת פרי ע\"ח, וז\"ל והי' אומר מורי זלל\"ה, שיש י\"ב שערים ברקיע נגד י\"ב שבטים, וכל אחד עולה תפלתו דרך שער א' וכו', ואין השערים ודרכי השערים שווים, כי אם כ\"א משונה מחבירו, לכן גם התפלות משונות, לכן כאו\"א ראוי להחזיק כמנהג תפלתו, כי מי יודע אם הוא משבט ההוא, ואין תפלתו עולה אלא ע\"י שער ההוא עכלה\"ק, וק\"ז הייטב לב זלל\"ה פי' בזה מאמה\"כ לשבטיך עיי\"ש לדרכו."},{"passage_id":"devurim_7c60bb2d_p11","passage_content":"ונרחיב עוד מ\"ש ק\"ז הישמח משה זלל\"ה (פ' משפטים), שעומק הדין א\"א להשיג בשכל האנושי, אלא בהיות ד' עם השופט, ומלמדו להועיל לכוון הדין כהלכה, וזולת זה עלול לטעות ולהוציא ח\"ו משפט מעוקם, ומזה הטעם שולחין הבעלי דינים לחוץ בשעת גמר דין, דשמא א' מהם משקר, ודובר שקרים לא יכון לנגד עיני, וא\"א שיהי' השראת השכינה, עכ\"פ מבואר דלכוון המשפט וההלכה לאמיתו, צריך לזה השראת השכינה והשפעת אלקות, וא\"א זולת זה."},{"passage_id":"devurim_7c60bb2d_p12","passage_content":"ואפשר להבין בזה טעם הכתוב, שצוה למנות ב\"ד לכל שבט ושבט, וע\"ד שכתב הרמב\"ן הנ\"ל, שהגדולים שבהם בחכמה יתמנו על כל השבט, כדמיון סנהדרי גדולה, ואפשר דכמו שיש י\"ב שערים נגד י\"ב שבטים להעלות תפילתן של ישראל, וכל אחד משונה מחבירו, ואין תפלתו עולה אלא דרך שער ההוא כמ\"ש בפע\"ח הנ\"ל, כמו\"כ הן הצינורות, הממשיכים השפעות בגשמיות וברוחניות, לכל שבט ושבט בפני עצמו, וע\"כ הוצרך ב\"ד הגדול לכל שבט ושבט, שהגדולים שבהם בחכמה יתמנו ע\"ז, שהם ימשיכו השפעת החכמה והדעת, והשפעת אלקות דרך י\"ב צינורות שערי השמים, לכל שבט ושבט כפי בחינתו, כי אין דרכי השערים שווים, ואין בחינת שבט שוה לחבירו, וזה הכרח, כי א\"א לכוון משפט אמת זולת ע\"י השפעת אלקות הנ\"ל."},{"passage_id":"devurim_7c60bb2d_p13","passage_content":"ולפ\"ז יתורץ קושיא ה' הנ\"ל, דמצינו דמשרע\"ה מנה שרי אלפים והמאות, ומדוע לא מנה לכל שבט ושבט ב\"ד לכל שבטו, אמנם לא הוצרכו ישראל לזה בימי משרע\"ה, כי כל ישראל הם ענפיו, והוא שורש לכולן, והי' כולם כלולים בו, והי' ממוזג עם בחינת נפשו של כל אחד ואחד, כמ\"ש האוהחה\"ק הנ\"ל, ע\"כ הי' בכוחו להמשיך מעיינות החכמה, והשפעת אלקות לכל שבט ושבט, כפי בחינתו, אבל בדורות שלאחריו, לא הי' בנמצא עוד איש כמשה רבינו, שיהי' כולל כל הבחינות, על זה הי' הצווי מאתו ית' למנות ב\"ד הגדול לכל שבט, להמשיך על כל הבתי דינין והדיינים של אותו השבט, השפעת אלקית והשפעת הדעת."},{"passage_id":"devurim_7c60bb2d_p14","passage_content":"ואפשר ליישב בזה מה שהשמיט הרמב\"ם ז\"ל הך דינא, דממנין ב\"ד לכל שבט ושבט (עיין קושיא ד') דבימיו לא הי' נפק\"מ לדין זה, דאין מצות מנוי שופטים נוהג כלל בזמה\"ז, דאין לנו סמוכים, והגם שכתב הרמב\"ם הרבה דינים, שאין נוהגים בזמה\"ז, והם הלכתא למשיחא, והרי כתב כל הלכות שופטים, אבל הך דינא דממנין לכל שבט ושבט, אין נפק\"מ בה אף הלכתא למשיחא, כי אז יהי' משה רבינו עמנו, ולא יצטרכו למנות לכל שבט לטעם הנ\"ל, כי הוא כולל נשמת כל ישראל, וע\"כ השמיטה הרמב\"ם ז\"ל, מאחר שאין בה נפק\"מ כלל אף לעתיד."},{"passage_id":"devurim_7c60bb2d_p15","passage_content":"ובזה יתורץ קושיא ב' הנ\"ל, דלמה נאמר הכתוב בדרך מסורס, והול\"ל שופטים ושוטרים תתן לך לשבטיך בכל שעריך כפרש\"י, ואפשר שע\"כ הקדים הכתוב, אשר ד' אלקיך נותן לך למלת שבטיך, להורות דלא הוצרכו למנות לכל שבט ושבט מיד, כל זמן שהי' משרע\"ה קיים כמ\"ש לעיל, ורק אחר שאמר אשר ד' אלקיך נתן לך, שהוא זמן ירושת הארץ, אז הי' הצווי של לשבטיך, גם היא נתינת טעם על לשבטיך, מפני ששורש המשפט ע\"י השפעת א לקות, וזה מרומז באמרו אשר ד' אלקיך נתן לך, ע\"כ הצריכה התוה\"ק לשבטיך, למנות ב\"ד לכל שבט ושבט, כדי שימשיכו השפעת האלקית כפי בחינת השבט."},{"passage_id":"devurim_7c60bb2d_p16","passage_content":"וז\"ש ושפטו את העם משפט צדק, דלכאורה את העם מיותר, וידוע דאת העם ישפוטו, ויספיק לומר ושפטו משפט צדק, אמנם הכוונה, דהשפעת אלקות כפי בחינת העם, וכפי הכנת המקבלים וכ\"א בחינתו משונה, וע\"כ צריך להיות השופט כפי בחי' הדור, כמ\"ש ז\"ל דור דור ושופטיו, וג\"ז הוא טעם על לשבטיך, שהצריכה התוה\"ק ב\"ד לכל שבט ושבט כפי בחינתם."},{"passage_id":"devurim_7c60bb2d_p17","passage_content":"ולדרכנו יתבאר דברי המדרש הנ\"ל (קושיא ו') שהסמיכו להאי קרא שופטים ושוטרים תתן לך, הלכה קרובו של אדם מהו שיהא מותר לו לישב בדינו וכו', וא\"ש קישור הלכה זו לכאן, דלדרכנו מבואר בהאי קרא, דשורש המשפט ועומק הדין, אין דעת אנושי מקיף אותה, ולא יושג אלא ע\"י השראת השכינה והשפעת אלקות, וכ\"ז נרמז באמרו שופטים ושוטרים תתן לך אשר ד' אלקיך נתן לך, שהוא ית' הנותן לך כח הכרעה לעשות המשפט, ומעתה הי' סד\"א לומר דקרוב יהא כשר לדון, דאין לחשוש לנטיית הדעת ע\"י קרבה, כיון דשורש המשפט, לא יושלם ע\"י הכרעת דעת אנושי, כ\"א ע\"י השפעת אלקות, ואין זה כדעת האדם אשר יטה ימין ושמאל ע\"י נגיעה קלה, ומ\"ש הכתוב כי השוחד יעור ויסלף, לפי שהוא מעשה עבירה דאסרה רחמנא, וע\"כ ימנע מן הדיין השראת השכינה והשפעת אלקות, וממילא יסלף דרכו ולא יוציא לאור משפטו, אבל קרבה דאין כאן מעשה עבירה, הי' ס\"ד לומר דלא יפסל, ע\"כ הסמיכו במדרש הלכה זו לכאן דאעפ\"כ קרוב פסול, אמנם אחרי שהחליטו חז\"ל דקרוב פסול, הי' אפשר לומר דזה מורה, דעצם הדין נעשה ע\"י הכרעת דעת אנושי, והראי' שחששה התוה\"ק לנטיית הדעת מחמת קרבת, ועד\"ז יהי' ענין המשפט זלה בעיניך, ע\"כ הסמיכו מאמר דרשב\"ג, אל תהי מלגלג בדין, שהוא א' משלשה רגלי העולם וכו', ובאמת שורש המשפט ע\"י השפעת אלקות, ואין דעת אנושי מקפת אותה, אלא שהתוה\"ק צותה לעשות התרחקות, כל מה ששייך בגדר אנושי להביא לידי נטיית דעת, שאם יש קצת נטיית הדעת, נמנע ממנו השפעת אלקית לכוון משפט אמת, ומהאי טעמא קרוב פסול לדון, ולדרכנו א\"ש מלת לך דמיותר לכאורה כנ\"ל (בקושיא א') ואפשר שירמוז הכתוב שלפי מדריגת ובחינת הממנים, יהי' השפעת אלקות על הדיינים."},{"passage_id":"devurim_7c60bb2d_p18","passage_content":"R"}]}]
