[{"dvar_torah_id":"devurim_e8a36eb7","title":"מעלת המצות הקלות והשכר בעוה\"ז","summary":"בפרשת עקב נדרש על מצות קלות, אשר בני אדם משגיחים בהן פחות. הרמב\"ן מבאר שאין מצוה קלה באמת, וכל המצות חמודות וחביבות. שכרן בעוה\"ז נועד למי ששומר המצות הקלות, אך אין לשקול ערך מצוה מול שכרה.","contents":[{"passage_id":"devurim_e8a36eb7_p1","passage_content":"והי' עקב תשמעון את המשפטים האלה ושמרתם ועשיתם אותם ושמר ד' אלקיך לך וגו' הנה רבו הפירושים במלת עקב מה הוא, והרמב\"ן הק' מביא ג' פירושים ע\"ז יעיי\"ש, וע\"כ האי עקב לדרשא אתי, דלפי פשוטו הול\"ל אם תשמעון וכו', ורשיז\"ל פי' מצות קלות שאדם דש בעקביו וכו', ויש להבין וכי יש מצות שאדם דש בעקביו אתמהה, גם בעלי התוס' הקשו כן, ובמדרש תנחומא נדרש ג\"כ מלת עקב כפירש\"י, וז\"ל מצות קלות שאין בני אדם משגיחין בהן, רק שמשליכין אותן תחת עקביהן כלומר שהן קלות וכו', ממשמעות לשונם נראה דלא דרשו עקב כפשוטו שנידושין בעקב, רק לפי שהן קלות בעיני בנ\"א ומשליכין אותם אחרי גיום, מושאל עליהם שם עקב."},{"passage_id":"devurim_e8a36eb7_p2","passage_content":"ובעלי התוס' העתיקו ג\"כ דברי המדרש הנ\"ל, אבל מבואר בדבריהם שפירשו מלת עקב, שהן קלות ונידושין בעקב ממש, וזהו לשונם יש תמהין, וכי יש מצות שאדם דש בעקביו, ואפשר כגון שילוח הקן, דכתיב כי יקרא קן צפור לפניך בדרך, נמצא כשהולך דש בעקביו על הקן, אי נמי מצות ציצית, שאדם גורר אחריו כמנהג העולם וכו', אמנם הקשו בתוס' שהרי ארז\"ל, דכל המגרר ציציותיו עליו הכתוב אומר וטאטאתי' במטאטא השמד ר\"ל וכו', עכ\"ל, ומ\"ש כגון שילוח הקן, קשה להבין דהרי מציאת הקן אינה מצוה, כמ\"ש רז\"ל כי יקרא פרט למזומן, והמצוה נעשה רק בשעת שילוח, ואז אין נידוש עוד ברגלים, וק\"ז היש\"מ זלה\"ה כתב בשם המפרשים שמכאן סמך לתחומין מן התורה, ופירוש והי' עקב תשמעון, פי' שתשמרו המצות שהן בעקב בהליכת הרגלים, שלא תלכו יותר מתחום שבת, ועיין במאיר נתיבים, אבל לפי\"ז קשה הא אין מצוה זו קלה, ורש\"י ובעה\"ת כללו בפירושם שניהם, שהן קלות וגם נידושים בעקב, וקושיא זו יקשה גם על בעה\"ת, מ\"ש כגון ציצית דאין מצוה זו קלה."},{"passage_id":"devurim_e8a36eb7_p3","passage_content":"ובלבוש ז\"ל הקשה דבסוף פרשת ואתחנן נאמר, היום לעשותם, ודרז\"ל היום לעשותם ולמחר לקבל שכרם לעוה\"ב, דשכר מצוה בהאי עלמא ליכא, ובפרשה זו יעד הכתוב שכר עוה\"ז לשומרי מצותיו, באמרו והי' עקב תשמעון וגו' וברך פרי בטנך וגו', ותירץ דטעם הדבר דשכר מצוה בהאי עלמא ליכא, הוא מפני ששכר מצוה גדול מאוד בערכה, מכל קניני עוה\"ז, ואין בכל הארץ ומלואה די, לשלם שכר מצוה אחת, אבל מה שיעד הכתוב כאן שכר עוה\"ז, הבטחה זו נאמרה על תשלום שכר מצות קלות, ועבורן נותן לנו השי\"ת שכר בעוה\"ז, וזהו והי' עקב תשמעון, פי' המצות קלות, אז ושמר ה\"א לך, ישלם לך שכרך בעוה\"ז זת\"ד ז\"ל."},{"passage_id":"devurim_e8a36eb7_p4","passage_content":"ויש להבין איך אפשר לחלק בין המצות בערכן ובשכרן, ועוד וכי יצוייר מצוה שהוא קלה בערכה, ושכרה מועט, הלא כל המצות כולן, אין שיעור וערך ואין קץ למתן שכרן, ואיך אפשר לומר שהודיענו הכתוב לומר, שבעשיית המצות הקלות נקבל שכרינו משלם בעוה\"ז, הלא ערכי המצות ושכרן נעלמו מאתנו, ולא ניתן לנו רשות להבחין ולשקול מצות התורה, כדאיתא במד\"ר ובתנחומא (פ' זו) זש\"ה אורח חיים פן תפלס נעו מעגלותי' לא תדע, אמר ר' אבא בר כהנא שלא תהא יושב ושוקל מצותי' של תורה ורואה אי זו מצוה מרובה שכרה ועושה אותה, לכן נעו מעגלותי' לא תדע, תני' ר' חייא משל למה הדבר דומה למלך שהי\"ל פרדס, והכניס בו פועלים, ולא גילה להם המלך שכר נטיעות הכרם, שאלו גילה להם שכר נטיעותיו, הן רואין איזה נטיעה ששכרה הרבה ונוטעין אותה, נמצאת מלאכת הפרדס מקצתה בטלה וכו', כך לא גילה הקב\"ה שכר כל מצוה ומצוה, שאלו גילה נמצאו המצות מקצתן קיימות ומקצתן בטלות ע\"כ, וכתב הרמב\"ן ז\"ל (סו\"פ בא) וז\"ל כי הקונה מזוזה בזוז א', וקבעו בפתחו ונתכוין בענינה, כבר הודה בחידוש העולם, ובידיעת הבורא והשגחתו, וגם בנבואה, והאמין בכל פינות התורה, מלבד שהודה שחסד הבורא גדול מאוד וכו', ולפיכך אמרו הוה זהיר במצוה קלה כבחמורה, שכולן חמודות וחביבות מאוד, שבכל שעה אדם מודה בהן לאלקיו, וכוונת כל המצות שנאמין באלקינו, ונודה אליו שהוא בראנו וכו' עכ\"ל, מבואר בדבריו גודל מעלת כל המצות, ושנכלל בקיומם, מצות האמונה בהשגחת הבורא, ובחידוש העולם ובנבואה, ובכל התורה, וא\"כ אין במציאות כלל מצוה קלה, ואין קץ למתן שכרן של מצות."}]},{"dvar_torah_id":"devurim_ad622c99","title":"יראת דוד ממצוות קלות","summary":"דוד המלך מתיירא מיום הדין, במיוחד ממצוות קלות שמא עבר עליהן. המדרש מלמד על שכרן של מצוות קלות, והקשר בין יראת חטא להידור במצוות, במיוחד במצוות פסיעות שאין עליהן חיוב. דוד נזהר במצוות אלו, אך חשש שמא לא קיים אותן כראוי.","contents":[{"passage_id":"devurim_ad622c99_p1","passage_content":"במדרש תנחומא והי' עקב תשמעון, זש\"ה למה אירא בימי רע עון עקבי יסובני וכו', לפיכך הי' דוד מתיירא מיום הדין, ואומר רבש\"ע איני מתיירא מן מצות החמורות שבתורה וכו', ממה אני מתיירא ממצות הקלות, שמא עברתי על א' מהן וכד, ואתה אמרת הוי זהיר במצוה קלה כבחמורה, לכך אמר למה אירא בימי רע וכו', וכתיב גם עבדך נזהר בהם בשמרם עקב רב, אמר דוד לפני הקב\"ה רבון העולמים שמא מפני שהן מתוקין מדבש בסרתי בהן ח\"ו, אלא גם עבדך נזהר בהן בשמרם עקב רב זו מצות קלות, לפיכך כתיב מה רב טובך אשר צפנת ליראיך, זהו שכרן של מצות קלות עכ\"ד המדרש."},{"passage_id":"devurim_ad622c99_p2","passage_content":"ויש להבין דלכאורה דבריו סותרים זא\"ז, שאמר עון עקבי יסובני שנתיירא ממצות הקלות שמא עבר עליהן, ואח\"כ אמר גם עבדך נזהר בהם זו מצות קלות שהי' נזהר בהם, וכן הקשה שם העץ יוסף. גם צ\"ב איך יתכן לומר על אדונינו דהמע\"ה, שהי' שוקל בין המצות, לעשות בהן קלות וחמורות הלא הוא ידע ערכם של מצות, שכל מצות ה' אין קץ ואין חקר לערכם, גם צ\"ב מה שסיים בתנחומא לפיכך כ' מה רב טובך אשר צפנת ליראיך זהו שכרן של מצות קלות, דאיך נשמע מזה שכר מצות קלות בעוה\"ז, הלא בפסוק אין שום רמז דמיירי במצות קלות, וגם צפנת משמעותו שצפון לעוה\"ב."},{"passage_id":"devurim_ad622c99_p3","passage_content":"ואפ\"ל עפמ\"ד בגמ' (סוטה כ\"ב.) א\"ר יוחנן למדנו יראת חטא מבתולה וקיבול שכר מאלמנה וכו', דההוא אלמנה דהואי בי כנישתא בשיבבותה, כל יומא הוה אתיא ומצלה בי' מדרשי' דר יוחנן א\"ל בתי לא ביהכנ\"ס בשיבבותך, אמרה לי' רבי ולא שכר פסיעות יש, ובגמ' (ב\"מ קז.) מבואר דפליגי בזה רב ור' יוחנן והכי איתא התם אשכחתנהו ר' אבא לתלמידי' דרב, א\"ל מאי אמר רב בהני קראי, ברוך אתה בעיר וגו' וא\"ל הכי אמר רב ברוך אתה בעיר שיהא ביתך סמוך לביהכנ\"ס, אמר להו ר' יוחנן לא אמר הכי אלא ברוך אתה בעיר, שיהא בית הכסא סמוך לשלחנך, אבל ביהכנ\"ס לא, ור' יוחנן לטעמי' דאמר שכר פסיעות יש, מבואר דר' יוחנן אית לי' שכר פסיעות ורב לא כן ס\"ל, ורב ור\"י הלכה כר\"י, והנה כתב רשיז\"ל במס' סוטה הנ\"ל, למדנו קיבול שכר מאלמנה, שהיתה טורחת עצמה יותר מהצורך כדי לקבל שכר, מבואר דחיובא ליכא, ולא רמיא עלי' דאינש להביא עצמו לידי חיוב מצוה זו, אלא שאם עושה אותה מקבל עלי' שכר, ולפי\"ז שכר פסיעות אלו יקרא להן מצות קלות, כי אין עליהן חיוב לעשותם, וגם הם מצות שאדם דש בעקביו, דבהליכת הרגלים ודישת העקב נעשית המצוה."},{"passage_id":"devurim_ad622c99_p4","passage_content":"ובדרך זה אפשר לפרש מה דאיתא במד\"ר (פ' בחקותי) חשבתי דרכי ואשיבה רגלי אל עדותיך, אמר דוד בכל יום ויום הייתי מחשב, לבית פלוני אני הולך ולמקום פלוני אני הולך, ורגלי מוליכות אותי לבתי כנסיות ולבתי מדרשות ע\"כ, ורבו הפירושים לבאר דברי המדרש, ולדרכנו אפ\"ל דמיירי לענין שכר פסיעות, דדוד המע\"ה הי' לו ביהכנ\"ס וביהמ\"ד בביתו, ואעפ\"כ הי' מחשב בכל יום להרבות בהליכה ופסיעות, ולילך להתפלל בבית הכנסת הרחוק מביתו, וחשב דאולי תהי' המצוה נעשית שם בתוספת קדושה ובתוס' הידור, אבל ורגלי מוליכות אותי לביהמ\"ד, ששפט בדעתו ובחר להתפלל בבית מדרשו, כי הבחין ולא מצא בית המדרש בבחינת קדושה כבית מדרשו, ובאמת כן הוא, שהי' בית מדרשו של דוד המלך מקודש יותר מכולם, והי' בו השראת השכינה בלתי ספק, אבל אעפ\"כ הי' דוד המע\"ה מתיירא, כדרך הצדיקים שמפשפשים תמיד במעשיהם, ומתייראים אפי' מנדנוד חטא קל, ולכן אמר דהמע\"ה למה אירא בימי רע עון עקבי יסובני, שחשש אולי טעה ולא הכריע כמשפט, ובגודל צדקתו הי' נחשב בעיניו לעון וחטא, מה שלא הרבה בפסיעות כדי להתהדר במצוה, וזהו עון עקבי, מה שחטאתי בעקבי, שמא לא שמרתי מצות פסיעות התלוי בעקביים, ומזה הי' דוד מתירא."},{"passage_id":"devurim_ad622c99_p5","passage_content":"ומעתה יובן לנו דברי התנחומא הנ\"ל, ואין כאן סתירה כלל, דבאמת הי' דהמע\"ה נזהר במצוה קלה כבחמורה, וניחא מה שסיים בתנחומא, שאמר דוד גם עבדך נזהר בהם בשמרם עקב רב זו מצות קלות, ומה שאמר למה אירא בימי רע עון עקבי יסובני, שהי' מתירא מן הקלות ואמר שמא עברתי על אחת מהן אם עשיתי אם לא עשיתי ר\"ל שהי' מתירא שמא לא שמר מצות פסיעות, שהוא מצוה קלה שאין בה חיוב רק תוספת והידור, ואיני יודע אם עשיתי אם לא עשיתי ר\"ל אם עשיתי וקיימתי המצוה כהוגן ואם צדקה הכרעתי."},{"passage_id":"devurim_ad622c99_p6","passage_content":"וכתב אאמו\"ר זלל\"ה בקדושת יו\"ט (פ' בלק), והובא בספה\"ק דמה שדרשו חז\"ל מאשר אנכי מצוך היום לעשותם, דשכר מצוה בהאי עלמא ליכא, היינו רק במצות שצונו אלקינו, כמאה\"כ אשר אנכי מצוך וכו', אבל במה שהאדם מביא עצמו לידי חיוב, ועושה יותר ממה שנצטוה, מגיע לו שכר אף בהאי עלמא, וציין מקור לדבריו לרש\"י ותוס' (ב\"ק ט' ע\"ב) שכתבו דמה שיוסיף האדם בהידור מצוה יותר משליש נכסיו שלא נצטוה בה, יפרע לו הקב\"ה בחייו, ואוכל פירותיהן בעוה\"ז, ועד שליש מצווה עליו דכתיב זה קלי ואנוהו, אינו נפרע לו בחייו, כדאמרינן היום לעשותם ולא היום ליטול שכרן כ\"כ רש\"י ז\"ל."},{"passage_id":"devurim_ad622c99_p7","passage_content":"ולדרכנו מתורץ קושית הלבוש, במה שאמר הכתוב והי' עקב תשמעון וכו' ויעד עלי' שכר עוה\"ז, ולכאורה שכר מצוה בהאי עלמא ליכא, ולפי דרכנו מיירי הכתוב כאן במצות פסיעות, דלא רמיא עלי' החיוב לעשותם, וכיון שהוא מביא עצמו לידי חיוב מגיע לו שכר בעוה\"ז."},{"passage_id":"devurim_ad622c99_p8","passage_content":"ומעתה יובן לנו דברי רש\"י ז\"ל בפירושו מ\"ש והי' עקב תשמעון וכו' אם המצות קלות שאדם דש בעקביו תשמעון, ר\"ל מצות קלות שאין עליהן חיוב לעשותן כמו מצות פסיעות שאמרנו, דישנן מצות קלות אבל החיוב בהם לעשותן כמ\"ש בתנחומא דשילוח הקן הוא מצוה קלה דאין חסרון כיס וקלה לעשותה, ועוד כמה מצות, אבל בכולן יש חיוב בעשייתן, אבל מצות פסיעות כיון שהאדם מביא עצמו לידי חיוב לכן ושמר ד' אלקיך וגו' וברך פלי בטנך וגו' ויגיע עליהן שכר בעוה\"ז."}]},{"dvar_torah_id":"devurim_18460bc3","title":"שכר המצות הקלות בעוה\"ז","summary":"באר המאמר את טעם מצוות קלות, שאין הכוונה לקלות עצמית, אלא לזלזול בני אדם. המתח בין המסית ליצר הרע, והצורך להתרחק מהמסיתים. שכרו של מי שמקיים מצוות קלות בעוה\"ז, אף על פי שהן נחשבות לזניחות בעיני הבריות.","contents":[{"passage_id":"devurim_18460bc3_p1","passage_content":"עוד אפ\"ל התנחומא הנ\"ל ודברי רש\"י ז\"ל באופן אחר, דגדר מצוה קלה שאמרו רז\"ל, אין הכוונה דהמצוה בעצם היא קלה, דאין זה במציאות כלל, דכל מצוה ערכה רם ונשגב כמו שהבאנו לעיל מדברי הרמב\"ן הק' ב\"פ בא, אלא ר\"ל שהיא קלה בעיני בני אדם, ובנ\"א מזלזלין בהם, לכן קראו אותה חז\"ל מצוה חלה, ובאמת ז\"ל התנחומא, מצות קלות שאין בנ\"א משגיחין בהם, ומשליכין אותן תחת עקביהן ע\"כ, אבל אין פירושו שמפני שהיא מצוה קלה, לכן אין בני אדם משגיחין בהם, כי אין במציאות מצוה שהיא קלה בעצם, אלא מפני שבנ\"א מזלזלין בהם, ומשליכין אותן תחת עקביהן לכן קראו אותה חז\"ל מצוה קלה."},{"passage_id":"devurim_18460bc3_p2","passage_content":"ונקדים עוד דלכאורה יפלא מה שהזהירה עלינו התורה כ\"כ במסית ומדיח, כמ\"ש לא תאבה לו ולא תשמע אליו וכו', לא תחמול ולא תכסה עליו וכו', הלא הוא עושה רק אומנתו של יצה\"ר, ומה יוסיף המסית תת כח על הסתת היצה\"ר, וכי יוכל הוא להרע יותר ממנו, ואדרבה לפי הראות כחו של היצר חזק ממנו, כמ\"ש ז\"ל (בקידושין פ\"א) ברב עמרם חסידא שאמר ליצרו חזי דאת נורא ואנא בישרא וכו'."},{"passage_id":"devurim_18460bc3_p3","passage_content":"ואפ\"ל עפ\"י מ\"ש הזוה\"ק (בפ' וישב) עה\"פ וישמע ראובן ויצילהו מידם, דלכאורה מה הי' הצלת ראובן, במה שאמר להם השליכו אותו אל הבור וכו', שהי' בו נחשים ועקרבים, והכניסו למקום סכנה, ותירצו בזוה\"ק שההצלה הי' במה שהצילו מידי בעלי בחירה, כי הנחשים לא יזיקו לאדם, אלא א\"כ נגזר עליו מן השמים, כמ\"ש ז\"ל בגמ' (שבת קנ\"א) אין חי' שולטת באדם עד שנדמה לו כבהמה, וראובן ידע ביוסף שהוא צדיק גמור ובודאי ינצל מהם, משא\"כ אנשים בעלי בחירה יכולים להרע ולהזיק ע\"י רוע בחירתם, גם למי שלא נגזר עליו, וכתבו בזוה\"ק, דזעירין אינון שזוכין להנצל מיד בעלי בחירה, ע\"כ חשבו הכתוב להצלה ע\"כ תוכן דבריו."},{"passage_id":"devurim_18460bc3_p4","passage_content":"וכמו\"כ איכא לחלק בין מעשה היצר למעשה המסית ומדיח, כי היצה\"ר אינו בעל בחירה, ואינו עושה רק שליחותו, וכפי שנצטוה ולא יוסיף עלי', ומסית כל אחד רק כפי שיש ביכולתו לעמוד כנגדו, הגדול לפי גדלו והקטן לפי קטנו, כמ\"ש חז\"ל כל הגדול מחבירו יצרו גדול הימנו, כי אין הקב\"ה בא בטרוניא עם בריותיו, ונצטוה כן שילחום עם כ\"א כפי תכונתו ויכולתו, ואין רצונו לנצח את הבריות, אלא עושה שליחותו, ויותר שמח אם ינוצח, אבל אדם המסית ומדיח שהוא בעל בחירה, ויש בידו להרע ולהסית אפי' כנגד רצון הבוי\"ת, כי אין הקב\"ה מונע הבחירה מבנ\"א, וא\"כ אפשר שיכביד ההסתה על האדם יותר מכאשר ביכולתו לעמוד, והסתה כזו אינו ברצונו ית' ולכן נענש עלי', ומחויב האדם לברוח ממנו בכל אופן ואופן."},{"passage_id":"devurim_18460bc3_p5","passage_content":"ומעתה אפ\"ל דאם האדם מתגבר על מסיתים ומדיחים בעלי בחירה ואינו מתפתה להם, רק לוחם כנגדם, יקבל שכרו משלם בעוה\"ז, כיון שהם מוסיפין וגורמין לו צער ויסורים בהסתה זו ע\"י רוע בחירתם, יותר ממה שהי' רצון הבוי\"ת לנסותו, נמצא שסובל יסורים וצער לעמוד בנסיון, יותר מכפי אשר הושת עליו בצווי הבוי\"ת, והעושה במצותו ית' יותר מכפי אשר הוטל עליו מן השמים, מגיע לו שכרו בעוה\"ז, כבחי' שכתבנו לעיל בשם הקדושת יו\"ט זלל\"ה, ומבואר כן במדרש רבה (פר' זו) א\"ר חלבו למה הדבר דומה ליתום שהי' מתגדל אצל בעה\"ב, הי' אוכל משלו ושותה משלו וכו', אותו היתום אומר כל מה שאני אוכל ושותה ומתכסה, מתוך שכרי הוא מחשבו, א\"ל אותו בעל הבית, חייך כל מה שאתה אוכל ושותה בכח חבית של מים שאתה ממלא לי וכו', אבל שכרך צרור ומונח לך, כך ישראל כל מה שאוכלים בעוה\"ז, בכח היסורים שהן באים עליהם, אבל שכרן צרור ומשומר לע\"ל ע\"כ, ולדרכנו בכח היסורים שסובלים מבעלי בחירה שמוסיפים על שליחותם ועל צווים, מגיע להם שכרן בעוה\"ז."},{"passage_id":"devurim_18460bc3_p6","passage_content":"ומעתה יובן מה שתירץ הלבוש דעל שמירת מצות קלות ישלם ד' שכרן בעוה\"ז, כי המצות קלות פירושו מה שהוא קלה בעיני ברא כנ\"ל, ומצות אלו יש עליהם הרבה מסיתים ומדיחים, ומלעיגים עליו, והנזהר בהם סובל דברת בנ\"א גם בני איש, ובשביל הצער והיגיעה שסובל מבעלי בחירה עבור קיום המצוה מגיע לו שכרו בעוה\"ז כנ\"ל, וא\"ש פי' הפסוק והי' עקב תשמעון שתקיים המצות קלות שאדם דש בעקביו ובנ\"א מזלזלין בהם, ושמר ד' אלקיך וכו' וברך פרי בטנך וכו' תקבל שכרם בעוה\"ז, ויבואר מ\"ש בתנחומא, מה רב טובך אשר צפנת ליראך וכו' זו היא שכרן של מצות קלות, ואפשר שדרשו כן מסיפא דהאי קרא, פעלת לחוסים בך נגד בני אדם שמתגברים נגד בנ\"א המסיתים, ומקיימים מצות קלות נגד בנ\"א המלעיגים עליהם וע\"כ מגיע להם שכרן בעוה\"ז."}]},{"dvar_torah_id":"devurim_9090449f","title":"שכר השמיעה והחוקים","summary":"שכר השמיעה והחוקים","contents":[{"passage_id":"devurim_9090449f_p1","passage_content":"והי' עקב תשמעון את המשפטים האלה וגו' ושמר ד' אלקיך לך את הברית ואת החסד אשר נשבע לאבתיך וגו', רבו הפירושים במלת עקב, הרמב\"ן הק' כתב ג' פירושים ואחד מהם מה שהביא בשם המפרשים, כי טעם עקב, שכר באחרית, ואמר והי' אחרית תשמעון את המשפטים האלה, ושמר ד' אלקיך לך את הברית ואת החסד, וסיים בשבח פירוש זה כי נכון הוא עכ\"ל, גם במדרש רבה פירשו כן וז\"ל אבל שכרו בעקב אני נותן לכם, מנין ממה שקרינו בענינינו והי' עקב תשמעון ע\"כ וכמו\"כ פי' האבן עזרא ז\"ל עיי\"ש, וראוי להבין דהרי מלת עקב, עכ\"ח מוסב על מלת תשמעון דסמיך לי', והרי השמיעה צריך להיות מתחלה ועד סוף, ולפירושם הי' צריך להסמיך מלת עקב, אל הבטחת השכר, שנאמרה בסוף הפסוק, ושמר ד' אלקיך וגו' וברך פרי בטנך, שזה יהי' באחרית הימים ולע\"ל, אבל שמיעת ועשיית המצות הנאמרה בראש הפרשה צריך להיות כל הימים."},{"passage_id":"devurim_9090449f_p2","passage_content":"ב) הקשה הרמב\"ן ז\"ל למה הזכיר הכתוב כאן המשפטים לבד, ולעיל בסוף פרשת ואתחנן נאמר ושמרת את המצוה ואת החקים ואת המשפטים וגו' ולמה חזר וכפל כאן המשפטים לבד, ולא הזכיר את השאר, ותירץ כי יזהיר הכתוב במשפטים הקלים, כדיני ממונות שלא יבזו אותם עכ\"ל. אולם עדיין צ\"ב דהרי לענין שמיעה אין חילוק בין משפטים לשאר מצות, ועכ\"ח מלת משפטים מוסב על תשמעון דסמיך לי', וא\"כ מדוע לא הזכיר כמר'כ גם חקים ומצות."},{"passage_id":"devurim_9090449f_p3","passage_content":"ג) ושמר ד' אלקיך לך את הברית ואת החסד אשר נשבע לאבתיך, ראוי להבין אם ישמעון ויעשו ישראל את כל המשפטים האלה, מה צורך עוד להבטחת השבועה שנאמרה לאבות, הלא מגיע להם הברכות האלה בזכותן, וכן הקשה הישמח משה זלל\"ה."},{"passage_id":"devurim_9090449f_p4","passage_content":"ד) הרשב\"ם סוף פ' ואתחנן פי' קישור הפסוקים וב' הסידרות להדדי, וז\"ל עה\"פ וידעת כי ד' אלקיך וגו' הא-ל הנאמן שומר הברית והחסד וגו' לאלף דור, שמא תאמרו הואיל ונשבע לאבותינו לתת לנו את הארץ, למה הוצרכנו לשמור מצותיו, כי יעשה הוא ית' מה שהבטיח מכל מקום, על זאת אני משיב לכם, כי אם לא תשמרו מצותיו, לא תרשו את הארץ, והוא לא יעבור על שבועתו, כי זו היא מידותיו ית', שומר וממתין את הברית והחסד שנשבע לאבות, לקיים מה שהבטיחן עד אלף דור, לאותו דור שיהיו אוהבין ושומרי מצותיו, והי' עקב תשמעון וגו' אם תשמעון ושמר ד' אלקיך לך וגו' לך ישמרנה ולא ימתין עד אלף דור, עכ\"ל הרשב\"ם ז\"ל. ויל\"ד דלפי פירושו מ\"ש הכתוב דימתין הקב\"ה לקיים ההבטחה עד אלף דור, ע\"כ רק באינם ראויים, אבל אם יהיו ראויים וישמרו ויעשו את המצות, פשיטא דלא ימתין אלא יתן להם מיד, כי מוכרח לקיים את שבועתו, וא\"כ למה הוצרך הכתוב עוד לכפול את הדברים והי' עקב תשמעון וכו' ושמר ד' אלקיך לך, הלא ידיעת ההפכים שווים."},{"passage_id":"devurim_9090449f_p5","passage_content":"ה) גם צ\"ב מה שפי' הרשב\"ם דימתין הקב\"ה לקיים הבטחתו עד אלף דור, ואז יכנסו לארץ, הלא אמרו רז\"ל (ר\"ה ל\"א) שית אלפי שנין הוו עלמא, ואין במציאות בכל שנות העולם אלף דור, וכי לעולם לא יכנסו לארץ אתמהה, הלא מוכרח הקב\"ה לקיים שבועתו, וכמו\"כ הקשו המפרשים ע\"מ דאמרי' (בסוטה ל\"א ע\"א) והובא ברש\"י (פ' ואתחנן) רשב\"א אומר גדול העושה מאהבה יותר מן העושה מיראה, שזה תלוי לאלף דור, וזה תלוי לאלפיים דור, כתיב הכא (שמות כ') לאלפים לאהבי ולשומרי מצותי, והתם כתיב ולשומרי מצותיו לאלף דור, כאן מאהבה וכאן מיראה עכ\"ד הגמ', ולכאורה קשה איך אפשר שישלם ד' שכר העושה מאהבה לאלפים דור והעושה מיראה לאלף דור, הלא אין במציאות בשנות קיום העולם כ\"כ דורות, ואיך יתקיימו הבטחת הכתובים."},{"passage_id":"devurim_9090449f_p6","passage_content":"ותירצו בספה\"ק עפ\"י מ\"ש בס' התמונה שלע\"ל יתארכו הימים להיות ארוכים כמו השנים של עכשיו, ובמגלה עמוקות כתב רמז ע\"ז, ויהי מקץ שנתים ימים, שלעת קץ ולע\"ל, יהי' שנתים של עכשיו רק ימים, ובזה תירצו מ\"ש שמחנו כימות עניתינו שנות ראינו רעה, ולכאורה הרי לא נשאר עוד משנות העולם כ\"כ שנים, שכבר סבלנו גלות ושעבוד, ואיך אפשר שימלא ד' לנו את כל השנים האלה, ולפי הנ\"ל א\"ש שיתארכו הימים והיו לשנים, אבל בחשבון ימי עולם לא יהיו נחשבים רק לימים, וא\"כ אפשר שיקוים לנו שמחנו כימות עיניתנו וכו', וא\"ש מה שכתוב לאלף דור, וגם מ\"ש לאלפים דור לעושים מאהבה, ועוד אפ\"ל עפ\"י מ\"ש חז\"ל, דלע\"ל עתידה אשה שתלד בכל יום, וא\"כ יהי' בכל יום דור חדש, ואפשר שישלם ד' החסד לאלף דור, ואפשר עוד לומר שישלח ד' ברכה כפולה ומכופלת, ויתן שכר הרבה דורות לדור א'."},{"passage_id":"devurim_9090449f_p7","passage_content":"אולם התינח כל אלו התירוצים, לענין הברכה שישלם ד' שכר עושי מצותיו, ולעתיד יעשה ד' נסים האלה, ויתארכו הימים למען שיוכל השי\"ת ליתן שכרם במדה גדושה, כי חפץ חסד הוא, אבל מה שפי' הרשב\"ם ז\"ל, כי יעכב ד' את הבטחת השבועה עד אלף דור אם לא יזכו ח\"ו, איך אפשר לומר כן, הלא אין במציאות אלף דור, וא\"כ לעולם לא יכנסו לארץ, בתמי', ובודאי לא יעשה ד' נסים ולא יאריך ד' שנות גלותינו, בשביל לעכב הבטחת הארץ, וגם האמת לא הי' כן, שנכנסו ישראל לסוף מ' שנה לארץ, ולמה כתבה התורה לאלף דור שאינו במציאות ולא הי' כן באמת."},{"passage_id":"devurim_9090449f_p8","passage_content":"ו) במדרש רבה ושמר ד' אלקיך לך וכו', מהו ושמר א\"ר שמואל בר נחמן כל מה שישראל אוכלים בעוה\"ז מכח הברכות שברכם בלעם הרשע, אבל ברכות שברכו אותם האבות, משומרים הם לע\"ל, שנא' ושמר ד' אלקיך לך את הברית וכו' אשר נשבע לאבתיך, עכ\"ד המדרש. וקשה הא מבואר בגמ' (סנהדרין ק\"ה) דברכותיו של בלעם כולן חזרו לקללה, וא\"כ איך יתכן לומר, דכל מה שישראל אוכלים בעוה\"ז, הוא מברכותיו של אותו הרשע, וגם מצינו שא\"ל הקב\"ה לבלעם לא תאור את העם כי ברוך הוא ופרש\"י והובא במדרש, שא\"ל הקב\"ה אינם צריכים לברכותיך כי ברוך הוא, וא\"כ הוא לכאורה סתירה בין המדרשים וצ\"ב."},{"passage_id":"devurim_9090449f_p9","passage_content":"ז) ברוך תהי' מכל העמים לא יהי' בך עקר ועקרה ובבהמתך, יש להבין קישור סוף הפסוק לתחלתו, ואם הוא ברכה אחרת, הי\"ל לומר ולא יהי' בך עקר ועקרה בו' המוסיף, ולפי פשוטו אין נראה שום קישור ביניהם."},{"passage_id":"devurim_9090449f_p10","passage_content":"ח) אמרו חז\"ל (בכורות מ\"ד ע\"ב) א\"ר יהושע בן לוי לא יהי' בך עקר מן התלמידים, ועקרה שלא תהא תפלתך עקורה לפני המקום עכ\"ד הגמ', פרש\"י ז\"ל וכשתתפלל על בנים תהא נשמעת תפלתך, ובתוס' כתבו דקאי על כל התפלות עיי\"ש, וכתב המהרש\"א ז\"ל בח\"א דלכאורה למה הוציאו חז\"ל הפסוק ממשמעותו דמיירי בעקר ועקרה כפשוטו, ודרשוהו שלא יהי' עקר מן התלמידים ועל תפלה כנ\"ל, ותירץ מפני דכולה קרא יתירא הוא, דכיון דכתיב להלן וברך פרי בטנך וכו' הרי כבר נשמע שלא יהי' בך עקר ועקרה, לכן דרשוהו חז\"ל שיהי' לימודך עושה פירות בתלמידים הגונים, וכן תפלתך עושה פירות ונשמעת עיי\"ש, וצריך ביאור לפי דרשת חז\"ל, איך מקושר סוף הפסוק לתחלתו, דברכה זו שיהא לימודך עושה פירות ותפלתך עושה פירות, לא שייכא בעמים כלל, ואם הוא ברכה בפני עצמה היל\"ל ולא יהי' בך עקר בו' המוסיף."},{"passage_id":"devurim_9090449f_p11","passage_content":"גם יש להבין מהו היתרון והחשיבות שיהיו ישראל ברוכים מן העמים, הלא מצינו בספרי זוטא והובא בילקוט (פ' נשא) אמרה כנס\"י לפני הקב\"ה רבש\"ע לכהנים אתה אומר לברכני, אין אנו צריכים אלא לברכתך השקיפה ממעון קדשך וכו', וברך את עמך ישראל וכו', א\"ל הקב\"ה ואני אברכם, אני עומד אחורי הכהנים ואברכם וא\"כ למה ברכם ד' שיהיו ברוכים מן העמים, ואמרז\"ל בב\"ר (פר' ס') מפני מה לא נפקדה רבקה, עד שהתפלל יצחק עלי', שלא יהי' אומה\"ע אומרים תפלתנו עשתה פירות, עוד שם במדרש שע\"י ברכת לבן, שאמר את היי לאלפי רבבה יצאו ממנה אלופי עשו, עכ\"פ מבואר שברכתם אינו מועלת רק מזקת, ולמה ברכם ד' בברכת העמים."},{"passage_id":"devurim_9090449f_p12","passage_content":"ט) כי תאמר בלבבך רבים הגוים האלה ממני וכו', לא תירא זכר תזכור את אשר עשה ד' אלקיך לפרעה ולכל מצרים וכו', פרש\"י ז\"ל עכ\"ח לשון דלמא הוא, שמא תאמר בלבבך רבים הגוים האלה וכו', אל תאמר כן לא תירא מהם, ולא יתכן לפרשו בא' משאר לשונות של כי עכ\"ל, ויש לדקדק מה צורך בקרא להשמיענו, שמא יעלה בלבבך כך, הלא העיקר הוא האזהרה, ויספיק האזהרה בלבד לא תירא מהם, ובודאי לאיזה כונה כתבה תורה כן וצ\"ב."},{"passage_id":"devurim_9090449f_p13","passage_content":"י) שמע ישראל אתה עובר היום את הירדן לבוא לרשת גוים גדולים ועצומים וכו', ערים גדולות ובצורות וכו', עם גדול ורם בני ענקים וכו', וידעת כי ד' אלקיך הוא עובר לפניך אש אוכלה, הוא ישמידם והוא יכניעם לפניך והורשתם ואבדתם מהר כאשר דבר ד' לך, ראוי להבין למה האריך הכתוב לספר את כל אלה, גוים גדולים ועצומים וכו' ערים גדולים וכו' עם גדול ורם וכו', הלא הכתוב מעיד כי המה דברים ידועים לך כמ\"ש אשר אתה ידעת ואתה שמעת וכו', וכיון שהם דברים ידועים לך א\"כ אין צורך בסיפורם, ויספיק לומר וידעת כי ד' אלקיך אש אוכלה הוא ישמידם והוא יכניעם וכו'."},{"passage_id":"devurim_9090449f_p14","passage_content":"יא) גם מה שסיים הכתוב כאשר דבר ד' לך, מלת לך מיותר, דמובן דלך דיבר בהבטחת הארץ, ויספיק לומר כאשר דבר ד'."},{"passage_id":"devurim_9090449f_p15","passage_content":"יב) במדרש רבה (פר ג' ס\"ח) שמע ישראל אתה עובר היום את הירדן, הלכה אדם מישראל ששותה מים לצמאו, אומר שהכל נהי' בדברו, ר' טרפון אומר בורא נפשות רבות וחסרונן, רבנן אמרי בא וראה, כל הנסים שעשה הקב\"ה לישראל, לא עשאן אלא על המים, וחושב שם כל הנסים שנעשו במים, במצרים במכת דם, ועל הים, ובבארה של מרים ועוד, א\"ל משה הוו יודעין, כל נסים שעשה לכם הקב\"ה לא עשה אלא על המים, ואף בשעה שתעברו את הירדן לירש את הארץ, עתיד הוא לעשות לכם נסים במי הירדן עכ\"ד המדרש, וצ\"ב קישור הלכה זו לפרשת אתה עובר את הירדן, ובגמ' איפסק הלכתא כתרווייהו, רק במשנה פליגי, עכ\"פ איך שייכא כ\"ז לפרשה זו."},{"passage_id":"devurim_9090449f_p16","passage_content":"יג) גם מה שסיים במדרש, רבנן אמרי כל הנסים שעשה הקב\"ה לישראל לא עשאן אלא על המים וכו' מאי נפק\"מ בכ\"ז, להלכה הנאמרה לעיל מני'."},{"passage_id":"devurim_9090449f_p17","passage_content":"יד) גם מצינו במס' גיטין (נ\"ו ע\"ב) שטיטוס הרשע חירף וגידף בזה, ואמר אין גבורתו אלא במים וכו', וחושב שם כל הנסים שהיו במים, יצתה בת קול ואמרה רשע בן רשע וכו', ברי' קלה יש לי בעולמי ויתוש שמה, עלה ליבשה ותעשה עמה מלחמה וכו', וא\"כ למה משבח המדרש כאן שכל הנסים שעושה הקב\"ה אינם אלא במים, ואין זה שבחו של מקום ב\"ה, אלא צריך שיכיר האדם נסי ד' בכל תנועה ותנועה, כמ\"ש הרמב\"ן ז\"ל (סוף פ' בא) וז\"ל שאין לאדם חלק בתורת משה רבינו, עד שנאמין בכל דברינו ומקרינו שכולם נסים, אין בהם טבע, ומנהגו של עולם בין ברבים ובין ביחיד הכל עפ\"י הנס עייש\"ד."},{"passage_id":"devurim_9090449f_p18","passage_content":"טו) במדרש רבה (פר' ג' ס\"י) שמע ישראל, מה ראה לומר להן כאן שמע ישראל, רבנין אמרי, למה\"ד למלך שקידש מטרונה בשני מרגליות, אבדה אחת מהן, א\"ל המלך איבדת אחת שמרי את השני', כך קידש הקב\"ה את ישראל בנעשה ונשמע, אבדו את נעשה שעשו את העגל, א\"ל משה אבדתם נעשה, שמרו נשמע הוי שמע ישראל, עכ\"ד המדרש. ראוי להבין דאין המשל דומה להנמשל, דכאן כשעשו את העגל ע\"כ אבדו שניהם, דמה יועיל נשמע, אם עברו ולא קיימו מצות העשי', וגם איך אפ\"ל שצום ד' אח\"כ שישמרו עכ\"פ אחת מהם, ומה יועיל נשמע לבד, ועכ\"ח ציום שישמרו שניהם נעשה ונשמע, וא\"כ אינו מענין המשל כלל."},{"passage_id":"devurim_9090449f_p19","passage_content":"טז) אל תאמר בלבבך בהדוף ד' אלקיך אתם מלפניך לאמר, בצדקתי הביאני ד' לרשת את הארץ וכו', לא בצדקתך וביושר לבבך אתה בא לרשת את ארצם, כי ברשעת הגוים האלה וכו', וידעת כי לא בצדקתך וכו', כי עם קשה ערף אתה וכו', ומונה והולך חטא העגל, ומרגלים וכו', ראוי להבין מפני מה זה צוה ד' אותנו באזהרה כפולה, בבל תאמר בצדקתי הביאני ד', כי אם ברשעת הגוים האלה, והאוהחה\"ק תמה ע\"ז, וכתב דע\"כ דור כשר היו באי הארץ, כמ\"ש הכתוב ואתם הדבקים בד' אלקיכם וכו', דאל\"ה לא היתה מועלת ברית אבות לרשת את הארץ, ודור המדבר יוכיח שלא הועיל להם זכות אבות לחודא, וכמ\"ש הראב\"ד בפ\"ב דעדיות, שהקב\"ה מתגלגל עמהם וממתין עד דור זכאי כדורו של יהושע, ורק דור זכאי ראוי לכנס לארץ, וא\"כ ע\"כ היו זכאים וצדיקים, וא\"כ למה הזהירם הכתוב לידע כי לא בצדקתך וכו', ותירץ האוהחה\"ק כי שעור הכתוב לומר, הגם שאתה עדה שלמה וצדיקים, אין בזכותכם כדאי לרשת את הארץ, אם לא היתה זכות אבות, שלא היו שלמים כ\"כ, לתת להם את הארץ בזכותם לבד, בלי זכות אבות עכדה\"ק."},{"passage_id":"devurim_9090449f_p20","passage_content":"והרמב\"ן הקשה ג\"כ, וז\"ל ויש על השואל לשאול, שהרי אמר הכתוב כי מאהבת ד' אתכם, והנה הם אהובים למעלה, והשם ית' לא יאהב רק את הטובים, כי רשע ואוהב חמס שנאה נפשו, א\"כ גם בצדקתם ירשו את הארץ, ומפני מה זה הזהירה התוה\"ק עליהם בבל תאמר בצדקתי וכו', עיי\"ש מה שתירץ, אבל עדיין צ\"ב איך אפשר לומר עליהם לא בצדקתך וכו', הרי דור המדבר הי' דור גדול מאוד, דאיתא בזוה\"ק דדור גדול כזה לא יהי' עד ביאת המשיח, ושמעו כל התורה מפי משרע\"ה, ואפי' אותו הדור שמתו במדבר, איתא בפדר\"א שלא שלטה בהם רמה ותולעה, וחיד\"א ז\"ל מביא בשם פרדר\"א, שהדור ששמעו אנכי לא ראו קרי מימיהם, ומה שהי' בהם מחטאים, הם ענינים גבוהים ונעלמים מעינינו, ומכ\"ש דור שני באי הארץ, שנא' עליהם לאלה תחלק הארץ, ודרשו בספרי (הובא באוה\"ח והוא גירסא בספרי) לאלה צדיקים וכשרים כמותכם ומדוע אמר הכתוב עליהם לא בצדקתך וכו'."},{"passage_id":"devurim_9090449f_p21","passage_content":"יז) עוד הקשה האוהחה\"ק, על מאמר הכתוב זכור אל תשכח את אשר הקצפת וכו', וז\"ל תימה איך מוכיח הכתוב ממה שעבר בזמנים שהיו בהם רשעים, לזמן הזה, שאפשר שצדקתם שהם עומדים בה היום, תספיק להם לרשת את הארץ, ויכולין לומר בצדקתי הביאני ד', ובאמת הוא קושיא גדולה שהרי דור באי הארץ לא הי' בהם מחטאים אלה כלל, ודור ראשון שחטאו נשארו במדבר ומתו, א\"כ למה נותן הכתוב טעם על לא בצדקתך אתה בא לרשת את הארץ, ומונה והולך כל החטאים האלה, הרי הם לא עשו אלה החטאים, וצדיקים וכשרים היו וצ\"ב."},{"passage_id":"devurim_9090449f_p22","passage_content":"יח) ושמרתם את כל המצוה אשר אנכי מצוך היום למען תחזקו ובאתם וירשתם את הארץ אשר אתם עוברים שמה לרשתה, ראוי להבין למה הזהירם הכתוב עוד על התחזקות לבוא לרשת את הארץ, הלא כבר נצטוו על ירושת הארץ, כמ\"ש לעיל אתה עובר היום את הירדן לבא לרשת וכו', ועוד כמה פסוקים שנאמרו בפ' זו, וא\"כ היתה ירושת הארץ מוחלטת, ולמה הזהירם ד' ית' עוד על התחזקות, ואזהרה זו הי' צריך שיוקדם לכל הבטחות והצווים האלה, ולא לאחרי'."},{"passage_id":"devurim_9090449f_p23","passage_content":"יט) כי הארץ אשר אתה בא שמה לרשתה, לא כאמ\"צ הוא וכו', והשקית ברגלך כגן הירק, והארץ אשר אתם עוברים שמה לרשתה, ארץ הרים ובקעות למטר השמים תשתה מים וכו', פרש\"י ז\"ל בשם הספרי, יכול בגנותה של א\"י הכתוב מדבר, וכך אמר להם לא כאמ\"צ הוא אלא רעה ממנה, תלמוד לומר וחברון שבע שנים נבנתה לפני צוען מצרים וכו', אפשר אדם בונה בית לבנו הקטן, ואח\"כ לבנו הגדול, אלא שהי' משובח וטובה הימנה שבע פעמים ככה, ארץ הרים ובקעות, פרש\"י משובח ההר מן המישור, שהמישור בבית כור אתה זורע כור, אבל ההר בית כור ממנו חמשה כורין ד' מארבע שפועיו וא' בראשו ע\"כ, ראוי להבין אחרי שבא הכתוב לספר במעלות ושבח הארץ שיש לה הרים, א\"כ למה אמר ארץ הרים ובקעות, הלא המישור אין זה משבחה של א\"י, ויספיק לומר ארץ הרים לבד."},{"passage_id":"devurim_9090449f_p24","passage_content":"כ) גם צ\"ב למה חושב הכתוב ההרים למעלת א\"י, הלא אמרו חז\"ל בערובין (נ\"ו ע\"א) כל עיר שיש בה מעלות ומורדות, אדם ובהמה שבה מזקינות בחצי ימיהן, ופרש\"י מפני הטורח, וא\"כ אין זו מעלה ושבח, ולמה לא כתב שבח המישור שאין בו טורח, ועושה פירות כמה מאות פעמים כמישור של שאר ארצות, כדאמרינן בכתובות (קי\"ב ע\"א) בברכותי' של א\"י, בית סאה עושה חמשת רבוא כורין וכו', וחברון שבע שנים נבנתה לפני צוען מצרים וכו' חברון מבונה על אחת משבעה בצוען והני מילי בטרשים, אבל שלא בטרשים חמש מאה, והני מילי שלא בברכותי', אבל בברכותי' כתוב ויזרע יצחק בארץ ההוא וימצא מאה שערים וכו' (ועיין רש\"י שם) נמצא שעולה החשבון דבית סאה בא\"י עושה חמשת רבוא כורין, והוא שבע מאות פעמים, ממה שעושה בית סאה בצוען מצרים, והרבה יותר ממה שעושה בית סאה בשאר ארצות, וא\"כ למה משבח הכתוב א\"י בהרים שעושים פירות מארבע שפועיו כדברי רש\"י, הלא גם בשאר ארצות מצוי כן, וכמה ארצות מלאים הרים גבוהים ונוראים."},{"passage_id":"devurim_9090449f_p25","passage_content":"כא) צ\"ב מה שחושב הכתוב בשבחה של א\"י, למטר השמים תשתה מים, ומאי רבותי' והלא כל העולם יש לו מעלה זו, אפי' מקומות שהם פחותים מאמ\"צ, רק ארץ מצרים לבדה הי' שותה מנילוס שלא כדרך העולם, וא\"כ אין זה לשבח א\"י מה שהוא עדיפא מאמ\"צ, כיון שהוא שוה בזה לכל העולם."},{"passage_id":"devurim_9090449f_p26","passage_content":"כב) גם יל\"ד מ\"ש למטר השמים, הלא ידוע דמטר הוא מן השמים, ויספיק לומר למטר תשתה מים, ובתוה\"ק לא נכתב אפי' אות א' שלא לצורך, אם לא לדרשא או ללמוד ממנה, וצ\"ב יתור זה למאי אתא."},{"passage_id":"devurim_9090449f_p27","passage_content":"כג) להלן בפ' ק\"ש ועצר את השמים ולא יהיה מטר, יל\"ד דנראה לכאורה ככפל לשון, ולמ\"ל לספר הסיבות הגורמת מניעת המטר, ויספיק לומר ולא יהי' מטר."},{"passage_id":"devurim_9090449f_p28","passage_content":"כד) גם קראו הכתוב במקום א' מטר השמים, ולהלן הוא אומר מטר ארצכם, ובפשטות משמעותו ע\"ש שהוא משקה את הארץ קראו מטר ארצכם, אבל יש להבין מדוע שינה הכתוב שבמקום א' קוראו מטר השמים, ובמ\"א קורא אותו מטר ארצכם וצ\"ב."},{"passage_id":"devurim_9090449f_p29","passage_content":"ולבא אל הענין נחזור לראש דברינו במה שהתחלנו לפרש הכתוב והי' עקב תשמעון וכו', ופרש\"י ז\"ל מצות קלות שאדם דש בעקביו וכו', וכן פירשו בעלי התוס' וכן הוא בתנחומא עיי\"ש, והקשו בעה\"ת ז\"ל וז\"ל, יש תמהין וכי יש מצות שאדם דש בעקביו ותרצו כגון שלוח הקן, ומצות ציצית עיי\"ש, ובישמח משה כתב בשם המפרשים שמכאן סמך לתחומים מן התורה, ופי' והי' עקב תשמעון, ר\"ל שתשמרו המצוה שהוא בעקב, בהליכת רגלים, שלא תלכו יותר מתחום שבת עיי\"ש, וגם אנכי אמרתי חלקי בכמה אופנים, הלא הם כתובים בחי' עיי\"ש."},{"passage_id":"devurim_9090449f_p30","passage_content":"וכעת התבוננתי וראיתי שגם תפלה הוא מצוה התלוי בפסיעות, וגם הוא קלה בעיני הבריות, כמ\"ש ז\"ל (בברכות ו' ע\"ב) מאי כרום זלות לבני אדם (תהלים י\"ב) אלו דברים שעומדים ברומו של עולם ובנ\"א מזלזלין בהם, ופרש\"י ז\"ל דברים העומדים ברומו של עולם כגון תפלה שעולה למעלה, עכ\"ל. ויש להבין משפרש\"י זו תפלה שעולה למעלה, והלא כל המצות עולין למעלה, אם נעשין לשמה, כמ\"ש ז\"ל בפסחים (נ' ע\"ב) רבא רמי כתיב כי גדול עד שמים חסדך, וכתיב כי גדול מעל שמים חסדך, הא כיצד כאן בעושין לשמה, וכאן בעושין שלא לשמה, ואיתא בזוה\"ק כל מצוה שהוא בלי דחילו ורחימו לא פרחית לעילא, א\"כ אין בין מצות תפלה לשאר מצות, שכולם עומדים ברומו של עולם ועולים מעל השמים אם נעשים לשמה, ולמה פרש\"י על תפלה דייקא כן. גם יש להבין דלפי פרש\"י מ\"ש ובני אדם מזלזלין בהם קאי ג\"כ על מצות תפלה, וגם הפסוק כרום זלות לבנ\"א קאי לפי פי' על מצות תפלה, ולא מצינו שיהיו מזלזלין בתפלה יותר משאר מצות."},{"passage_id":"devurim_9090449f_p31","passage_content":"עוד נקדים לפרש מה דאיתא בגמ' (ברכות ל\"ב ע\"ב) א\"ר אלעזר מיום שחרב בהמ\"ק ננעלו שערי תפלה, שנא' גם כי אזעק ואשוע שתם תפלתי, ואע\"פ ששערי תפלה ננעלו, שערי דמעה לא ננעלו, שנא' ואל דמעתי אל תחרש, ופרש\"י מדלא כתיב את דמעתי תראה, ש\"מ נראית הוא לפניו וא\"צ להתפלל ע\"ז עיי\"ש, מבואר מדברי הגמ' ששערי תפלה בלי דמעות ננעלו, ולכאורה יש להבין א\"כ מהו ענין התפלה שנתחייבנו בה, וחז\"ל למדוהו מקרא ולעבדו בכל לבבכם, איזה עבודה שהוא בלב זו תפלה, ולדעת הרמב\"ם הוא מ\"ע מן התורה, ולדעת הרמב\"ן ז\"ל עכ\"פ בעת צרה מודה דהוא מדאורייתא, ולכאורה מדוע נתחייבנו בה, אחרי שננעלו השערים ואין מניחין אותה ליכנס כ\"א ע\"י דמעות, והדמעות צריכים להיות דמעות של אמת ובכל לב, וא\"א לצוות ולחייב את האדם בהם, כי הם תלוים בעומק הלב, ואם חסר ההרגש בלב, לא יועיל הצווי עלי', ואיך אפשר להבין כל ענין תפלה שנתחייבנו בה והכי נאמר דמי שאינו יכול להוריד דמעות, יפטר מתפלה כיון שננעלו שערי תפלה, וא\"א שיכנסו, אתמהה."},{"passage_id":"devurim_9090449f_p32","passage_content":"ואפשר לומר דמ\"ש בגמ' דברים העומדים ברומו של עולם ופרש\"י זו תפלה, מיירי מתפילות שהתפללו בדחילו ורחימו, דאל\"ה לא פרחית לעילא כדברי הזוה\"ק הנ\"ל, אבל אעפ\"י שהוא בדחילו ורחימו ועולה למעלה, א\"א שיכנסו, כי ננעלו השערים לתפלה שהוא בלי דמעות, ולכן עומדים ברומו של עולם, כי כבר עלו למעלה, והשערים ננעלים."},{"passage_id":"devurim_9090449f_p33","passage_content":"וא\"ש משפרש\"י ז\"ל דברים העומדים ברומו של עולם על תפלה דוקא, ולא על שאר מצות, כי נשתנה מצות תפלה משאר מצות, כי בשאר מצות אם נעשית המצוה בדחילו ורחימו, פרחית לעילא, ונכנסת בבית גנזי דמלכא, משא\"כ מצות תפלה, כיון דשערי תפלה ננעלו, א\"א להיות נכנסת, וע\"כ עומדים ברומו של עולם, ואם א' בא ומוריד דמעות של אמת בתפלתו, נפתחו השערים, ואז יכנסו ויוכללו בתפלתו, כל אלו התפילות העומדים שם ויש להם תיקון, וא\"ש מה שנתחייבנו במצות תפלה אע\"פ שהשערים ננעלים, אבל סוכ\"ס יהי' להם תיקון ויכנסו כנ\"ל. ומ\"ש בגמ' דבני אדם מזלזלין בהם, יבואר לפי הנ\"ל, דלכאורה כיון דננעלו השערים בלא\"ה, ואין מניחין התפילות לכנס, א\"כ הי' מקום לזלזל בהם, ע\"כ אמרו חז\"ל אלו דברים העומדים ברומו של עולם, ועומדים שם ומצפים עד שיכנסו, וסוכ\"ס יהי' להם תיקון ע\"י שיוכללו בתפלה של דמעות, על כן קראו חז\"ל תגר על בני אדם שמזלזלין בהם."},{"passage_id":"devurim_9090449f_p34","passage_content":"והנה אמרו חז\"ל (ברכות י' ע\"ב) אריב\"ח משום רשב\"א המתפלל צריך שיכוין את רגליו, שנא' ורגליהם רגל ישרה, ובטור הובא בשם הירושלמי פלוגתא בזה, חד אמר כמלאכים דכתיב ורגליהם רגל ישרה, וח\"א ככהנים שהיו הולכין עקב בצד גודל, ונקטינן כמ\"ד כמלאכים דכן משמע בתלמוד שלנו, ועוד איפסיקא הלכתא בשו\"ע מ\"ש הרוקח דצריך לילך ג' פסיעות קודם התפלה להכין עצמו לתפלה, וגם אפסיק הלכה בש\"ע שירחיק מלא קומתו מלאחוריו כדי שיוכל לפסוע ג' פסיעות מלאחריו, עכ\"פ יש מצות פסיעות בתפלה, ופרטי המצוה נעשים ע\"י הרגלים, כגון עמידה בתפילה, שצריך שיכוין את רגליו, וג' פסיעות לפני התפלה, וג' פסיעות לאחריהן."},{"passage_id":"devurim_9090449f_p35","passage_content":"ומעתה אפשר לומר, דמ\"ש מצות שאדם דש בעקביו, כוונו רז\"ל על מצות תפלה שנעשית ע\"י פסיעות ובעקביים ומ\"ש בגמ' דבנ\"א מזלזלין בתפלה, מפני דעיקר עבודת התפלה הוא הכוונה בלב, כמ\"ש חז\"ל איזהו עבודה שבלב זו תפלה, וחז\"ל למדו מצות תפלה ממ\"ש ולעבדו בכל לבבכם זו תפלה, עכ\"פ צריך לכוין בה, ובפרט זה של המצוה בנ\"א מזלזלין ואין מכוונין כראוי, וע\"כ נקראת מצוה קלה, שהוא קלה בעיני בנ\"א ומזלזלין בכוונתה, וגם דש בעקביו ע\"י שפרטי המצוה נעשים בעקביים. והזהירה אותנו התוה\"ק והי' עקב תשמעון, שנשמור גם את המצות קלות מה שהוא קלה בעיני בנ\"א, ולא יזלזלו בהם, ולדרכנו הזהירה התורה על מצות תפלה, שהוא מהמצות שנעשית בעקב, שלא נזלזל בהם, שאע\"פ שהשערים ננעלים, הזהירה התוה\"ק שלא לזלזל בהם כי סוכ\"ס יהי' להם תיקון."},{"passage_id":"devurim_9090449f_p36","passage_content":"ונקדים לתרץ מה שהקשינו לעיל על מ\"ש ברוך תהי' מכל העמים, וכי מהו השבח שנהיו ברוכים מכל העמים, גם להבין הקישור לא יהי' בך עקר ועקרה כנ\"ל, ויתבאר עפ\"י מה דאיתא בגמ' (ברכות י' ע\"א) א\"ל ההוא צדוקי לברוריא, כתיב רני עקרה לא ילדה, משום דלא ילדה רני, אמרה לי' שטיא, שפיל לסיפי' דקרא, דכתיב כי רבים בני שוממה מבני בעולה אמר ד', אלא מאי עקרה לא ילדה, רני כנסת ישראל שדומה לאשה עקרה שלא ילדה בנים לגיהנם כוותיכו עכ\"ד הגמ', וכתב המהרש\"א ז\"ל בח\"א, דלמה לא נתקשה האי צדוקי על רישא דקרא, רני עקרה וכי משום דהיא עקרה רני, ולמה המתין בקושיתו על סיפא דכתיב ולא ילדה, ותירץ משום דברישא דקרא לא קשה, די\"ל דפירושו רני עקרה, שהיתה עקרה כבר בגלות, והשתא אינה עקרה בעת הגאולה ולכן רני, וכן לא ילדה ודאי לשעבר משמע אבל עכשיו ילדה, וא\"כ א\"א להקשות מידי, אלא מיתורא דכפל עקרה ולא ילדה, משמע לי' עקרה דכבר וגם עכשיו לא ילדה, דכה\"ג דרשינן (יבמות ס\"ד) שרי עקרה אין לה ולד מיתורא דכפל, דלא הי' לה אפי' בית ולד ועיקר מטרון חסר לה, וע\"כ קשה לי' דא\"כ אמאי רני עכ\"ד המהרש\"א ז\"ל."},{"passage_id":"devurim_9090449f_p37","passage_content":"וק\"ז הישמח משה זלל\"ה (בהפטורת תצא) מיישב קושית הצדוקי שהקשה משום דלא ילדה רני, וגם קושית ברוריא מסתירת המקראות דאמר עקרה ועדיין לא ילדה, ואח\"כ אמר כי רבים בני שוממה וכו' וקאי על כנס\"י הרי דילדה וכבר תירצו בגמ' ב' קשיות אלו, וכתב הוא ז\"ל עוד בזה עפי\"מ דאיתא (במס' מכות כ\"ד), וכבר הי' ר\"ג וראב\"ע ור\"י ור\"ע מהלכין בדרך, ושמעו קול המונה של רומי ברחוק ק\"כ מיל, והתחילו בוכין ור\"ע משחק, אמרו לו מפני אתה משחק, אמר להם ואתם מפני מה אתם בוכים, א\"ל הללו כושיים ומשתחוים לעצבים ומקטרים לע\"ז, יושבין בטח והשקט, ואנו בית הדום רגלי אלקינו שרוף באש ולא נבכה, אמר להן לכך אני משחק, ומה לעוברי רצונו כך, לעושי רצונו על אחת כמה וכמה ע\"כ בגמ', והנה לפי\"ז אף עכשיו בעת הגלות חורבן ושממון, יש שמחה לישראל מגדולת העכו\"ם מכח ק\"ו הנ\"ל, וכן אמר דוד נתת שמחה בלבי מעת דגנם ותירושם רבו, דאז מגיע גם לי מכח ק\"ו, ועכשיו מבואר הקרא רני עקרה ולא ילדה, היינו שעדיין לא ילדה כפי' מהרש\"א ז\"ל, ואעפ\"כ רני ויש לה שמחה ותקוה, כי רבים בני שוממה, ר\"ל שיהי' רבים בני השוממה כנס\"י, מבני בעולה ונלמד זו מק\"ו מבני הבעולה זו אוה\"ע, דאם לעוברי רצונו כך, לעושי רצונו עאכו\"כ, עכ\"ד הישמח משה זלל\"ה."},{"passage_id":"devurim_9090449f_p38","passage_content":"וכעין זה איתא בספה\"ק אגרא דכלה (פ' לך) עה\"פ ולישמעאל שמעתיך וגו' ואת בריתי אקים את יצחק, ובמדרש ר' אבא ב\"כ בש\"ר בירי אמר, כאן בן הגבירה למד מבן האמה, הנה ברכתי אותו זה ישמעאל, ק\"ו ואת בריתי אקים את יצחק ע\"כ במדרש, והקשה הוא ז\"ל דלמה לן ללמוד מק\"ו, הלא מקרא מפורש לעיל הבטחת השי\"ת ליצחק, ותירץ דבהבטחת השי\"ת לאברהם על יצחק, כתיב והקימותי את בריתי אתו לברית עולם ולזרעו \"אחריו\", אשר ילכו אחריו בחקות התורה, ורק בתנאי אם ישמרו את התורה והמצות, אבל לישמעאל שמעתיך, אע\"פ שאין לו שום זכות, והפרתי אותו והרביתי אותו ונתתיו לגוי גדול, ואע\"פ שאין לבניו שום זכות ומעשים, מ\"מ אתן להם למענך עבור שהוא בנך, ומזה יומשך חסד וטובה לזרע יצחק, שאפי' ח\"ו כשלא יהי' זכות לישראל, הנה יושעו ע\"י ק\"ו מהצלחת ישמעאל וגדולתו, ובאחרית הימים האלה, אם ח\"ו זכות וצדקה אין בנו, הנה יש לנו טענה ותקוה להוושע ע\"י כח הק\"ו, עכת\"ד בס' אגרא דכלה זי\"ע."},{"passage_id":"devurim_9090449f_p39","passage_content":"ופירשתי בזה מה דאיתא במדרש הים ראה וינוס מה ראה ברייתא דר' ישמעאל ראה, והוא פלא, ויובן עפי\"מ דאיתא בילקוט (רמז רל\"ד) שטען ס\"מ ואמר לפניו רבש\"ע לא עבדו ישראל ע\"ז במצרים, ואתה עושה להם נסים וכו', מיד השיב לו הקב\"ה שוטה שבעולם, וכי לדעתם עבדוה, והלא לא עבדוה אלא מתוך שעבוד וטירוף הדעת, ואתה דן שוגג כמזיד ואונס כרצון, כיון ששמע שר של ים כך, אותה חמה שנתמלא על ישראל החזירה על מצרים וכו', והקשו המפרשים הלא טענת אונס בל יועיל בע\"ז, דאיסורו ביהרג ואל יעבור, ותירצו דאעפ\"כ יש לחלק ביניהם ובין המצרים, שהם עבדו באונס והמצרים ברצון, ולכן כלפי המצרים ראוים הם להצלה."},{"passage_id":"devurim_9090449f_p40","passage_content":"ולכאורה אכתי יקשה, הן אמת דאיכא לחלק ביניהם ובין המצרים, אבל איך אפשר שהיו ראוים לנסים גדולים כאלה, כיון שעבדו ע\"ז באיסור, ולדרכנו הנ\"ל היו ראוים לזה מכח ק\"ו, דמצרים וכן כל האומות הי' להם שלוה והשקט, והיו עוע\"ז ברצון, ק\"ו שמגיע לישראל שהי' להם כבר זכותים מצות פסח ומילה, וזכות האמונה שהאמינו בד' ויצאו, ולכן ניצולו מכח ק\"ו, וז\"ש במדרש הים ראה וינוס, ברייתא דר' ישמעאל ראה, ובה מידת ק\"ו דהוא מדאורייתא ע\"כ וינוס, מכח מידה זו."},{"passage_id":"devurim_9090449f_p41","passage_content":"ולדרכנו אפשר לפרש פסוקי דאפטרתא בפ' זו (ישעי' מ\"ט) עוד יאמרו באזניך וכו', צר לי המקום וכו', ואמרת בלבבך מי ילד לי את אלה, ואני שכולה וגלמודה גולה וסורה, ואלה מי גדל, הן אני נשארתי לבדי אלה איפה הם, ופי' הפסוקים שכאשר יבואו בנ\"י בקיבוץ גליות עם רב, ישאלו כנס\"י מי ילד לי את אלה, הלא אני נשארתי לבדי ואלה איפה הם, ר\"ל מאיזה מקום באו, וישיב להם הקב\"ה, כה אמר ד' הנה אשא אל גוים ידי ואל עמים ארים נסי וכו' והיו מלכים אומניך וכו', ולכאורה אינו מתורץ עדיין קושיתם, ששאלתם הי' מאין באו לו כל אלה, ואיך מתורץ במ\"ש אל עמים ארים נסי, ולדרכנו נאמר, דכנס\"י יהיו תמהים וישאלו מאין הי' לי זכות לכל אלה הנסים, ומי ילד לי את אלה, ואני שכולה וגלמודה גולה וסורה, ואין לי די זכותים לכל אלה הנסים, וישיב להם הבוי\"ת, אל עמים ארים נסי וכו', וכאשר אשקל בכף מאזניים מעשיהם כלפי מעשיכם, מגיע לכם בכח ק\"ו, אם לעוברי רצונו כך, לעושי רצונו על אחת כו\"כ."},{"passage_id":"devurim_9090449f_p42","passage_content":"ולדרכנו יבואר ביאור פסוקים הנ\"ל על נכון, מ\"ש לא בצדקתך וביושר לבבך, אתה בא לרשת את הארץ, כי אם ברשעת הגוים האלה, ויובן עפ\"י מ\"ש רז\"ל (סוטה כ\"א ע\"א) יש זכות תולה ג' שנים, ורצו להביא ראי' ממ\"ש באדום כה אמר ד' על שלשה פשעי אדום וכו', ודחו שם דאין ראי' מאדום, דדלמא שאני עכו\"ם דלא מפקיד דינא עלייהו, פרש\"י ז\"ל אין ממהרין מן השמים לפקוד עונותיהם בעוה\"ז, אבל מישראל ממהרין ליפרע בעוה\"ז ומדקדקין אחריהם עכ\"ל, גם מצינו שבקש שלמה המלך, והנכרי אשר יבוא מארץ רחוקה תן לו, בין ראוי ובין שאינו ראוי עיין ברש\"י ז\"ל, וזש\"ה לא בצדקתך וביושר לבבך, כי אע\"פ שהיו דור באי הארץ כשרים וצדיקים, מ\"מ אפשר שיחול עליהם קטרוג, כיון שישראל מדה\"ד מדקדק אחריהם, לזה אמר הכתוב כי אם ברשעת הגוים האלה, ואומה\"ע מקבלים שפע אעפ\"י שהם רשעים כי אין ממהרין לפרע מהם בעוה\"ז כדברי הגמ' הנ\"ל, א\"כ מגיע לך מדין ק\"ו, אם לעוברי רצונו כך לעושי רצונו עאכו\"כ."},{"passage_id":"devurim_9090449f_p43","passage_content":"ומעתה נבין מ\"ש הכתוב ברוך תהי' מכל העמים, כי אחר שפרט הכתוב כל הברכות האלה, וברך פרי בטנך וכו', דגנך ותירושך וכו', ושמא ח\"ו יהי' קטרוג על ישראל, כי אין אדם צדיק בארץ אשר יעשה טוב ולא יחטא, ואיך יחולו הברכות האלה, לכן הבטיח לנו הקב\"ה קיום לברכות הללו, במ\"ש ברוך תהי' מכל העמים, שהברכות יגיע לך מכח העמים, שהם עומדים בגדולתן ושלותן, וא\"כ מגיע גם לך מכח ק\"ו, ויחולו הברכות עליך."},{"passage_id":"devurim_9090449f_p44","passage_content":"ויובן בזה משפרש\"י ז\"ל עה\"פ הן עם לבדד ישכון ובגוים לא יתחשב, (הובא בילקוט), וז\"ל כשהן שמחים אין אומה שמחה עמה, שנא' ד' בדד ינחנו וכו', וכשהאומות עו\"ג בטובה, הם אוכלין עם כל א' וא', ואין עולה להם מן החשבון, שנא' ובגוים לא יתחשב ע\"כ, ולכאורה וכי כך הוא המידה, שהם יזכו בטובת כל האומות, והאומות לא יזכו בטובתן, וכי משוא פנים יש בדבר, ולדרכנו א\"ש, כי בטובת האומות מגיע להם לישראל מדינא מכח ק\"ו, משא\"כ להיפך."},{"passage_id":"devurim_9090449f_p45","passage_content":"ויתבארו לדרכנו מקראי קודש כי תאמר בלבבך רבים הגוים האלה וכו' לא תירא מהם, כי לכאורה כ\"ז מיותר, והול\"ל בקיצור לא תירא מהם, כאשר הקשינו לעיל, אמנם התוה\"ק מלמדנו, פן יפול לב האדם בקרבו, בראותו שלות העכו\"ם והצלחתן, והסט\"א מצליח שלא כדרך הטבע, ופן יפול ח\"ו לידי יאוש ר\"ל, ע\"כ כתבה תוה\"ק כי טענה זו עצמה יהי' לך התחזקות, ולא תירא מהם, כי אם לעוברי רצונו כך, לעושי רצונו עאכו\"כ וא\"ש מה שמאריך הכתוב בגדולת העכו\"ם, כי מזה עצמו יהי' לך התחזקות על הישועה ולא תירא מהם, ומעתה אין כוונת הכתוב כפי הנראה מפשטות הכתובים, שכ\"ז כתבה תורה רק לפי הס\"ד שמא תאמר כן, אבל לדרכנו גם לפי המסקנא והאמת כן הוא, וכל זה ראי' למ\"ש אח\"כ לא תירא מהם, ומביא הכתוב עוד ראי', זכור תזכור את אשר עשה ד' אלקיך לפרעה ולכל מצרים המסות הגדולות וכו' האותות והמופתים וכו', אע\"פ שקיטרגה מידת הדין שאין ישראל ראוים לנסים האלה, שהללו עוע\"ז והללו, אבל הגיע להם הישועה, וניצולו ע\"י כח ק\"ו כנ\"ל, וא\"כ מזה יהי' לך התחזקות ולא תירא מהם."},{"passage_id":"devurim_9090449f_p46","passage_content":"ומעתה נבין קישור הכתוב ברוך תהי' מכל העמים לא יהי' בך עקר ועקרה, ודרשו חז\"ל שלא תהא תפלתך עקורה לפני המקום, כי יש חשש פן ח\"ו ע\"י קטרוג, לא יתקבל תפלתך לפני המקום, ע\"כ אמר ברוך תהי' מכל העמים, דהיינו שיהי' ברכותך מכח ק\"ו, ואז לא יחול עוד קטרוג עליך, כי בין כך ובין כך טוב אתה מהם, וכיון שדרכם צלחה, כ\"ש וק\"ו שמגיע לך, ואין קטרוג שולט עליך."},{"passage_id":"devurim_9090449f_p47","passage_content":"עוד אפשר לפרש קישור הכתוב, עפ\"י מ\"ש (בב\"ר פ' ס') מפני מה לא נפקדה רבקה עד שהתפלל יצחק עלי', שלא יהיו אומה\"ע אומרים תפלתנו עשתה פירות ע\"כ. וע\"כ הכתוב מבשרנו, שלעתיד אע\"פ שנהיו ברוכים מכל העמים, אעפ\"כ לא יהי' בך עקר ועקרה, כי לא יהי, עוד מקום לטעות ולומר שברכתם עשתה פירות, כי יהיו האומות אז ארורים ומקוללים, כמשה\"כ כל המחלה אשר שמתי במצרים וכו' ונתנם בכל שונאיך, וא\"א שברכתך באה ע\"י ברכת העמים (אח\"כ ראיתי פי' זה בחתם סופר החדשים שנדפסו בירושלים)."},{"passage_id":"devurim_9090449f_p48","passage_content":"ובזה יובן דברי המדרש (הובא בייטב לב פ' חקת) מי יתן טהור מטמא לא א', דהנה אלמלא מעשה הרשעים, לא הי' נחשב כ\"כ מעשה הצדיקים, כי כל מה שעושין אינם יוצאים ידי חובתן לפי ערך גדולתו ית', וגם כי אין אדם צדיק בארץ אשר יעשה טוב ולא יחטא, אבל לפי ערך רשעת הרשעים נחשבים מעשה הצדיקים, וזה מי יתן טהור מטמא, שע\"י הטמא מחשיבו הקב\"ה לטהור וצדיק, וזה מחסדי ד' ית' שאע\"פ שאינו ראוי, נותן לו הקב\"ה בכח ק\"ו, ולכן מסיים לא א', כי א\"א לזכות לזה אלא ע\"י חסדי השי\"ת שעושה כן בכח הק\"ו."},{"passage_id":"devurim_9090449f_p49","passage_content":"ועד\"ז יתבארו כוונת הפסוקים, שמע ישראל אתה עובר את הירדן לבוא לרשת גוים גדולים ועצומים, ערים גדולות ובצורות בשמים, עם גדול ורם וכו' ומאריך הכתוב בסיפור גדולת העמים וחזקם הכל מטעם הנ\"ל, כי כ\"ז הוא לטובתכם, כי מגיע לכם השפעת עוה\"ז מכח ק\"ו, ולכן סיים והורשתם וכו' כאשר דבר ד' לך, וקאי גם על תחלת הפסוק כי כל מה שניתן להם גדולה וכבוד הוא לך ובשבילך, כדי שיחולו הברכות עליך כנ\"ל."},{"passage_id":"devurim_9090449f_p50","passage_content":"ועתה נבוא לבאר דברי המדרש הנ\"ל, שמע ישראל אתה עובר את הירדן וכו' הלכה השותה מים לצמאו אומר שהכל נהי' בדברו וכו', וסיום דברי המדרש כל הנסים שעשה הקב\"ה לישראל לא עשה אלא על המים, והדקדוקים כבר נפרטו לעיל, ונקדים מה דאיתא בילקוט (פ' וישלח רמז קל\"ז) עשו הי' לו שש נפשות, והכתוב קורא אותם נפשות הרבה, ע\"י שעובדין לאלהות הרבה, וביעקב כתיב שבעים נפש, אע\"פ שהיו שבעים קורא אותם הכתוב נפש לשון יחיד, ע\"ש שהן עובדין לאלוה א', ע\"כ בילקוט, ואיתא בזוה\"ק כי האומות הם מעלמא דפרודא, ולכן קורא אותם הכתוב רבים, וישראל הם מעולם האחדות וע\"כ נקראים נפש בל' יחיד."},{"passage_id":"devurim_9090449f_p51","passage_content":"ואפשר שזה פי' הברכה, בורא נפשות רבות וחסרונן, שהקב\"ה ברא נפשות רבות, אלו העכו\"ם שנקראו נפשות, וגם נקראו רבים, מעלמא דפרודא, וחסרונן וברא להם כל חסרונם וצורכם וכל טוב העוה\"ז, ולא יחסר להם מאומה, ולכאורה למה עשה ד' ככה, ע\"ז אמר על כל מה שבראת, דתכלית בריאת צורכן וחסרונן הי', להחיות בהם נפש כל חי, שעי\"ז ישיגו חיות והשפעה ישראל שנקראו נפש בל' יחיד, כי מגיע להם בכח ק\"ו, אם לעוברי רצונו כך לעושי רצונו עאכו\"כ כי אולי לא יזכו ישראל בזכותם ופן ח\"ו ישלוט בהם קטרוג, לכן יקבלו השפעתם מכח ק\"ו."},{"passage_id":"devurim_9090449f_p52","passage_content":"ולפי\"ז ישראל נהנים בעוה\"ז מכח ק\"ו, וגם הבאנו לעיל דברי המדרש רבה, כל מה שישראל אוכלים בעוה\"ז מכח הברכות שברכם בלעם הרשע וכו', ולא ינוכה להם כלום מברכות האבות, והם נצחיות ונשארו לעולמים, כמ\"ש ושמר ד' אלקיך את החסד וכו' ודרשו ע\"ז במדרש דברכות האבות משומרין הן לע\"ל, וע\"כ מסיים ברוך חי העולמים, דעיקר הברכה וזכות המצוה שמור לך, וחי לעולמים, נצחיות בעוה\"ז ובעוה\"ב, דעולמים תרתי משמע."},{"passage_id":"devurim_9090449f_p53","passage_content":"ועתה נבאר נוסח הברכה שהכל נהי' בדברו, עפ\"י מה שפי' המפרשים, מ\"ש ברוך שאמר והי' העולם, עפ\"י מ\"ד כי מתחלה עלה במחשבה לפניו ית' לברוא את העולם במדת הדין, וראה שאין העולם מתקיים, הקדים מדת הרחמים ושתפה למדה\"ד, ועי\"ז נתקיים העולם. ובזה פירשו בדבר ד' שמים נעשו, שע\"י דיבורו של הקב\"ה שברא את העולם במדת הרחמים, עי\"ז שמים נעשו ונתקנו, ויש להם תקומה, כי לפי המחשבה לא הי' אפשר להתקיים, וזה פי' ברוך שאמר והי' העולם, ע\"י האמירה שברא השי\"ת את העולם במאמר, והבריאה הי' במדת הרחמים עי\"ז יש לעולם קיום והוי', וזה פי' נוסח הברכה שהכל נהי', שיש הוי' וקיום לכל הנבראים, בדברו, ע\"י הדבור שהוא הבריאה שהי' במדת הרחמים."},{"passage_id":"devurim_9090449f_p54","passage_content":"ובדרך זה יתפרש מ\"ש הכתוב והורשתם והאבדתם מהר כאשר \"דבר ד' לך\" ר\"ל דהדיבור שהי' בשעת הבריאה, שברא השי\"ת את העולם במדת הרחמים זה הי' עבורך, וזה כאשר דבר ד' לך ר\"ל עבורך, א\"כ כל מה שיש להם לאומות השפעת עוה\"ז, הוא הכל מכח שנברא העולם ברחמים, כי אלולי זאת לא הי' קיום לעולם, וא\"כ מגיע לך כל זאת מדינא כי אתה הוא הגורם לכל השפעות האלה, ולכן והורשתם והאבדתם מהר והטעם כאשר דבר ד' לך."},{"passage_id":"devurim_9090449f_p55","passage_content":"וא\"ש מה שהסמיכו במדרש הלכה זו, ונוסח ב' ברכות אלו לפרשת שמע ישראל, כי כ\"ז מבואר בפרשה, כי מה שהתחיל בפרשה לבוא לרשת גוים גדולים ועצומים וכו' ערים גדולות ובצורות וכו', בא להורות על כח הק\"ו כנ\"ל, ומזה יתבאר נוסח הברכה בורא נפשות רבות וכו', שכל השפעתם של האומות כדי שיהיו ישראל ניזונים בכח הק\"ו, ומה שסיים בפרשה כאשר דבר ד' לך, שהדיבור והבריאה הי' עבורך במדת הרחמים כנ\"ל, מזה יתבאר נוסח ברכת שהכל נהי' בדברו כנ\"ל."},{"passage_id":"devurim_9090449f_p56","passage_content":"ועתה נבאר סיום דברי המדרש הנ\"ל, בא וראה כל הנסים שעשה הקב\"ה לא עשה אלא במים וכו', ואפשר כי מים רומז לנצחיות, עפימ\"ד (בכריתות ה' ע\"ב) ת\"ר אין מושחין מלכים אלא על המעיין כדי שתמשך מלכותן, והרמב\"ם ז\"ל (בפ\"א מה' מלכים הי\"א) כתב כשמושחין מלכי בית דוד, אין מושחין אותן אלא על המעין, וכתב הכ\"מ ז\"ל דבבלי ובירושלמי דשקלים איתא מלכים סתם, ומפרש רבינו הרמב\"ם מלכי בית דוד דוקא, דבהנהו בעינן שתמשך מלכותן ולא במלכי אחריני ע\"כ, עכ\"פ מבואר דמעיין רומז לנצחיות, שתמשך לעד ולדורי דורות, וע\"כ עשה הקב\"ה כל הנסים על המים ובמעינות ונהרות, כמו שחושב במדרש על הים ובירדן וביאור מצרים וכו', להורות כי הנסים האלה שעשה לנו הקב\"ה הם נצחיים, והם צינור המשפיע נסים לישראל בכל הדורות, והכל מכח ושורש אותן הנסים, כמ\"ש בזוה\"ק ושאבתם מים בששון ממעיני הישועה, כי הנסים הראשונים הם מעינות המושכין ישועה, וצנורות המשפיעין נסים לכל הדורות, ועוד יש בחי' אחרת במים שרומז לחסדים, כמ\"ש חכמי האמת, וגם מים רומז לטהרה כידוע, וכמ\"ש הכלי יקר בפ' חקת כי מים שורש הטהרה, וע\"כ נותנין האפר פרה לתוך המים ועי\"ז מטהרין עיי\"ש."},{"passage_id":"devurim_9090449f_p57","passage_content":"נמצא דמים רומז על ג' בחינות הנ\"ל, ומעתה נבין קישור הלכה זו, השותה מים לצמאו ונוסח ב' ברכות אלו, לפרשת שמע ישראל אתה עובר היום את הירדן וכו', וגם א\"ש מה שתקנו ב' ברכות אלו על המים דוקא, דהנה בפרשה זו מבואר דכל הנסים שעשה הקב\"ה לא עשה אלא על המים, ומים רומז לנצחיות, וכמו\"כ בנוסח בורא נפשות, ברוך חי העולמים, מבואר דהברכות והישועות הם נצחיים ועומדים לעולמים, בעוה\"ז ובעוה\"ב כמו שבארנו וגם מים רומז לחסדים, ובארנו לעיל בברכת שהכל נהיה בדברו, שכל העולם יש לו קיום והוי' ע\"י מדת החסד, שהוא דבורו של הקב\"ה שבו נברא העולם, וע\"כ תקנו ברכות האלה על המים."},{"passage_id":"devurim_9090449f_p58","passage_content":"ועוד למדנו מדברי המדרש הנ\"ל מ\"ש בא וראה שכל הנסים שעשה הקב\"ה וכו' לא עשה אלא על המים, להורות דרק אם הם בבחי' מים, שיש בהם כח הטהרה וממקור הטהרה הם באים, רק אז יקרא להם שם נסים, ואם לאו הם נסיונות ולא נסים, ואלו הנסים הנעשים באמצעות עוברי עבירה הם באים מכח הטומאה, וצריך לברוח מהם יותר מן הבורח מן הארי ומן הדוב, ומי שיש לו אפי' ספק להאמין בנסים האלה בלתי ספק מינות נזרקה בו."},{"passage_id":"devurim_9090449f_p59","passage_content":"ועתה נבוא לתרץ קושית הרמב\"ן ז\"ל בפ' והי' עקב תשמעון את המשפטים וכו' למה לא נאמרה גם חוקים, כי השמיעה צריך להיות גם בחוקים, ונתרץ גם שאר הדקדוקים בענין, דהנה אם הי' לנו דעת אמיתי, לא הי' במציאות חוקים כלל, והי' גלוים לנו כל מצות התורה כמשפטים כן חוקים, וכן יהי' לע\"ל, כאשר יתקיים בנו ומלאה הארץ דעה, ויבינו טעמי התורה, כמ\"ש חז\"ל במדרש דברים המכוסים מכם בעוה\"ז יהיו צופים לכם לעוה\"ב, ואז לא יהי' חוקים כלל, כמ\"ש ז\"ל במדרש דלע\"ל יתגלה חוק וטעם פרה אדומה לכל, ועתה הוא רחוקה מאתנו, אבל בימינו אלה בעוה\"ר שפלות הדעת והעדר האמונה גברה בעולם, ודעת בנ\"א קצרה מהבין, לא די שאין אנו מבינים החוקים, אלא גם משפטי ד' אינם יודעין ואינם מבינים, ויש להם קושיות על הנהגת הבוי\"ת, ומוציאים משפט מעוקל, ומהפכים ר\"ל דרכי ד' למינות ואפיקורסות."},{"passage_id":"devurim_9090449f_p60","passage_content":"ע\"כ הכתוב מבשר ואומר והי' עקב תשמעון (מל' שומע יוסף, תשמע חלום) את המשפטים האלה, שלבסוף יבינו הכל כי משפטי ד' אמת צדקו יחדיו, ויוצדק בעיניהם הנהגה העליונה, גם יבינו כל המצות כחוקים כמשפטים, ואז ושמר ד' אלקיך את הברית ואת החסד וכו', שיתקיימו כל ההבטחות האלה, ויהי' תיקון השלם, וכל ישראל יהיו צדיקים וכשרים, ואז יתקיים שכרם בעקב, והכתוב רומז על ב' הבטחות אלו, על שמיעת והבנת החקים, ועל שכר העתיד. ויתורץ קושיתנו הנ\"ל לפי מה שפי' עקב לשון אחרית איך אמר הכ' עקב תשמעון, הלא השמיעה צריך להיות בכל הדורות, ולדרכנו כי לזה הבחי' של תשמעו לא יגיעו ישראל אלא באחרית ולע\"ל, שישמעו ויבינו את החוקים ואת המשפטים והנהגה העליונה כנ\"ל."}]},{"dvar_torah_id":"devurim_f4973db8","title":"נעשה ונשמע: קדושת ישראל בהר סיני","summary":"במדרש נדרש על קדושת ישראל בהר סיני, שראו את כל התורה לפני קבלתה. משה מזהיר על אובדן מדריגה זו בעקבות חטא העגל, אך מורה לשמור על השמיעה, שתשמור על קיום התורה. לעתיד, יחזרו ישראל למדריגתם ויבינו את ערך השמיעה.","contents":[{"passage_id":"devurim_f4973db8_p1","passage_content":"עוד אפ\"ל באופן אחר והי' עקב תשמעון, ונקדים לפרש דברי המדרש הנ\"ל שמע ישראל וכו' משל למלך שקידש מטרונה בשני מרגליות, אבדה א' מהן וכו', כך קידש הקב\"ה את ישראל בנעשה ונשמע, אבדו נעשה בעגל, א\"ל משה שמרו נשמע, הוי שמע ישראל, עכ\"ד המדרש. ונקדים מ\"ד בגמ' (שבת פ\"ח ע\"א) שאל האי צדוקי לרבא, על מה שהקדימו ישראל נעשה לנשמע, ברישא אבעי' לכו למשמע אי מציתו קבליתו, ואי לא לא קבליתו, עיי\"ש מה שהשיב לו. ובאמת יש ע\"ז תירוץ מספיק, אבל לפי שאינו מובן לפי השגתם של הצדוקים, לכן השיב לו רבא תירוץ לפי השגתו, ויובן עפימ\"ש בקדושת לוי בלקוטים, אלו קרבנו לפני הר סיני ולא נתן לנו את התורה דיינו, והקשה מאי הי' תועלתינו בקריבת הר סיני בלי קבלת התורה, ותירץ דע\"י קרבתן לפני הר סיני פסקה זוהמתן ונתקדשו כ\"כ, עד שהרגישו באבריהם כל המצות עשה ול\"ת, כמו האבות הקדושים שהי' להם ב' כליות נובעות חכמה, ויתבאר שפיר מ\"ש אלו קרבנו לפני הר סיני ולא נתן לנו את התורה דיינו, כי בקריבת ישראל לפני הר סיני השיגו כבר כל התורה עד שלא ניתנה, ולפי\"ז א\"כ מה הי' צורך עוד לקבלת התורה, מפני שהי' גלוי וידוע לפניו ית', כי לא יעמדו ישראל במדריגה זו, כמו שהי' שנפלו ממדריגתם ע\"י חטא, ואז לא יהי' בכוחם להשיג התורה מעצמם, וע\"כ הי' צורך לנתינת התורה אליהם עכ\"ד ז\"ל, ועוד טעם אפ\"ל כי גדול שכר המצווה ועושה ממי שאינו מצווה ועושה, וע\"כ כדי להרבות שכרן הי' צורך בנתינת התורה להם."},{"passage_id":"devurim_f4973db8_p2","passage_content":"ובזה פירשתי מאמר המסורה נעשה ונשמע, ונשמע קולו בבואו אל הקודש ובצאתו ולא ימות, ונשמע פתגם המלך אשר יעשה בכל מלכותו כי רבה הוא, דהנה מה שאמרו ישראל נעשה קודם לנשמע, שראו בכח קדושתן שכשיבואו להר סיני ידעו וישיגו כל התורה, ויוכלו לקיים העשי' לפני השמיעה, אבל א\"כ למה הי' צורך לנשמע דהיינו קבלת התורה, לזה מתרץ המסורה ונשמע קולו בבואו אל הקודש, שהקב\"ה השמיע לנו את קולו בקבלת התורה, אע\"פ שהשגנו כבר כל מצות התורה, ובצאתו ולא ימות שכאשר נצא מזה המדריגה שהי' גלוי וידוע לפניו ית' כן, גם אז יהיו חיים וקיימים בתוה\"ק, ויתקיים השגתן בתורה ע\"י השמיעה, בקבלת התורה, ועוד טעם ונשמע פתגם המלך אשר יעשה כי רבה הוא, כי גדול המצוה ועושה, ע\"כ הוצרכו עוד לקבלת התורה."},{"passage_id":"devurim_f4973db8_p3","passage_content":"ומעתה יתבאר דברי המדרש הנ\"ל, שא\"ל משה אבדתם נעשה ע\"י העגל, ר\"ל מדריגה זו שהי' לכם בהר סיני, לקיים נעשה קודם השמיעה נאבד מכם, עכ\"פ שמרו נשמע, שאחר השמיעה עכ\"פ תקיימו תורה ומצות, וזה שאמרו במדרש הלואי שמרו נשמע."},{"passage_id":"devurim_f4973db8_p4","passage_content":"אמנם לע\"ל יחזרו ישראל למדריגתן ויהי' פסקה זוהמתן, ויתעלו במדריגה להשיג העשי' לפני שמיעה, אעפ\"כ יהי' אצליהם חשיבות גם השמיעה, כי אז יהי' להם דעת והשגה אמיתית, ויבינו גודל ערך וחשיבות של מצות שמיעה, וזה והי' עקב תשמעון את המשפטים האלה, ובשורה היא להם, שאע\"פ שלא יהיו צריכים לבחי' נשמע, כי יוגדל מעלתם ויהיו בבחי' נעשה כמו שהיו בשעת מ\"ת, אעפ\"כ תשמעון את המשפטים שיקבלו שכר גם על השמיעה."}]},{"dvar_torah_id":"devurim_14cfbaac","title":"ברכות בלעם והשפעתן בעוה\"ז","summary":"במאמר זה מבואר כי ברכות בלעם, אף שנתבטלו, נתקדשו על ידי הקב\"ה והן משמשות כצינור להשפעת טובת עוה\"ז לישראל. ברכות האבות, לעומת זאת, שמורות לעוה\"ב. השפעת עוה\"ז נובעת מברכות העמים, כפי שמבואר במדרשים.","contents":[{"passage_id":"devurim_14cfbaac_p1","passage_content":"באופן אחר אפשר ליישב דקדוקים הנ\"ל, בהקדם לבאר דברי המדרש ושמר ד' אלקיך את הברית ואת החסד, מהו ושמר, א\"ר שמואל ב\"ר נחמן כל מה שישראל אוכלים בעוה\"ז מכח הברכות שברכם בלעם הרשע, אבל ברכות שברכו אותן האבות משומרים הן לע\"ל, שנא' ושמר ד' אלקיך לך את הברית וכו' ע\"כ, וקשה הא מבואר בגמ' (סנהדרין ק\"ה) דברכותיו של בלעם כולם חזרו לקללה, ואיך אפשר לומר דכל מה שישראל אוכלים בעוה\"ז הוא מברכותיו של בלעם, ולכאורה יש לדייק גם בדברי הגמ' סנהדרין הנ\"ל, האיך אפשר שברכותיו של בלעם נתבטלו וחזרו לקללה, הלא פרשה זו מגופי תורה הוא, ונביאות אמת היתה בפיו, כמ\"ש הלא את אשר ישים ד' בפי אותו אשמור לדבר, והרמב\"ם כתב (בה' מלכים) דהכופר בביאת המשיח הוא כופר בתורה, וכתב שם שביאת המשיח הנרמז בתורה בנבואת בלעם, עכ\"פ נבואת אמת הי', ואיך אפשר שיתבטל, הלא א\"א שיתבטל אפי' אות א' מן התורה."},{"passage_id":"devurim_14cfbaac_p2","passage_content":"ואפשר דברכות שאמר בלעם נתבטלו וחזרה לקללה, מפני שהי' רשע והחליק בנבואתו, ואמר פי' כזב בנבואתו כמו שמפורש במדרש ומבואר בדברינו בפ' ואתחנן עיי\"ש, וכל כוונתו הי' להרע וגם גרם רעה לישראל, שעל ידו נפלו ישראל בשיטים, ע\"כ נתבטלו ברכותיו, אבל כיון שכתוב נבואתו בתוה\"ק, וכל דיבור בתוה\"ק הי' הקב\"ה אומר ומשה אומר וכותב כמבואר בגמ' (מנחות ל' וב\"ב ט\"ו), ע\"כ כיון שהקב\"ה אמרה ונכתבה בתוה\"ק יש לה קדושה, וברכות אלו הם נצחיות וקיימים, ולפי\"ז איו עוד סתירה בין המאמרים, דמה שמבואר בגמ' (סנהדרין רדה) דברכות בלעם חזרו ונתבטלו, האמת כן הוא דברכות שאמר בלעם נתבטלו, לפי שנתכוין להרע והי' רשע, אבל מה שחזרו ונשנו מפי הקב\"ה אותן הברכות יש להם קיום נצחית וקדושה, וישראל נהנים מהם בעוה\"ז."},{"passage_id":"devurim_14cfbaac_p3","passage_content":"ונקדים עוד מש\"כ הגה\"ק מבוטשאטש ז\"ל בסידורו דעת קדושים, לפרש מ\"ש בתפלת שמ\"ע, ותן שכר טוב לכל הבוטחים בשמך באמת, ולכאורה למה אנו צריכים להתפלל ע\"ז, הלא אין הקב\"ה מקפח שכר כל ברי', ובודאי יתן שכר לבוטחים בו באמת, אבל נראה דהנה לכל דבר צריך אתערותא דלתתא כידוע, וא\"כ אלו הבוטחים בשמך באמת מחמת שהם דבוקים בהשי\"ת בכל לבם, אין בקשתם על טובת העוה\"ז כלל, וההכרח שיהי' איתערותא דלתתא, לכן אנו מבקשים עבורם, ותן שכר טוב וכו', וזה נחשב לאיתערותא דלתתא, ועי\"ז יזכו להשפעת עוה\"ז, ואילולי בקשתינו עליהם לא הי' אפשר שיזכו להשפעת עוה\"ז, כי כל בקשתם ותפלתם כולה רוחניות, ע\"כ בסי' דעת קדושים."},{"passage_id":"devurim_14cfbaac_p4","passage_content":"ומעתה נבין דברכות שברכו אותנו האבות הקדושים המה כולה רוחניות, ואין להם קישור בעוה\"ז, להמשיך על ידה השפעת עוה\"ז, ע\"כ הם משומרין לעוה\"ב כדברי המדרש, אבל ברכותיו של בלעם, אעפ\"י שנתבטלו וחזרו ונתקדשו אח\"כ ע\"י שאמרן הקב\"ה כנ\"ל, אבל מ\"מ נשאר בו כח הפועל, שאחר שנתקדשו ונעשו ברכות נצחיות, הם צינור להשפעת טובת עוה\"ז, כי האומה\"ע כל השפעתם וטובתם רק בעוה\"ז, וע\"י שעברו הברכות בפיו של בלעם ע\"י דבר המפסיק, נקלטה בהם השפעת עוה\"ז, ומאלו הברכות ישראל נהנים בעוה\"ז, אבל לא מברכותיו של בלעם, כי הם נתבטלו רק מהברכות שנאמרו בתורה שנתקדשו ע\"י שאמרם הקב\"ה כנ\"ל."},{"passage_id":"devurim_14cfbaac_p5","passage_content":"ומעתה יתבארו היטב דברי המדרש הנ\"ל, א\"ר שמואל בר נחמן כל מה שישראל אוכלים בעוה\"ז מכח הברכות שברכם בלעם הרשע, ואין הכוונה על אותן ברכות עצמן, כי הם נתבטלו כדאיתא (בגמ' ב\"ב הנ\"ל) אבל הכוונה על אותן הברכות שנאמרו בתורה ונתקדשו, אבל כיון שעברו ע\"י פיו של בלעם, נשאר בו כח הפועל להשפיע השפעת עוה\"ז, אבל ברכות שברכו אותם האבות הן משומרים לעוה\"ב, כי כולה רוחניות, ואין להם קישור בעוה\"ז כלל, שנא' ושמר ד' אלקיך לך את הברית וכו'."},{"passage_id":"devurim_14cfbaac_p6","passage_content":"ומעתה יתורץ קושית הלבוש ז\"ל, הא שכר מצוה בהאי עלמא ליכא, ואיך אמר הכתוב והי' עקב תשמעון וכו', ומונה והולך ברכות עוה\"ז וברך פרי בטנך ופרי אדמתך וכו', ולדרכנו יבוארו הפסוקים על דרך זה, והי' עקב תשמעון ושמר ד' אלקיך את הברית ואת החסד וכו' ושכר המצות יהיו משומרין לך לעוה\"ב, כי שכר מצוה בהאי עלמא ליכא, ומה שנא' וברך פרי בטנך וכו' אותן ברכות עוה\"ז יושפעו לך מברכותיו של בלעם כדברי המדרש הנ\"ל, ולכן מסיים הכ' ברוך תהי' מכל העמים שכל מה שישראל אוכלים בעוה\"ז הוא מברכת העמים מברכותיו של בלעם."},{"passage_id":"devurim_14cfbaac_p7","passage_content":"וכעין זה פירשתי מה שאמר אחשורוש להמן הכסף נתון לך והעם לעשות בו כטוב בעיניך, דלכאורה הול\"ל והעם לעשות בו כרצונך, ורצונו הלא היא לעשות רעה, וטובה מאי בעי הכא, אך דכל דברי המגלה הזאת הם ברוח הקודש כמ\"ש רז\"ל אסתר ברוח הקודש נאמרה, ומכתבי הקודש הוא, ומצינו בלבן שלמדו חז\"ל מדיבוריו עקרי הלכות, לפי שמן השמים נשלחו דיבורים אלו לתוך פיו, ונעשה מדיבוריו עצם התורה, וכמו\"כ בדיבורו של אותו רשע אחשורוש והמן יש בו טעמי תורה בנגלה ובנסתר, שמן השמים ניתן בפיהם דיבורים אלו, אלא שנתלבשו בלבושים, והם עצמם לא ידעו הרמוז בהם, וע\"כ כדי להמשיך לישראל שפע עוה\"ז, כמו שהשיגו אחר הנס שנא' ואת בית המן נתתי לאסתר, וכל טובות עוה\"ז ניתן להם, ולפי שמרדכי הצדיק ואסתר לא התפללו על טובות עוה\"ז, וכל כוונתם הי' רק להרבות כבוד שמים ולהצלת ישראל, ובהכרח שיהי' איתערותא דלתתא, וא\"א זאת רק ע\"י ברכת העמים כנ\"ל, כי כל השפעתם הוא מעוה\"ז, לכן הושם בפיו של אחשורש אלו הדיבורים, שאמר והעם לעשות בו כטוב בעיניך, ר\"ל מה שהוא טובה אצלך, דהיינו קניני עוה\"ז, ינתן להם לישראל, אף שהוא לא ידע הרמוז בהם, אבל מן השמים הושמו בפיו אלו הדיבורים להמשיך השפעת עוה\"ז לישראל, כי זה צריך להיות ע\"י ברכת העמים דייקא כנ\"ל."},{"passage_id":"devurim_14cfbaac_p8","passage_content":"ולדרכנו אפשר לפרש דברי התנחומא הנ\"ל, לפיכך כתיב מה רב טובך אשר צפנת ליראיך וכו', זו הוא שכרן של מצות קלות, ולכאורה אדרבה בפסוק זה מבואר דשכר מצוה בהאי עלמא ליכא, דאשר צפנת ליריאיך משמע שצפון להם לעוה\"ב, ובתנחומא כתבו דרשא זו על והי' עקב תשמעון, שמפורש שם שכר עוה\"ז, וסיימו בה לפיכך כתיב מה רב טובך אשר צפנת וכו' זו שכרן של מצות, ואדרבה זו ראי' לסתור. אמנם יתפרש הכתוב על דרך זה, מה רב טובך אשר צפנת ליראיך זה שכרן של מצות, שצפון להם לעוה\"ב, כי שכר מצוה בהאי עלמא ליכא, ומה שישראל נהנים בעוה\"ז, הוא מברכת העמים, כמ\"ש הכתוב ברוך תהי' מכל העמים, וכמבואר במדרש הנ\"ל כל מה שישראל אוכלים בעוה\"ז הוא מברכותיו של בלעם הרשע, או ע\"י כח ק\"ו, כמו שפירשנו בדרך הראשון, שהם נערכים נגד העמים, ומגיע להם מדין ק\"ו, וז\"ש פעלת לחוסים בך נגד בנ\"א, כמ\"ש התוס' (יבמות ס\"א ע\"א) דעכו\"ם קרוים בני אדם שהם בני אדם הראשון, אע\"פ שאין קרוים אדם, אבל הם נקראים בנ\"א עיי\"ש, וכל השפעות העוה\"ז הם מקבלים ע\"י שהם נערכים נגד העכו\"ם בכח ק\"ו, או מברכות העמים כדברי המדרש הנ\"ל."},{"passage_id":"devurim_14cfbaac_p9","passage_content":"וב' בחינות אלו מבוארים גם בקרא, והי' עקב תשמעון ושמר ד' אלקיך וכו' דשכר המצות משומרים לך לעוה\"ב, וברך פרי בטנך וכו' וכל ברכות העוה\"ז יהי' ע\"י ברוך תהי' מכל העמים, ע\"כ הביא התנחומא פסוק זה מה רב טובך אשר צפנת וכו' פעלת לחוסים בך נגד בנ\"א, כי כמו כן מבואר בפסוק זה ב' בחינות הנ\"ל, דשכר המצות משומרים הם לעוה\"ב, וכל טובות העוה\"ז יקבלו ישראל ע\"י ברכת העמים כנ\"ל."}]},{"dvar_torah_id":"devurim_e53f221b","title":"הצורך בבניית ב' מקדשות","summary":"הקב\"ה בנה את ב' המקדשות כדי לחזק את ישראל, אף שידע שיחרבו. דור באי הארץ היה צדיקים, אך נדרשו אזהרות מפני חטאים עתידיים. עיקר ירושת הארץ תתקיים לעתיד, כאשר יתחזקו במצוות ויתקדשו במים טהורים.","contents":[{"passage_id":"devurim_e53f221b_p1","passage_content":"באופן אחר אפשר לתרץ מ\"ש הכתוב לא בצדקתך וביושר לבבך אתה בא לרשת וכו', והקשה האוהחה\"ק והרמב\"ן ז\"ל, הלא דור באי הארץ צדיקים היו, ועוד הקשה האוהחה\"ק למה מונה הכתוב כל החטאים האלה, באמרו זכור אל תשכח את אשר הקצפת את ד' אלקיך במדבר וכו', הלא דור באי הארץ לא הי' בהם מחטאים האלה כלל, ודור הראשון שחטאו כבר מתו, ויתבאר בהקדם מה שהקשה היפה תואר (פ' מקץ) אחרי דכבר נרמז בפסוקים חורבן בית ראשון ובית שני, והי' גלוי וידוע מלפניו ית' שעתידין ליחרב, א\"כ למה הי' צורך לבנין בית שני, והי' טוב יותר להמתין על בנין המקווה, בית השלישי שיהי' נצחי ועומד לעד, ותירץ שהי' הצורך לבנין בית שני כדי לזכות על ידו לנס חנוכה עייש\"ד, ודבריו צ\"ב דלמה צריך לתרץ דבנין בית שני הי' בו צורך בשביל נס חנוכה, הלא אפשר לתרץ בפשיטות, דע\"כ לא המתין הקב\"ה על בנין דלעתיד, דחביבין לפני הקב\"ה עבודת הקרבנות שהקריבו ישראל במשך ימי בית שני, ורצה הקב\"ה להיות השראת שכינתו ית' בתוך בני ישראל גם באותן הדורות, שהיו דורות גדולים, ורוב התנאים היו במשך ימי בית שני, ואעפ\"י שהי' גלוי וידוע לפניו ית' שעתיד ליחרב, אעפ\"כ רצה שיהי' השראת שכינתו בתוכינו עכ\"פ במשך ימי הבית, ועו\"ק על דבריו למה הוקשה קושיתו על בית שני, הלא גם על בית ראשון אפשר להקשות כמו\"כ, כי הי' גלוי וידוע שעתיד ליחרב, שכבר התנבא עליו משרע\"ה ונושנתם בארץ וכו', ולמה הי' צורך לבנותו לפי שעה, ולסבול אח\"כ צער החורבן, וקרבנות ישראל שנהרגו בעת החורבן, ולמה לא המתין הקב\"ה על בנין העתיד, שהוא עתיד להיות נצחי וקיים לעד ולא יחרב עוד."},{"passage_id":"devurim_e53f221b_p2","passage_content":"והאמת הברור דאע\"פ שהי' גלוי וידוע לפניו ית' החורבן, וגם הצער שיסבלו ישראל ע\"י החורבן, אעפ\"כ הי' מוכרח להיות בנין בהמ\"ק ראשון ושני, שעל ידם הי' חיזוק לישראל להתקיים, ואותן הח' מאות שנה שהיו המקדשות נתנה השפעה רוחניות לישראל שיתקיימו גם בימי גלותם אח\"כ, כמ\"ש התוס' במס' ב\"ב (כ\"א ע\"א) על מ\"ש בגמ' שם, התקינו שיהיו מושיבין מלמדי תינוקות בירושלים, מאי דרוש כי מציון תצא תורה, וכתבו התוס' לפי שהי' רואה קדושה גדולה וכהנים עוסקים בעבודה, הי' מכוין לבו יותר ליראת שמים וללמוד תורה, כדדרשינן בספרי למען תלמד ליראה וגו', גדול מעשר שני שמביא לידי תלמוד, לפי שהי' עומד בירושלים עד שיאכל מעשר שלו, והי' רואה שכולם עוסקים במלאכת שמים ובעבודה, הי' גם הוא מכוון ליראת שמים ועוסק בתורה, עיי\"ש. ואלולי ב' מקדשות אלו לא הי' בכוחם של ישראל לעמוד נגד נסיונות הגלות ונסיונות הדור, ע\"כ הי' הכרח שיהי' בנין ב' מקדשות אלו."},{"passage_id":"devurim_e53f221b_p3","passage_content":"ואפשר שמה שאמר הכתוב לא בצדקתך וכו' הכוונה על דרך זה, דבאמת הי' דור באי הארץ דור כשר וצדיקים, כמ\"ש הראב\"ד (בפ\"ב דעדיות) דהמתין הקב\"ה על דור כשר שיהיו ראוים לכנס לא\"י, ומבואר במדרש שהיו כולם צדיקים כמובא לעיל, אבל הי' גלוי לפניו ית' מה שיהי' לבסוף, שעתידין לחטוא בע\"ז בבית ראשון, ובית שני נחרב עבור חטאים אחרים, לכן הזהירם הכתוב לומר לא בצדקתך וביושר לבבך אתה בא לרשת את הארץ, שלא תחשוב שכבר הגעת לשלימות גמור שיהי' ירושת הארץ נצחי, כמו שיהי' לעתיד שלא יחטאו ישראל עוד לעולם, ויתבטל היצה\"ר מן העולם, אבל אתה לא הגעת עדיין למידה זו, ועדיין אתה עלול לחטוא, ואע\"פ שאתם כדאי ליכנס לה עתה, אבל אינו מספיק צדקתך שיהי' ירושת הארץ קיום נצחי אצלכם, וע\"כ אמר לא בצדקתך, ומביא הכתוב ראי' לזה, זכור אל תשכח את אשר הקצפת את ד' אלקיך וכו' למן היום אשר יצאת מאמ\"צ וכו', ואע\"פ שיצאת מאמ\"צ ונתקדשו ישראל במעמד הר סיני, אעפ\"כ נזדמן להם כל אלו החטאים שמונה הכתוב, א\"כ תדע שעדיין אתה עלול לחטא, ותזהר והשמר מהם, כי אם לאו ח\"ו עתיד בהמ\"ק ליחרב, ע\"כ הזהירם הכ' לא בצדקתך וכו' אע\"פ שהיו צדיקים כנ\"ל, אבל עדיין היו צריכים אזהרה, מפני שהי' גלוי וידוע לפניו שעתידים לחטוא ועתיד בהמ\"ק ליחרב."},{"passage_id":"devurim_e53f221b_p4","passage_content":"ולא רצה הקב\"ה להזכיר להם בפירוש חורבן בהמ\"ק, כי די' לצרה בשעתה, ע\"כ הזכירו רק ברמז במאמר זה כנ\"ל. וא\"ש מה שהזכיר הכתוב חטאים האלה אע\"פ שהם לא עשו כל זאת, רק הדור הראשון שכבר מתו, אבל הכתוב הביא זאת לראי' לומר, ראו מה שאירע לדור יוצאי מצרים, אעפ\"י שהיו דור דיעה אעפ\"כ הוכשלו בחטאים האלו, ע\"כ הזהרו והשמרו כי עדיין אתם עלולים לחטוא, ופן תגרמו ח\"ו החורבן והגלות ע\"י עוונותיכם, וכמ\"ש החתם סופר זלל\"ה לפרש מאמר המשנה איזהו חכם הרואה את הנולד, ונולד לשעבר משמע, והיל\"ל איזהו חכם הרואה את העתיד להולד, אמנם זה נביא יתקרי ולא חכם, ומעלת החכם שרואה מה שנולד כבר, וחושש ומתירא פן יהי' הדבר עוד, ומה שהי' הוא שיהי' עכתד\"ק."},{"passage_id":"devurim_e53f221b_p5","passage_content":"וכמו\"כ לעניננו ע\"כ מונה הכתוב החטאים שעשו דור יוצאי מצרים, למען ישכילו דור שני באי הארץ, וידעו שכבר הי' לעולמים בדור הראשון, אע\"פ שהיו צדיקים וגדלה מעלתם מאוד, אעפ\"כ נכשלו בחטאים אלה, כמ\"ש חז\"ל לא היו ישראל ראוים לאותו מעשה וכו', ע\"כ יזהרו כי עדיין עלולים לחטוא, ואם תאמר כיון שהזהירם הכ' על החורבן כנ\"ל, א\"כ למה לא המתין הקב\"ה על בנין העתיד, שאז לא יחטאו עוד ישראל ויהי' בנין נצחי, ולא יצטרכו ישראל לסבול צער החורבן, ע\"כ אמר הכתוב לא בצדקתך וביושר לבבך וכו' אע\"פ שעדיין אתה עלול לחטוא, ועתיד הבית ליחרב, אעפ\"כ הי' הכרח שיבואו ישראל לא\"י ולבנות בהמ\"ק, וזה שאמר כי אם ברשעת הגוים האלה ד' מורישם מפניך, ולמען הקים את השבועה וכו' כי ע\"י רשעת הגוים שמטמאים את הארץ, כוחות הטומאה שלהם חזקים מאוד, ופן לא יהי' בכוחם של ישראל לעמוד נגד כוחות הטומאה החזקים, ולא יוכלו להתקיים בתורתם, והקב\"ה מוכרח להקים את שבועתו להם, ע\"כ הכניסם לא\"י ובנה להם את בית הבחירה אעפ\"י שהי' גלוי לפניו ית' החורבן, מפני שזה יהי' חיזוק לישראל שיתקיימו כנ\"ל."},{"passage_id":"devurim_e53f221b_p6","passage_content":"ועתה נבוא לתרץ מה שהקשינו על מאמר הכתוב למען תחזקו ובאתם וירשתם את הארץ, למה הזהירם הכתוב על התחזקות אחרי כל הבטחות, והי' עוברים את הירדן מיד, כמאה\"כ אתה עובר היום את הירדן, ולמה הי' צריכים עוד להתחזקות, ואגב יתורצו שאר הקושית במאמר זה, בהקדם מה דאיתא (במד\"ר פ' ראה) וז\"ל כי ירחיב ד' אלקיך את גבלך, אפשר שהקב\"ה מרחיב את א\"י, א\"ר יצחק המגילה הזאת אין אדם יודע כמה ארכה וכמה רחבה, כשהיא נפתחת היא מודעת כמה היא, כך א\"י כל רובה הרים וגבעות, שנא' והארץ אשר עוברים בה ארץ הרים ובקעות וכו', כשישרה אותה הקב\"ה, מנין שנא' כל גיא ינשא וכל הר וגבעה ישפלו והי' העקוב למישור והרכסים לבקעה, אותה שעה היא מודעת מה היא, וכו', ואיתא בספרי שהראה לו הקב\"ה למשה כל חדרי א\"י, ופי' שהראה לו כל מה שטמון בתוך ההרים, שעתידין להתרחב ולהיות נגלה לעין כל לעתיד, הראה ד' למשה רבינו באותה שעה."},{"passage_id":"devurim_e53f221b_p7","passage_content":"ובאמת אפי' בשעה שהיו ישראל על אדמתם, היתה א\"י גדולה הרבה יותר מכאשר היא אחר החורבן, כמ\"ש בגיטין (נ\"ז ע\"א) א\"ר יהודה א\"ר אסי ס' רבוא עיירות הי' לו לינאי המלך בהר המלך, וכל א' וא' הי' בה כיוצאי מצרים וכו', אמר עולא לדידי חזי לי ההוא אתרא, ואפי' ס' רבוא קני לא מחזיק, אמר לי' ארץ צבי כתיב בה, וכו', בזמן שיושבין עלי' רווחא, ובזמן שאין יושבין עלי' גמדא, עכ\"ד הגמ', אמנם עיקר נתינת הארץ יתקיים רק לעתיד, כי אז יתרחב א\"י ויתפתחו ההרים, ואין אנו יודעים פנימיות של א\"י עד אותה שעה, כשיקיים ד' את הבטחתו, כמ\"ש כי ירחיב ד' את גבולך."},{"passage_id":"devurim_e53f221b_p8","passage_content":"ובזה יבואר מ\"ש בספרי (פ' תבוא) עשה מצוה זו (של בכורים) שבשכרה תכנס לארץ ע\"כ, והקשה ההפלאה זלל\"ה הא מצות בכורים אינו נוהג אלא לאחר ירושה וישיבה, ולא שייך לומר שבשבילה תכנס לארץ, ולדרכנו יבואר כוונת הספרי, לומר שע\"י מצות בכורים תזכה למתנת הארץ בבחי' שתהי' לעתיד, כמ\"ש במדרש הנ\"ל שאותה שעה תהא מודעת מה היא, ועדיין אין אנו יודעים מתנה זו מה טיבה, ולע\"ל יתוודעו לנו כל חדרי א\"י, ואז יהי' המתנה בשלימות, וזה שאמרו שבשבילה תכנס לארץ, היינו פנימיות הארץ וחדרי ההרים."},{"passage_id":"devurim_e53f221b_p9","passage_content":"וכבר פירשתי (בדרשה בא\"י) מפני מה נתכווץ א\"י כ\"כ אחר החורבן, (כדאיתא בגמ' גיטין הנ\"ל), עפ\"י מ\"ד במדרש ילקוט פ' האזינו וז\"ל, עתידה כנס\"י שתאמר לפני הקב\"ה הרי עדי קיימין, שנא' העידותי בכם את השמים ואת הארץ, א\"ל הריני מעבירן, שנא' כי הנני בורא השמים החדשים וכו', א\"ל רבש\"ע הריני רואה מקומות שקלקלתי בהם ובושתי, שנא' ראי דרכך בגיא וגו', א\"ל הריני מעבירם שנא' וכל גיא ינשא, א\"ל רבש\"ע הרי שמי קיים, א\"ל הריני מעבירו שנא' וקורא לך שם חדש, א\"ל רבש\"ע הרי שמי קרוי ע\"ש הבעלים, א\"ל הריני מעבירו, שנא' והסירותי את שם הבעלים מפיה עכ\"ד המדרש, ויש להבין דהא תינח מה שהשיב להם הקב\"ה הנני בורא השמים החדשים, הכוונה שברוחניות יתחדשו השמים לעתיד על ידי הקב\"ה, אבל מה שא\"ל הקב\"ה על מקומות שבא\"י הנני מעבירן, איך יהי' זה, וא\"כ יתקטן עוד מידת ארץ ישראל, ואיך נשמע זאת מפסוק כל גיא ינשא, שיעביר הקב\"ה מקומות ההם."},{"passage_id":"devurim_e53f221b_p10","passage_content":"ואפשר לומר דכבר הקשו איך מותר לזרוע כל קרקע בא\"י, והלא איכא לספוקי שמא הוא מנחל איתן, שאסרה תורה לזרוע אותה לעולם, וכיון שנולד הספק במקום קבוע, הרי אמרינן דכל קבוע כמחצה על מחצה, ותירץ הר\"ש מקינון דקבוע שאינו ניכר הוא, שאין אנו יודעין מקום קביעותה, וכיון שיש רוב כנגדו, ה\"ה כאלו נתבטל מן העולם, וע\"כ מותר לזרוע בסתם קרקעות עכ\"ד, ועתה אתי שפיר מ\"ש הקב\"ה הנני מעבירן, כיון דאחר החורבן נתכווץ א\"י ונתקטן מאוד, וכאשר יאמרו ישראל לפני הקב\"ה לעתיד שהם בושים מהמקומות שחטאו שם, יאמר להם הקב\"ה הנני מעבירן, ר\"ל שישתנו המקומות ההם, ועי\"ז יהיו קבוע שאינו ניכר, וכאשר יתקיים הבטחת כי ירחיב ה' את גבולך, ויתרחב א\"י הרבה מאוד, יתבטלו מקומות ההם בס', וה\"ה כאילו נתבטלו מן העולם, דבטול בס' נחשב כאלו נתבער מן העולם, ע\"כ אתי שפיר מ\"ש להם הקב\"ה הריני מעבירן שנא' וכל גיא ינשא, דעל ידי שיתפתחו ההרים ויתרחב א\"י יתבטלו בס' וה\"ה כאלו העבירם מן העולם."},{"passage_id":"devurim_e53f221b_p11","passage_content":"ומ\"ש בילקוט שעתידין ישראל שיאמרו לפני הקב\"ה לע\"ל שהם בושים בשמם, ויאמר להם הקב\"ה הריני מעבירו וקורא לך שם חדש, לא הבנתי מעולם למה יהיו בושים בשם ישראל, ועתה בעוה\"ר נתפרש לנו גם מאמר זה שבמדרש, כי הכופרים ורשעי ארץ טמאו ולכלכו את שם ישראל, וחתמו בשם זה על כל מעשי תועבותם, ע\"כ יהיו ישראל בושים בשם זה לע\"ל, ויאמר להם הקב\"ה הנני קורא לך שם חדש, אבל לא גילה לנו השם החדש והעלימו אותו מאתנו, ואפשר שאם הי' ידוע לכופרים האלה השם החדש, היו מטמאין גם אותו, כי בודאי יהי' השם החדש מקודש מאוד, וכל מאוים להכניס הטומאה בקדושה, ע\"כ הסתירו מאתנו השם החדש עד לע\"ל בב\"א."},{"passage_id":"devurim_e53f221b_p12","passage_content":"עכ\"פ מבואר בדברי מדרש הנ\"ל שיתרחב א\"י לעתיד, ובאותה שעה תהא מודעת מה היא, ואז יהי' עיקר ירושת הארץ, כי ירשו ישראל את כל ארץ ישראל וחדרי ההרים, ע\"כ אמר הכתוב ושמרתם את כל המצוה וכו', למען תחזקו ובאתם וירשתם את הארץ, אשר אתם עוברים שמה לרשתה, אעפ\"י שאתם עוברים שמה עתה, אבל עיקר ירושת הארץ לא ינתן לכם עכשיו רק לעתיד, לכן צריך שתתחזקו בשמירת כל המצות, למען תזכו לירושה אמיתית שתהי' לעתיד, והמשיך הכתוב בטעם הדבר, שציום על ההתחזקות אפי' אחר שיכנסו לתוכה, ואמר כי הארץ אשר אתה בא שמה לא כארץ מצרים הוא, אשר השקית ברגלך וכו', דלכאורה הלשון ברגלך מיותר ויספיק הכתוב גם בלעדו, אלא בא לרמז שארץ מצרים אין בו תוכיות ופנימיות, רק מה שתדרוך בכף רגלך ותראה בעיניך, וכן הוא בכל ארצות העולם, אלא שאמר הכתוב באמ\"צ שהוא הטובה מכל ארצות, שנא' כגן ד' כארץ מצרים, ואעפ\"כ אין בה מעין השבח של א\"י ומכ\"ש בשאר ארצות, ובזה מובן מה ששבח הכתוב א\"י בהרים במ\"ש והארץ אשר אתה בא שמה לרשתה ארץ הרים ובקעות, וכו', וההרים עתידים להיות מישור, ההרים עצמן יתפתחו ויהי' לבקעות, ואין הכוונה כפשוטו בשבח ההרים, שיש מקום לחרוש מד' רוחותיו, דבלא\"ה א\"י עושה פירות שלא כדרך הטבע, כדאמרינן בכתובות חמשת רבוא כורין לכל בית סאה, וכנ\"ל, וגם שאר ארצות יש להם הרים, אבל כוונת הכתוב להודיענו כי עדיין לא ירשנו את הארץ, והירושה האמיתית יהי' רק לעתיד, וע\"כ צריך להתחזק במצות למען נזכה אל הירושה ההיא, וגם כי הי' גלוי וידוע לפניו ית' שעוד יחרב הבית קודם הירושה ההיא, וע\"כ ציום על ההתחזקות במצות."},{"passage_id":"devurim_e53f221b_p13","passage_content":"ועתה נבאר מ\"ש הכתוב למטר השמים תשתה מים, ונקדים מש\"כ החתם סופר זלל\"ה בדרשותיו (ח\"ב דף שע\"ו) וז\"ל כי ידוע שהגשמים מתהווים בטבע מאידים העולים מן הארץ, ומהבל פה אנשי העולם, ואם כי זה רק הכנה קטנה בטבעי העולם, ועיקר הוא כמאחז\"ל (סוף פ\"ק דתעניות) שעבים שואבים ממי אוקינוס וממתקין בעבים וכו', מ\"מ ג\"ז אמת כי הווית העבים נעשה מאידים העולים מן הארץ, ולפי\"ז אם ההבל והאידים העולים מהם, הוא מהבל פה דובר נבלה ולה\"ר ורכילות, הגשמים המתהוים מזה המה מלוכלכים מזוהמת קליפת עונות ופשעים ההמה, והמאכלים המתהוים מאלו הגשמים, מטמאין אוכליהן ביתר שאת, באופן שיהי' הבל פיהם של שנה הבאה רע יותר משל אשתקד, ועי\"ז גשמי שנה הבאה ותבואתה רע, וגורם טומאה יותר לבנ\"א וכן חוזר חלילה וכו' עיי\"ש ע\"כ הצורך לעניננו, ובישמח משה (פ' נח) העתיק מ\"ש בפרקי דר\"א וז\"ל, כשאין ישראל עושים רצונו של מקום אז הגשמים ע\"י עננים, והוי הארץ כאשה הרה לזנונים, אבל כשעושין רצש\"מ אז הגשמים באים בלא עננים, כדכתיב כאשר ירד הגשם והשלג מן השמים, והוי כאשה הרה מבעלה, עכ\"ד המדרש."},{"passage_id":"devurim_e53f221b_p14","passage_content":"עכ\"פ מבואר גודל חשיבות מטר היורד מן השמים, ממים עליונים, כדברי ר' יהושע בתענית (ט' ע\"ב), ואין אנו משיגים גודל ערכה וחשיבותה של מטר היורד מן השמים, כי אין דבר טמא יורד מן השמים, ומטר מן השמים בא ממקור הטהרה, ומקדש ומטהר, ולא זכינו עדיין למטר כזה מעולם, ולעתיד נזכה לזה ברצות השם, וע\"כ משבח הכתוב בשבח א\"י, שלא כאמ\"צ הוא אשר השקית ברגלך מנילוס שהיו עובדין מצרים לנילוס, ונמצא מתהוים פירות הארץ ממים ששורה עליהם טומאת ע\"ז, ומכניסים טומאה באוכליהם, ובכל ארצות, המטר בא מאידים של בני אדם המלאים הבל של עבירות, ושורה טומאה על פירות הארץ ומטמאים אוכליהם, אבל הארץ אשר אתה בא שמה לרשתה לעתיד, למטר השמים תשתה מים, והמים יבואו ממקור הטהרה, ויכנסו קדושה וטהרה בפירות הארץ, ויקדשו ויטהרו אוכליהם, וזה שבחה של ארץ ישראל."},{"passage_id":"devurim_e53f221b_p15","passage_content":"ומעתה יתבאר מ\"ש בפ' והי' אם שמוע ונתתי מטר ארצכם, ולא קראו הכתוב מטר השמים, דלפי מ\"ש התוס' ברכות (ל\"ה ע\"ב) דפרשה זו מיירי בעושין רצש\"מ, אבל אין עושין רצונו כ\"כ דאינם צדיקים גמורים עיי\"ש, ע\"כ לא יזכו עוד שירד להם מטר מן השמים, רק לעתיד יזכו לזה ע\"כ קראו הכתוב מטר ארצכם, ויתבאר ג\"כ מ\"ש שם ועצר את השמים ולא יהי' מטר, דלכאורה כפל לשון למה, אבל מפנו שיש ב' מיני גשמים כנ\"ל, ע\"כ אמר הכתוב שע\"י החטאים כמ\"ש וסרתם ועבדתם וכו', לא די שיהי' ועצר את השמים שלא תזכו למטר היורד מן השמים, אלא עוד תענשו ולא יהי' מטר, שאפי' מטר היורד מאידים לא יהי' לכם."},{"passage_id":"devurim_e53f221b_p16","passage_content":"ועל דרך זה יתפרש דברי הגמ' (תענית ז') אמר רבא גדול יום הגשמים יותר מיום שניתנה בו תורה, שנא' יערוף כמטר לקחי, מי נתלה במי הוי אומר קטן נתלה בגדול עכ\"ד הגמ', ולכאורה יפלא איך אפשר להשוות ולדמות יום הגשמים ליום שניתנה בו תורה, ושעוד גדול יותר ממנו, אתמהה, ופירשתי כבר ששמיני עצרת מתפללין על גשם, ועפ\"י הכוונה מחכמי אמת והמקובלים, יש שייכות בין יום הזה לגשמים, ואפשר שכוונו חז\"ל במ\"ש גדול יום הגשמים לשמיני עצרת, ובא\"י עושין ביום זה שמחת תורה, ושמחה של תורה גדול יותר מיום שניתנה בו תורה, ע\"כ אמרו גדול יום הגשמים מיום שניתנה בו תורה, ולדרכנו אפ\"ל דמ\"ש גדול יום הגשמים, כוונו חז\"ל על העתיד, שיהיו הגשמים ממטר היורד מן השמים ממקור הטהרה, וע\"כ ערכה גדול מאוד, וכן מ\"ש משה רבינו יערוף כמטר לקחי, ודימה את התורה למטר, הכוונה ג\"כ על מטר היורד מן השמים, שזה יהיה לעתיד כאשר יזכו ישראל אלי', והנה כתב המהרש\"א (בח\"א שם), דגדול יום הגשמים יותר מיום שניתנה בו תורה, דטובת התורה אינה אלא לצדיקים בלבד, שזוכין בנפש על ידה, אבל טובת הגשמים בין לצדיקים ובין לרשעים עכ\"ל, וכמו\"כ נאמר לדרכנו, גדול יום הגשמים שיהי' לעתיד, כי אז יהיו הכל צדיקים כמאה\"כ ומלאה הארץ דעה, ואת רוח הטומאה אעביר מן הארץ, ואת רוחי אתן בקרבכם, והגשמים ירדו מן השמים ממקור הטהרה, ויכניסו קדושה וטהרה בפירות הארץ, ויקדשו ויטהרו אוכליהם, וע\"כ יהי' בבחי' גבוה יותר, מטובת התורה בעוה\"ז שאינה אלא לצדיקים, אבל טובת הגשמים לעתיד, יהיו הכל נהנין ממנה ברוחניות כנ\"ל."},{"passage_id":"devurim_e53f221b_p17","passage_content":"ועתה נבוא לבאר בע\"ה, מה שקשה על דברי הרשב\"ם ז\"ל (סוף פ' ואתחנן) במה שפי' מאמה\"כ שומר הברית והחסד לאלף דור וכו', שהקב\"ה ימתין לקיים הבטחת הארץ עד אלף דור, עד שימצא דור כשר, כמ\"ש לאוהבי ולשומרי מצותי עכ\"ד הרשב\"ם ז\"ל, ודבריו נפלאים המה, הלא מבואר בגמ' (ר\"ה ל\"א ע\"א) א\"ר קטינא שיתא אלפי שנין הוו עלמא, וא\"כ אין במציאות שיהי' אלף דור, ואיך ימתין הקב\"ה עד אלף דור א\"כ לעולם לא יכנסו לארץ, והרי מוכרח הקב\"ה לקיים הבטחתו, וכמו\"כ הקשו קושיא זו על מ\"ש בפ' יתרו ועושה חסד לאלפים וכו', ובפ' תשא נוצר חסד לאלפים, ומתרגמינן לאלפי דרין, ואין במציאות כ\"כ דורות בכל ימות עולם, וכבר כתבנו למעלה כמה תירוצים לפרש הפסוק ועושה חסד לאלפים, אבל כ\"ז אינו מספיק לבאר דברי הרשב\"ם כמבואר לעיל, ובתוס' חדשים על המשניות (סוף מס' מכות) תירצו קושיא זו, עפימ\"ש בה\"ג בהקדמתו, דדור הוא ב' שנים, ונלמד ממ\"ש (בסנהדרין צ\"ז ע\"א) תנא דבי אלי' ששת אלפים שנה הוי עלמא, ב' אלפים תהו, ב' אלפים תורה, ב' אלפים ימות המשיח וכו', נמצא שעברו ב' אלפים שנה מימות עולם עד שניתנה התורה, וכתיב דבר צוה לאלף דור, שנתינת התורה הי' לאלף דור, א\"כ שמע מינה שב' שנים נחשב לדור עכ\"ד הבה\"ג ז\"ל, וא\"כ מתרץ מ\"ש עושה חסד לאלפים, כי לפי\"ד בה\"ג ז\"ל, יש במציאות ב' אלפים דורות בחשבון שנות העולם, עכ\"ד בתוספת חדשים."},{"passage_id":"devurim_e53f221b_p18","passage_content":"ובספה\"ק תורת משה (בתוס' מש\"מ) דחה דברי התוס' חדשים הנ\"ל, דע\"כ מ\"ש ועושה חסד לאלפים, כוונת הכתוב על אלפיים דורות ממש, ולא על דורות של ב' שנים כדברי בה\"ג, דהרי סמיך לי' פוקד עון אבות על בנים ועל בני בנים על שלשים ועל רבעים, ולמדו מכאן דמדה טובה מרובה ממדת פורענות ת\"ק פעמים ככה, עיין רש\"י שם, ואם נאמר דכוונת הפסוק במ\"ש ועושה חסד לאלפים, על דורות של ב' שנים, א\"כ לא נשמע מכאן דמרובה מידה טובה ת\"ק פעמים, שהרי בפורעניות מונה הכתוב דורות גמורים בנים ובני בנים, וא\"א שיהיו דורות אלו של ב' שנים, אלא ע\"כ ממקומו הוא מוכרח, דגם מ\"ש הכתוב ועושה חסד לאלפים, מיירי בדורות גמורים, עכ\"ד בס' תורת משה זלל\"ה."},{"passage_id":"devurim_e53f221b_p19","passage_content":"ואפ\"ל אע\"ג דאידחי דברי התוס' חדשים הנ\"ל, וא\"א לפרש הפסוק ועושה חסד לאלפים על דורות של ב' שנים כבה\"ג הנ\"ל, אבל דברי הרשב\"ם ז\"ל אפשר לפרשם דבשיטת הבה\"ג אמרם, ומ\"ש הכתוב שומר הברית והחסד לאלף דור, יתפרש שפיר, דעיקר הבטחת הארץ לאברהם אבינו יתקיים לסוף אלף דור, דהיינו ב' אלפים שנה כפי חשבון הדורות של בה\"ג ז\"ל."},{"passage_id":"devurim_e53f221b_p20","passage_content":"וסייעתא לדברי הרשב\"ם ז\"ל, מגמ' סנהדרין (צ\"ז ע\"א) הנ\"ל שאמרו שם ב' אלפים תוהו, ב' אלפים תורה, ב' אלפים ימות המשיח, ופרש\"י ב' אלפים תורה, מן הנפש אשר עשו בחרן עד שנות המשיח, יש אלפים שנה, ומונה והולך כל החשבון עיי\"ש, ואחר כלות ב' אלפים תורה, הוי דינא שיבוא משיח, ותכלה הגלות ויבטל השעבוד מישראל, אבל בשביל עונותינו שרבו, לא בא משיח לסוף ד' אלפים (מבריאת העולם דהיינו לסוף ב' אלפים של תורה), ויצאו מה שיצאו שעדיין הוא מעוכב לבוא עכ\"ל רש\"י ז\"ל."},{"passage_id":"devurim_e53f221b_p21","passage_content":"ולפי מה שבארנו לעיל, דעיקר ירושת הארץ יתקיים רק לעתיד, כשיקוים הבטחת כי ירחיב ד' את גבלך, ויתרחב א\"י, ויתודע לנו חדרי ההרים וגדולתה של א\"י, א\"כ לפי\"ז צדקו דברי הרשב\"ם ז\"ל בפי' הפסוק, שומר הברית וכו' לאוהביו ולשומרי מצותיו לאלף דור, כי עיקר הבטחת הארץ בברית בין הבתרים, הי' באופן שיתקיים לסוף אלף דור, דהיינו לסוף ב' אלפים שנה, מהנפש אשר עשו בחרן שהי' זמן ברית בין הבתרים, כי אז יהי' התחלת ימות המשיח, ועל אותו זמן נאמרה ההבטחה, ואע\"פ שנכנסו ישראל לארץ קודם הזמן ההוא, אבל עיקר ירושת הארץ שיתרחב א\"י וירשו כל חדרי א\"י, לא יתקיים רק לדור ההוא, שיהיו כולם כשרים וצדיקים, כמאה\"כ לאוהביו ולשומרי מצותיו, ונתבאר יפה דברי הרשב\"ם ז\"ל."},{"passage_id":"devurim_e53f221b_p22","passage_content":"ואפ\"ל קצת הסבר בדברי הבה\"ג הנ\"ל, ולקרבם קצת אל השכל, עפ\"י מ\"ש בס' היצירה, כי כל הנבראים שבעולם משתנה בחינתם בכל שנה ואפי' בהמות וחיות, אין טבעותם ומהותם שוה מהנולדים בשנה זו, להנולדים בחבירתה, וכתב הראב\"ד שם שבזה יובן מה שאמרו חז\"ל אין מעשרין משנה על חבירתה, מפני שאינו מינו עיי\"ש, והנה ידוע דהאדם יש בו כח כלול מכל הנבראים, וא\"כ כלות שנתו והשתנות טבע מין האדם, תלוי' בכלות שנת הנבראים שכלול מין האדם מהם, והנה כלות שנת הנבראים אינו שוה, וכל אחד נבדל מחבירו, ומפורש קצתם בריש מס' ר\"ה עיי\"ש, והנה במשך ב' שנים משנות העולם, נשלם כבר כל שנות הנבראים, א' המוקדם וא' המאוחר, ונתחדש בטבעו כל מעשה בראשית, וע\"כ אפשר לומר במין האדם, שב' שנים נחשב לו לדור שלם, כי הנולדים אח\"כ ישתנו בטבעם ומהותם מהנולדים קודם לכן."},{"passage_id":"devurim_e53f221b_p23","passage_content":"ועתה יבואר קישור הסידרות לפי דברי הרשב\"ם הנ\"ל וכפי שבארנו דבריו, וכה יאמר הכתוב (בסו\"פ ואתחנן) שומר הברית והחסד לאוהביו ולשומרי מצותיו לאלף דור, שעיקר הבטחת הארץ יתקיים רק לעתיד, כשיהי' דור כשר וצדיקים, ויהיו כולם אוהביו ושומרי מצותיו, וסמיך לי' והי' עקב תשמעון את המשפטים, שזה יהי' באחרית, כי מלת עקב פי' אחרית כנ\"ל, ואז כולם ישמעו וישיגו את המשפטים, וגם את החוקים ואת המצות, אלא שהכתוב מבשרינו, שיתרבה ההשגה והדעת, שיבינו את כל המצות והחוקים, כמשפטים שהשכל אנושי מחייבן, ואז יתקיים ושמר ד' אלקיך את הברית ואת החסד אשר נשבע לאבתיך, שיקיים השי\"ת הבטחת הארץ לנו, וכל הברכות שיהנו ישראל עד הזמן ההוא, יהי' ע\"י ברוך תהי' מכל העמים כנ\"ל, ושכר מצוה בהאי עלמא ליכא ומתורץ קושית הלבוש כנ\"ל."},{"passage_id":"devurim_e53f221b_p24","passage_content":"R"}]}]
