[{"dvar_torah_id":"devurim_48b81eb5","title":"ברכה וקללה: בחירה בחיים","summary":"במדרש נידונה השאלה מדוע ניתנה ברכה וקללה, ותשובה לכך היא שבחרת בחיים. הקב\"ה מסר לישראל את הבחירה, והעבודה היא להוסיף קדושה ולהשפיל את הסט\"א. יש להבחין בין דרכי העבודה של ב\"ש וב\"ה, כאשר כל אחד מהם מייצג גישה שונה בהבנת הברכה והקללה.","contents":[{"passage_id":"devurim_48b81eb5_p1","passage_content":"(מכתי\"ק) ראה אנכי נותן לפניכם היום ברכה וגו', במדרש ילקוט ברכה וקללה למה נאמר, לפי שנאמר החיים והמות נתתי לפניך הברכה והקללה, שמא יאמרו ישראל הואיל ונתן המקום לפנינו שני דרכים, באיזה שנרצה מהם נלך, ת\"ל ובחרת בחיים, והוא פלאי, דהאיך יעלה על הדעת לבחור ח\"ו דרך המות והקללה."},{"passage_id":"devurim_48b81eb5_p2","passage_content":"ב) עוד הקשו המפרשים, דהתשובה אינה מעין השאלה כלל, כי השאלה היא ברכה וקללה למה נאמר, והתשובה שלכך נאמר ובחרת בחיים."},{"passage_id":"devurim_48b81eb5_p3","passage_content":"ג) גם אינו מובן עיקר השאלה, דברכה וקללה למה נאמר, הלא בכתוב מבואר, שהוא להודיענו שכר ועונש המצוה והעבירה ומה קשה בזה, ועיין ישמח משה."},{"passage_id":"devurim_48b81eb5_p4","passage_content":"ד) במד\"ר אמר ר' חגי ולא עוד שנתתי לפניכם שני דרכים, אלא שנכנסתי לפנים משורת הדין ואמרתי לכם ובחרת בחיים, וגם זה פלאי, מה בזה ענין לפנים משוה\"ד, הלא כל התוה\"ק מלאה מאזהרות כאלו לבחור בדרך הטוב וזהו מעיקר הדין, גם אינו מובן השבח הגדול שנשתבח במה שהוא נתינת שני דרכים."},{"passage_id":"devurim_48b81eb5_p5","passage_content":"והנלפענ\"ד, כי הנה כבר נודע אשר כח הצדיקים והקדושה, עם כח הרשעים והסט\"א ר\"ל, הוא זה לעומת זה, וכמ\"ש ולאום מלאום יאמץ, ופירש\"י ז\"ל, לא ישוו בגדולה כשזה קם זה נופל, וכן הוא אומר אמלאה החרבה, לא נתמלאה צור אלא מחורבנה של ירושלים, ועד\"ז פי' החת\"ס ז\"ל, מה דשלח משה אל מלך אדום, אתה ידעת את כל התלאה אשר מצאתנו, דלכאורה מנא ידע, אלא שיוכל לידע זה מעצמו, שמכפי ריבוי גדולתו, יוכל לידע התלאה אשר לישראל, כיון שהוא ממש זה לעומת זה, ואבא מארי זלה\"ה בקדושת יו\"ט (לחנוכה אות ט\"ו) פי' עד\"ז פלוגתא דב\"ש וב\"ה בנרות חנוכה, דב\"ש סברי פוחת והולך, וב\"ה אמרו מוסיף והולך, ואמרינן בגמ' טעמא דב\"ש כנגד פרי החג, וטעמא דב\"ה מעלין בקודש ולא מורידין, והקשו המפרשים וכי ב\"ש לית להו מעלין בקודש ולא מורידין, והלא במנחות יליף לה מקרא, גם מהו ענין חנוכה אצל פרי החג, אבל האמת הוא כי כל עבודתינו להרחיב גבול הקדושה, ולהיות מוסיף והולך ברוב כח ואומץ, ולעומת זה להשפיל כח הסט\"א ולהכניעם, לבער רוח הטומאה מן הארץ, וזה הי' עבודת פרי החג, שאמרו חכז\"ל שהוא נגד ע' אומות, ומתמעטין והולכין שהוא סימן כלי' להם, ולזה ב\"ש שהם מסטרא דגבורה לנער רשעים מן הארץ, סברי גם בנרות חנוכה פוחת והולך שזה עבודתם, כמו בפרי החג שמתמעטין והולכין לכלות הרשעים, וממילא מתרבה הקדושה, כי לאום מלאום יאמץ, אמנם הב\"ה אשר המה מסטרא דחסד, סברי אדרבה מוסיף והולך, שזה עבודתם להרבות ולהטיב ברוב שפע אל הקדושה, וממילא נתמעט הסט\"א, שכשזה קם זה נופל, והכל הולך אל מקום א', אך בזה פליגי באיזה דרך יהי' התחלה מצידנו בעבודה יעיי\"ש בנועם דבריו, וקצת מזה הוא גם באוהב ישראל (פ' וישב ובעניני שמ\"ע), גם בפ' בשלח אמרתי בזה דברים נחמדים."},{"passage_id":"devurim_48b81eb5_p6","passage_content":"והנה אמרו חכז\"ל במדרש (הובא בחת\"ס פ' זו) עה\"כ ראה אנכי וגו' הברכות והקללות מסורות בידכם, ומזה מבואר דעת חכז\"ל בכוונת הכתובים האלה, שהקב\"ה נתן ביד ישראל הברכה והקללה, שיהי' בידם לברך את הראוי לברכה, ולקלל לראוים שתחול עליהם הקללה ר\"ל, ובזה מתורץ היטב קושיית המפרשים שהובא בישמח משה פ' זו ובכתנות אור, על מה שאמרו בילקוט, יצחק שהי' אוהב ישראל פתח בקללה ומסיים בברכה, אורריך ארור ומברכיך ברוך, דבר אחר צדיקים תחלתן יסורים וסופן שלוה, ובלעם שהי' שונא ישראל פתח בברכה ומסיים בקללה מברכיך ברוך ואורריך ארור, וחשה לפי\"ז משה רבינו שהי' אוהב ישראל, למה סיים בקללה ברכה וקללה יעיי\"ש מה שתירץ, ולהנ\"ל לק\"מ, דאין זה דומה להתם, דמיירי מהמאורעות המגיע אליהם, שצריך לסיים בברכה, ולהיות סופן שלוה, אבל כאן מיירי מהברכות והקללות המסורות בידם, לברך ולקלל אחרים, ולפי דעת ב\"ה דהלכה כוותייהו להיות מוסיף והולך, כל עבודתינו היא רק בברכת הצדיקים להוסיף כח הקדושה, וכמ\"ש מעלין בקודש ולא מורידין, שעיקר הוא העלאת הקדושה, וממילא דאין צריך להיות מורידין להסט\"א, דממילא נעשה, ולפי\"ז שפיר התחיל בברכה, כי כח הקללה הניתן עבור הרשעים, הוא נמשך מכח עבודתנו בברכת ישראל, נמצא דעבודה זו של הברכה קודמת, ואלו הי' מתחיל בקללה, הי' מקום לטעות כדברי ב\"ש, לעבוד עבודה זו להיות פוחת והולך לקלל הרשעים, והברכה נמשכת אח\"כ, אבל האמת כי בשמים הסכימו דהלכה כב\"ה."},{"passage_id":"devurim_48b81eb5_p7","passage_content":"ובזה יתבארו היטב דברי המדרש ברכה וקללה למה נאמר, וכוונתו לקושיא הנ\"ל, למה סיים בקללה, וע\"ז אמר לפי שנאמר החיים והמות נתתי לפניך הברכה והקללה, שמא יאמרו נלך באיזה שנרצה, כי באמת דברי ב\"ש וב\"ה אלו ואלו דברי אלקים חיים, ודברי ב\"ש המה דרך גבוה, ויש להסתפק באיזה הדרך נלך, ע\"כ אמר ובחרת בחיים להורות הלכה כדברי ב\"ה."},{"passage_id":"devurim_48b81eb5_p8","passage_content":"וי\"ל עוד דהקשה להמדרש ברכה וקללה למה נאמר, דבאמת סגי בחד מינייהו, דלב\"ה סגי במוסיף והולך ברכת הקדושה, והקללה ממילא נעשית, ולב\"ש סגי בפוחת והולך שהוא קללת הרשעים, והברכה ממילא נעשית, עכ\"פ ממה נפשך לתרווייהו סגי בחד מהנך, וא\"כ קשה למה הוצרך הכתוב לכתוב שניהם ברכה וקללה, וע\"ז מתרץ שהוא שני דרכים בדרכי עבודה, עד שבאמת יש להסתפק איזה הדרך נלך, לולא שהודיע לנו הכתוב ובחרת בחיים, ועכ\"פ כיון שאלו ואלו דברי אלקים חיים, וגם עסק כח הקללה היא דרך גבוה כדברי ב\"ש, לכך ביאר לנו הכתוב תרווייהו, כי שני אלה דרכי העבודה משורשים בביאור, בתורת אלקים חיים, אף שהלכה כב\"ה."},{"passage_id":"devurim_48b81eb5_p9","passage_content":"ובזה יש לבאר היטב דברי המד\"ר הנ\"ל (בקושיא ד') כי באמת חילוק גדול יש בין שני אלה דרכי העבודה, כי קללת הרשעים מגיע אליהם מצד הדין האמיתי, לרוב רשעתם של הקמים על ה' וישראל, אשר אין לשער רוב רשעת הגוים האלה, אשר רעה תבוא אליהם הכל באמת והכל בדין, אבל בברכת ישראל אי אפשר לילך בדין הגמור, כי אמרו חכז\"'ל אם יעמוד הקב\"ה בדין, אפי' עם אברהם יצחק ויעקב לא יוכלו לעמוד, ואם תמצה עומק הדין מי יצדק לפניך בדין, וע\"ז הקדים הקב\"ה מדה\"ר בשביל קיום העולם לכנוס לפנים משוה\"ד, וא\"כ עבודה זו קשה וחזקה יותר, וכמ\"ש רש\"י ז\"ל ואת ידך החזקה שכובש מדה\"ד בחזקה, גם הקב\"ה אמר ישמעאל בני ברכני, יה\"ר שיכבשו רחמיך את כעסך, ואעפי\"כ בחר ה' בעבודה זו יותר, הגם שצריכין בזה לסיוע גדול לכבוש המדה\"ד."},{"passage_id":"devurim_48b81eb5_p10","passage_content":"וזה יש לכוון היטב בדברי המדרש, א\"ר חגי ולא עוד שנתתי לכם שני דרכים, שהוא חביבותא יתירה שמסר בידם שני הדרכים של הברכה והקללה, אלא שנכנסתי עמכם לפנים משוה\"ד, ואמרתי ובחרת בחיים, שהוא מלמדם להועיל לילך בדרך החיים, אף שבדרך זה הוא נכנס עמהם לפנים משוה\"ד, עכ\"ז הוא מלך חפץ בחיים."}]},{"dvar_torah_id":"devurim_cc69624d","title":"ברכה וקללה: בחירה בין חיים למות","summary":"בפרשת ראה נידונה נתינת הברכה והקללה לישראל, וההבנה כי הבחירה בידם. המדרש מדגיש את הצורך לבחור בדרך הטובה, שהיא מדת החסד, כדי להמשיך ברכה לישראל, בעוד שהקללה תבוא מאליה על שונאיהם. יש להבין את כפל הלשון וההדגשה על הבחירה הנכונה.","contents":[{"passage_id":"devurim_cc69624d_p1","passage_content":"ראה אנכי נתן לפניכם היום ברכה וקללה, את הברכה אשר תשמעו אל מצות ה' אלקיכם וכו', יש לדקדק מדוע אמר הכתוב ראה, הרי על הדיבור שייך לשון שמיעה, ולא לשון ראי', והול\"ל שמע."},{"passage_id":"devurim_cc69624d_p2","passage_content":"ב) יש להבין אומרו לפניכם, הי\"ל לומר נתתי לכם, כי הנתינה מתייחס אליהם ולא לפניכם."},{"passage_id":"devurim_cc69624d_p3","passage_content":"ג) היום מיותר, דהרי מובן מאליו שביום ההוא נאמרה, גם כי לא נתן הכתוב סימן באיזה יום הי', וא\"כ מה תועלת להזכיר היום. רבותינו בעלי התוס' דרשו, בעוה\"ז הם ברכה וקללה, אבל לימות המשיח כולם ברכה, ולכך נאמר היום, ר\"ל בעוה\"ז ע\"כ. ויש להבין דגם דרשה זו מיותרת, שכיון דתלה הכתוב ברכות וקללות באם תשמעו או לא, ולימות המשיח יהיו כל ישראל שומעים ועושים מצות ד', וא\"כ פשיטא שיהי' להם רק ברכות."},{"passage_id":"devurim_cc69624d_p4","passage_content":"ד) קשה דכל הפסוק מיותר, כיון דמפרש להלן בפסוק שאח\"ז, את הברכה אשר תשמעו וכו' והקללה אם לא תשמעו וכו', א\"כ למה צריך להקדים תחלה בדרך כלל, ראה נתתי לפניכם ברכה וקללה, והוצרך אח\"כ עוד לפרש תנאיו ופרטיו, הלא יתבאר הכל מפסוק שאח\"ז, ופסוק ראשון מיותר לגמרי."},{"passage_id":"devurim_cc69624d_p5","passage_content":"ה) במדרש (הובא בישמח משה) ברכה וקללה למה נאמר, לפי שנאמר את החיים ואת המות נתתי לפניך הברכה והקללה, שמא יאמרו ישראל כיון שנתן לפנינו הקב\"ה ב' דרכים, נלך באיזה מהם שנרצה, תלמוד לומר ובחרת בחיים, עכ\"ד המדרש. ובצפנת פענח הובא גירסת המדרש בנוסח אחר, ושמא תאמר ובחרת במות תלמוד לומר ובחרת בחיים, ולכך נאמר ברכה וקללה ע\"כ. ראוי להבין מה הי' הס\"ד שיאמר האדם ובחרת במות, וכי מי פתי יחשוב ככה, עד שהוצרך הכתוב להזהירו על ההיפוך, ואם יצרו תוקפו כ\"כ, שאף שיודע שהוא דרך מות, הולך בו בעצת יצרו, א\"כ מה יתן ומה יוסיף לו אזהרה זו, ובחרת בחיים, כיון דאינו חש לחייו, גם על זה לא יחוש."},{"passage_id":"devurim_cc69624d_p6","passage_content":"ו) יש להבין מה הי' קושייתם, ברכה וקללה למה נאמר, ועוד איך מתורץ זה בתירוצם, ולפי הנראה לא תירצו כלום ע\"ז, ותשובתם אינו מענין השאלה כלל."},{"passage_id":"devurim_cc69624d_p7","passage_content":"ז) במדרש רבה, רבנן אמרי אמר הקב\"ה לא לרעתכם נתתי לכם ברכה וקללה, אלא להודיעך דרך טובה שיבחרו אותה, כדי שיטלו שכר, מניין ממה שקרינו בענין ראה אנכי נתן וכו' ברכה וקללה וכו' ע\"כ, והוא תמי' דמהיכי תיתי לומר שהברכות יהי' לרעתם, וגם מה שסיים מנין ממה שקרינו בענין, ראה אנכי נתן וכו' ברכה וקללה, הלא בפסוק אינו מבואר שיבחרו דרך הטובה, והול\"ל פסוק ובחרת בחיים."},{"passage_id":"devurim_cc69624d_p8","passage_content":"ח) במדרש רבה ראה אנכי וכו' א\"ר אלעזר משאמר הקב\"ה הדבר הזה בסיני, באותה שעה מפי עליון לא תצא הרעות והטוב, אלא מאלי' הרעה באה על עושה הרעה, והטובה באה על עושה הטובה, דבר אחר א\"ר חגי ולא עוד שנתתי לכם שני דרכים, אלא שנכנסתי לפנים משורת הדין, ואמרתי לכם ובחרת בחיים, ראוי להבין מה בא ר' חגי להוסיף, במ\"ש ולא עוד שנתתי לכם שני דרכים, והלא גם ר\"א ס\"ל כן, ומפורש. בתורה כן נתתי לכם ברכה וקללה את החיים."},{"passage_id":"devurim_cc69624d_p9","passage_content":"ט) גם צ\"ב מה שסיים שנכנסתי לפנים משורת הדין ואמרתי לכם ובחרת בחיים, למה יקרא לה לפנים משוה\"ד, הלא כל התורה מזהיר אותנו על שמירת המצות בכ\"מ, ושורת הדין כן."},{"passage_id":"devurim_cc69624d_p10","passage_content":"ונקדים מ\"ש בסה\"ק אגרא דכלה (פ' ראה), הובא בס' בני יששכר (חודש ניסן מאמר ד') ותוכן דבריו, עפ\"י הידוע, דטבע וסגולת המצוה להשפיע טוב לכל העולם, וסגולת העבירה הוא בטבע להשפיע ההיפוך, ואמרו ז\"ל במדרש רבה מיום שאמר הקב\"ה בסיני ראה אנכי וכו', באותה שעה מפי עליון לא תצא הרעות והטוב, אלא מאלי' הרעה בא על עושה הרעה, והטובה באה על עושה הטובה, א\"כ הכל נעשה ע\"י מעשי התחתונים, כפי עשייתם הם גורמים לעצמם לטוב או ח\"ו לרעה, והנה לפי זה יש להתבונן, כשישראל מצטרכים למפלת שונאיהם ולעשות נקמה בגוים, ע\"י איזה מפעל יגרמו זאת, אם ע\"י מעשה המצות, הלא סגולתם כל היום רק לעורר ישועות וברכות וטובות, ואם על ידי עבירות, הלא הם באזהרה לבלתי עשותם, אבל ידוע מ\"ש רז\"ל גדולה עבירה לשמה ממצוה שלא לשמה וכו', ולפי\"ז אפשר להמשיך מפלה לשונאי ישראל ע\"י עבירה לשמה, דטבע העבירה גורם להביא דינים וגבורה, אבל להיות העבירה ההיא לשמה, הדינים והגבורות שמתעוררים ונפעלים ע\"י העבירה זו, על ראש רשעים יחולו, והוא לטובת ישראל כגדר המצוה, וכמו כן אפשר לפעול זאת ע\"י תשובה מאהבה, דזדונות נעשו כזכיות, דשורש העבירה גורמת הרעה, וע\"י תשובה מאהבה יחול הרעה על שונאיהם ולטובת ישראל כגדר המצוה."},{"passage_id":"devurim_cc69624d_p11","passage_content":"ובזה פי' הפסוקים ראה אנכי נותן לפניכם ברכה וקללה, ר\"ל בידכם יהי' מסור הכח לעורר ברכה לישראל וקללה לשונאי ישראל, ומפרש את הברכה לישראל אשר תשמעו אל מצות וכו', והקללה לשונאי ישראל אם לא תשמעו אל מצות וכו' דהיינו עבירה, אבל יהי' בבחינת וסרתם מן הדרך אשר אנכי מצוה, שהעבירה יהי' בכלל ציווי, דהיינו עבירה לשמה, עי\"ז תפעלו קללה לשונאיהם של ישראל עייש\"ד."},{"passage_id":"devurim_cc69624d_p12","passage_content":"אמנם קשה לפרש כן, דפשטות הכתובים מורים, דברכה וקללה הנאמר כאן, הן המה האמורות בהר גריזים ובהר עיבל, כמו שפירש\"י ז\"ל כאן, ומפורש בפסוק להלן ונתת את הברכה על הר גריזים ואת הקללה על הר עיבל, ושם נתפרשו י\"א ארורים על עבירות פרטיות, ואיך אפשר להוציא הפסוקים מפשטן, ולפרשם על עבירה לשמה והקללה על ראש שונאינו, ואפ\"ל דשניהם נלמד מכפל הפסוקים כמו שיבואר, דמ\"ש ראה אנכי נותן לפניכם ברכה וקללה, ר\"ל כדברי האגרא דכלה, שהברכות והקללות מסורים בידכם שתפעלו ע\"י מעשיכם ברכות לישראל, והקללה על שונאיהם כנ\"ל, ואח\"כ אמר הכתוב את הברכה אשר תשמעו וכו' והקללה אם לא תשמעו וכו' הן המה האמורות בהר גריזים ובהר עיבל, וא\"כ דרשינן תרווייהו מיתור הפסוקים."},{"passage_id":"devurim_cc69624d_p13","passage_content":"אולם יש עוד דרך ואופן, איך להמשיך מפלה על שונאי ישראל ולהכניע כח הטומאה, עפימ\"ש אאמו\"ר זלל\"ה בקדושת יו\"ט, ואפס קצהו תראה בספה\"ק אוהב ישראל (מאמרי חנוכה) בביאור פלוגתת ב\"ש וב\"ה בנר חנוכה (מס' שבת כ\"ב) דב\"ש ס\"ל פוחת והולך, וטעמייהו כנגד פרי החג שמתמעטין בכל יום, וב\"ה ס\"ל מוסיף והולך, דמעלין בקדש ואין מורידין, ואפשר להסביר טעם פלוגתתן, עפי\"מ דידוע, דבכלל שרשי העבודה הוא להכניע הקליפות ורוח הטומאה מן הארץ, ולהכניע כח של שרי האומות, ועי\"ז נתגבר כח הקדושה ממילא, כי כשזה קם זה נופל, אמנם יש דרך אחר ישר לפני האלקים, והוא לתקן דרך הקדושה ולתקן מעשיו בדרך התורה והמצות, ובזה מוסיף והולך כח הקדושה, וכשנתגבר כח הקדושה, ממילא פוחת והולך כח הסט\"א, כשזה קם זה נופל, ולא יצטרך עוד לעשות פעולות להכניע הסט\"א ושרי האומות, כי מאליהם יכרעו ויפולו."},{"passage_id":"devurim_cc69624d_p14","passage_content":"וזהו ענין מחלוקת ב\"ש וב\"ה, דב\"ש מידתם גבורה, וס\"ל שעיקר עבודת האדם במעשה המצות, להכניע כח הטומאה מן הארץ, וע\"כ אמרו פוחת והולך כנגד פרי החג, שמקריבים אותם כנגד ע' אומות, ומתמעטים והולכים לסימן כלי' להם, ומשם ראי' דזהו עיקר העבודה להכניע אותם, ועי\"ז יתגבר כח הקדושה, אבל ב\"ה דמידתם מדת החסד כידוע, רוח אחרת הי' אתם, וס\"ל דמוסיף והולך בקדושה, ומעלין בקודש, וכשיתגבר הקדושה ממילא יהי' הורדה לסט\"א, ויתבער מן הארץ, וא\"צ עוד לעשות פעולה לזה, וידוע דהלכה כב\"ה, וא\"כ העיקר להמשיך ברכה לישראל ולהגביר כח הקדושה, והקללה מאליו יחול על ראש שונאינו ע\"י פעולה זו."},{"passage_id":"devurim_cc69624d_p15","passage_content":"ואפשר להטעים עוד טעמייהו דב\"ה וסברתם, עפימ\"ש ק\"ז הישמח משה ז\"ל (בפ' בשלח) לפרש דברי הילקוט, והמים להם חומה, חמה כתיב, שטען ס\"מ הללו עובדי ע\"ז והללו וכו', והשיב לו הקב\"ה הלא לא עבדו אלא מתוך שיעבוד ואונס, כיון ששמע שרו של ים כך, אותו חמה החזירו על מצרים ע\"כ בילקוט, וביאר דבריו עפ\"י הקדמה מזוה\"ק, דמדת הדין אינו חוזר בריקניא, והנה הי' התגברות הדין על ישראל, והים הי' סוער עליהם להטביען, דהללו והללו עובדי ע\"ז, ולזה הי' צריך יד חזקה לכבוש מדת הדין, ולגרום הצלה לישראל ע\"י לימוד זכות בטענת אונס, וכיון שניצולו ישראל, ומידת הדין אינו חוזר בריקניא, לכן אותה חמה החזירו על מצרים, ונתהפך מדת הדין עליהם ע\"כ תו\"ד ז\"ל."},{"passage_id":"devurim_cc69624d_p16","passage_content":"ולפי\"ז מסתבר טעמא דב\"ה, כי לעשות פעולה זו להמשיך מפלה על שונאינו, ולהכניע האומות ושריהם, יש סכנה בדבר, כי עי\"ז יתעורר כח הקטרוג ח\"ו על ישראל, כמו שהי' בקריעת ים סוף, בטענת הללו והללו, ומה נשתנו אלו מאלו, ע\"כ טוב יותר לאחוז בדרך סלולה כדברי ב\"ה, להמשיך ברכה לישראל ולהגביר כח הקדושה, ועכ\"ח יהי' מפלה לשונאינו, כי מדת הדין אינו חוזר בריקניא, וכתב בספה\"ק דברי אמת מהצה\"ק מלובלין זי\"ע, שכתב בשם רבו הק' לפרש מ\"ש התוס' (בריש מס' ב\"ק) ארבעה נזיקין וז\"ל, אית דוכתא דלא תני הן כמו הכא, ואית דוכתא דתני הן, כדקתני ארבעה ראשי שנים הן ע\"כ, ותו\"ד דיש כח ביד החכמים וביד ישראל, להמשיך פעולות בכח אמירתם אם לטוב או להפכו, ולכן במקום שדברו דברים טובים לישראל, אמרו הן להמשיך הטובה ההיא לעולם, וע\"כ אמרו ארבעה ראשי שנים הן, ובד' אבות נזיקין לא אמרו הן, כי לא רצו להמשיך פעולה זו, עכ\"ד."},{"passage_id":"devurim_cc69624d_p17","passage_content":"ולדרכנו יהי' מתורץ קושית הכתנות אור (הובא בישמח משה) על דברי המדרש ילקוט (פ' תולדות) אורריך ארור ומברכיך ברוך, ולהלן אצל בלעם אומר מברכיך ברוך ואורריך ארור, אלא בלעם ע\"י שהי' שונא פתח בברכה וסיים בקללה, דבר אחר הרשעים ע\"י שתחלתם שלוה וסופן יסורים, פותחין בברכה וחותמין בקללה, הצדיקים ע\"י שתחלתן יסורים וסופן שלוה, פותחין בקללה וחותמין בברכה, ולכן בירך יצחק אורריך ארור ומברכיך ברוך עכ\"ד המדרש, והקשה בס' הנ\"ל, דמשה רבינו שהי' אוהב ישראל, א\"כ למה סיים בקללה, באמרו כאן ראה נתתי לפניכם ברכה וקללה, עיי\"ש תירוצו, ואפשר לתרץ קושיתו בשני דרכים, ועל פי פשוט אפשר לחלק בין ברכת משה רבינו לברכת יצחק אבינו, דשם נאמר אורריך ארור, ומיירי באוררי בני אדם, ובירך אותנו יצחק אבינו, שלא יחולו קללת בנ\"א עלינו, ויקללו המה ואתה תתברך, ויחול הקללה על המאוררים, ויפה הקדים הקללה כי לית בי' ממשא, רק גרמת צער בעלמא וצדיקים תחלתן יסורים וסופן שלוה, וע\"כ סיים בברכה, כי סופן שיהי' להם שלוה, וכולם יברכו לישראל, משא\"כ בברכת משרע\"ה, והקללות שנאמרו כאן הם מן השמים לעוברי רצונו ח\"ו, וע\"כ לא טוב להתחיל בקללה, כי אפשר שיזיק ח\"ו, ויותר טוב להתחיל בברכה, והמשיך הברכה לישראל ע\"י אמירתו, כנ\"ל בשם ספה\"ק דברי אמת, ונמתק מאליו הקללה ולא יחול עוד לעולם."},{"passage_id":"devurim_cc69624d_p18","passage_content":"ולדרכנו הראשון יתורץ גם באופן אחר, עפ\"י מה שבארנו לעיל כוונת הכתוב כאן, ראה נתתי לפניכם ברכה וקללה, שהקב\"ה מסר בידינו להמשיך כח הברכה לישראל, והקללה על שונאינו, והכל בכח מעשינו, והלכה כדברי ב\"ה שהעיקר להמשיך הברכה לישראל ולהגביר כח הקדושה, והקללה מאליו יחול על ראש שונאינו, כי כשזה קם זה נופל, ומדת הדין אינו חוזר בריקניא כנ\"ל, וע\"כ הקדים משה רבינו ברכה לקללה, כי העיקר להמשיך ברכה לישראל, והקללה מאליו יחול על ראש שונאינו כנ\"ל, (וכעין בחי' זו כתבנו בדרוש הקדום בכתי\"ק באופן אחר קצת)."},{"passage_id":"devurim_cc69624d_p19","passage_content":"ומעתה יבואר דברי המדרש הנ\"ל, ברכה וקללה למה נאמר, ר\"ל דהוקשה להם הלא מיותר לגמרי כקושייתינו הנ\"ל, ואפי' אם נתרץ כאשר ביארנו לעיל, דהכתוב בא להורות, כי מסר ד' בידינו להמשיך הברכה בכח מעשינו, וגם הקללה על האומות, אבל למה נאמרו שניהם, הלא בא' לבד אפשר לפעול שניהם כנ\"ל, וגם למה הקדים הכתוב ברכה וסיים בקללה, כקושית הכתנות אור לעיל, ומבאר המדרש בתירוצו, לפי שנאמר ראה נתתי לפניך וכו', שמא יאמרו ישראל כיון שנתן לנו הקב\"ה ב' דרכים, נילך באיזה מהם שנרצה, ר\"ל אם ירצו יעשו כדברי ב\"ש, שמידתם גבורה, ולעשות עיקר הפעולה להכניע שרי האומות ולהמשיך מפלה לשונאינו, מפני שמצערים אותם בעינויים קשים, וקשה לסבול מהם, והפעולה להתגבר כח הקדושה יהי' נעשה מאליו, בהמשכת מדת הגבורה על שונאינו, ע\"ז סיימו במדרש תלמוד לומר ובחרת בחיים, דהלכה כב\"ה, והעיקר להמשיך מדת החסד וברכה לישראל, והקללה מאליו יחול על ראש שונאינו ע\"י פעולה זו כנ\"ל, לכך נאמר ברכה וקללה, להורות ע\"ז, כי בידינו להמשיך כל זה, ויוקדם פעולת הברכה, לכן קדמו בפסוק ברכה לקללה, וא\"ש."},{"passage_id":"devurim_cc69624d_p20","passage_content":"ולדרכנו יתבאר דברי המדרש רבה (המובא לעיל) וז\"ל רבנן אמרי לא לרעתכם נתתי לכם ברכה וקללה, אלא להודיעך דרך הטובה שיבחרו אותה כדי שיטלו שכר, מנין וכו', שנא' ראה אנכי נתן וכו', ברכה וקללה ע\"כ, ולדרכינו ר\"ל, שלא נאחוז במדת הגבורה, ולהמשיך הברכה והקללה שניהם, ע\"י מדה זו כב\"ש, אלא להודיעך דרך הטובה שיבחרו אותה כדי שיטלו שכר, שהתוה\"ק מייעץ אותנו, להמשיך שניהם ע\"י דרך הטובה מדת החסד כב\"ה, ומה שהאומות מצערים אותנו, ע\"ז נקבל שכר בעוה\"ז, כמבואר במד\"ר (פ' עקב פ\"ג ס\"ד) שכל מה שישראל אוכלים בעוה\"ז, בכח היסורים שבאין עליהם עיי\"ש, וסיום דברי המדרש מנין ממה שקרינו בענין, ראה נתתי לפניך וכו' ברכה וקללה, והקדים הכתוב ברכה, להורות שנאחוז בדרך זה, וזה יהי' פעולתינו להגביר הקדושה, והקללה לשונאינו יומשך ממילא."},{"passage_id":"devurim_cc69624d_p21","passage_content":"ומעתה יבואר גם דברי המדרש הרל, א\"ר חגי ולא עוד שנתתי לכם שני דרכים, אלא שנכנסתי לפנים משורת הדין, ואמרתי לכם ובחרת בחיים וכו', ר\"ל שמסר הקב\"ה בידינו ב' דרכים, ובכחינו להמשיך הברכה לנו, והקללה לשונאינו ע\"י הברכה לבד, וגם ע\"י הקללה ומדת הגבורה לבד כנ\"ל, אלא שנכנסתי לפנים משוה\"ד ואמרתי ובחרת בחיים, שתבחרו הדרך שהוא לפנים משוה\"ד והוא מדת החסד, שאין בו דין, רק כולו רחמים גמורים, והקללה על שונאינו יחול מאליו ע\"י המשכה."},{"passage_id":"devurim_cc69624d_p22","passage_content":"ויתבארו כל הדקדוקים במקראי קודש אלו, כי מה שכפל הכ' לומר ברכה וקללה, אעפ\"י שנתפרש בפסוק שאח\"ז בא להורות על ענין אחר, כי בידינו מסר הקב\"ה להמשיך הברכה והקללה, וא\"ש מ\"ש לפניכם, ולא נאמר לכם, כי לא נתן הקב\"ה לנו הברכה והקללה בפועל, כי מאתו לא תצא הרעות, אלא נתן לנו את הכח להמשיך ולפעול זאת ע\"י מעשינו, וא\"ש מ\"ש ראה ולא אמר שמע, כי לפי דרכנו הנ\"ל לא נאמרה כאן ברכה וקללה, גם שניהם, ולא יתכן לומר שמע את הברכה ואת הקללה אשר אנכי נתן וכו', אלא ברכה לבדה היא שנתנה לנו, ומייעץ התוה\"ק אותנו איך להמשיך את הברכה לישראל ע\"י פעולתנו, והקללה מאליו יחול כנ\"ל, וא\"א להבין זאת ע\"י שמיעה אלא ע\"י ראי' שכלית, ע\"כ אמר הכתוב ראה, בעיני שכלך, אנכי נתן לפניכם ברכה וקללה, ותדע איך להמשיך אותם ע\"י מעשיך, ומ\"ש היום, ר\"ל שבעוה\"ז שייך להמשיך ברכה לישראל וקללה לשונאינו, אבל לימות המשיח יהי' רק ברכה, ולא נצטרך להמשיך קללה על שונאינו, כי לא יהיו בעולם ויתבערו מן הארץ, וכל הרשעה כולה כעשן תכלה, ותעביר ממשלת זדון מן הארץ, ותמלוך אתה ד' לבדיך בב\"א אכיה\"ר."}]},{"dvar_torah_id":"devurim_7380f984","title":"ברכה וקללה: עקרונות השמירה בתורה","summary":"הדבר תורה עוסק בחשיבות השמירה על מצוות התורה, הקשר בין ברכות לקללות, והצורך בהבנה מעמיקה של תוכחות התורה. המדרש מדגיש את השפעת המעשים על הגאולה והעונש, ואת הצורך לראות את הדברים בעין השכל למען הטוב והברכה.","contents":[{"passage_id":"devurim_7380f984_p1","passage_content":"ראה אנכי נתן לפניכם היום ברכה וקללה וגו', יל\"ד למה אמר הכתוב ראה הול\"ל שמע, כי על הדיבור שייך לשון שמיעה ולא לשון ראי', גם אנכי מיותר, גם אומרו היום מיותר, כי מי לא ידע כי ביום ההוא ידבר, וגם כי לא נתן הכתוב סימן לדעת באיזה יום הי', וא\"כ מה תועלת להזכיר היום, גם ברכה וקללה מיותר, כאשר נתבארו הדקדוקים לעיל בדרוש הקדום."},{"passage_id":"devurim_7380f984_p2","passage_content":"ב) במדרש רבה אדם מישראל מהו שיהא מותר לו לקרות את התוכחות בקריות הרבה, כך שנו חכמים אין מפסיקין בקללות, אלא א' קורא את כולן וכו', ולמה אין מפסיקין וכו', א\"ר חייא בר גמדא לפי שכתוב (משלי ג') מוסר ד' בני אל תמאס ואל תקוץ בתוכחתו, אל תעש את התוכחות קיצין קיצין, דבר אחר א\"ר יהושע דסכנין בש\"ר לוי, אמר הקב\"ה אני כתבתי על כבודי עמו אנכי בצרה, אין שורת הדין שיהיו בני מתקללין ואני מתברך, כיצד אם יקראו את התוכחות קריות הרבה, אין קרוי וקרוי שאין מברך ב' פעמים, לפני' ולאחרי', אלא א' קורא את כולן, רבנן אמרי לא לרעתם נתתי להם ברכות וקללות, אלא להודיען איזו דרך הטובה שיבחרו אותה, כדי שיטלו שכר, מנין ממה שקרינו בענין ראה אנכי נותן לפניכם עכ\"ד המדרש."},{"passage_id":"devurim_7380f984_p3","passage_content":"ראוי להבין קישור הלכה זו לכאן, הלא ברכה וקללה האמור כאן, הן המה האמורות בהר גריזים ובהר עיבל כפרש\"י, וכן משמע בפסוק להלן, שנא' בסמוך ונתת את הברכה על הר גריזים וגו', ולא על קללות שבפ' תוכחה דיבר הכתוב כאן, והול\"ל שאלת הלכה זו בפ' תבא בענין תוכחות, וגם מה שסיים ורבנן אמרי דנראה כאלו רבנן פליגי עלי' דר יהושע דאל\"כ הול\"ל אמרי רבנן, ויש להבין במאי פליגי. גם יש להבין דפשיטא דלטובתם ניתנו הברכות, ומאי למימרא, ועוד איזה קישור יש בדברי רבנן להלכה הנ\"ל דאין מפסיקין בקללות וצ\"ב."},{"passage_id":"devurim_7380f984_p4","passage_content":"ג) במדרש ראה אנכי נותן וגו', מה כתיב למעלה מן הענין, כי אם שמור תשמרון את כל המצוה וכו', אמר הקב\"ה אם שמרתם דברי תורה, אני משמר אתכם מן המזיקין, א\"ר אבא בר זעירא אין בית רובע בחללו של עולם, שאין בו כמה אלפים מזיקין וכו', ואם אתה משמר דברי תורה, יהיו המלאכים משמרים אותך, הרי נתתי לפניך ברכה וקללה וכו' עכ\"ד המדרש. וצ\"ב איך שייכא כל ענין מזיקין לברכה וקללה האמור בענין, והלא כאן מדבר בברכות וקללות שנאמרו בהר גריזים ובהר עיבל, ועוד מדוע הסמיכו ענין זה לפסוק ראה אנכי, דנראה דהמדרש רוצה לבאר בזה פסוק ראה אנכי, ואינו מובן השייכות אליו כלל, גם למה דרשו הפסוק אם שמר תשמרון על שמירה מן המזיקין, ולמה הוציאו את הפסוק מפשוטו, דקאי על שמירת המצות."},{"passage_id":"devurim_7380f984_p5","passage_content":"ד) ונתצתם את מזבחותם ושברתם את מצבותם וגו', לא תעשון כן לד' אלקיכם, ופרש\"י ז\"ל (ואיתא בספרי) ר\"ג אומר וכי תעלה על דעתך, שישראל נותצין למזבחותיהם ח\"ו, אלא שלא תעשו כמעשיהם, ויגרמו עונותיכם ומעשיכם הרעים, למקדש אבותינו שיחרב, ע\"כ בספרי, ולפי\"ז לאו דלא תעשון הוא אזהרה, שלא יעשו עונות ויגרמו החורבן, ואינו מפורש בקרא על איזה עונות הזהיר הכתוב, אלא ודאי דקאי על כל עונות ולאוין שבתורה, והרי כבר הזהיר הכתוב על כל אחד במקומו, ולמה הוצרך הכתוב לכפול האזהרה כאן."},{"passage_id":"devurim_7380f984_p6","passage_content":"ה) רק חזק לבלתי אכל הדם כי הדם הוא הנפש, ולא תאכל הנפש עם הבשר וגו', פרש\"י ז\"ל ממה שנא' חזק, אתה למד שהיו שטופים בדם לאכלו, לפיכך הוצרך לומר חזק דברי ר\"י, ר\"ש בן עזאי אומר, לא בא הכתוב אלא להזהירך וללמדך, עד כמה אתה צריך להתחזק במצות, אם הדם שהוא קל להשמר ממנו, שאין אדם מתאו' לו, הוצרך לחזקך באזהרתו, ק\"ו לשאר מצות עכ\"ל רש\"י ז\"ל ובספרי בשינוי קצת עיי\"ש."},{"passage_id":"devurim_7380f984_p7","passage_content":"והרמב\"ן הק' הקשה כי לשון חזק אינו מתיישב בכל זה, כי מה חוזק ואומץ יש בהזהר מן הדם, וראוי שיאמר לחומרו, השמר לך לבלתי אכול הדם, ומצינו לשון חזק על כללות התורה והמצות, כמ\"ש הקב\"ה ליהושע רק חזק ואמץ מאוד לשמור ולעשות ככל התורה וגו', וכמוהו בכ\"מ, אבל במצוה יחידית לא נמצא כן, ומה נשתנה דם שנאמר בו חזק, ותירץ הרמב\"ן ז\"ל, עפ\"י מ\"ש בס' המורה כי הי' דרך העכו\"ם לזבוח לשדים, כמ\"ש יזבחו לשדים וגו', וגם הי' דרכם כן במצרים, כמ\"ש ולא יזבחו עוד את זבחיהם לשעירים, והיתה העבודה ההיא באכילת הדם, כי היו מקבצים הדם לשדים, והם אוכלים עליו ומתחברים עמהם והיו מתנבאין ע\"י ומגידין עתידות, ולא שזה עיקר טעם איסור הדם, כי הכתוב מפרש טעמו כי הדם הוא הנפש, אבל מזה הטעם היו שטופין ורודפין אחרי', שהי' תשוקתם לידע עתידות, ע\"כ הזהירה תורה חזק, שיחזיק בתומתו ובאמונת השי\"ת, ואל יאכל מן הדם בשום ענין, כי הבל המה מעשה תעתועים ואין בהם מועיל עכת\"ד הרמב\"ן ז\"ל, וכ\"כ הספורנו."},{"passage_id":"devurim_7380f984_p8","passage_content":"אמנם עדיין צ\"ב, דהרי כ\"פ הזהירה תורה על הכישוף ולא נאמר חזק, ומדוע נשתנה כאן שנא' בו חזק, עוד יל\"ד למה כתבה בלשון שלילה, לבלתי אכל הדם, הול\"ל חזק לא תאכל דם, ומלישנא דקרא משמע שהזהיר הכתוב שלא יהא הדם נאכל על ידך, והול\"ל כמו בכל אזהרות שבתורה, שנאמרה לא תאכל, לא תעשה, שהצווי ואזהרה אקרקפתא דגברא רמי."},{"passage_id":"devurim_7380f984_p9","passage_content":"ו) במדרש רבה (פ' ויקרא פר ד') ונפש כי תחטא, א\"ר יצחק אמר לה הקב\"ה לנפש, אני כתבתי עליך רק חזק לבלתי אכול הדם וגו', ואת יוצאת וחוטאת, נפש כי תחטא בשגגה עכ\"ד המדרש, ראוי להבין דהרי פסוק זה נאמר על כל המצות, שנא' מכל מצות ד' אשר לא תעשינה, וא\"כ מדוע תפסו אזהרת הדם דוקא, גם במדרש גופא סיימו דבריהם ואת יוצאת וחוטאת, נראה דמיירי בסתם מכל חטאים שבתורה, ומדוע נקטו אזהרת הדם, ואפשר שדרשו כן מכח סמוכים, שנאמר בפסוק דלעיל מני' וכל דם לא תאכלו, וסמיך לי' ונפש כי תחטא, אבל הא גופא טעמא בעי, מאי ענין זה לזה, ואיזה קישור יש לאזהרת הדם אל כל המצות, והמתנות כהונה פי', דמסיפא דקרא קדייק, כי הדם הוא הנפש וגו', אבל עדיין צ\"ב כי כ\"ז מורה על חומר איסור הדם, אבל לא יכלול בו אזהרת כל המצות, ולמה הסמיכוהו אל שגגת כל המצות."},{"passage_id":"devurim_7380f984_p10","passage_content":"ז) כי יסיתך אחיך בן אמך וגו', בסתר לאמר נלכה ונעבדה וגו', פרש\"י דבר הכתוב בהווה, שאין דברו מסית אלא בסתר וכו', ראוי להבין דהן אמת דדרך הכתוב לדבר בהווה, אבל זה רק במקום שעיקר הדבר לצורך נאמרה, והי' אפשר לאומרה גם בלשון אחר, דרך הכתוב לאומרה בלשון המורגל וההווה, אבל כאן תיבת בסתר מיותר לגמרי, דאין נפק\"מ לדינא, אם הי' ההסתה בסתר או בגלוי, והול\"ל כי יסיתך אחיך, ואין סברא לומר, שבשביל שדרך המסות להיות בסתר, כתבה תוה\"ק מלה מיותרת, וטעמא בעי."},{"passage_id":"devurim_7380f984_p11","passage_content":"גם מצינו (בפ' תבוא) שנא' ארור האיש אשר יעשה פסל ומסכה וגו' ושם בסתר וגו', וחז\"ל דרשו ממנו כמה דרשות (במס' ע\"ז רב), דע\"ז של ישראל אינה נאסרת עד שתעבד, שנא' ושם בסתר עד שיעשה לה דברים שבסתר, עוד למדו שם שטעונים גניזה שנא' ושם בסתר עיי\"ש, וכל אלו דרשות נדרשו מיתורא דקרא, וא\"כ בסתר דהכא ג\"כ מיותר, ואיך אפ\"ל דכתבה תורה שלא לצורך, רק בשביל שדבר הכתוב בהווה."},{"passage_id":"devurim_7380f984_p12","passage_content":"ח) להלן בפ' עיר הנידחת מסיים הכתוב, ולא ידבק בידך מאומה מן החרם למען ישוב ד' מחרון אפו וגו', פרש\"י שכל זמן שע\"ז בעולם, חרון אף בעולם ע\"כ, ובסוף מס' סנהדרין דרשו רז\"ל כל הפרשה של עיר הנידחת על ע\"ז כפשוטו, וסיימו למען ישוב ד' מחרון אפו, תנא כל זמן שהרשעים בעולם, חרון אף בעולם, תני רב יוסף מאן רשעים גנבי עכ\"ד הגמ', והוא פלא דכל הפרשה מיירי בע\"ז, וגם תחילת פסוק זה ולא ידבק בידך מאומה מן החרם מיירי בע\"ז, ולמדו חז\"ל מכאן שאסור להנות מע\"ז ומנכסי עיר הנידחת, ובמס' מכות (כ\"ב) אמרו הנהנה מעצי אשרה לוקה שנא' ולא ידבק בידך וגו', ואיך דרשו סוף הפסוק על גנבי, וגנבי מאן דכר שמי', והמהרש\"א בח\"א כתב לפרש, כיון דנזכר בפסוק חרם, והגנבים עוברים בכל שעה על החרם, שהיו רגילים ליתן בביהכנ\"ס חרם על הגניבות, ובזה מביאין חרון אף בעולם עכ\"ד המהרש\"א ז\"ל, אמנם קשה להבין דבריו, דחרם דהכא מיירי בע\"ז, כמו שדרשו חז\"ל כמה הלכות ע\"ז מכאן, וע\"ז חמורה מגניבה ומכל עבירות שבתורה, ולמה דרשו רב יוסף על גנבי, והוציאו מפשוטו של מקרא דמיירי בע\"ז, והוא פלא."},{"passage_id":"devurim_7380f984_p13","passage_content":"ט) שמור ושמעת את כל הדברים האלה אשר אנכי מצוך למען ייטב לך ולבניך וגו', כי תעשה הטוב והישר וגו', הקשה האוהחה\"ק דהול\"ל שמע ושמרת, ולמה הקדים שמירה לשמיעה, ועוד למה הזכיר כאן הטבת הבנים ולא הזכיר כן במקום אחר, עוד יל\"ד אומרו כי תעשה הטוב והישר, אחרי שכבר אמר שמור ושמעת וגו' וגמר אומר למען ייטב לך, הרי שהטובה האמורה הוא שכר בעד השמיעה והשמירה, ולמה צריך לחזור ולתת טעם שהטובה יגיע אליך בשכר כי תעשה הטוב והישר וגו' והלא כבר מלתו אמורה."},{"passage_id":"devurim_7380f984_p14","passage_content":"ולבאר כל הענין נקדים מה דאיתא במד\"ר פ' עקב (פ\"ג סי' ט\"ו) פסל לך, א\"ר יצחק כתיב והי' כי יחטא ואשם והשיב את הגזלה וגו', או את הפקדון אשר הפקד אתן וגו', א\"ל הקב\"ה למשה הלוחות לא היו מופקדים אצלך, את שברת אותן, ואת מחליף אותן עכ\"ד המדרש, ראוי להבין למה צריך לטעמא דפקדון, והלא השובר כלי של חבירו בידים, חייב לשלם מכל מקום, אפי' לא היו בפקדון אצלו, ויפה כחו של פקדון, שאפי' לא הזיקן בידים, אלא שפשע בשמירתן, או לא שמרם מגניבה ואבידה בש\"ש מ\"מ חייב, אבל כאן ששברם בידים, בלא טעמא דפקדון יתחייב עלי', וממנ\"פ אם עשה שלא כדין בשבירת הלוחות, וחייב לשלם אפי' בלא טעמא דפקדון, ואם עשה כדין כמו שהי' באמת, וכמ\"ש חז\"ל שדרש ק\"ו בעצמו והסכים הקב\"ה על שבירתן, א\"כ אפי' היו פקדון, אין עליו חיוב תשלומין, שהרי שברן מדעת בעל הפקדון וצ\"ב."},{"passage_id":"devurim_7380f984_p15","passage_content":"ונקדים עוד מ\"ד במדרש רבה פרשת תשא (פר' מ\"ג ס\"ה) בשעה שעשו ישראל את העגל, הי' משה מפייס וכו', אמר משה רבון העולם כך אמרת בסיני אנכי ד' אלקיך, אלקיכם לא נאמר, לא לו אמרת, שמא להם אמרת וכו', הוי ויחל משה, אר\"ש דסכנין בש\"ר לוי, לפיכך חזר וכתבה בלשון רבים בפ' קדושים אני ד' אלקיכם, וכן בכל המצות אומר אני ד' אלקיכם, ולא אמר אני ד' אלקיך, עכ\"ד המדרש, ולכאורה צ\"ב איך אפשר לטעון טענה כזו, הגם שהי' רק לסתום פי המקטריגים, אבל מ\"מ צריך שיהי' בטענה עכ\"פ קצת אמת, וכי יצייר לומר כן שלא נתן הקב\"ה הדברות לישראל כלל אלא למרע\"ה, וכי לחנם ציום שיהיו נכונים ליום השלישי לעשות הכנה ופרישה, ועוד וכי עביד הקב\"ה כל הנסים האלה למגנא, שנא' וכל העם רואים את הקולות, ודרשו חז\"ל שהיו רואים את הנשמע, ויצאה נשמתן בדיבור ראשון, והוריד הקב\"ה טל שעתיד להחיות את המתים לע\"ל והחי' אותן, ואם לא להם נאמרו הדברות אלא למשה, א\"כ כל הנסים האלו למה, ומה צורך בהן, ועוד דאיתא במדרש (שה\"ש רבה), ישקני מנשיקות פיהו, רבנין אמרי, הדיבור עצמו הי' מחזר על כאו\"א מישראל, ואומר לו מקבלני את עליך, כך וכך מצות יש בי, כו\"כ עונשין, כך וכך גזירות וכו', והוא אומר הן והן, מיד הדיבור נשקו על פיו עכ\"ד המדרש, ואין שום הו\"א בעולם לומר שלא לישראל נאמרו הדברות, וא\"כ יש להבין מה היתה טענת משרע\"ה, ואיך השתיק בזה את פי המקטרג וצ\"ב."},{"passage_id":"devurim_7380f984_p16","passage_content":"ונקדים עוד מ\"ש (בפ' אחרי) את משפטי תעשו ואת חקתי תשמרו וגו', ושמרתם את חקתי ואת משפטי אשר יעשה אתם האדם וגו', פרש\"י דלמה הוכפל בכתוב, אלא כדי ליתן שמירה ועשיי' לחוקים, ושמירה ועשיי' למשפטים, לפי שלא נתן אלא עשי' למשפטים ושמירה לחוקים עכ\"ל רש\"י ופי' המזרחי דלעיל כתיב ואת חקתי תשמרו, א\"כ לא נאמרה אלא שמירה בחוקים ע\"כ חזר כאן ואמר אשר יעשה אתם האדם, וקאי עשי' על חוקים ועל המשפטים, וכן ושמרתם האמור כאן קאי בין אחוקים ובין על המשפטים ע\"כ, ויש להבין דשמירה זו מצות ל\"ת, ועשי' זו מצות עשה, וישנם בחוקים עשה ול\"ת וכן במשפטים, וכבר נאמרה אזהרת שמירה ועשי' לכל מצוה במקומה, וא\"כ למה הוצרך הכתוב עוד ליתן שמירה ועשי' לחוקים ומשפטים, והלא כבר נאמרה לכל א' אזהרתו, במקום ציויו."},{"passage_id":"devurim_7380f984_p17","passage_content":"ונקדים עוד מה דאיתא בפסיקתא דרב כהנא (פי\"ט) ויהי בשלח פרעה את העם, ילמדנו רבינו השולח יד בפקדונו של חבירו, כיצד הוא נגבה, ב\"ש אומרים ילקה בחסר ויתר, וב\"ה אומרים כשעת הגזלה וכו', ואמרו רבותינו כל מי ששולח יד בפקדונו של חבירו ראוי שתשבר זרועו, ממי את למד מפרעה וכו', ומנין שהיו ישראל בידו פקדון, שכן הוא אומר למשה, שיאמר לישראל פקד פקדתי עכ\"ד המדרש, ראוי להבין למה צריך לטעמא דפקדון, הרי בלאו טעמא דפקדון יענש עליהם פרעה, דהמזיק את חבירו או הרגו חייב, ובן נח שהרג את ישראל חייב מיתה, והם השליכו את ילדי ישראל ליאור וכבשום בבנין, והכום והרגום, והכל עפ\"י גזירתו של פרעה, ובודאי יענש ע\"ז, ומה ענין זה לפקדון, ואיך למדו מכאן דשולח יד בפקדון חייב, והלא התחייבותו לכאורה לאו מטעמא דפקדון הוא."},{"passage_id":"devurim_7380f984_p18","passage_content":"ופרשתי כבר עפימ\"ש בילקוט (רמז רמ\"א) בשעה שבקש הקב\"ה להטביע את מצרים, עמד עוזא שר של מצרים לפני הקב\"ה, ואמר רבש\"ע למה אתה רוצה להטביע מצרים, כלום הטביעו בני מבניך או הרגו מהם, וכי בשביל ששעבדו בהם, אתה רוצה לטבען, כבר נטלו שכרן עכ\"ד המדרש, ולכאורה יפלא איך הי' יכול לטעון כלפי שמיא שקר מוחלט כזה, הלא הכתוב מעיד, שצו' את המילדות להרוג את הזכרים, ואח\"כ צוה לכל עמו כל הבן הילוד היאורה תשליכוהו."},{"passage_id":"devurim_7380f984_p19","passage_content":"ואפשר שטענתם הי', עפימ\"ש הרמב\"ן ז\"ל עה\"פ הבה נתחכמה, כי נתחכם פרעה ולא רצה לצוות לשרי הטבחים אשר לו, להרגם בחרב המלך, אלא צוה למילדות ולכל עמו שיהרגו הם, והוא יעלים עינו מלשופטם על כך עיי\"ש, ולפי\"ז טען שר של מצרים, כיון דנעשה ע\"י שליח, ואין שליח לדבר עבירה, א\"כ אין מגיע עונש כלל על כל מצרים, אלא על ההורגים בלבד, דדברי הרב ודברי התלמיד דברי מי שומעין."},{"passage_id":"devurim_7380f984_p20","passage_content":"אולם באמת אין טענה זו מספקת לפטור על ידה, דהרי דרשו חז\"ל בב\"מ (דף מ\"ד ע\"א) אמר לעבדו ושלוחו שישלח יד בפקדון, מנין שחייב השומר, ת\"ל על כל דבר פשע ע\"כ, ופירשו הפוסקים אע\"פ דהשולח להזיק או לגזול ממון חבירו, אין המשלח חייב, דאין שליח לדבר עבירה, אבל בשומר שעשה שליח לשלוח יד בפקדון, חייב המשלח מדין שמירה, כיון שחיוב שמירה עליו, ועכ\"פ פשע בשמירתו."},{"passage_id":"devurim_7380f984_p21","passage_content":"וכן הדין לענין גרמא, דלענין נזקין פטור, משא\"כ השומר חייב אפי' לא הזיק בידים, אלא שגרם היזק ע\"י שלא שמר כראוי, כי כ\"ז נכלל בגדר השמירה שחייבתו תורה, כי כל חיוב השומר רק גרמא הוא, דע\"י שלא שמר כראוי גרם ההיזק, ואעפ\"כ חייבתו תורה לשלם, עכ\"ח שגדר השמירה לחייב גם על הגרמא, וע\"כ בטלה טענת שר של מצרים, כיון דהיו ישראל אצלם בתורת פקדון כמ\"ש פקד פקדתי, א\"כ אף דלא הרגו בהם אלא ע\"י שליח, אבל מ\"מ פשעו בשמירתם, וחייבים מדין שומר, וא\"ש מה שלמדו בפסיקתא מכאן דהשולח יד בפקדון חייב, דכל חיובם הי' בתורת שומר פקדון."},{"passage_id":"devurim_7380f984_p22","passage_content":"ומעתה נבין מה שכפל הכתוב בפ' אחרי, ושמרתם את חקותי וגו', ליתן שמירה ועשי' לחוקים, ושמירה ועשי' למשפטים, אע\"פ שכבר הזהיר הכתוב על כל מצוה ומצוה במקומה, אבל התוה\"ק הטילה עליהם חיוב השמירה על כל המצות בין על חוקים ובין על המשפטים, ובגדר השמירה לשמור את עצמו מכל הדברים המפסידים עבודתו ית', ושלא יעשה דבר הגורם לעבירה, או דבר הגורם לבטל מצות עשה, ובאזהרת המצות לבד לא ידענו חיוב זה, כי גרמא פטור בדיני התורה, לכך הכניסם הקב\"ה בחיוב השמירה על כל המצות, ובגדר השמירה להשמר אף על הגרמא, וכמ\"ש חז\"ל ונשמרתם מכל דבר רע, שלא יהרהר אדם ביום ויבוא לידי טומאה בלילה, ואע\"פ שבגוף העבירה כבר אונס הוא, אעפ\"כ למדו חז\"ל מונשמרתם, שכל זה בגדר חיוב השמירה, שירחיק הנזק ממנו קודם בואו, וכמו שפרש\"י שמור את חדש האביב, מקודם בואו שמור שיהא ראוי לאביב וכו', וכמו שפרש\"י ואביו שמר את הדבר, הי' ממתין ומצפה מתי תבוא, וכן שומר אמונים וכו', עכ\"פ מבואר דגדר השמירה לפקוח בעיני שכלו קודם בואו, וע\"כ כתבה תורה שמירה ועשי' בכל המצות, כי יפה כוחה של שמירה, כי אזהרת עשי' אינו אלא בשעת מעשה, מוסיף עלי' חיוב השמירה שמוטל עליו בכל עת, ואף לפני בוא הנזק לפניו, שישמור עצמו שלא יבוא לידי גרמא."},{"passage_id":"devurim_7380f984_p23","passage_content":"ובזה אפ\"ל מ\"ש (תהלים ע\"ט) אל תזכר לנו עונות ראשונים, ולכאורה קשה, כיון דאמר ראשונים מכלל דאיכא אחרונים, א\"כ למה אין מתפללים גם עליהם, והלא גם הם צריכים כפרה, והול\"ל אל תזכור לנו עונות, ויכלול בזה את כולן, ולא מצאתי עדיין תירוץ מספיק ע\"ז, ואפ\"ל עפימ\"ש האוהחה\"ק עה\"פ כי יסיתך אחיך וגו', ות\"ד כי יש מסית שבא עם האדם, מיום היותו בעולם והוא היצה\"ר, ועוד יולד באדם מסית באמצעות העבירה, אם עבר על מצוה אחת, יוולד בו כח החפץ רשע, והוא סוד עבירה גוררת עבירה, ונוסף הוא על כח הרע הראשון להחטיאו, וכי ירבה לחטוא ירבו המקטריגים האלה, ויגדל בו כח ההסתה, והאריכו בזה חכמי האמת עכת\"ד."},{"passage_id":"devurim_7380f984_p24","passage_content":"והפרי מגדים בספרו מתן שכרן של מצות, חקר לדעת דלפעמים המסיתים שנבראו ע\"י עונות בנ\"א, מכריחים את האדם לעשות עבירה, וא\"כ למה יתחייב העושה, והלא אנוס הוא, ותירץ דחייב משום דינא דגרמי, כיון דברי הזיקא, והוא גרם זאת ע\"י מעשיו עכ\"ד, ולדרכנו אפ\"ל דחייב מדין שמירה, אע\"פ שבעשיית העבירה אנוס הוא, אבל סיבת העבירה שני', באה לו מפני שלא נשמר בראשונה, וא\"כ בעשות הראשונה פשע בשמירת האחרונים, וע\"כ חייב על הראשונות גם בעונש המגיע על האחרונות."},{"passage_id":"devurim_7380f984_p25","passage_content":"ומעתה א\"ש מ\"ש אל תזכר לנו עונות הראשונים, דעל עונות האחרונים יש לימוד זכות, דכמעט אנוס הוא, ומוכרח ע\"י המסית המשיאו, ואין בו כח לעמוד נגדו, ואע\"פ דעדיין לא נמנע ממנו דרכי התשובה, ואם מתפלל להשי\"ת בכל לבו, וע\"י סייעתא דשמיא אפשר להנצל מהם ולעמוד כנגדם, אבל קשה מאוד להתגבר כנגדם, וא\"א לחייבו על מעשה זו, אבל כל חיובו על מעשה הראשונות, שבמעשה זו גרם להביא את עצמו לעונות האחרונים, וע\"כ מתפללים אל תזכר לנו עונות הראשונים, כי אם הם לא יזכרו, נבטלו האחרונים ממילא והבן."},{"passage_id":"devurim_7380f984_p26","passage_content":"ומעתה מ\"ש הכתוב כי יסיתך אחיך וגו', בסתר לאמר נלכה ונעבדה וגו', אין כוונת הכתוב שדבר דבריו בסתר, בחדר לפנים מחדר שלא יהיו עדים שומעים ומעידין עליו, כי אין נפק\"מ בזה לדינא, אבל הכתוב מזהיר כאן על חיוב השמירה ממנו, ויובן עפ\"י מ\"ש האוהחה\"ק וז\"ל ודקדק הכתוב לומר בסתר, להעיר כי המסית הוא מסתיר עצמו כי הוא המסית, ומדבר כמדבר דברי אהבה וריעות, ומראה טלפיו כי לא להרע הוא מתכוון, וע\"כ אמר הכתוב לאמר נלכה ונעבדה, פי' לא שאומר בפי' נלכה ונעבדה, אלא אומר דברים מסותרים, ותכלית דבריו הוא לומר נלכה ונעבדה, עכ\"ד האוהחה\"ק, וע\"כ לאזהרת השמירה ממנו כתבה תורה בסתר, וכמו שפרש\"י ז\"ל דבר הכתוב בהווה שאין דברי מסית אלא בסתר, וע\"כ צריך שמירה יתירא שלא יתחבר עמו כלל, ואל תאמר בלבבך שעדיין אינו מסית לע\"ז, וכשיבוא לידי כך אברח ממנו ואניחו, ע\"כ הזהירה התוה\"ק, תדע שכל דבריו הם בסתר, וגם מה שנראה לך דברים פשוטים, ארס של ע\"ז טמון בהם, ולא תדע העת שאתה צריך לברוח ממנו, וגם לא יהי' עוד בכוחך לברוח ממנו, כי כבר יכנס הארס בגופך, וע\"כ מחיוב השמירה לברוח ממנו מיד, וכל התחברות עם עוברי עבירה, ה\"ה בכלל גדר שמירה זו, וכמ\"ש האוחה\"ק עה\"פ ובו תדבקון וז\"ל, וכאן צוה ד' שלא ידבק אלא בקרובי ד', ולשלול בא שלא ידבק בקרובי ע\"ז, עכ\"ד, וכמו שמצינו בחורבן הבית שהפסוקים מעידים שנביאי הבעל הטעו את ישראל, והם היו הגורמים לכל חטאיהם, ואעפ\"כ הי' גזירת החורבן על כל ישראל, אלא ודאי מדין השמירה נגעו בה, מפני שלא שמרו את עצמן מהם, והתוה\"ק חייבה לשמור מהם ולברוח מהם, ושלא להתחבר אליהם כלל."},{"passage_id":"devurim_7380f984_p27","passage_content":"והנה במס' שבועות (ל\"ט ע\"א) ביארו שם חומר העונש של שבועת שקר ושבועת שוא, ואמרו שם כל עבירות שבתורה, אם יש לו זכות תולין לו ב' וג' שנים, וכאן נפרעים ממנו לאלתר, שנאמר (זכרי' ה') הוצאתי' נאם ד' ובאה אל בית הגנב ואל בית הנשבע לשקר וגו', וכלתו ואת עציו ואת אבניו, דברים שאין אש ומים מכלין אותן, שבועת שקר מכלה אותן, ודרשו שם אל בית הגנב זה הגונב דעת הבריות וכו', ואל בית הנשבע לשקר כמשמעו, עכ\"ד הגמ' וכתב המהרש\"א (בח\"א שם) דע\"כ לא דרשי לי' על גנב ממש, דאינו חמור כ\"כ לכלות עציו ואבניו, ע\"כ מיירי בגונב דעת הבריות, שאין לו ממון אצל חבירו וטוענו ומשביע לחנם, דהוי בכלל לא תשא את שם ד' לשוא, עכ\"ד המהרש\"א."},{"passage_id":"devurim_7380f984_p28","passage_content":"ואפ\"ל דעל כן החמירה תוה\"ק בעונש עיר הנידחת כ\"כ, שנא' הכה תכה את יושבי העיר הזאת לפי חרב, החרם אתה ואת כל אשר בה וגו', ולא ידבק בידך מאומה מן החרם, מפני שבעיר הנידחת נמצאים הרבה מסיתים ומדיחים, והם גונבי דעת הבריות, וכל מעשיהם בסתר וזה סכנה גדולה, וחיוב גדול להשמר מהם, וחרון אף ד' גדול מאוד עליהם, ע\"כ סיים הכתוב כשתעשה דין עיר הנידחת, אז ישוב ד' מחרון אפו, ודרשו חז\"ל כל זמן שהרשעים בעולם חרון אף בעולם, וא\"ש מה דתני רב יוסף מאן רשעים גנבי, הכוונה על אלו המסיתים גונבי דעת הבריות, וגם רב יוסף מיירי בע\"ז כפשטות הכתובים וכפרש\"י, אלא שנותן טעם על עונש החמור שנתנה תורה על עיר הנידחת, ועל חרון אף ד' המבואר בקרא, ע\"כ אמר מאן רשעים גנבי, וכ\"ז שרשעים האלה בעולם מפישים חרון אף בעולם, וע\"כ החמירה התוה\"ק בעונש עיר הנידחת הכה תכה את כל יושבי העיר וגו' ושרפת באש וגו' ולא ידבק בידך וגו' מפני שיש בו גונבי דעת הבריות, וצריך זהירות ושמירה יתירה להרחיק מהם, וצותה תוה\"ק להשמר מאלו המסיתים וגונבי דעת הבריות וכמו\"כ לטעם זה כתבה תורה שמירה על כל המצות, ושומר שכר חייב אף על הגניבה, וזה אזהרה לשמור עצמנו מגונבי דעת אלו."},{"passage_id":"devurim_7380f984_p29","passage_content":"ומעתה נבאר מאמר הכתוב רק חזק לבלתי אכל הדם, ולמה הזהירה הכתוב על התחזקות באזהרת הדם, גם למה נאמר לאו זה בלשון שלילה, כקושיתנו לעיל (קושיא ה'), ואפ\"ל עפ\"י מ\"ש הרמב\"ן ז\"ל בשם ס' המורה, שהיו שטופים באכילת הדם, ומתחברים אל השדים עי\"ז, כדי לשמוע מהם עתידות, ואפשר שאזהרה זו לא נאמרה לאסור אכילת הדם, כי כבר הזהיר עלי' הכתוב כ\"פ, אבל כאן צוה הכתוב שלא ליתן התחזקות לאוכלי הדם, והצווי הוא שלא לשאול עתידות מאוכלי הדם, כי עי\"ז נותנים להם חיזוק וגורמים לו שיאכל דם, ואילולא שומעים לו, ושואלים ממנו עתידות, לא היה מתחבר אל השדים ולא הי' אוכל דם, ומפני שהיו שטופין ורודפין לשמוע עתידות כמ\"ש הרמב\"ן ז\"ל, ע\"כ הזהירנו הכתוב חזק שיהי' לך התחזקות, ואל תרדוף לשאול העתידות מאוכלי הדם, לבלתי אכל הדם, שלא תגרום שיהא הדם נאכל על ידך, וע\"כ כתבה תורה אזהרה זו בלשון שלילה לבלתי אכל הדם."},{"passage_id":"devurim_7380f984_p30","passage_content":"ואפ\"ל עוד בחינה, עפ\"י מ\"ש האוהחה\"ק (בפ' יתרו) עה\"פ לא יהי' לך אלהים אחרים, וז\"ל כי פעולת איש ישראל העובד ע\"ז ר\"ל, פועלת הדרגה באותו אלהים, והוא אומרו לא יהיה לך אלהים, פי' הוי' שלך תעשנו אלהים, והאבן עזרא ז\"ל כתב עה\"פ כי מנסה ד' אלקיכם אתכם, בעבור שעזבו ולא המיתו, וע\"כ ניתן לו הכח לעשות אותות ומופתים, עכ\"ד, ואלו הי' לכל הדור התחזקות בשמירת התומ\"צ, לא הי' כח לע\"ז כלל, והיו בטלים ממציאות לגמרי, כי רק ע\"י העברת התומ\"צ, נותנים להם הוי' וכח ומציאות כמ\"ש האוהחה\"ק, ועי\"ז נותנים להם כח לעשות אותות ומופתים כמ\"ש הראב\"ע ז\"ל."},{"passage_id":"devurim_7380f984_p31","passage_content":"ואפשר שמה שאמר הכתוב כאן רק חזק, הזהירנו הכתוב להתחזק בשמירת כל התורה והמצות, ואז יהי' ממילא לבלתי אכל הדם שלא יתאכל הדם, ולא יהי' כח לסט\"א והשדים להתחבר עם ישראל, ולטמא אותם ע\"י אכילת הדם, כי אם נתחזק בתומ\"צ, כאפס וכאין יהיו, ולא יהי' בכוחם להביא את ישראל לידי נסיונות ע\"י העתידות שאומרים, כי הנסיונות ע\"צ העונש הם באים כמ\"ש האבן עזרא ז\"ל, ובעבור שרפו ידי הדור מן התורה והמצות, ע\"כ יש לרשעים ולמזיקי עולם, כח גדול לעשות אותות ומופתים ולהביא אותם לידי נסיונות."},{"passage_id":"devurim_7380f984_p32","passage_content":"ולכן הזהירנו התוה\"ק רק חזק בתומ\"צ, ותתחזק כוחות נפשך ע\"י שמירת התומ\"צ, ולא תתן אחיזה לסט\"א בכוחות נפשך, ואז יהי' ממילא לבלתי אכל הדם, ונותן הכתוב טעם כי הדם הוא הנפש, דכל תשוקתם של המזיקים האלה אל הדם, מפני שיש בדם כח הנפש, וכל מאוים שיהא להם אחיזה בקדושה ובנפשות ישראל, וע\"כ מתדבקים השדים אל אוכלי הדם, כי ע\"י הדם, שיש בו כח הנפש, יש להם אחיזה בנפש הישראל, וע\"כ צותה התוה\"ק לחזק כוחות נפשך ע\"י שמירת התומ\"צ, ואז לא יהיה להם אחיזה להתדבק בנפשך."},{"passage_id":"devurim_7380f984_p33","passage_content":"והרמב\"ן ז\"ל כתב כי ב' טעמים יש, טעם הכתוב כי הדם הוא הנפש והוא העיקר, וטעם שכתב בס' המורה, שהיו מתחברים לשדים ע\"י אכילת הדם, ולדרכנו שניהם חדא נינהו, והא בהא תליא, כי ע\"כ היו השדים מתחברים אליהם באכילת הדם, כי הדם הוא הנפש, וכל תשוקתם להיות להם אחיזה בנפשות ישראל, וע\"י הדם שבו כוחות הנפש, אפשר להיות להם אחיזה, ותרווייהו חד טעמא אינהו."},{"passage_id":"devurim_7380f984_p34","passage_content":"וא\"ש דברי המדרש הנ\"ל (בפ' ויקרא) אמר הקב\"ה לנפש אני כתבתי עליך רק חזק לבלתי אכל הדם וגו', ואת יוצאת וחוטאת, נפש כי תחטא בשגגה ע\"כ, (עיין לעיל קושיא ו'), ולדרכנו אין כוונת המדרש על אזהרת הדם לבד, כי אם לא נזהר באזהרה זו, אין עדיין בידו שגגת שאר מצות, אבל בפסוק זה רק חזק, הזהירה התוה\"ק על התחזקות בכל המצות, וגם הזהירנו על השמירה, שלא נעשה גרמא ע\"י מעשינו לעבירות, כמ\"ש בדרך הראשון שהצווי הוא שלא ישאל עתידות מאוכלי הדם, שלא יגרום שיהי' הדם נתאכל על ידך, וכ\"ז מגדר השמירה לחייב אף על הגרמא כנ\"ל, וע\"כ הקב\"ה מתמי' על הנפש, שמפני שלא קיימת אזהרה זו רק חזק וכו', ע\"כ נכשלת בשגגת המצות, הוי נפש כי תחטא."},{"passage_id":"devurim_7380f984_p35","passage_content":"וכעין זה מבואר במדרש שם, וז\"ל נפש כי תחטא ושמעה קול אלה, הה\"ד חולק עם גנב שונא נפשו, אלה ישמע ולא יגיד (משלי כ\"ט) מעשה בשלטון א' שהי' הורג את הקבלנין (שהי' מקבלין מן הגנבים מה שגנבו) ומתיר את הגנבים, והי' הכל מליזין עליו וכו', הביא חולדות ונתן לפניהם מנות וכו' וסתם את החורים, והיו נוטלות את המנות ומוליכות לחורים, ומוצאים אותן מסותמות, ומחזירות את המנות למקומן, לומר שאין הכל אלא מן הקבלנים, וע\"כ אמר שלמה חולק עם גנב שונא נפשו, שהוא גורם ומרגיל את הגנב לעבירה, סוף שיכשל שישמע האלה, מ\"ש תורה אם לא יגיד ונשא עונו, ויעבור עליו ולא יגיד, עכ\"ד המדרש, עכ\"פ מבואר דברי שלא שמר את עצמו מגרמת העבירה, לסוף נכשל בעבירה עצמה, ובאמת כתב המדרש משל זה על נפש כי תחטא ושמעה קול אלה, אבל אפשר שרצו גם לתת טעם על פרשה שלמעלה ממנו, שנא' נפש כי תחטא ועשה אחת מכל מצות ד' וגו', איך אפשר שבא הנפש לידי שגגת חטא, ע\"כ הביאו המשל, דע\"י שלא שמר עצמו כראוי, ולא הרחיק את עצמו מגרמת עבירה, בא לידי כשלון אח\"כ, ואלמלי עשה הרחקות, והתחזק בשמירת מצותיו ית' לא הי' בא לידי חטא כלל."},{"passage_id":"devurim_7380f984_p36","passage_content":"ופלא מ\"ש התרגום יונתן, בעשרת הדברות (שבפ' ואתחנן) וז\"ל עמי בני ישראל לא תהוון גנבין, לא חברין ולא שותפין עם גנבין, ולא יתחמי בכנשתהון דישראל עם גנבין, וכ\"כ בכל הדברות, ועוד כתב בלאו דלא תרצח דלא יקומון בניכון בתריכון, וילפון להון הינון, למהוי עם קטולין עכ\"ל, והנה כל אלה שכתב הוא בגדר הרחקה, להרחיק את עצמו מעבירה, ושלא יתחבר עם עוברי עבירה, ולא יתראה אפי' בחבורתם, פן ילמדו הבנים ויהיו כמותם, ולפי דברי התרגום יונתן הי' נכלל כל זה בלוחות, ומהיכן דרש לומר כן, ואין זה מבואר בכתוב, ולהלן נעתיק מה דאיתא במדרש רבה (שה\"ש) שבין כל דיבור ודיבור שבעשרת הדברות, פרשיותי' ודקדוקי' של תורה היו כתובים, וא\"כ כיון שהי' כתוב בלוחות המצות ודקדוקי' של תורה, גם חיוב השמירה והרחקה מהעבירה הי' נכלל בהם, כי כשנצטוו ישראל על המצות, נצטוו ג\"כ בחיוב השמירה עליהם, ובכל צדדי הגרמא."},{"passage_id":"devurim_7380f984_p37","passage_content":"ועתה נבאר מה הי' טענת משרע\"ה, במה שטען לי צווית ולא להם, והדקדוקים כבר נפרטו לעיל, ונראה דהנה כתבו בעלי התוס' והרמב\"ן ז\"ל והראב\"ע וכל הראשונים, כי לא לשם ע\"ז נתכוונו ישראל בעשיית העגל, כי אם לעשות שופט ומנהיג במקומו של משה, כמשה\"כ עשה לנו אלהים אשר ילכו לפנינו, אשר יורה לנו הדרך, כי זה משה לא ידענו מה הי' לו, ומיד הי' בדעתם, כי אם ישוב משה יעזבו את העגל, וילכו אחר משה רבינו (כ\"כ הרמב\"ן ז\"ל) וכן הי' הדבר, כיון שראו העם את משה, מיד הניחו את העגל ובעטו בו, שהניחו לו לשרפו ולזרות עפרו ע\"פ המים, ואין חולק עליו כלל, וכתב הרמב\"ן ז\"ל עה\"פ לשמצה בקמיהם, עפי\"מ שתרגמו אונקלוס לאסבותהון שום ביש לדריהון, כי העגל אשר עשו, אעפ\"י שלא כוונו בו לשם אלקית, וישראל שבאותו הדור ידעו שאין בו ממש, ולא עשוהו לשם ע\"ז, אבל יהי' מכשול ושמץ רעה לדורות ישראל הבאים, פן יגררו אחר הע\"ז ויאמרו לא לחנם עשו אבותינו את העגל ועבדוהו, רק שידעו בו כי הוא אשר העלם מאמ\"צ, ומצאו בעבודתו תועלת, ואף אנחנו נעשה כן, עכ\"ל הרמב\"ן ז\"ל, עכ\"פ נמצא שכל חטא העגל לא הי' בו עבירה דע\"ז בפועל, אלא בבחי' גרמא לחטא, שגרמו לדורות הבאים לטעות אחר הע\"ז, ולא יצאו ידי חובתן בחיוב השמירה שנצטוינו בכל המצות, ומגדר השמירה להרחיק מכל דבר הגורם להפסיד עבודתו ית', ולהשמר מנזק קודם בואו כמו שאמרנו לעיל."},{"passage_id":"devurim_7380f984_p38","passage_content":"ומעתה א\"ש מה שהמליץ משרע\"ה על ישראל, וטען לי צווית ולא להם, כי בפסוק נאמר אנכי ד' אלקיך, ולא יהי' לך אלהים אחרים, שלא לעבוד ע\"ז בפועל, והם לא עבדו ע\"ז בעשיית העגל, אלא שלא יצאו ידי חובתן בחיוב השמירה מגרמא, וחז\"ל דרשו כן במדרשים שנכלל במצות התורה ובדברות גם חיוב שמירה עליהם, אבל אין מפורש כ\"ז בפשוטו של מקרא, והם לא השיגו עוד הרמוז בכתובים, כפי מה שכוונו חז\"ל באמיתות דרשתם."},{"passage_id":"devurim_7380f984_p39","passage_content":"וזה הי' טענת משרע\"ה לזכותם, שלא עברו ישראל על פשטות הכתובים, אלא שלא הבינו הרמוז בהם מחיוב השמירה, ולא הי' עליהם חיוב השגה זו, כי לא היו עדיין הלוחות בידם, ובלוחות הי' כתוב כ\"ז בין דיבור לדיבור כמבואר לעיל בשה\"ש רבה (פר' ה') עה\"פ ידיו גלילי זהב וגו', א\"ר יוחנן יפה למדני בן אחי ר\"י, מה גלים הללו, בין גל גדול לגל גדול גלים קטנים, כך בין כל דיבור ודיבור שבעשרת הדברות, פרשיותי' ודקדוקי' של תורה היו כתובים ע\"כ, מבואר שכל אזהרות ודקדוקי תורה היו כתובים בדברות, ולפי דעת חז\"ל המבואר בש\"ס ומדרשים, גם חיוב השמירה בכלל האזהרות ודקדוקי תורה, וא\"כ הי' כ\"ז בלוחות בין דיבור לדיבור, וכמ\"ש התרגום יונתן הבאנו דבריו לעיל, שהי' כתוב בלוחות חיוב השמירה והרחקה מהעבירה ומכל דבר הגורם לעבירה עיי\"ש, אבל כיון שלא הי' עדיין הלוחות בידם, לא חלה עליהם עוד חיוב ידיעה זו, ע\"כ שיבר משרע\"ה את הלוחות, ולא ידעו ישראל הכתוב בהם, כדי שיהי' להם תירוץ שלא ידעו בחיוב השמירה."},{"passage_id":"devurim_7380f984_p40","passage_content":"וכל הטענה של לי צווית ולא להם, לא הי' על גוף הצווי והדברות אנכי ולא יהי' לך, שהכל מודים שגם לישראל נאמרו ונצטוו בה, אבל מה שרמוז בהם מחיוב השמירה, והצווי להתרחק מכל דבר הגורם להיות מפסיד עבודתו ית' ומצותיו, ושלא להתחבר עם הערב רב, שזה גורם היזק בחיוב השמירה, כל זה לא ידעו ישראל עוד, ולא הי' עליהם חיוב ידיעה זו, כי לא בא לידם עדיין הלוחות, ולא נצטוו עליהם בפירוש, וזה הי' לימוד זכות גדול על ישראל, ונצטוו על השמירה אח\"כ כמו שדרשו חז\"ל."},{"passage_id":"devurim_7380f984_p41","passage_content":"ובזה יתבאר מאמר הכתוב, שמור ושמעת את כל הדברים האלה וגו', למען ייטב לך ולבניך וגו', כי תעשה הטוב והישר וגו' והדקדוקים כבר נפרטו לעיל (קושיא ט') ולדרכנו נאמר, כי לא בא אזהרה זו על שמירת גוף המצות, כי כבר הזהירנו התוה\"ק בהם בכ\"מ, ולא הי' הצורך לכפול את האזהרה בהם, ועוד שאלמלא כן, הי' צריך להקדים אזהרת השמיעה לאזהרת השמירה, והול\"ל שמע ושמור כקושית האוהחה\"ק ז\"ל, אבל מה שציונו התורה כאן, הוא שנהי' זהירים במצות השמירה בכל המצות, וגדר השמירה להרחיק מכל דבר נזק והגורמים להפסיד עבודתו ית', וכמ\"ש האוהחה\"ק שרמז הכתוב באמרו ושמעת את כל הדברים האלה, לרבות כל גזירות ושמירות וגדרים שחידשו רז\"ל, שבאמצעות הגדרים יהיו מצות התורה נשמרים עכ\"ד ז\"ל."},{"passage_id":"devurim_7380f984_p42","passage_content":"גם נכלל בצווי זה לחנך הבנים, שיזהרו במצות ד' בשמירה מעולה, ואפשר שרמז עלי' הכתוב, באמרו ושמעת את כל הדברים האלה, שתלמד אותם על השמירות וגדרים וסייגות, שנרמזו בתיבת כל הדברים כדברי האוהחה\"ק, ואז כשהם עושים ומקיימים מצות ד' וייטיבו מעשיהם על ידך, נחשב לך בעולם העליון, כאלו עדיין אתה חי ומקיים מצות ד', כמ\"ש חז\"ל אם אומרים שמועה מפיו בעוה\"ז, שפתותיו דובבות בקבר, שנא' אגורה באהליך עולמים, ועל דרך זה בכל המצות, כיון שאתה הגורם למעשיהם ע\"י החינוך טוב שנתת להם, נחשב לך למעשה, וח\"ו להיפך אם לא יחנכם כראוי, והבנים לא אמון בם ואינם מחזיקים בתורת ד' ר\"ל, נחשב מעשה הרע אליו, מפני שפשע בשמירתם, וע\"כ נענש גם הוא על מעשיהם, שהוא הי' הגורם לחטאם, ונכלל כל זה בחיוב השמירה שקבלנו עלינו להשמר מכל דבר הגורם לחטא, ובדרך כלל תלוי מעשה הבנים והנהגתם כפי החינוך אשר יקבלו, וזה מאמר הכתוב למען ייטב לך ולבניך אחריך, שתחנכם ע\"ד התורה שייטיבו מעשיהם עד עולם, ואז כי תעשה הטוב והישר בעיני ד', כשיקיימו בניך מצות ד', יהי' נחשב לך כאלו אתה בעצמך תעשה הישר והטוב, וע\"כ נאמר כי תעשה הישר בלשון עתיד, כי הכוונה על לעתיד בעולם העליון, גם שם תעשה הטוב והישר, ותקיים מצות ומע\"ט ע\"י בניך, כשיהיו הם מקיימים מצות ד', יהי' נחשב העשיי' הזאת גם לך."},{"passage_id":"devurim_7380f984_p43","passage_content":"ואפ\"ל עוד בדרך הפשוט, עפי\"מ שפרשתי הפסוק (משלי כ\"ב) חנוך לנער עפ\"י דרכו גם כי יזקין לא יסור ממנו, כי דרך העולם כשהבנים מתנהגים בדרך התורה וייטיבו מעשיהם, אז גם אביהם ייטיב דרכו ויתקן מעשיו עוד יותר, ואם ח\"ו להיפך אז גם הוא מתקלקל עמהם, וזה חנוך לנער עפ\"י דרכו, שתתן לו חינוך טוב, ואז גם כי יזקין לא יסור ממנו, ר\"ל גם אביהם הזקן לא יסור ממצות ד', וכמו\"כ כאן למען ייטב לך ולבניך אחריך, שתחנכם שייטיבו מעשיהם, ויקיימו מצות ד', ואז כי תעשה הטוב והישר בעיני ד' אלקיך, שגם אתה תעשה הטוב והישר ותתקן מעשיך, ובזה יהיו מתורצים ג' קושית שהקשה האוהחה\"ק בפ' שמר ושמעת (עיין לעיל קושיא ט')."},{"passage_id":"devurim_7380f984_p44","passage_content":"ונבוא לבאר הענין מ\"ש הקב\"ה למשה פסל לך, ואיתא במדרש הנ\"ל שחייבו הקב\"ה למשה בתשלומין, על שהיו הלוחות פקדון אצלו, והדקדוקים כבר נפרטו לעיל, ונקדים מה שהקשה הגאון הק' מפלאצק זלל\"ה, דלכאורה איך שיבר משה את הלוחות, הלא הי' כתובים בהם שמותיו ית', וגרם בזה לידי מחיקת השם, ע\"כ קושיתו, ובאמת מבואר במדרשים ובתנדב\"א (ח\"ב ריש פ\"ד) שפרחו הכתובים מן הלוחות, שנא' וארא והנה חטאתם וכו', ובתנחומא (פ' תשא) מבואר עוד יותר וז\"ל, כל ימים שהי' הכתב על הלוחות, לא הי' משה מרגיש בהם, כיון שפרח הכתב נמצאו כבדים על ידיו והשליכם ונשתברו ע\"כ, הרי מבואר דבשעה ששברן משה רבינו, כבר פרח הכתב מהם, ולא הי' עוד חשש מחיקת השם."},{"passage_id":"devurim_7380f984_p45","passage_content":"אמנם לכאורה קשה ע\"ז, שהרי אמרו בגמ' שבת (פ\"ז ע\"א) ששבר משה את הלוחות מכח ק\"ו, ומה פסח שהוא א' מתרי\"ג מצות אמרה תורה וכל בן נכר לא יאכל בו, התורה כולה כאן וישראל מומרים על אחת כמה וכמה ע\"כ, והא תינח אם הי' הכתב בלוחות שייך למידרש ק\"ו זה, אבל לפי דברי המדרשים הנ\"ל, שכבר פרח מהם הכתב לפני שבירתן, א\"כ לא שייך לומר כל התורה כולה כאן, ונמצא בטל כח הק\"ו."},{"passage_id":"devurim_7380f984_p46","passage_content":"ובאמת במדרש גופא יש סתירה, שאמרו שם (פ\"ר מ\"ו ס\"א) שפרחו הכתובים מן הלוחות, ובאותו מאמר עצמו אמרו, לכך שיבר משה את הלוחות, שאמר מוטב שידונו כפנוי' ולא כאשת איש, דנראה כתרתי דסתרי אהדדי שהרי הקידושין א\"א שיחולו אלא ע\"י הכתב שבלוחות, וכיון שכבר פרח הכתב מהם, בלא\"ה ידונו כפנוי', ולמה הי' צריך לשברן עוד מטעם שלא ידונו כאשת איש, והרי בלא\"ה אין לקדושין שום חלות."},{"passage_id":"devurim_7380f984_p47","passage_content":"ואפ\"ל עפ\"י הסברא שכתבו התוס' במס' שבת (פ\"ז ע\"א) שהקשו שם איך ערערו אהרן ומרים על משה במה שפירש מן האשה, והלא הסכים הקב\"ה על ידו, במ\"ש ואתה פה עמוד עמדי, ותירצו בתוס' שאעפ\"כ התרעמו עליו, שאלו לא פירש מדעתו, לא הי' הקב\"ה מסכים עמו, אלא לפי שהי' רצונו כן, לכן הסכים הקב\"ה על ידו, דבדרך שאדם רוצה לילך מוליכין אותו עכת\"ד התוס' ז\"ל, וכעין סברא זו כתב האוהחה\"ק (בפ' קרח) מדעתי' דנפשי', בפי' הפסוק כי ד' שלחני כי לא מלבי, ולכאורה הוא כפל לשון, ופי' הוא ז\"ל כי אעפ\"י שד' שלחו, עדיין הי' מקום לערער ולומר, שהי' מלבו ורצונו, והסכים ד' על ידו, כי רצון יראיו יעשה, ע\"כ אמר כי לא מלבי, שלא הי' לי אפי' רצון בלב עכת\"ד."},{"passage_id":"devurim_7380f984_p48","passage_content":"ובסברא זו אפשר לתרץ קושיתנו הנ\"ל, ונאמר כי משרע\"ה עשה ק\"ו זו טרם שפרחו האותיות, והיו עדיין האותיות קיימות בלוחות, וא\"כ יפה כח הק\"ו שכל התורה כולה כאן וכו', אבל כיון שדרש ק\"ו זה ובירר להלכה כן, הסכים הקב\"ה על ידו, וכדי שלא יבוא לידי מחיקת השם ע\"כ פרחו האותיות, נמצא דמה שפרח הכתב מן הלוחות, הי' ג\"כ בכח הק\"ו שדרש משה, ומה שאמר מוטב ידונו כפנוי' וכן הק\"ו שעשה, כ\"ז הי' קודם שפרח הכתב מהם, והי' הכרח לדרוש ק\"ו על שבירתן כדי שידונו כפנוי', ואחר שדרש ק\"ו הסכים הקב\"ה עמו, וע\"כ פרח הכתב מהם כדי שלא יבוא לידי מחיקת השם, והוא גרם לזה בכח הק\"ו שדרש."},{"passage_id":"devurim_7380f984_p49","passage_content":"והנה לפי\"ז לכאורה אין עליו חיוב תשלומין, אפי' אם יעשו ישראל תשובה, ונמצא שלא הי' צורך בשבירתן, כי שבירתן הי' בידי שמים ע\"י שפרחו האותיות מהם, וכל מה שפעל משה רבינו בזה הי' רק גרמא, דע\"י שדרש ק\"ו והי' לו רצון בשבירתן, הסכים הקב\"ה עמו ופרח הכתב מהם, וא\"א לחייב בתשלומין ע\"ז, כי גרמא בנזקין פטור, ע\"כ אמרו במדרש הנ\"ל, שאמר הקב\"ה למשה, וכי לא פקדון היו הלוחות בידך, ומדין השומר שחייב אפי' על גרמא, ואפי' ע\"י שליח כנ\"ל, ע\"כ את שברת אותם ואת מחליף אותן לכך נאמר פסל לך וא\"ש."},{"passage_id":"devurim_7380f984_p50","passage_content":"ועתה נבוא לבאר תחלת הפרשה ראה אנכי נותן לפניכם היום ברכה וקללה, עפ\"י מ\"ש רשיז\"ל (בפ' מקץ), בשבע שנים הטובות נאמר הגיד לפרעה לפי שהי' סמוך, ובשבע שני הרעב נאמר הראה את פרעה, לפי שהי' הדבר מופלג ורחוק, נופל בו לשון מראה עכ\"ל רש\"י ז\"ל, עכ\"פ מבואר דעל דבר שהוא רחוק בזמן, וא\"א לראותו כ\"א בעין השכל, נופל עליו לשון ראי', וכן מצינו שאמר הכתוב אראנו ולא עתה (במדבר כ\"ד) ודבר שהוא נוכח עיניו נופל עליו לשון הבטה, וזה מאמר הכתוב ראה, שצוותה עלינו התוה\"ק על חיוב השמירה בכל המצות, וגדר השמירה לראות למרחוק, ולהרחיק כל נזק טרם בואו, כמו שפרש\"י ז\"ל שמור את החדש האביב קודם בואו שמור וכו', וכמ\"ש לעיל בשם הרמב\"ן ז\"ל דחטא העגל הי' מפני שיכשלו על ידו דורות הבאים, וכן פי' האונקלס עה\"פ לשמצה בקמיהם עיי\"ש, וכ\"ז בגדר השמירה לראות את הנולד, ולהרחיק כל נזק, וע\"כ אמר היום, שהצווי הוא לראות היום גם מה שעתיד להיות לאחר זמן, ושמירה זו יגרום עליך הברכה, וח\"ו להיפך גורם הקללה."},{"passage_id":"devurim_7380f984_p51","passage_content":"וכתב הספורנו בפ' תבוא, שע\"כ נאמרו י\"א ארורים בלשון יחיד ארור האיש וגו', כי החוטאים האלה היו על הרוב ראשי העם, שלא הי' על ההדיוטות למחות בידם, וע\"כ קלל את העוברים לבדם, ולא יהיו שאר העם ערבים להם, כמו שהעיד יחזקאל, באמרו נשיאי ישראל איש לזרועו היו בך, למען שפוך דם, אב ואם הקלו בך וכו' ובאותה הפרשה הזכיר הנביא רוב אלה הארורים, ואמר שנעשו אלו העונות בירושלים ע\"י הנשיאים, עכ\"ל הספורנו ז\"ל. וקשה להבין איך אפשר שנשיאי ישראל בימי יחזקאל הנביא, שהי' בזמן בית הראשון, עשו עונות מכוערים כאלה עריות ושפכ\"ד וכדומה, אלא ע\"י שלא עשו הרחקות וסייגים, ולא יצאו ידי חובת שמירה, וחיוב השמירה להסיר כל נזק וכל דבר הגורם לעבירה, ע\"כ הם גרמו עונות אלו שנעשו ע\"י העם, ונחשב להם כאלו עשו בעצמם."},{"passage_id":"devurim_7380f984_p52","passage_content":"ובזה אפ\"ל מ\"ש בפ' עגלה ערופה, וענו ואמרו ידינו לא שפכה את הדם הזה ועינינו לא ראו, ובמס' סוטה (מ\"ה ע\"ב) במתני' שם, וכי על דעתינו עלתה, שזקני ב\"ד שופכי דמים הן, אלא שלא בא לידינו ופטרנוהו בלא מזון, ולא ראינוהו והנחנוהו בלא לוי' ע\"כ, ולכאורה עדיין יקשה ההמשך מ\"ש כפר לעמך ישראל וגו', כי לא יתכן לבקש על הכפרה אא\"כ עשו איזה חטא, וכיון שאמרו ידינו לא שפכה ועינינו לא ראו, ולא פטרנוהו בלא מזונות ובלא לוי', א\"כ מה הקישור לומר אחריו כפר לעמך ישראל וגו'."},{"passage_id":"devurim_7380f984_p53","passage_content":"ולדרכנו נאמר דזקני העיר באמת לא שפכו דם ולא פטרוהו בלא מזונות, אבל איך נזדמן ונסתבב מעשה כזה בעירם, מפני שלא השגיחו כדי צרכו של הדור, ולא יצאו ידי חובת השמירה שמוטל עליהם, וע\"כ צריכים כפרה, וזה מאמר הכתוב ידינו לא שפכה את הדם הזה, אבל עדיין אנו צריכים לכפרה, לפי שעינינו לא ראו, שלא ראינו מרחוק, לעשות גדרים וסייגים ולהסיר כל נזק טרם בואו, כמו שנצטוו ישראל ע\"ז בגדר השמירה, כי אלו עשינו כל זה לא הי' אפשר שתבוא תקלה ומכשול כזה בעירנו, וע\"כ צריכים כפרה."},{"passage_id":"devurim_7380f984_p54","passage_content":"ומעתה אפשר לפרש ומאמר הכתוב ושברתם את מצבותם וגו' לא תעשון כן וגו' ויתורץ מה שהקשינו לעיל (קושיא ד') עפ\"י מ\"ש רז\"ל במס' סוטה (ל\"ד ע\"ב) הובא ברש\"י ז\"ל (פ' מסעי) עה\"פ והורשתם את כל יושבי הארץ וגו' ואבדתם את כל משכיותם ואת כל צלמי מסכותם וגו', כי לכם נתתי את הארץ, כי הי' תנאי זה בירושת הארץ, ואם תעשו כן תוכלו להתקיים בה, ואם לאו לא תוכלו להתקיים בה, ואיתא בגמ' דבעון ע\"ז נחרב הבית, וע\"כ הזהיר הכתוב ונתצתם את מזבחותם ושברתם את מצבותם, שאם לא תאבדו ע\"ז מן הארץ, תגרמו בזה החורבן, וע\"כ סיים הכתוב לא תעשון כן לד' אלקיכם ופרש\"י אמר ר' ישמעאל שלא יגרמו עונותיכם למקדש אבותיכם שיחרב, וזה קאי על שלפניו ונתצתם את מזבחותם וגו' שאם לא תעשו כן ולא תאבדו ע\"ז מן הארץ תגרמו בזה החורבן, וכתבה תורה לא תעשון דנחשב כאלו אתם עשיתם בעצמכם, אע\"פ שממרום שלח אש, כמ\"ש ויצת אש בציון, אבל כיון שמעשיכם גרמו לזה, ומדין השמירה לחייב גם על הגרמא כנ\"ל."},{"passage_id":"devurim_7380f984_p55","passage_content":"ומעתה יתבאר דברי המדרש הנ\"ל ראה אנכי נתן וגו', מה כתיב למעלה מן הענין כי אם שמר תשמרון את כל המצוה וגו', אמר הקב\"ה אם שמרתם דברי תורה אני משמר אתכם מן המזיקין וכו', ואפשר הכוונה כאן על המזיקין שיש בעולם ברוחניות ובגשמיות, שכל העולם מלא מהם כמ\"ש במדרש הנ\"ל אין בית רובע בחללו של עולם שאין בו כמה אלפים מזיקין, ע\"כ אמרה תורה כי אם שמר תשמרון, שנצטוינו על חיוב השמירה במצות ומכל דבר הגורם נזק בשמירת המצות, ואע\"פ שבאמת אין בכוחינו להשמר כל צורכו, כי הרבה מזיקין יש, ואין לך בית רובע שאין בו כמה אלפים וכו', אבל עלינו לעשות כל מה דאפשר, ואז הקב\"ה יסייע אותנו מדה כנגד מדה, בזכות שנקיים מצות שמירה, גם הקב\"ה ישמור אותנו מן המזיקין ברוחניות ובגשמיות וחיוב השמירה נלמד ממ\"ש הכתוב ראה אנכי, המורה על ראי' למרחוק כנ\"ל, ע\"כ הסמיכו במדרש דרשה זו לפסוק ראה אנכי וכו'."},{"passage_id":"devurim_7380f984_p56","passage_content":"ועתה נבוא לבאר דברי המדרש שהתחלנו בו אדם מישראל מהו שיהא מותר לקרות את התוכחות בקריות הרבה וכו' והדקדוקים כבר נפרטו לעיל (קושיא ב'), ולבאר כל הענין נקדים מה דאיתא במס' מגילה (ל\"א ע\"ב) אין מפסיקין בקללות וכו', אמר אביי לא שנו אלא בקללות שבתורת כהנים, אבל קללות שבמשנה תורה פוסק, מאי טעמא הללו בלשון רבים אמורות, ומשה מפי הגבורה אמרן, והללו שבמשנה תורה בלשון יחיד אמורות, ומשה מפי עצמו אמרן ע\"כ בגמ', ולכאורה קשה איך אפשר לומר כן דמשה מפי עצמו אמרן, והלא האומר אפי' על אות אחת שבתורה, שמשה מפי עצמו אמרו ולא מפי הקב\"ה ה\"ז כופר בתורה, אלא ודאי שגם קללות שבמשנה תורה משה רבינו שמען מפי הגבורה, וא\"כ למה חילקו חז\"ל ביניהם, ובתוס' שם פירשו משה מפי עצמו וברוח הקודש ע\"כ, והרמב\"ן הק' בפ' בחקותי הביא ג\"כ גמ' דמגילה הנ\"ל, וכתב בפירושו וז\"ל, קללות שבתו\"כ בל' רבים ומשה כי אמרן מפי הגבורה אמרן, ובמשנה תורה בל' יחיד ומשה כי אמרן מפי עצמו אמרן, הגבורה עשתה משה שליח בינו ובין בני ישראל עכ\"ל."},{"passage_id":"devurim_7380f984_p57","passage_content":"ועדיין קשה איך אפשר לחלק ביניהם, דהרי גם באותן שבתו\"כ הי' משה רבינו שליח בינו ובין בנ\"י, דהרי בכל התורה הי' סרסור בין ישראל לאביהם שבשמים, וא\"כ למה חילקו חז\"ל ביניהם. ואפ\"ל עפימ\"ש ק\"ז הישמח משה זלל\"ה (בפ' מטות) וכן איתא בספה\"ק, דהי' ב' בחינות בדיבור משה, ובעת שהי' הדיבור בבחי' כה אמר ד', נעשה משרע\"ה שליח, אבל בעת שאמר זה הדבר אשר צוה ד', היתה שכינה מדברת מתוך גרונו ושמעו מפי הגבורה, א\"כ אפ\"ל דתוכחות שבתו\"כ היתה שכינה מדברת מתוך גרונו, וע\"כ אמרו חז\"ל שמפי הגבורה אמרן, ותוכחות שבמשנה תורה הי' רק בבחי' שליח, ועכ\"פ היו שניהם מפי הגבורה, אלא אותן שבמשנה תורה נאמרו בבחי' אחרת כנ\"ל, אבל עדיין צריך הסבר למה חילקו חז\"ל ביניהם, והלא עכ\"פ שניהם מפי הגבורה נאמרו, וגם התוכחות שבמשנה תורה, אף שהי' משרע\"ה בבחי' שליח, מ\"מ פורעניות הם, ומפי הגבורה נאמרו אליו, ולמה אמרו חכמים דמפסיקין בהם, ולא מצאתי עדיין בספרים הסבר מספיק לחלק ביניהם."},{"passage_id":"devurim_7380f984_p58","passage_content":"ונקדים מ\"ד במס' ברכות (ז' ע\"ב) מזמור לדוד בברחו מפני אבשלום בנו, והקשו בגמ' קינה לדוד מבעי' לי', אר\"ש בן אבישלום, מלה\"ד לאדם שיצא עליו שטר חוב, קודם שפרעו הי' עצב, לאחר שפרעו שמח, אף כאן דוד כיון שא\"ל הקב\"ה הנני מקים עליך רעה מביתך הי' עצב, אמר שמא עבד או ממזר הוא דלא חייס עלי, כיון דחזא דאבשלום הוא שמח משום הכי אמר מזמור עכ\"ד הגמ', והקשו המפרשים שלא מצינו שהי' חס על אביו, אדרבה רדפו עד נפש ונהג בו מנהג אכזריות יותר מכל עבדים ואכזרים, וא\"כ עדיין יקשה קינה לדוד מבעי' לי' כקושית הגמ', וביערות דבש (ח\"א דרוש י\"א) הקשה קושיא זו ותוכן תירוצו, כי העונשין הבאים על האדם יתחלקו לב' אופנים שונים, עונש המגיע אל האדם בהשגחה פרטית מד', לענשו על חטאיו ולהשיבו באחריתו, ואופן הב' כי מזלו הוא לרעה, וכפי תולדתו כוכבי השמים מורים אליו לרעה, רק ד' מגן בעדו ומשדד מערכות השמים, וכאשר יחטא האדם, ד' מסלק השגחתו ממנו, ומניחו למנהגו של עולם תחת כוכבי השמים וכסיליהם, והמה פעלו בו כפי מזלו לרעה, וההבדל בין ב' אופנים אלו, דבאופן הראשון ינוקה עונו, ומקבל תשלום פרי חטאתו, ואז טוב לו לעוה\"ב, אבל באופן השני עונש המגיע אליו אינה לכפרת חטאו, רק ע\"י סילוק השגחתו ממנו יונח למקרי הטבע, והם יפעלו בו כפי רוע מזלו, ועונש חטאיו נשארו בשלימות ליום הגמול, ומעתה יבואר דברי הגמ' הנ\"ל, דמתחלה הי' דוד מתיירא שמא עבד או ממזר שהם בטבע אכזרים, א\"כ עונש המגיע אליו הוא ע\"י מקרי הטבע, וזה מורה על סילוק השגחתו ממנו, ואין בעונש זה כפרת עון ע\"כ הי' עצב, אבל בראותו כי בנו רודפו, אמר סתם ברא חייס על אבא, וא\"כ אין זה עונש עפ\"י הטבע, ועכ\"ח שהוא השגחה פרטיית מבעל המשלם גמול, ואם כן בזה יוסר עונו וחטאתו תכופר וע\"כ שר מזמור לדוד עכת\"ד היערות דבש ז\"ל."},{"passage_id":"devurim_7380f984_p59","passage_content":"ולכאורה אפשר לחלק בין שני התוכחות בדרך הנ\"ל, דאותן שבמשנה תורה, יבואו בהשגחה פרטית מאת ד', ועל כן הזכיר הכתוב בהם שם הוי', ישלח ד' וגו' ידבק ד', יככה ד' וגו' יתן ד' וגו' ועוד כמה פסוקים, וכ\"מ שנא' שם הוי' אינו אלא מהקב\"ה לבדו, כי אי אפשר לפרש שם זה על צד הכנוי כמו בשאר שמות, ושם זה מורה על רחמים, להורות כי התוכחות אלה על צד הרחמים יבואו לכפרת עונות, ואין זה פורעניות, ועל כן מפסיקין בהם, ואפשר לברך עליהם הרבה ברכות, כמ\"ש שאמר דוד שירה על עונש הבא לכפרת עון, אבל התוכחות שבתורת כהנים, אינו מבואר ולא נרמז בכתובים שבאים בהשגחה פרטית לכפרת עון, ולא נזכר שם הוי' המורה על רחמים בפסוקי תוכחה שבתו\"כ, וא\"כ אפשר שיש בהם גם עונשים ממקרי הזמן שאינם לכפרת עון, כמ\"ש כ\"פ והלכתי אף אני עמכם בקרי, המורה על מקרה כאשר פירשו מפוה\"ת, וע\"כ אמרו חז\"ל דאין מפסיקין בהם, דאלו על צד העונש הם באים, ואין מברכין על הפורענות, ולפי\"ז א\"ש לחלק ביניהם, אמנם א\"א להעמיס חילוק זה בדברי הגמ', דהם אמרו מפני שמשה מפי עצמו אמרן ע\"כ מפסיקין בהם, ועדיין הענין צ\"ב."},{"passage_id":"devurim_7380f984_p60","passage_content":"ואפ\"ל עפי\"מ דאמרי' (ב\"ק י\"ז ע\"ב) בברייתא, תרנגולין שהיו מפריחים ממקום למקום, ושברו כלים ברוח שבכנפיהן, משלמין חצי נזק, סומכוס אומר נזק שלם, והקשו בגמ' לרבנן, אי כחו כגופו, כולי נזק בעי לשלם, ואי לאו כגופו דמי חצי נזק נמי לא לשלם, אמר רבא לעולם כגופו דמי, וחצי נזק צרורות הלכתא גמיר לה, והקשה הרא\"ש ז\"ל, הא דלא קאמר דכולי עלמא כחו לאו כגופו דמי, וחצי נזק צרורות הלכתא גמיר לי', דמן הדין לא הי' לי' לשלומי' כלום, ואתי' הלמ\"מ לחייבי' בחצי נזק. ותירץ הרא\"ש ז\"ל דפשיטא לי' דהלמ\"מ לגרועי' אתי', כדאמרי' גבי סוכה אתי' הלכתא וגרעתא לשלישית ואוקמי' אטפח עכ\"ד, ובישמח משה סוף פ' אמור כתב לפרש בטעמו של דבר, דהלכתא ודאי לקולא אתי, על פי המבואר בכתבי האר\"י זלל\"ה, דתורה שבכתב הוא דין, ושבעל פה הוא רחמים, וע\"כ כפי הכתוב הוי חומרא, והוא כפי שורת הדין הגמור, אבל הלכתא תורה שבע\"פ מצד הרחמים, ולגרועי' אתי' מן הדין, עייש\"ד."},{"passage_id":"devurim_7380f984_p61","passage_content":"ואפשר להסביר הענין, דלמה תורה שבכתב הוא דין ותורה שבע\"פ הוא רחמים, עפ\"י מ\"ש חז\"ל דמתחלה עלה במחשבה לברוא את העולם במדת הדין, שנא' בראשית ברא אלקים, וראה שאין העולם מתקיים והקדים מדת הרחמים ושתפה למדה\"ד, שנא' ביום עשות ד' אלקים ארץ ושמים ע\"כ, והנה תורה קדמה לעולם, ותורה שבכתב כבר הי' כתובה לפניו ית', אש שחורה ע\"ג אש לבנה קודם שנברא העולם כמבואר במדרש, א\"כ מקורה של תורה שבכתב מעולם הדין כי אז הי' רק שליטת הדינים בעולם, אבל תושבע\"פ אעפ\"י שנברא' ג\"כ קודם בריאת העולם, אבל לא באה לידי התגלות כי אם על ידי משרע\"ה וחכמי התורה, ואז הי' כבר התגברות החסד בעולם, ע\"כ מקורה בסוד החסד, שנמתקו על ידו, ונשתנו ונתהפכו מדין לרחמים."},{"passage_id":"devurim_7380f984_p62","passage_content":"ולדרכנו יתבאר דברי הגמ' במס' מגילה הנ\"ל, דתוכחות שבתורת כהנים משה מפי הגבורה אמרן, שהי' שכינה מדברת מתוך גרונו כנ\"ל, והם מחלק תורה שבכתב שקדמה לעולם, ומצד הדין והגבורה, ע\"כ אמרו חז\"ל שאין מפסיקין בהם, דאין מברכין על הפורעניות, אבל תוכחות שבמשנה תורה משה מפי עצמו אמרן, שהי' שליח כדברי התוס' וכמו שביארנו לעיל, ולכן נמתקו על ידו ונתהפכו מדין לחסד, שהוא הי' כבר בעולם החסד אחר הבריאה, ולכן נזכר שם הוי' בכמה פסוקים בתוכחה זו, להורות כי מצד החסד הם באים, והעונש בא על ידי השגחה פרטיות ולכפרת עון, וע\"כ אמרו חז\"ל דמפסיקין בהם, ומברכין עליהם דעל צד הטובה הם באים."},{"passage_id":"devurim_7380f984_p63","passage_content":"ויתבאר הענין יותר עפ\"י מ\"ש חז\"ל במס' ברכות (נ\"ד ע\"א) חייב אדם לברך על הרעה כשם שהוא מברך על הטובה, שנא' ואהבת את ד' וגו', וכתב הרמב\"ם ז\"ל בפי' המשניות שזה דבר שכלי אצל בעלי השכל, ואפי' לא הורה הכתוב עליו, לפי שיש דברים רבים נראים טובים בתחלתן, ויהי' אחריתם רעה רבה, וכמו\"כ להיפך, וע\"כ אין ראוי למשכיל להשתומם, כשתבא עליו רעה גדולה מפני שאין יודע סופה עכ\"ד. ובאמת מצינו כן בגמ' (במס' תענית כ\"א) גבי נחום איש גם זו, שאמר על הרעות גם זו לטובה, וסוף שהיו הכל טובות, ורבינו יונה פי' חייב אדם לברך על הרעה, מפני שהוא סיבה לכפרת עון, וטובה הוא לו שיתכפרו עונותיו, וא\"ש מ\"ש חז\"ל דתוכחות שבמשנה תורה מפסיקין בהם, ומברכין עליהם כמה ברכות, כיון שלכפרת עון הם באים וע\"צ ההשגחה, ע\"כ מברכין עליהם."},{"passage_id":"devurim_7380f984_p64","passage_content":"ואפ\"ל גם בפשטות, עפ\"י מה דידוע דהגלות צורך הגאולה, כמ\"ש האריז\"ל לפרש מ\"ש חז\"ל, לא גלו ישראל אלא כדי שיתוספו להם גרים, דתכלית הגליות לברר ניצוצות הקדושות מארצות גלותם, ועי\"ז ימהר ויחוש הגאולה, נמצא שהי' ההכרח לתוכחות האלה, והוא גזירה קדומה בשביל צורך הגאולה, וע\"כ שפיר מברכין עליהם, כי הם לטובה כמו הברכות."},{"passage_id":"devurim_7380f984_p65","passage_content":"ובזה יתבאר מאמר הכתוב ראה אנכי נותן לפניכם וגו', ראה רומז על ראי' למרחוק כמ\"ש לעיל, ועל ראי' בעיני השכל, ואם תראה כן תשכיל ותדע, שרק היום ברכה וקללה, ר'ל בבחי' היום ובאשר הוא שם, אבל בעתיד הוא הכל ברכה, ולטובה הם באים, לכפרת עון ולצורך הגאולה כנ\"ל."},{"passage_id":"devurim_7380f984_p66","passage_content":"והנה הבאנו לעיל דברי היערות דבש ז\"ל, שכתב דכפרת עון אינה אלא ביסורים שבאים מצד השגחה פרטיות, ולא עפ\"י מקרי הטבע, ובאמת אפ\"ל דאפי' היסורים שהם בדרך הטבע, כיון שבאים כפי בחינתו ובחי' נפשו יש בהם כפרה קצת, אלא שאין מכפרים כ\"כ כמו היסורים שבאים ע\"צ ההשגחה, וחלוקי כפרה הם, כמו שאינו דומה כפרת המביא אשם להמביא חטאת, וכמו\"כ היסורים שבאים ע\"צ השגחה פרטיות מכפרים יותר, כי נשלחים אליו לרפאות תחלואי נפשו, והם מדה כנגד מדה כנגד מה שחטא, וע\"כ יש בהם כח יותר להסיר פגמי נפשו, והיסורים שבאים ע\"י מקרי הזמן אין בהם כח כפרה כ\"כ, אבל מ\"מ גם הם מכפרים קצת."},{"passage_id":"devurim_7380f984_p67","passage_content":"עכ\"פ נתבאר יפה החילוק, שבין תוכחות שבתו\"כ לתוכחות שבמשנה תורה כנ\"ל, והנה הרמב\"ם פסק (בפי\"ג מה' תפלה ה\"ז) וכן מבואר בש\"ע (או\"ח סי' תכ\"ח ס\"ו), דמצד הדין בקללות שבמשנה תורה אם רצה לפסוק בהן פוסק, וכבר נהגו העם שלא לפסוק בהן, אלא א' קורא אותן ע\"כ, ונראה לתת טעם למנהג העולם, דאפשר שאע\"פ שתוכחות אלו משה מפי עצמו אמרן, והמתיק אותם לחסד ולטובה כמבואר לעיל, אבל מפני שניתוספו העונות בעוה\"ר, נתוספה העונש באריכת הגלות, כמ\"ש רז\"ל ובעונותינו הרבים יצאו מה שיצאו, ועונותינו האריכו קיצנו, וכמ\"ש הרמב\"ן (בפ' בא) שניתוספה על גלות מצרים ל' שנה, ע\"י שהוסיפו על חטאתם פשע עיי\"ש, ועכשיו מעורב בעונשי הגלות, גם אלו שבאים ממקרי הזמן ואינם לכפרה כ\"כ, ע\"כ נהגו העם שלא להפסיק ביניהם, אף שמעצם הדין מפסיקין בהם."},{"passage_id":"devurim_7380f984_p68","passage_content":"ואפשר שזה יהי' הפלוגתא במדרש המובא בפתח דברינו שחכמים אומרים אין מפסיקין בקללות ואין מברכין על פורעניות, מפני שיש בהם גם עונשים הבאים ע\"י מקרי הזמן ואינם לכפרה, ורבנן פליגי עלי', ואמרי לא לרעתם נתתי להם הברכה והקללה, אלא לטובתם כדי שיטלו שכר, שגם אלו מכפרים והם צורך הגאולה כנ\"ל, ועוד שתטלו גם שכר, כמ\"ש במדרש רבה (פ' עקב) עפ\"י משל ליתום וכו', דכל מה שישראל אוכלים בעוה\"ז בכוח היסורים שבאים עליהם עיי\"ש, וע\"כ סמכו במדרש הלכה זו לפסוק ראה אנכי, דמשם נשמע דע\"י ראי' למרחוק יראו שהכל ברכה, וע\"כ אמר אנכי נותן, כי מאתו ית' לא תצא הרעות, וא\"כ בהכרח שהכל ברכה, והקללה יתהפך ע\"י המתקת הרחמים והטוב, כמ\"ש בייטב לב זלל\"ה קללה ר\"ת קרן קיימת לו לעוה\"ב, ואעפ\"י שנראה בעיניך באשר הוא שם שהוא קללה, אבל בעתיד תראה שהכל הי' לטובה ולברכה."},{"passage_id":"devurim_7380f984_p69","passage_content":"R"}]}]
