[{"dvar_torah_id":"devurim_b2be3b81","title":"מלחמת היצר והצורך בקדושה","summary":"במלחמת היצר, התורה מצווה על קיום מצוות כדי לזכות בניצחון. הסמיכות בין פרשת יפת תואר לבן סורר ומורה מלמדת על התיקון הנדרש בניצוצות הקדושה. שליחת הקן משמעה את הצורך להדר אחר מצוות, ובכך להאיץ את הגאולה.","contents":[{"passage_id":"devurim_b2be3b81_p1","passage_content":"כי תצא למלחמה על איביך ונתנו ר אלקיך בידך ושבית שביו וגו', יל\"ד דהיל\"ל כי תלחם על איביך, ולמה כתבה תורה אריכות לשון, ועיקר המכוון שהוא הפעולה חסר מן הפסוק."},{"passage_id":"devurim_b2be3b81_p2","passage_content":"ב) ונתנו ה' אלקיך בידך ושבית שביו צ\"ב שהוא כפל לשון דהיינו הך."},{"passage_id":"devurim_b2be3b81_p3","passage_content":"ג) בספרי על איביך כנגד איביך, ונתנו ד' אלקיך בידך, אם עשית כל האמור בענין, סוף שד' אלקיך נותנו בידך, עכ\"ל הספרי, ויל\"ד מה הוסיפו בדרשתם, על איביך כנגד איביך, והלא פשטות משמעות הכתוב כן הוא."},{"passage_id":"devurim_b2be3b81_p4","passage_content":"ד) עוד יש להבין מ\"ש אם עשית כל האמור בענין, סוף שד' אלקיך נותנו בידך, והרי כל האמור בענין הוא פרשת יפת תואר, והצווים שנצטוו עלי', ואלו הצוויים שבפרשה לא ניתן לקיימן רק לאחר שכבר נתנו ד' בידך ולאחר המלחמה, ואיך תלוי' ניצוח המלחמה בקיום מצותי' של פרשה זו."},{"passage_id":"devurim_b2be3b81_p5","passage_content":"ה) במדרש תנחומא (ובמד\"ר והובא ברש\"י ז\"ל) שנו רבותינו מצוה גוררת מצוה ועבירה גוררת עבירה, שנא' וראית בשבי' אשת יפת תואר, מה כתיב בתרי', כי תהיין לאיש שתי נשים וגו', שתיים בבית מריבה בבית, ולא עוד אחת אהובה וא' שנואה וכו', מה כתיב בתרי' כי יהי' לאיש בן סורר ומורה, כל מאן דנסיב יפ\"ת נפיק מנייהו בן סורר ומורה וכו', מה כתיב אחריו כי יהי' באיש חטא משפט מות והומת, אם ניצל מזו לא ניצל מזו, למדנו שעבירה גוררת עבירה, ומצוה גוררת מצוה מנין, דכתיב כי יקרא קן צפור לפניך, מה כתיב בתרי' כי תבנה בית חדש, תזכה לבנות בית חדש ולעשות מעקה, מה כתיב בתרי' לא תזרע כרמך כלאים תזכה לכרם ולזרוע שדה וכו', הרי למדנו שמצוה גוררת מצוה וכו', עכ\"ל התנחומא, וראוי להבין בשלמא מה שלמדו מסמיכת הפרשיות אלו, דעבירה גוררת עבירה, משום דעבירות הללו יש להם קישור, והא' תולדה לחבירו, כמ\"ש במדרש דע\"י שנשא יפ\"ת יהי' א' אהובה וא' שנואה, ומזה עצמו יוליד בן סורר ומורה וכו', וע\"כ הסמיכו חז\"ל ללמוד מכאן דעבירה גוררת עבירה, דבעבירות הללו מובן בפשטות לכל אדם התקשרותם, וממנו ידון ויקיש על כל העבירות כולן, אבל המצות שמנו כאן, אין להם קישור בפשטות, כי מה ענין שילוח הקן לבית חדש וכן כולהו, אלא שכח המצוה ברוחניות ימשוך ויגרור אחריו מצוה אחרת ובכל התרי\"ג מצות כן הוא, ולמה הסמיכו דרשתם ללמוד כן מפרשה זו של שילוח הקן, וכמו\"כ הי' אפשר ללמוד משאר מצות הסמוכות בתורה, וטעמא בעי."},{"passage_id":"devurim_b2be3b81_p6","passage_content":"ו) גם יש להבין ענין הסמיכות של פרשת יפ\"ת לפרשת כי תהיין לאיש ב' נשים, כי עיקר מצות התורה בפ' זו, הוא לאו דלא יוכל לבכר, וזה אין לו קישור לפ' יפ\"ת כלל."},{"passage_id":"devurim_b2be3b81_p7","passage_content":"ז) גם מדוע כתבה תורה אזהרה זו דלא יוכל לבכר בב' נשים, כמו\"כ הי' אפשר לצוות בב' בנים מאשה אחת, א' אהוב וא' שנוא לא יוכל לבכר וכו', ובפשטות אפ\"ל, עפ\"י מה שדרשו חז\"ל דשנואה מיירי ששנואה בנשואי', שנשאה באיסור תורה, ולרבותא נקטי' קרא שאעפ\"י כן לא יוכל לבכר, אבל א\"כ אין לו קישור לפרשת יפ\"ת, שאין זו שנואה בנשואי' שהתורה התירה."},{"passage_id":"devurim_b2be3b81_p8","passage_content":"ח) גם יש להבין בגופא דקרא, במ\"ש לא יוכל לבכר, דהנה בתורת מתנה רשאי ליתן לו ב' חלקים, ורק בתורת בכור אסרה תורה, דאין יכול לעשותו בכור, ובספרי למדו מדכתיב לא יוכל, דאם בכר אינו מבוכר, ולכאורה מאי רבותי', ופשיטא דאם אינו בכור א\"א לעשותו בכור."},{"passage_id":"devurim_b2be3b81_p9","passage_content":"ט) במס' קידושין (ע\"ח ע\"ב) למדו מדכתיב כי את הבכור בן השנואה יכיר, יכירנו לאחרים, מכאן א\"ר יהודה, נאמן אדם לומר זה בני בכור וכו', ומיירי בצריך הכירא, כגון שבא עם אביו ממדינת הים, ואין מכירין בו אם הוא בכור, עכ\"ד הגמ'. אבל א\"כ למה כתבה תורה בלשון יכיר, הרי האחרים אין מכירין אותו, וכל מה שאנו סומכין על דיבורו של אביו, מכח נאמנות שהימנהו הכתוב, ולא מחמת הכירות, והי\"ל לכתוב לשון נאמנות, ולא לשון הכירות, גם יש להבין מ\"ש הכתוב כי את הבכור בן השנואה יכיר וגו', כי הוא ראשית אונו וגו', מה הוסיף הכתוב בטעם הדבר, מה שלא ידענו בו עד הנה, כי כבר הזכיר הכתוב כ\"פ, כי בן השנואה הוא הבכור, וע\"כ לא יוכל לבכר כ\"א אותו, ולא חידש לנו הכתוב כלום, אלא שכפל הדבר במלות שונות וכתב ראשית אונו במקום בכור והיינו הך, וטעמא בעי להבין כוונת הכתוב בזה."},{"passage_id":"devurim_b2be3b81_p10","passage_content":"י) בבעל הטורים מעתיק לשון המדרש, כי תהיין לאיש זה הקב\"ה, אהובה אלו העכו\"ם שמראה להם פנים, שנואה אלו ישראל שמסתיר מהם פנים, ביום הנחילו לעתיד לבוא, לא יוכל לבכר כי אם בני בכורי ישראל, עכ\"ד המדרש, וצ\"ב במה שדורש איש זה הקב\"ה וב' נשים אלו ישראל ואומה\"ע, בשלמא ישראל נקראו כלה קריאה בנעימה, ואיתא במדרשים, שבשעת מתן תורה נתקדשו ישראל בבחי' קדושין ע\"י הלוחות, ולכך שיבר משה את הלוחות כדי שידונו כפנוי', ונתקדשו אח\"כ בלוחות שניות, וכתב ההפלא\"ה ז\"ל בהקדמתו, דהי' גם בחי' חופה, במה שכפה עליהם הר כגיגית, וזהו כוונת הברכה מקדש עמו ישראל נרי חופה וקידושין, אבל אומה\"ע מניין להם זה, ולמה יקראו גם הם בבחי' זווג, ולא מצינו כן בשום מקום, ועוד למה כינה אומה\"ע בשם אהובה, על שמראה להם פנים, והלא אין זה אלא לשנאתם, שנותן להם שכרן בעוה\"ז, כדי להאבידן מעוה\"ב, כמו שאמר הכתוב ומשלם לשנאיו אל פניו להאבידו (דברים ז')."},{"passage_id":"devurim_b2be3b81_p11","passage_content":"יא) גם קשה למה כינה ישראל לשנואה, הלא מפורש בתורה נביאים וכתובים אהבת השי\"ת לעמו ישראל, כמש\"ה כי מאהבת ד' אתכם (דברים ז') באהבת ד' את ישראל (מלכים א' י') באהבת ד' את עמו (ד\"ה ב' י') ועוד פעמים אין מספר, ולמה כינה אותם לשנואה, והוא פלא."},{"passage_id":"devurim_b2be3b81_p12","passage_content":"יב) גם צ\"ב, מה שדרשו ביום הנחילו לע\"ל, לא יוכל לבכר את בן השנואה וכו', וכי הו\"א בעולם שיהיו האומ\"ע בכורים לע\"ל, והלא נאמר כי אעשה כלה בכל הגויים, ואלה שישארו מהם, יהיו למס עובד ועבדים לישראל, כמ\"ש ובני נכר אכריכם (ישעי' ס\"א) וכי צריך קרא למימר לא יוכל לבכר, וכבר מפורש בכתוב דישראל נקראו בכורים למקום, כמשה\"כ בני בכורי ישראל (שמות ד') ואיתא בשמות רבה (פר י\"ט ס\"ז) כשם שעשיתי יעקב בכור, שנאמר בני בכורי ישראל, כך אני עושה למלך המשיח בכורי, שנא' אף אני בכור אתנהו וכו', ובילקוט תהלים (רמז תת\"מ) דורש מה הבכור נוטל פי שנים בנחלה, אף הם יטלו המלכות בעוה\"ז ובעוה\"ב."},{"passage_id":"devurim_b2be3b81_p13","passage_content":"יג) גם כל הענין סורר ומורה צ\"ב, דאיתא במס' סנהדרין (ע\"א ע\"א) כמאן אזלא הא דתניא, בן סורר ומורה לא הי' ולא עתיד להיות, ולמה נכתב דרוש וקבל שכר, כמאן כר' יהודה, דס\"ל דצריכין להיות אביו ואמו שווין בקול (ועיין בהגהות הב\"ח שם), והוא פלא, איך אפשר שנכתבה פרשה שלימה בתורה, שאין לה מציאות כלל עפ\"י פשוטו, הגם שנכתבה לדרוש ולקבל שכר, אבל כללא אית לן, דפסוקי התורה ההכרח שיהי' בהם משמעות אף לפי פשוטן, דאין מקרא יוצא מידי פשוטו לעולם."},{"passage_id":"devurim_b2be3b81_p14","passage_content":"יד) ובזוהר קשה מ\"ש בגמ' שם, אבעית אימא ר' שמעון הוא, דתניא אר\"ש, וכי מפני שאכל זה תרטימר בשר ושתה חצי לוג יין וכו', מוציאין אותו לסקלו, אלא לא הי' ולא עתיד להיות, אלא דרוש וקבל עלי' שכר, ולכאורה איך יאמר ר\"ש כי א\"א שיהיו מוציאין אותו לסקלו, דאין שורת הדין והלכה כן, ואיך יחלוק על מה שהוא הלכה מרווחת בתורה, ומפורש בפסוק דמוציאין אותו לסקלו, ואיך אפ\"ל ההיפך ממה שמפורש בפסוק."},{"passage_id":"devurim_b2be3b81_p15","passage_content":"טו) עוד יש להבין מה הי' ראיתו של ר\"ש, וכי מפני שאכל תרטימר בשר וכו', מוציאין אותו לסקלו, אלא לא הי' ולא עתיד להיות, הלא פשיטא לי' לגמרא, דנהרג ע\"ש סופו, ולא משום תרטימר בשר, גם אמרו שם (ס\"ח ע\"ב) קטן מנ\"ל דפטור, ויליף לי' מדכתיב וכי יהי' לאיש בן סורר ומורה, בן הסמוך לגבורתו של איש, והקשו ל\"ל קרא, היכא אשכחן דענש הכתוב קטן, והלא פטור מכל העונשין שבתורה, ומשני סד\"א כיון דעל שם סופו נהרג, אפי' קטן נמי וכו', עכ\"פ ס\"ל לסתמא דגמ', דנהרג ע\"ש סופו דאל\"ה ל\"ל קרא להוציא את הקטן, וא\"כ מאי ראיתו של ר\"ש, גם יקשה למה לא הקשו בגמ' לר\"ש, ל\"ל קרא להוציא את הקטן, כיון דלא ס\"ל דנהרג ע\"ש סופו, א\"כ פשיטא דקטן אינו נעשה בן סורר ומורה, כמו שפטור מכל עונשין שבתורה."},{"passage_id":"devurim_b2be3b81_p16","passage_content":"טז) גם קשה דלא מצינו כן בשאר עבירות שבתורה, שיש בהן מיתת ב\"ד, שיהא נהרג ע\"ש סופו, ואפי' עשה מעשה שחייב עלי' מיתה, ויש שם עדים והתראה, אלא שאין עדותן מכוונת אינו נהרג עלי', והמזרחי והגור ארי' הוסיפו להקשות, על מ\"ש בן סורר ומורה נהרג ע\"ש סופו, ממה דאיתא בב\"ר גבי ישמעאל, אמרו מלאכי השרת לפני הקב\"ה, מי שעתידין בניו להמית את בניך בצמא, אתה מעלה לו באר וכו', א\"ל הקב\"ה עכשיו צדיק הוא או רשע, א\"ל צדיק, אמר לה לפי מעשיו של עכשיו אני דנו, שנא' כי שמע אלקים אל קול הנער באשר הוא שם, ובמס' ר\"ה (ט\"ז ע\"ב) א\"ר יצחק אין דנין את האדם, אלא לפי מעשיו של אותה שעה שנא' כי שמע אלקים אל הנער באשר הוא שם עכ\"ד הגמ', וא\"כ למה אמרו בבן סורר ומורה שנהרג ע\"ש סופו, והוא סתירה לכאורה, ועיי\"ש מה שתירץ המזרחי, והגור ארי' הקשה על תירוצו, ותירץ הוא ז\"ל, דב\"ד של מעלה אין דנין ע\"ש סופו, אבל ב\"ד של מטה דנין, אבל ג\"ז קשה דלא מצינו בשום מקום שיהא ב\"ד של מטה ממיתין ע\"ש סופו כאשר הקשינו לעיל, ומה שהקשה הוא על הרא\"ם, קשה גם על דבריו, דבפ\"ק דר\"ה משמע דאין חילוק, דסתמא קאמר אין דנים את האדם אלא לפי מעשיו של אותה שעה."},{"passage_id":"devurim_b2be3b81_p17","passage_content":"יז) והמהרש\"א ז\"ל בח\"א כתב על דברי הגמ' הנ\"ל, דלמדו כן מכח יתור, דבאשר הוא שם מיותר הוא, אבל ממשמעות, לא הי' אפשר לדרוש כן, דתיבת שם מורה בכ\"מ על המקום, ולא על הזמן, אבל קשה דאם מיותר הוא, ורק לדרשא זו אתי', למה כתבה תורה תיבה המורה על מקום, הול\"ל לישנא דמורה על זמן, ללמוד ממנו דאין דנין את האדם אלא לפי מעשיו של אותה שעה."},{"passage_id":"devurim_b2be3b81_p18","passage_content":"יח) ובכלי יקר הקשה ג\"כ קושיתנו הנ\"ל, על מה שאמרו חז\"ל בן סורר ומורה לא הי' ולא יהי', אלא דרוש וקבל שכר, א\"כ למה כתבה תורה דבר שאין לו מציאות כלל, ותירץ כי מפשוטו של הפרשה יש לימוד מוסר נפלא לכל ישראל שנקראו בנים למקום, ויש לחוש שיאמרו, אף אם יהיו בנים סוררים יוותר להם הקב\"ה, כדרך האב שמוותר לבנו, ע\"כ יראו פרשה זו, שגם בב\"ד של מטה חייב האב למסור את בנו לב\"ד, וכן הדין גם בב\"ד של מעלה עכת\"ד, אבל צ\"ב, דאם לא הי' ולא יהי' דין זה בעולם, א\"כ לא יראו ולא יקחו מוסר, כי יאמרו לא הי' ולא נהי' דבר זה מעולם."},{"passage_id":"devurim_b2be3b81_p19","passage_content":"בזוה\"ק פ' בלק (דף קצ\"ז ע\"ב) כתבו רמז נאה על פרשת בן סורר ומורה וז\"ל, תנינן בההוא שעתא אמר קוב\"ה למשה כתוב (פרשת בן סורר ומורה) א\"ל משה מרי דעלמא שביק דא, אית אבא דעביד כדין לברי', ומשה מרחוק הוה חמי בחכמתא, כל מה דזמין קוב\"ה לבנ\"י, אמר מרי דעלמא שבוק מלה דא, ונראה מדברי הזוה\"ק שבשביל ב' טעמים, בקש משרע\"ה מהקב\"ה שלא יכתוב פרשה זו, ראשית עפ\"י פשוטו של מקרא, כיון דלא הי' ולא עתיד להיות, דכי אית אבא עביד כדין לברי', ע\"כ בקש שלא יכתוב פרשה שאין לה מציאות, והטעם השני מפני שראה מה שרמוז בה על כלל ישראל כמו שיבואר להלן, נתיירא ממנו, ובקש שלא יכתוב פרשה זו, א\"ל קוב\"ה למשה חמינא מה דאת אמר, כתוב וקבל אגרא וכו', אנא ידע יתיר מה דאת חמי, בההוא שעתא רמז למלאך וכו', רבנא דאורייתא, אמר למשה אנא דרישנא לההוא קרא, כי יהי' לאיש דא קב\"ה, דכתיב ד' איש מלחמה, בן דא ישראל, סורר ומורה דכתיב כי כפרה סוררה סרר ישראל, עיי\"ש שדורש כל הפרשה כולה על כנס\"י, ובסוף הפרשה דרשו לימוד זכות על ישראל, וז\"ל מאי שנא דבקדמיתא לא כתיב זולל וסובא, (בתחילת הפרשה) ולבתר כתיב זולל וסובא, אלא מאן גרים להו לישראל למהוי סורר ומורה לגבי אבוהון דבשמיא, בגין דאיהו זולל וסובא בשאר עמין, דכתיב ויתערבו בגוים וילמדו ממעשיהם וכו', כיון דשמע משה כדין כתב פרשתא דא, שראה בו לימוד זכות על ישראל, ומסיים בזוה\"ק ועם כל דא היפה בנשים זו כנס\"י, צאי לך בעקבי הצאן, אלו בתי כנסיות ובתי מדרשות, ורעי את גדיותיך אלו ינוקי דבי רב, דלא טעמו טעם חטא, על משכנות הרועים אלו מלמדי תינוקות וראשי ישיבות עכלה\"ק, ועפ\"י דברי הזוה\"ק יתבאר שפיר דרוש וקבל שכר, כי כל הפרשה הוא לימוד זכות על ישראל, וע\"כ נאה לדרוש פרשה זו לזכותן של ישראל, וגם קיבול שכר, יש בה."},{"passage_id":"devurim_b2be3b81_p20","passage_content":"יט) אמנם עדיין יש להבין פרשה זו גם עפ\"י פשוטן של דברים, דאין מקרא יוצא מידי פשוטו, ולמה נכתבה פרשה זו עפ\"י פשוטו, אם לא הי' לה מציאות כלל, דבאמת משמע בזוה\"ק, שגם בשביל טעם זה שאין לה מציאות כלל, בקש משרע\"ה שלא לכתוב פרשה זו, וטענה זו אינו מיושב עדיין, גם יש להבין מה שסיימו בזוה\"ק, ועם כל דא צאי לך בעקבי הצאן אלו בתי כנסיות ובתי מדרשות, מהו הלשון בעקבי הצאן הול\"ל בדרכי הצאן, ואיך ירמוז זה על בתי כנסיות ובתמד\"ר, ואיזה קישור יש לכל זה לפרשת סורר ומורה."},{"passage_id":"devurim_b2be3b81_p21","passage_content":"כ) כי יקרא קן צפור לפניך וגו', במדרש רבה הלכה תינוק שנולד כשהוא מהול, מהו שיהא מותר למול אותו, כך שנו חכמים תינוק שנולד מהול, צריך להטיף ממנו דם ברית, מפני בריתו של אברהם אבינו, ומנין אתה למד מן התורה, שנא' המול ימול וכו', ופי' במתנות כהונה דריש בי' המול כבר, שנולד כך יהא נמול ע\"כ, וצ\"ב איך שייכא הלכה זו לפ' שילוח הקן, וחתם סופר זלל\"ה הקשה דקאמר מפני בריתו של א\"א, והדר קאמר מנין מן התורה, וכי לא סגיא בטעמא קמא."},{"passage_id":"devurim_b2be3b81_p22","passage_content":"כא) עוד במדרש שלח תשלח, רבנן אמרי אם שלחת מצות הקן, את זוכה לשלח עבד עברי, מנין שנא' וכי תשלחנו חפשי מעמך, ולכאורה קשה ממנ\"פ אי מיירי בזמן הגלות לא שייך דין עבד עברי, דע\"ע אינו נוהג אלא בזמן שהיובל נוהג, ולעתיד ג\"כ לא יהי' נוהג עבד עברי, דיבטלו הסיבות הגורמים למכירת ע\"ע, דמכרוהו ב\"ד בגניבתו או מוכר עצמו מחמת דחקו לא יהי' שייך אז, דיהי' מלאה הארץ דעה ולא יעשו עבירות, וגם המכירה בעצמה עבירה הוא דעבדי הם ולא עבדים לעבדים, ועוד שנא' ועמדו זרים ורעו צאנכם ובני נכר אכריכם (ישעי' ס\"א) הרי מבואר בפסוק גדולתן של ישראל, שיהי' האוה\"ע עבדים להם, והם לא יהיו עבדים, ואפי' בזמן הבית שהי' נוהג דין עבד עברי, לא שייך לומר זוכה לע\"ע, כיון שהוא עבירה."},{"passage_id":"devurim_b2be3b81_p23","passage_content":"כב) עוד קשה מדוע לא הביא מקרא דכתיב קודם ובשנה השביעית תשלחנו חפשי מעמך, ופסוק זה שהביא נאמרה במצות הענקה, ולא במצות שלוח, והמדרש דורש כאן שלח תשלח דמצות שלוח הקן יביאהו לשלוח נרע, א\"כ יותר הו\"ל להביא פסוק הנאמרה במצות שלוח עבדים, וכן הקשה החתם סופר זלל\"ה."},{"passage_id":"devurim_b2be3b81_p24","passage_content":"כג) כי תצא מחנה על איביך ונשמרת מכל דבר רע וגו', כי ד' אלקיך מתהלך בקרב מחניך להצילך ולתת איביך לפניך והי' מחניך קדוש וגו' ודרשו ע\"ז במד\"ר פ' קדושים (פר' כ\"ד ס\"ז) א\"ר שמואל בר נחמן משל לכה\"ג שהי' מהלך בדרך, נזדמן לו חלוני א' (פי' זר), א\"ל אלך עמך, א\"ל בני כהן אני ובדרך טהור אני מהלך, ואין דרכי להלך בין הקברות, אם אתה הולך עמי מוטב, ואם לאו סוף שאני מניחך וכו', כך א\"ל משה לישראל כי ד' אלקיך מתהלך בקרב מחניך להצילך, מהו להצילך, חד אמר להגן עליך להיות צל על ראשו, וחד אמר לרוקן כל נכסי אומות וליתן לך, כמ\"ש ונצלתם את מצרים, על מנת והי' מחניך קדוש ולא יראה בך ערות דבר, עכ\"ד המדרש, ויל\"ד למה הוציאו במדרש תיבת להצילך מפשוטו, שמורה על הצלה, והוא א' מד' לשונות שנאמרו בגאולתן של ישראל והוצאתי והצלתי וכו', וכמ\"ש אשר הציל אתכם מיד פרעה, ובכ\"מ משמעותו הצלה, ולאידך מ\"ד דדריש לי' על נכסי אומות שינתן לישראל קשה עוד יותר, הלא העיקר הוא הצלת הנפשות לתת איביך לפניך ולהכניע האומות, וירושת ממונם ממילא יבוא, ובלא הצלת הנפשות, ירושת ממונם הוא ללא הועיל, ולמה הוציאו הפסוק מפשוטו ממשמעות הצלה שהוא מוכרח, ודרשו אותו על ירושת ממונם שהוא רחוק מפשוטו ורק טפל."},{"passage_id":"devurim_b2be3b81_p25","passage_content":"כד) עוד יל\"ד איך דרשו לרוקן ממונם של אוה\"ע מלשון ונצלתם את מצרים, דא\"כ הול\"ל להצילם, ותיבת להצילך מוסב על ישראל."},{"passage_id":"devurim_b2be3b81_p26","passage_content":"קודם שנבאר כללית הפרשה, נבאר כל ענין וענין לבדו, וממילא יתבאר הקישור שביניהם, ונתחיל בפ' יפת תואר, במה שאמרו ז\"ל לא דיברה תורה אלא כנגד יצה\"ר, שאם אין הקב\"ה מתירה שישאנה באיסור זהו לשון רש\"י ז\"ל, והוא מגמ' קידושין (כ\"א ע\"ב) מוטב שיאכלו ישראל בשר תמותות שחוטות, ואל יאכלו בשר תמותות נבילות ע\"כ, וקשה איך אפשר להתיר בשביל זה לעשות עבירה חמורה כזו, דא\"כ בסברא זו אפשר להתיר כל איסורין שבתורה, דעד שלא יעשנו באיסור יעשנו בהיתר."},{"passage_id":"devurim_b2be3b81_p27","passage_content":"וע\"ק דהרי אמרו חז\"ל הסח בין תפלה לתפלה חוזר עלי' מעורכי המלחמה, ואפי' על איסור דרבנן לא עברו, אלו ההולכים בצבא המלחמה, דאל\"ה היו חוזרין כאשר דרשו חז\"ל, וא\"כ כולם צדיקים אמיתיים היו, ואיך אפשר שיתאוו תאוה לישא כותית, עד שהוצרך הכתוב להתירה להם, מחשש דלא ישאנה באיסור, והוא הפלא ופלא, וכבר עמדו והתפלאו על ענין זה כל מפורשי התורה, ותירצו כל א' לפי דרכו."},{"passage_id":"devurim_b2be3b81_p28","passage_content":"והנה בסודן של דברים מבואר בספר הלקוטים בשם האריז\"ל, ועד\"ז כתבו האוהחה\"ק והה\"ק ר' אברהם אזולאי זלל\"ה והחיד\"א ז\"ל, כולם ביארו הפרשה עפ\"י דרכו, ופלא שלא הביאו בשמו, ויסוד הדבר וסודו, עפ\"י דבריהם ז\"ל שאמרו, שבחטא אדה\"ר נשבו כמה נשמות יקרות ביד סטרא אחרא, והם נשמות הגרים, צא ולמד כמה וכמה גדולי עולם באים מהאומות, ורות המואבי' תוכיח, ושמעי' ואבטליון ואונקלוס הגר וכאלה רבות, אבל לפעמים המצא תמצא נשמה טהורה דבוקה בטמאה, ואין כח בטהורה להטות הטמאה להטיב ולהתגייר, והוא מונחת שם עד עת דרור, צא ולמד ממ\"ש המקובלים, שנשמת ר' חנינא בן תרדיון היתה דבוקה בשכם בן חמור, ונרמז בתיבת רחב\"ת ידים, ונפש זו לא עשתה מפעל טוב בשכם, ויצאה ממנו כשדבק בדינה, מצא הנפש מינה ונדבקה בו, ונרמז בכתוב ותדבק נפשו בדינה, וזה כל מלאכתינו, להוציא אלו הנשמות העשוקות מעמקי התהומות, ולהחזירם אל הקדושה, כמו שפי' בזה האריז\"ל, מה שאמרו חז\"ל אין בן דוד בא עד שיוכלו נשמות שבגוף עיי\"ש."},{"passage_id":"devurim_b2be3b81_p29","passage_content":"ובהקדמה זו תבין ענין יפת תואר כי ידוע כי כל אותם ההולכים לאותה מלחמה מלחמת הרשות, היו צדיקים גמורים כמ\"ש לעיל, וא\"כ לצדיק גמור א\"א שיתגבר עליו יצה\"ר לטמא עצמו עם הנכרי, ולכן הודיעתו התורה שאם יחשוק בה, אין זה כי אם ניצוץ הקדוש הנמצא בה, נוגע לנשמת האיש הזה ושייכא לשורש נשמתו, ולכן חשק בה, ולא לגולם הנגלם חשק, כי אליו לא ימשך תאות ישראל במצב זה, ולכן התירה תורה שיבא עלי', ובההוא רוחא דשדי בגווה כידוע, אפשר שיתגבר הטוב שבה וידחה הרע, ותכנס האשה ההוא אל הקדושה ותתגייר, והי' אם לא חפצת בה, זה מורה שהי' הטוב שבה מועט, ונתבטל במיעוטו, וגבר עליו הרע ודחה אותו לחוץ, ונדבק עם ההוא רוחא וכו', ונשארה כולה רע וריקן מקדושה, ע\"כ ושלחת לנפשה בשביל נפשה, שכבר הוצאת ממנה וכו', ועיין באוהחה\"ק שמאריך בזה, וכל הענין מבואר בס' הלקוטים מהאריז\"ל."},{"passage_id":"devurim_b2be3b81_p30","passage_content":"ואפ\"ה יצא ממנה בן סורר ומורה, דאי אפשר שלא ישארו בה, סיגים מעורבים משורש הטומאה אשר נפרשו משם, ומי לנו גדול מהאבות ואמהות שיצא מהם ישמעאל ועשו, מפני שהי' מעורב עוד קצת פסולת, שנשארה מן המקור אשר נפרשו משם, וכמ\"ש בדוד המלך ע\"ה שנאמר בו ולבי חלל בקרבו, ולא הי' בו כח הרע כלל, אעפ\"כ כשלקח יפ\"ת נולד ממנו אבשלום, וגם לפי דרך זה יתפרשו סמיכות הפרשיות, יפ\"ת לבן סורר ומורה כמו שדרשו חז\"ל."},{"passage_id":"devurim_b2be3b81_p31","passage_content":"והנה בדבריהם ז\"ל מתורץ שפיר, למה התירה התורה למשות מעשה זו, ואחר שהאר\"י הק' קבל כך, הוא קבלה אמיתית בלי ספק ואין להרהר אחרי', והם דברים ברורים כשמש בצהרים, שבשביל טעם הנ\"ל התירה התורה יפ\"ת, אבל עדיין יקשה, איך אפשר להעמיס דבריהם הנ\"ל, במ\"ש חז\"ל לא דברה תורה אלא כנגד יצה\"ר, שאם אין הקב\"ה מתירה ישאנה באיסור, והלא לפי דרכיהם לא זו הטעם שהתירה תורה יפ\"ת, ועל דברי חז\"ל הדרא קושיא לדוכתי', איך אפשר להתיר בשביל טעם זה איסור חמור כ\"כ, גם לפי פשוטו איך אפשר לומר על צדיקים אלו ההולכין למלחמת הרשות, שיעשו עבירה כזו באיסור, ועדיין כל הענין צ\"ב, וכבר פירשתי הענין באופנים שונים."},{"passage_id":"devurim_b2be3b81_p32","passage_content":"ומה שנ\"ל עוד לומר בביאור הענין, דהנה לאחר החורבן לא הי' עוד מלחמה עפ\"י דין, דאין יוצאין למלחמת הרשות אלא על פי ב\"ד של ע\"א, וכבר בטלה הסנהדרין, ומלחמת מצוה לא הי' אחר החורבן, ובמלחמת הקודמים הי' עוד נביאים בישראל, והנה כתב הרמב\"ם ז\"ל (בפ\"ט מה' יסודי התורה ה\"ג) אם יאמר לנו הנביא, שנודע לנו שהוא נביא, לעבור על אחת מכל מצות התורה, בין קלות בין חמורות לפי שעה מצוה לשמוע לו, וכן למדנו מחכמים ראשונים מפי השמועה, בכל אם יאמר לך הנביא עבור על ד\"ת, כאליהו בהר הכרמל, שמע לו חוץ מע\"ז, והוא שיהי' הדבר לפי שעה, ועד\"ז כתב האוהחה\"ק (פ' ויחי) לתרץ מה שנשא יעקב ב' אחיות, כי עשה מעשה עפ\"י נבואתו, שיכול לישא ב' אחיות לפי שעה, לא שיעקר איסור ב' אחיות, וכן מצינו גבי יהודה שע\"י מלאך הורשה לקחת את תמר, כמ\"ש ז\"ל במדרש, שזימן לו הקב\"ה מלאך, וא\"ל ממנה מלכים עומדים, ממנה גואלים עומדים עיי\"ש, וא\"כ לכאורה בזמן שיש נביא הי' אפשר להתיר יפ\"ת לפי שעה עפ\"י נביא, ולמה הוצרך התורה לעקור איסור זה לגמרי, ולהתירה לדורות."},{"passage_id":"devurim_b2be3b81_p33","passage_content":"אמנם יובן הענין, עפ\"י מ\"ש התניא ז\"ל בספה\"ק לקוטי אמרים (פ\"ח ובפ\"ז שם) לבאר החילוק בפנימיות בין איסור להיתר, וכתב שמי שאכל בשר ויין היתר, למלאות תאות גופו ונפשו הבהמית, הנה עי\"ז יורד חיות הבשר והיין שבקרבו, ונכלל לפי שעה ברע גמור שבג' קליפות וכר עד אשר ישוב האדם ויחזור לעבודת ד' ולתורתו, כי לפי שהי' היתר, לכך יכולים לחזור ולהעלותו בשובו לעבודת ד', שזהו לשון היתר ומותר, כלומר שאינו קשור ואסור בידי החיצונים, שלא יוכל לחזור ולעלות לד', משא\"כ במאכלות אסורות וביאות אסורות וכו' הם אסורים וקשורים בידי החיצונים לעולם, וע\"כ נקראים בשם איסור שהם אסורים וקשורים בידי הסט\"א, ואין עולים משם עד כי יבוא יומם, כמ\"ש ואת רוח הטומאה אעביר מן הארץ, או עד שיעשה תשובה גדולה כ\"כ, שזדונות נעשו לו כזכיות שהוא תשובה מאהבה עייש\"ד."},{"passage_id":"devurim_b2be3b81_p34","passage_content":"ומעתה כיון שענין יפת תואר הוא כדי להציל נפש היקרה, ולהעלות ניצוץ הקדוש הדבוק בה, כמ\"ש לעיל בשם האריז\"ל, ע\"כ התירה התורה יפ\"ת לדורות, ונעקר האיסור לגמרי ונעשה להיתר, כדי שיהא ניקל להעלות משם ניצוץ הקדוש, כמ\"ש הרב התניא ז\"ל שדבר היתר אינו קשור בידי החצונים, ולא הי' סגי ומספיק שיתירנו הנביא לפי שעה, ולא יעקור איסורו ממנו לדורות, דאם ישאר עליו שם איסור וארי' רביע עלי', אז כח הסט\"א והיצה\"ר יחזק עליהם מאוד, וקשור ואסור בידי החצונים, ומי יודע אם יצליח בידו להעלות הניצוץ הקדוש משם."},{"passage_id":"devurim_b2be3b81_p35","passage_content":"ואפשר שזה המכוון בדבריהם ז\"ל, במ\"ש לא דברה תורה אלא כנגד יצה\"ר, ר\"ל מפני שיש התנגדות היצה\"ר והסט\"א על דבר האסור, וכדי שיקל על האדם ללחום עמו ולהוציא ממנו את שביו, הנפש היקרה ששבוי אצלו מעת חטא אדה\"ר, ע\"כ התירה התורה שישאנה בהיתר ולא ישאנה באיסור, ולא שחששו שישאנה באיסור ממש, כי לא נחשדו צדיקים האלה ע\"ז, וגם אין טעם זה מספיק להתירה כנ\"ל, אולם הכוונה שהאיסור שבה יתירנה הנביא בהוראת שעה, אבל עדיין ישאר עלי' איסור עולם, ולא רצתה תוה\"ק שישאנה בדרך זה, כל זמן שעדיין שם האיסור רביע עלה, אע\"פ שיותר עפ\"י נביא, כיון דיש כח גדול לסט\"א עלי', והניצוץ הקדוש שבוי הוא בידם וקשה להעלות מהם, וע\"כ לתכלית זה התירה התורה אותה היתר עולם."},{"passage_id":"devurim_b2be3b81_p36","passage_content":"ואפשר להסביר עוד יותר עפ\"י מה שאמרו ז\"ל, לעולם יעסוק אדם בתומ\"צ אפי' שלא לשמה, דמתוך שלא לשמה בא לשמה, אבל בעבירה אפי' באופן שיהא מותר עבירה לשמה, צריך להיות לגמרי לשמה בלי פני' כלל, דאם יש בה נגיעה שלא לשמה, חזרה להיות עבירה ואסור, וע\"כ ביפ\"ת אם ישאר עלי' עוד איסור עולם, אף אם יתירנה הנביא בהוראת שעה מ\"מ שם איסור עלה ואולי לא יוכל להשלים עצמו בקדושה, כאשר מוטל עליו כפי שורש נשמתו, ואפשר שיהי' מעורב במעשה ההוא גם פני' גשמית, כי קשה לעשות לשמה בלי שום פני', ואז לא יעלה בידו לתקן ניצוץ הקדוש ולהעלותו, כי יהי' מעשה איסור וגם שלא לשמה. ע\"כ התירה התורה יפ\"ת היתר עולם, ונעקר ממנה שם האיסור, ואז אף אם לא יהי' לגמרי לשמה, אפשר להעלות אותו למדריגת לשמה ולתקן הניצוץ שבה, וזה שאמרו רז\"ל לא דברה תורה אלא כנגד יצה\"ר, מפני שיש התנגדות היצה\"ר והסט\"א, וקשה להוציא מהם הנפש היקרה ששבוי אצלם, ע\"כ בהכרח התירה תורה יפ\"ת כנ\"ל."},{"passage_id":"devurim_b2be3b81_p37","passage_content":"ומעתה יתבאר מה שאמרו בספרי על איביך כנגד איביך, שנרמז כאן גם מלחמת היצה\"ר, שיש לה התנגדות גדול, וע\"כ נאמר כי תצא ולא כי תלחם, לרמוז שבשעה שאתה יוצא למלחמה בפשטות, יש לנגדך עוד מלחמה כנגד היצה\"ר, להוציא בלעו מפיו נשמות העשוקות אצלו, ולכן נאמר איביך לשון רבים לרמוז על ב' אויבים, וזה שמסיים בספרי אם תעשה כל האמור בענין ר\"ל פרשת יפ\"ת, ותעשה בו כמצות התורה, סוף שנתנו ד' אלקיך בידך ושבית שביו, והכוונה על הנפש היקרה דקדושה, השבוי אצלם ונדבק ביפ\"ת, ותצליח להוציא ממנה ולתקן ולהעלות אותו ניצוץ הקדוש ונתבאר יפה פרשת יפ\"ת לפי דרכנו."},{"passage_id":"devurim_b2be3b81_p38","passage_content":"ועתה נבוא לבאר פרשה שני' הסמוכה לה, כי תהיין לאיש ב' נשים א' אהובה וא' שנואה וגו', והדקדוקים כבר נפרטו לעיל עיי\"ש, ונקדים מה שפירשתי עה\"פ וירא ד' כי שנואה לאה וגו', והקשו בגמ' (ב\"ב קכ\"ג) אלימא שנואה ממש, אפשר בגנות בהמה טמאה לא דבר הכתוב, בגנות צדיקים דבר הכתוב, אלא ראה הקב\"ה ששנואין מעשה עשו בפני' ויפתח את רחמה עכ\"ל הגמ', לכאורה הוציאו חז\"ל את הפסוק ממשמעותו, דשנואה לאה משמעותו שהיא היתה שנואה, ולפי הדרש, אחרים היו שנואים בעיני', וכללא אית לן דאין מקרא יוצא מידי פשוטו."},{"passage_id":"devurim_b2be3b81_p39","passage_content":"ואפ\"ל דחז\"ל בדרשתם לא באו להוציא הכתוב מפשוטו, אלא ליישב פשוטו של מקרא באו, דאפי' לפי פשוטו, שהיתה שנואה בעיני אחרים אין זה גנות לה, דלפי שהיו שנואים מעשה עשו בפני', ע\"כ היתה שנואה בעיני הבריות, וא\"כ שזה היתה הסיבה, אין זה גנותה אלא שבחה, כמ\"ש ביחזקאל בן בוזי הכהן, ע\"ש שהיו מבזין אותו נקרא כן, ולכאורה למה הזכיר הכתוב גנותו, אלא דהסיבה מה שגינוהו הבריות, הי' מחמת צדקתו, ועל שהוכיח את בני דורו, א\"כ זהו שבחו ונאה להזכירו."},{"passage_id":"devurim_b2be3b81_p40","passage_content":"ועתה יתבאר דברי המדרש שבבעה\"ט ז\"ל, אחת אהובה אלו אומה\"ע, ר\"ל על שמשתווים בעניני העולם ועושים כל התועבות כמו שאר האומות ע\"כ הם אהובים בעוה\"ז, ולא שהקב\"ה אוהבן, אבל מ\"ש במדרש שמראה להם אהבה, ר\"ל לפי ראות עין הבריות, והכל שלמים עמהם, ושלוים ושקטים, אבל ישראל הם שנואים בעוה\"ז, שכל האומות שונאים את ישראל, והסיבה לזה מפני שישראל שונאים דרכי עשו, ודרכי ע\"ז ומינות, ע\"כ הם שנואים בעיני האומות, ושבח הוא להם, ולא אמרו במדרש שהקב\"ה שונאן ח\"ו, אלא שמסתיר מהם פנים, ור\"ל שאין להם שלום, ושנואים בעיני כל האומות, אבל כלפי שמיא הוא להיפך, דישראל ששונאים דרכי עשו המה האהובים לפני המקום, ואוה\"ע הם שנואים למקום."},{"passage_id":"devurim_b2be3b81_p41","passage_content":"ונבוא לבאר מ\"ש הכתוב לא יוכל לבכר את בן האהובה ע\"פ בן השנואה, ולתרץ קושית הנ\"ל, ונקדים מה דאיתא בתנחומא (סוף פ' שופטים) כי תקרב אל עיר וגו', וקראת עלי' לשלום, מדבר במלך המשיח, שפותח להם לשלום וכו', והי' אם שלו' תענך וכו', שיהיו מביאין לו דורון וכו', ואם לא תשלים עמך רוח תזזית נכנסת בהם, והם מורדין במלך המשיח, מיד הורגם וכו', ואין משייר אלא ישראל וכו', עכ\"ד המדרש, והנה מ\"ש שלא ישתיירו אלא ישראל, והלא אלו שמשלימין ישתיירו, ולא מבני ישראל המה, כי אין מקבלין גרים לע\"ל, ונראה מזה דאלו שישלימו, אע\"פ שאין להם דין ישראל לגמרי, אבל מ\"מ כיון שיהיו נכנעים לישראל, ויתחברו להם ולמקום ב\"ה, יהי' להם קצת קישור לישראל."},{"passage_id":"devurim_b2be3b81_p42","passage_content":"ונקדים עוד מ\"ד בב\"ר (פר' ס\"ז) ולבני הפלגשים אשר לאברהם וגו', בימי אלכסנדרוס מוקדן באו בני ישמעאל לעורר על ישראל על הבכורה וכו', אמרו ישמעאלים מתורתן אנו באים עליהם, כתיב כי את הבכור בן השנואה יכיר, וישמעאל בדין שיטול פי שנים, א\"ל גביעה בן קוסם, אדוני המלך אין אדם עושה מה שהוא רוצה לבניו, א\"ל הין, א\"ל והכתיב ויתן אברהם את כל אשר לו ליצחק וכו', א\"ל והיכן שטר שלוח וכו', א\"ל ולבני הפלגשים אשר לאברהם נתן מתנות וישלחם וגו', ונסתלקו משם בבושת פנים, עכ\"ד המדרש, ובמס' סנהדרין (צ\"א ע\"א) מובא ג\"כ כל הענין שבאו בני ישמעאל לדון עם ישראל, אלא שלא הזכירו שם שבקשו חלק בכורה, ולא באו בטענת בכורה כלל, אלא ליטול חלק בארץ עם ישראל, כיון שגם הם בנים לאברהם, וארץ ישראל ניתנה לאברהם."},{"passage_id":"devurim_b2be3b81_p43","passage_content":"וכתב היפה תואר דאותה אגדה שבגמ', ס\"ל דלא בקשו חלק בכורה, כי דין הבכורה מחודש לישראל, ואין טעם להם בדין זה, ולפי\"ז יהי' פלוגתא בין הגמ' והמדרש, אבל קשה לומר כן שיהיו פליגי במציאות, ואיך אפשר שיהי' דברי שניהם אמת, ואפ\"ל דלא פליגי כלל, ושניהם אמת, דהם בקשו קודם גם חלק בכורה ואח\"כ כשנתברר להם, שאין מגיע להם חלק בכורה, בקשו עכ\"פ חלק הפשוט, שיהי' להם חלק בארץ כמו ישראל, וע\"ז השיבו להם דג\"ז אין מגיע להם כמ\"ש שם."},{"passage_id":"devurim_b2be3b81_p44","passage_content":"ומעתה אפשר להבין דברי המדרש שבבעה\"ט, שדרשו לא יוכל לבכר את בן האהובה על האומה\"ע לע\"ל, דאע\"ג דכבר נדחה טענת האומות על הבכורה בימי אלכסנדרוס מוקדן כמבואר לעיל, אבל לע\"ל כשיתקרבו לישראל, אותן שישלימו עמהן וישארו בחיים, אפשר שיטענו, שגם להם מגיע חלק בכורה בא\"י, אבל לא מצד עצמן שכבר דחו טענתם זו, אלא ממה שנתקרבו לישראל, יבקשו שיהי' להם חלק בבכורה בכלל ישראל, או אפשר שיהי' טענתם על עוה\"ב, דהיינו פי שנים וחלק בכורה, כמבואר במדרש תהלים הנ\"ל (הו\"ד קושיא י\"ב) דעוה\"ב מגיע לישראל מכח חלק בכורה, וא\"כ זאת יהי' טענתם, שיטלו גם הם בעוה\"ב בכלל ישראל, כיון שהם טפלים אליהם."},{"passage_id":"devurim_b2be3b81_p45","passage_content":"וע\"כ אמר הכתוב לא יוכל לבכר, כי באמת אין בטענתם טענה, כמ\"ש היפ\"ת כי דין הבכורה מחודש לישראל, ואין לאומה\"ע זכות בה, ואע\"פ שיתקרבו ויהי' להם שייכות לישראל, אבל לא יהי' להם דין ישראל, כי אין מקבלין גרים לע\"ל, ואין דין הבכורה נוהג בהם כלל, ועוה\"ב לא ינתן אלא לישראל לבד, והם יהיו משועבדים לישראל, ולאלימא מילתא, שלא יהי' קטרוג משרי האומות, לטעון על חלק בכורה, ע\"כ גזר אומר הכתוב לא יוכל לבכר, וכיון שכל טענתם יהי' מכח התורה, בטלה טענתם מעיקרו, ולא יהי' להם פתחון פה כלל."},{"passage_id":"devurim_b2be3b81_p46","passage_content":"ואפ\"ל עוד כוונה, במ\"ש במדרש בן אהובה אלו אוה\"ע שמראה להם פנים, עפ\"י מ\"ש האריז\"ל לפרש דבריהם ז\"ל, לא גלו ישראל אלא כדי שיתוספו עליהם גרים, דתכלית כל הגליות, לברר ניצוצות הקדושות מארצות גלותם עיי\"ש, והבאנו לעיל בשם ס' הלקוטים ואוהחה\"ק, כי האהבה והחשק הנמשך אל היפ\"ת, הוא לצד הנפש הטהורה אשר בה, כי יגלה ד' את עיניו, להכיר את הניצוץ הקדוש אשר דבוק בה, ואליו ימשך אהבתו, וכמו\"כ אפ\"ל באומה\"ע, ע\"כ נראים כאהובים, לצד ניצוץ הקדוש אשר בהם, (ובבחי' זו אפשר להבין, מ\"ש רז\"ל חן מקום על יושבי', כי מן השמים מראים אהבה וחן, לתכלית זה, כדי להוציא בלעם מפיהם)."},{"passage_id":"devurim_b2be3b81_p47","passage_content":"ועד\"ז ירמוז הכתוב כי את הבכור בן השנואה יכיר, ודרשו חז\"ל יכירנו לאחרים, ולפי דברי המדרש הנ\"ל קאי כ\"ז על לע\"ל, ויכירו כל האומות, כי רק לישראל מגיע חלק בכורה, כמ\"ש וראו כל עמי הארץ כי שם ד' נקרא אליך וגו', ויכירו ויודו כי רק ישראל נקראו בנים למקום, והקב\"ה יכירנו להם, ולא יטענו עוד על הבכורה, ודי להם שישארו בחיים, ויהנו ממה שיהיו עבדים לישראל, ורק אותן שיתקרבו לישראל ולא ימרדו במלך המשיח, ומבוארים שפיר דברי המדרש שבבעה\"ט."},{"passage_id":"devurim_b2be3b81_p48","passage_content":"ואפ\"ל גם עפ\"י פשוטו, דורש תורה לא יוכל לבכר, אין הכוונה שלא יוכל לעשותו בכור, דזה פשיטא, דאם אינו בכור איך אפשר לעשותו בכור, אלא דמצינו במדרשים דחלק פי שנים נקרא בשם בכורה, אע\"פ שאינו בכור כמ\"ש בילקוט תהלים (רמז תת\"מ) אף אני בכור אתנהו וגו', וכי בכור הי' דוד, והרי כתיב ודוד הוא הקטן, ולמה קורא אותו בכור, אלא מה בכור נוטל פי שנים בנחלה, אף דוד נוטל המלכות בעוה\"ז ובעוה\"ב עכ\"ד המדרש, ולזה משמיענו הכתוב לא יוכל לבכר, דאין רשאי ליתן לו פי שנים, ואע\"פ שבתורת מתנה שרי, אבל בתורת בכורה אין רשאי, ובדרך זה אפשר לפרש הכתוב בין לפי פשוטו ובין לפי מדרשו, וא\"ש."},{"passage_id":"devurim_b2be3b81_p49","passage_content":"ולדרכנו א\"ש מה שדרשו במדרש שבבעה\"ט, שתי נשים על ישראל ואוה\"ע, ולכאורה למה יקראו לאוה\"ע בשם זיווג ואישות כישראל (עיין בקושיתנו לעיל), ולדרכנו כל המדרש הנ\"ל קאי אלעתיד, שלא ישתיירו מן האומות אלא אותן שישלימו עם מלך המשיח, ויתקרבו לישראל ולהקב\"ה כמבואר בתנחומא הנ\"ל, ועל אותן האומות שפיר נופל עליהם לשון אישות, כיון שיהיו נטפלין לישראל, וע\"כ יטענו שמגיע להם גם חלק בכורה בכלל ישראל, כיון שהם נטפלין להם, לכך אמר הכתוב לא יוכל לבכר כנ\"ל."},{"passage_id":"devurim_b2be3b81_p50","passage_content":"ועתה נחזור לבאר פרשת סורר ומורה, וכבר הערנו למעלה דכל הענין פלאי, ועוד נוסיף להעיר בדברי הגמ' (סנהדרין ע\"א) שאמרו שם לר\"י ולר\"ש, בן סורר ומורה לא הי' ולא עתיד להיות, א\"ר יונתן אני ראיתיו וישבתי על קברו, וכתב רבינו בחיי ז\"ל, או דפליגי עלי', או דלא הי' בן סורר ומורה ממש, אלא כגון אבשלום, וכעין סורר ומורה עכ\"ד, וצ\"ב איך אפשר לומר דפליגי, והלא כיון שהעיד ר' יונתן שהוא ראהו וישב על קברו, א\"כ נעשה ונגמר דינו בדורם, ודינו של סורר ומורה צריך הכרזה, דנפקא לן מדכתיב וכל ישראל ישמעו ויראו, א\"כ הי' הדבר מפורסם בדורם, ואיך אפשר לחלוק על המציאות, מה שנתפרסם ונודע לכל ישראל, ולומר ע\"ז שלא הי' ולא יהי', ודרך השני שכתב הרבינו בחיי שהי' כעין בן סורר ומורה וכעין אבשלום, ג\"כ קשה הלא אבשלום לא הי' בגדר סורר ומורה, שרצה להרוג את אביו, ועשה הרבה רעות לעיני השמש ולעיני כל ישראל, והי' חייב מיתה ולא ע\"ש סופו נהרג, ואינו ענין לסורר ומורה כלל."},{"passage_id":"devurim_b2be3b81_p51","passage_content":"ואפשר לתרץ כל הקושיות בע\"ה, ומתחילה נקדים לתרץ מה שהקשינו על מאמרם ז\"ל, בן סורר ומורה נהרג ע\"ש סופו, והלא אמרו ז\"ל בר\"ה (ט\"ז) א\"ר יצחק אין דנין את האדם אלא לפי מעשיו של אותה שעה, ומצינו גבי ישמעאל שאמר הקב\"ה באשר הוא שם אני דנו, ונראה לומר דהנה א\"א למסור לב\"ד של מטה, לדון את האדם ע\"ש סופו, ואפי' ב\"ד של מעלה אין בכוחם לדון ע\"ש סופו, כי מה שיהי' בסופו של אדם בעל בחירה, א\"א לידע לשום נברא רק להקב\"ה לבדו, והוא יודע העתידות בתכלית, ופירשתי בזה מה דאיתא בב\"ר (פר' פ\"ח ס\"ח) ר' חנינא אמר בשעה שבא הקב\"ה לבראות את אדה\"ר, נמלך במלאכי השרת וא\"ל נעשה אדם וכו', אמרו לו מה טיבו, אמר להם צדיקים עומדים ממנו וכו', ולא גילה להם שהרשעים עומדים ממנו, שאלו גילה להם וכו', לא היתה מידת הדין נותנת שיברא ע\"כ במדרש, ולכאורה הוא פלא. דכיון שלא גילה להם הקב\"ה חלקי הסותר, א\"כ אין זה בכלל נמלך, כי העלים מהם שהרשעים עומדים ממנו."},{"passage_id":"devurim_b2be3b81_p52","passage_content":"ונראה לומר דלפי האמת היתה כוונת בריאת האדם אצלו ית', ע\"ש סופו וע\"ש העתיד, דלעתיד לא יהיו עוד רשעים בעולם, כמ\"ש ועמך כולם צדיקים, והרשעים רובן ישובו מדרכם הרעה, ויעשו תשובה הגונה, ואותם שכבר נכרתה נשמתם מאילנא דחיי, ואין להם עוד אחיזה באילן הנשמות כמבואר בספה\"ק, לא ישארו בעולם, כמ\"ש וברותי מכם הפושעים והמורדים בי, ועל אותו הזמן היתה כוונת בריאת האדם, שלא יהיו אלא צדיקים בעולם, ומלאה ארץ דעה, אלא שאין רצונו ית' לגלות לשום נברא ענינים אלו, כי מה שיהי' הבירור לעתיד, ויתבררו הרשעים ויכלו, זה אחד משרשי הגאולה העתידה, ועניני הגאולה וסודי' לא מסר ד' לשום נברא אפי' למלאכים, ומליבא לפומי' לא גלי', ע\"כ לא גילה להם למלאכי השרת שהרשעים עומדים ממנו, שא\"כ הי' צריך להראות להם את כל ההשתלשלות, ואיך שיהי' הבירור, ושיחזור כל העולם להיות צדיקים דאל\"ה לא היתה מידת הדין נותנת שיברא (ומה שרצה הקב\"ה להסכמתם, פרשתי במקום אחר ואין עת האסף פה) עכ\"פ אין רצונו ית' לגלות ענינים אלו לשום נברא, ע\"כ לא גילה להם אלא שצדיקים עומדים ממנו, וכן יהי' האמת לעתיד, שלא יהיו רק צדיקים, ועל סמך זה היתה כוונת בריאת האדם, אח\"כ מצאתי בנזר הקודש שכתב, שהכריע הקב\"ה לברוא את העולם, אע\"פ שראה מעשה הרשעים, אבל מפנו שראה תיקון העולם, איך שיהי' לעתיד, ובשביל תכלית זה ברא את העולם, ובכלל דבריו דברינו."},{"passage_id":"devurim_b2be3b81_p53","passage_content":"עכ\"פ מבואר, דבריאת האדם ובריאת העולם, הי' על שם סופו ועל שם העתיד, וכמו כן מצינו ביציאת מצרים שצירף הקב\"ה הזכותים דלעתיד, וגאלם על שם זה, אע\"פ שלא הי' די זכותים להגאל, כמשה\"כ בהוציאך את העם ממצרים תעבדון את האלקום על ההר הזה, אבל לא מסר הנהגה זו לשום נברא, ואין בכוחו אפי' לב\"ד של מעלה לדון ע\"ש העתיד וע\"ש סופו, כי לא נגלה להם העתיד. ונקדים עוד דבזוה\"ק (פ' וירא) מבואר דהוא ובית דינו הם ב' עולמות, וז\"ל וד' המטיר על סדום, דא בי דינא דלתתא, דנטיל רשו מעילא וכו', ועולם שלמטלה ממנו הוא כולו רחמים עיי\"ש."},{"passage_id":"devurim_b2be3b81_p54","passage_content":"ונבוא אל הענין, דמ\"ש אין דנין את האדם אלא לפי מעשיו של אותה שעה, זה רק בב\"ד של מטה או בב\"ד של מעלה, שלא נמסר להם ידיעת העתידות, וא\"א להם לדון ע\"ש סופו, דידיעת העתידות הוא בלתי לד' לבדו, ומעתה מתורץ קושיתנו, דלמה כתבה תורה באשר הוא שם, דתיבת שם משמעותו מקום, וחז\"ל דרשוהו כאן על הזמן, והול\"ל מלה המורה על הזמן, כאשר העיר המהרש\"א ע\"ז, ולדרכנו דהב\"ד של מעלה ומלאכי השרת קטרגו על ישמעאל, לדונו ע\"ש סופו, לפי שעתיד להמית את ישראל בצמא, ולא הסכים הקב\"ה עמהם, ובאשר הוא שם מורה על מקום, שהוא נדון בב\"ד של מעלה, שאין להם כח לדון ע\"ש סופו, וע\"כ דנוהו לפי מעשיו של עכשיו, וזה כי שמע אלקים אל קול הנער באשר הוא שם, לפי העולם שנדון בו, דהיינו בב\"ד של מעלה, וע\"כ ידונוהו לפי מעשיו של עכשיו, והדרש והפשט א' הוא, דמה שדרשוהו חז\"ל על הזמן, לא הוציאוהו ממשמעות התיבה המורה על המקום."},{"passage_id":"devurim_b2be3b81_p55","passage_content":"ומה שלא רצה הקב\"ה להסכים עמהם ולדונו ע\"ש סופו, יובן עפימ\"ש בספה\"ק נוע\"א עה\"פ ולישמעאל שמעתיך, דלכאורה למה התפלל אברהם אבינו על ישמעאל שיחי', הלא ידע בו שהוא רשע, אלא מפני שא\"א בירר את הגליות לבניו, וראה שיהיו ישראל אצלו בגלות, ורצה שיתכפרו בזה, ולא יצטרכו לבוא בגהינם עכ\"ד, ולעתיד יתגלו עוד טעמים וענינים שעבורם הי' הכרח וטובה לישראל על ידם, ולטעם זה לא רצה הקב\"ה לדונו ע\"ש העתיד, ודנו לפי מעשיו של אותה שעה, אמנם הקב\"ה לבדו דן ע\"ש העתיד, ואצלו ית' עבר ועתיד והווה הכל ברגע אחד, ואי אפשר לחלק אצלו בין עבר ועתיד והווה, ולפניו ית' נגלו כל העתידות, ויוכל לדון ע\"ש העתיד אם רצונו כן."},{"passage_id":"devurim_b2be3b81_p56","passage_content":"ולפי דרכנו אפ\"ל, דמ\"ש ז\"ל בן סורר ומורה נידון ע\"ש סופו, לא שממיתין אותו בב\"ד, כי אין כח ביד בי\"ד להמיתו ע\"ש סופו, כמו שהקשינו לעיל, דעפ\"י דין צריך עדים והתראה ועדותן מכוונת, ועוד הרבה פרטי דינים, ואיך אפשר להמיתו בלא מעשה ובלא עדים והתראה ע\"ש סופו אמנם יובן עפ\"י מ\"ש חז\"ל בכתובות (ל\"ו ע\"א) ובכ\"מ אע\"פ שבטלו ארבע מיתות ב\"ד, דין ארבע מיתות לא בטלו, מי שנתחייב סקילה או נופל מן הגג או חי' דורסתו וכו', והתוס' הקשו שם הא חזינן הרבה רשעים שמתים על מיטתם, ותירצו דשמא זכות תולה להם, או שעשו תשובה, וע\"י תשובה הקב\"ה מיקל את דינם, ולפעמים מוחל לגמרי וכו' עכ\"ד התוס'."},{"passage_id":"devurim_b2be3b81_p57","passage_content":"ומעתה אפ\"ל דעפ\"י שורת הדין מגיע לו מיתה ע\"ש סופו, רק שא\"א למסור דבר זה לב\"ד של מטה, ואין בכח האדם לדון ע\"ש סופו כאשר ביארנו לעיל, ע\"כ יומת ע\"י דין ארבע מיתות, שנופל מן הגג או חי' דורסתו, שזה דין סקילה המגיע אליו, ומ\"ש והוציאו אותו אל זקני עירו ואל שער מקומו וגו', ורגמוהו כל אנשי עירו וגו', כ\"ז מצד שורת הדין, ואע\"פ שבפועל נתקיים בו דינו ע\"י דין ד' מיתות ב\"ד, מ\"מ כתבה תורה עיקר הדין, לכוונת דרוש וקבל שכר, כמ\"ש בגמ' סנהדרין הנ\"ל."},{"passage_id":"devurim_b2be3b81_p58","passage_content":"ומעתה לא פליגי בגמ' ר\"י ור\"ש ור' יונתן, ואין כאן פלוגתא במציאות, דמ\"ש ר' יהודה בן סורר ומורה לא הי' ולא עתיד להיות, בב\"ד של מטה קאמר, וגם טענת ר\"ש כן הוא, וכי בשביל שאכל תרטימר בשר נהרג, בב\"ד של מטה קאמר, דהלא א\"א להרוג בדיני התורה ע\"ז, ואין כח ביד ב\"ד להמית ע\"ש סופו, ומ\"ש ר' יונתן אני ראיתיו וישבתי על קברו, הוא ראה בן סורר ומורה שעלה לגג ונפל ונהרג בידי שמים, בדין ארבע מיתות, נמצא שאין פלוגתא בין התנאים כלל."},{"passage_id":"devurim_b2be3b81_p59","passage_content":"ולכאורה יש להבין דהנה אמרו ז\"ל דסורר ומורה נהרג ע\"ש סופו, ורצו לומר בגמ' לפי הס\"ד דאפי' קטן יהרג ע\"ש סופו, ובארנו לעיל דנהרג בדיני שמים, כי רק הבוי\"ת יודע לדון ע\"ש העתיד, וא\"כ כיון שהכל גלוי וידוע לפניו, וגזרה חכמתו ית' לענוש אותו ע\"ש סופו, א\"כ למה בא לעולם ולמה נולד, וטוב לו שלא נברא משנברא ליום זעם וצרה, ולמה צריך להמתין על דינו, עד שיאכל תרטימר בשר וישתה יין, כיון שנדון בדיני שמים וא\"צ גלוי מילתא לפניו ית'."},{"passage_id":"devurim_b2be3b81_p60","passage_content":"אמנם מאוד עמקו מחשבותיו ית', ובודאי ראתה חכמתו ית' תועלת בבריאתו, אף שיהי' קיומו רק לשעה, ואפשר כי תכלית הורדתו לעולם, הוא כבחי' יפת תואר שהבאנו לעיל בשם האר\"י ז\"ל, ודבוק בו ניצוץ קדוש ונפש יקרה אשר מן הצורך להעלותו, ויובן עפי\"מ שאמרו חז\"ל כי הבא על יפת תואר יוליד בן סורר ומורה, ולפעמים לא ניתקן עוד הניצוץ הקדוש ביפ\"ת לגמרי, כמ\"ש לעיל בשם ס' הלקוטים, במאמר והי' אם לא חפצת בה, שיצא ממנה הניצוץ הקדוש ונדבק בההוא רוחא דשדי בגווה, ואפשר שנכנס אח\"כ בבן סורר ומורה הנולד ממנה, ויגיע לו תיקון ע\"י עבודת מצות ומע\"ט שיקיים בו אביו, כי ניצוץ זה שייך לשורש נשמתו כמ\"ש האריז\"ל, וע\"כ ההכרח שיתוקן על ידו, וע\"י שיקיים בו מצות מילה ופריעה, ועבודה ויגיעה שיעמול בו לגדלו לתורה, בזה יתוקן הניצוץ ההוא, וכשיושלם התיקון הזה ויתעלה הניצוץ הקדוש אשר בקרבו, אז נשלמה תכלית בריאתו, ואין בו עוד צורך בעולם, ונהרג בדיני שמים ע\"ש סופו, כי נעשה כלו רע, אחר שהוצא ממנו הניצוץ הטוב וניתקן, כי מקורו רע מן השורש הטומאה אשר הי' ביפת תואר, וכל חיותו רק מן הניצוץ הטוב אשר בו, ואחרי שנתקן ניצוץ הזה נפסק חיותו ומת בדיני שמים."},{"passage_id":"devurim_b2be3b81_p61","passage_content":"ולפעמים לא יומת בדיני שמים וישאר בחיים, כמ\"ש לעיל בשם התוס' (כתובות ל' ע\"ב) דהרבה רשעים מתים על מיטתם ולא יאספו בדיני שמים, מפני שזכות תולה להם, או ע\"י שעשו תשובה מעולה עיי\"ש, וכמו\"כ בבן סורר ומורה, אפשר שיכריעו זכיותיו ולא יומת בדיני שמים, אבל הכרעה זו א\"א אלא ע\"י הקב\"ה לבדו, כמ\"ש הרמב\"ם ז\"ל בה' תשובה (פ\"ג ה\"ב) כי לשקול הזכיות והעונות, א\"א בכח האדם לידע ערכם וגודלם, ואין שוקלין אלא בדעתו של א-ל דיעות ולו נתכנו עלילות, והוא היודע האיך עורכין הזכיות כנגד עונות ע\"כ, ועל כן א\"א שיהרג בן סורר ומורה ע\"ש סופו אלא בדיני שמים."},{"passage_id":"devurim_b2be3b81_p62","passage_content":"ומעתה אין כאן קושיא וסתירה כלל, דשם בישמעאל הי' רצונו ית' כן, שידונו אותו לפי מעשיו שבאותו שעה, כדי שישאר בחיים, והיתה הכוונה לטובת ישראל כמ\"ש לעיל, ובבן סורר ומורה נהרג ע\"ש סופו בדיני שמים, ומיתתו ג\"כ טובה לעולם, כמ\"ש ז\"ל (סנהדרין ע\"ב ע\"א) שמיתתן של רשעים הנאה להם והנאה לעולם, וכיון שכל הענין נהרג ע\"ש סופו נשקל בדעתו של א-ל דיעות, אין בידינו להקשות ואין בידינו להשוות מילתא לחבירתה, כי כל א' נדון לפי מה שראתה חכמתו ית', וכפי צורך תיקון נשמתו ותקון העולם."},{"passage_id":"devurim_b2be3b81_p63","passage_content":"ומ\"ש חז\"ל (בסנהדרין ע\"א הנ\"ל) דלמה נכתב פרשת בן סורר ומורה דרוש וקבל שכר, אפשר לומר דע\"י קריאת הפרשה בכוונה הגונה, ובשימת לב על ענינים הרמוזים בה, יתהוו אלה התיקונים, ויזכו אלי' ע\"י קריאה בלבד, מבלי שיצטרך להיות בפועל ממש, וכמו שפי' מאה\"כ אשרי הגבר אשר תיסרנו ד' ומתורתך תלמדנו, עפ\"י מ\"ש חז\"ל דיסורין מכפרים כמו קרבן, ואמרו חז\"ל כל העוסק בפ' עולה ובפ' חטאת כאלו הקריב עולה וכאלו הקריב חטאת, וכמו\"כ ביסורין, וזה אשרי הגבר אשר תיסרנו ד', אם יזכה לא יבואו עליו בפועל ממש, אלא מתורתך תלמדנו, ע\"י שילמד בפרשיות התורה התוכחות והיסורין, וישים לבו אליו בתשובה מעולה, יתכפר לו עונו ויהי' לו מזבח כפרה כאלו באו עליו בפועל."},{"passage_id":"devurim_b2be3b81_p64","passage_content":"וכמו\"כ בקריאת פרשת סורר ומורה, כי לפי מה שפירשנו בו, כל הענין לצורך תיקון הוא, וע\"י זכות תולה ישתנה ויומתק דינו, וע\"כ אמרו דרוש וקבל שכר, שע\"י קריאת הפרשה בכוונה הגונה, יגיע אליך כל התועלת הרמוז בה, ויצמיח לך טובה באופנים שונים, גם מבואר בזוה\"ק כי בפרשה זו יש בה לימוד זכות על כלל ישראל, ושפיר יובן דרוש וקבל שכר, בין עפ\"י פשוטו ובין עפ\"י הרמז, וא\"ש סמיכות הפרשיות יפת תואר, ולא יוכל לבכר בן האהובה, ופרשת בן סורר ומורה, ולפי דרכנו כל ענינם אחד הוא, ולצורך תיקון ניצוץ הקדוש אשר בקרבם, להעלותו ולתקנו כמו שביארנו."},{"passage_id":"devurim_b2be3b81_p65","passage_content":"ועתה נבוא לבאר פ' שילוח הקן ודברי המדרשים שם, ויתבארו כל הקושיות בענין הנ\"ל, ונקדים דברי הגמ' במס' חולין (קל\"ט ע\"ב) ת\"ר כי יקרא קן צפור לפניך מה ת\"ל, לפי שנא' שלח תשלח את האם וגו', יכול יחזור בהרים וגבעות, כדי שימצא קן, ת\"ל כי יקרא במאורע ע\"כ בגמ', והמקור חיים (בריש ה' פסח) רוצה ללמוד מכאן שמחויב לחזור אחר קיום מ\"ע בכל המצות, וראייתו מדאמרי' כאן יכול יחזור בהרים ת\"ל כי יקרא, מוכח דבשאר מצות דלא מיעטי' קרא, מחויב לרדוף אחריהם כדי לקיימם."},{"passage_id":"devurim_b2be3b81_p66","passage_content":"והגאון מהרש\"ם ז\"ל בהגהותיו לס' או\"ח, העיר על דברי המקו\"ח הנ\"ל, שהרי מבואר ברש\"י ז\"ל, דגבי שילוח הקן הי' ס\"ד דגמ' לומר, דמחויב לחזור בהרים, משום שנאמר שלח תשלח, ומכח יתור כפילת הלשון הי' ס\"ד שצריך לחזור אחר המצוה הזאת עד שתבוא לידו, וכן משמע מלשון הש\"ס, שאמרו לפי שנא' שלח תשלח יכול יחזור בהרים וכו', משמע דמעיקרא הי' הס\"ד דמחויב לחזור בהרים, מכח כפילת הלשון שלח תשלח, וא\"כ אדרבה מדברי הגמ' הנ\"ל מוכח להיפך, דבשאר מצות אין שום הו\"א שיצטרך לרדוף אחרי', אם אינה מזומנת לפניו, עכ\"ד המהרש\"ם ז\"ל, וכתבתי בספרי ויואל משה (מאמר ב' סי' ע\"א) לתרץ הערה זו, עפ\"י דברי החות יאיר (סי' ס\"ז) שמסתפק אם מחויב לשלח, אפי' אינו רוצה לא באם ולא בבנים, או דלמא רק אם ירצה ליקח הבנים, הזהירה עליו התורה לא תקח האם על הבנים, אבל אם לא ירצה בהם, יניחם במקומם ואין עליו חיוב מצוה כלל, וכתב דמדברי הגמ' הנ\"ל, דאמר יכול יחזור בהרים, ת\"ל כי יקרא במאורע, נשמע עכ\"פ דנהי דמיעטה קרא שלא יחזור בהרים להמציא לו קן, אבל לכשיקרה לפניו, רמיא עלי' ליזקק לה, ומחויב לשלחה עכ\"פ, אף אם אין לו צורך בבנים, עכ\"ד החו\"י ז\"ל."},{"passage_id":"devurim_b2be3b81_p67","passage_content":"ואפשר לומר דנלמד דבר זה, ממ\"ש הכתוב שלח תשלח ב' פעמים, להורות דמ\"מ מחויב לשלחה, אף אם אינו רוצה ליקח הבנים, ומעתה מ\"ש בגמ' בסברת הס\"ד, לפי שנאמר שלח תשלח, הוצרך להם פסוק זה, שאם אין לנו לימוד לחייבו בשילוח, אף אם אינו רוצה ליקח הבנים, תו אין מקום לחשוב לחייבו לחזור בהרים, כיון שאף אם הוא לפניו אינו חייב בכה\"ג, שאינו רוצה ליטול את הבנים, ע\"כ הוצרך להם לפי הס\"ד קרא דשלח תשלח, אבל אפשר דבשאר מצות, במקום שאין קיומן תלוי ברוצה ואינו רוצה, אפשר דמחויב לרדוף אחר המצות, דליכא מיעוטא דכי יקרא במאורע כדברי המקו\"ח, עיי\"ש בדברינו, עכ\"פ היוצא לנו מזה, דנשמע מקרא דשלח תשלח אף לפי המסקנא ולדברי הכל, דמחויב להדר אחר המצות ולקיימן, אפי' אם אינו צריך בהם לצורך הנאת עצמו, ואף דאינו מחויב לחזור בהרים וגבעות, משום שנא' כי יקרא, אבל כשהן לפניו רמי' עליו חיובא לקיימם עכ\"פ כדברי החו\"י."},{"passage_id":"devurim_b2be3b81_p68","passage_content":"ואפ\"ל טעם עפ\"י הרמז, על מ\"ש חז\"ל כי יקרא פרט למזומן, דהנה מבואר במדרשים ובזוה\"ק, דסגולת מצוה זו ממהרת את הגאולה, כמ\"ש במד\"ר (פר' ו' סי\"ז) אם קיימת מצוה זו אתה ממהר לבוא מלך המשיח ואלי' הנביא, ולמדו כן מפסוקים עיי\"ש, והתוה\"ק רצתה לעשות לנו גבול וגדר, דבעניני הגאולה אין לנו לעשות פעולות אנושיות, ואינו בא אלא בהיסח הדעת, וע\"כ הגם דבכל המצות, אף אם נימא דלא כדברי המקו\"ח ואינו מחויב לרדוף אחריהם, אבל אם רדף אחריהם והזמינם לפניו, עכ\"פ מקיים המצוה בהם, אבל מצוה זו בפרטיות דמורה על הגאולה, דרשו בו כי יקרא פרט למזומן, וא\"א לקיים המצוה אא\"כ באו לידו בהיסח הדעת, שהזמינוהו לו מן השמים."},{"passage_id":"devurim_b2be3b81_p69","passage_content":"ועכ\"פ לפי הנ\"ל דמפרשת שילוח הקן, נשמע דצריך להדר אחר המצות, א\"ש מ\"ש במדרש מנין שמצוה גוררת מצוה שנא' כי יקרא. וגו', דמכאן שמעינן חביבות המצוה, שצריך להדר אחרי' וליזקק לה, לכוונת המצוה לבדה אף שא\"צ ליקח הבנים, והגם שבכל המצות כולן אמרי' דמצוה גוררת מצוה, אבל מכאן אנו למדין גודל השכר והתועלת שמרויח האדם, ע\"י שיזדמנו לו מן השמים עוד מצות בשכר המצות שעשה, שהרי מחויב הוא להדר אחריהם ולקיימם, וא\"כ אם ממציאים אותם מן השמים לפניו, שכר גדול הוא לו."},{"passage_id":"devurim_b2be3b81_p70","passage_content":"והנה פליגי בגמ' בכ\"מ בש\"ס, אי אמרינן דברה תורה בלשון בנ\"א, ואם אפשר למדרש כפילות הלשונות, כמו הענק תעניק, העבט תעביטנו ועוד, והתוס' בכתובות (דף ס\"ז ע\"ב) כתבו בשם ר\"י ז\"ל, דכל היכא דאיכא למידרש דרשינן להו, ולא אמרינן דברה תורה בלשון ברא, אלא היכא דלא מסתבר להו לחז\"ל למדרש, כמו בהענקה עיי\"ש, והנה אם נימא דדברה תורה כלשון ברא, לא הוה שמעינן משלח תשלח, דצריך להדר אחר המצות ולקיימן כדברי החו\"י ז\"ל, ולא הוי שמעינן מכאן דמצוה גוררת מצוה, אבל כיון דמסמיכת הפרשיות אנו רואין דמצוה גוררת מצוה, ע\"כ נשמע דלא אמרינן דברה תורה כלשון בנ\"א, וא\"ש דברי המדרש הנ\"ל מה שסמכו הלכה זו דתינוק שנולד מהול צריך להטיף ממנו דם ברית לפרשת שילוח הקן, דחז\"ל למדו הלכה זו דצריך להטיף ממנו דם ברית, מפני שנאמר המול ימול כמ\"ש במדרש הנ\"ל, אבל אי נימא דברה תורה כלשון בנ\"א א\"א לפשוט הלכה זו מקרא, ע\"כ הסמיכו הלכה זו לכאן, דמכאן ראי' דלא אמרי' דברה תורה כלשון בנ\"א ושפיר נפשטה הלכה זו."},{"passage_id":"devurim_b2be3b81_p71","passage_content":"ואפ\"ל עוד דהנה כתבו רז\"ל בטעם הסרת הערלה, דערלה הוא הנשאר מזוהמת נחש הקדמוני, והשראת הסט\"א עלי', והתגברות כח הרע נאחז בה, ושם מיתה יקרא לה, וכל הגוים יקראו ערלים אפי' כשהם נימולים, ומצינו באברהם אבינו שא\"ל הקב\"ה התהלך לפני והי' תמים, ופרש\"י בשם המדרש התהלך לפני במצות מילה וכו', שכ\"ז שהערלה בך אתה בעל מום לפני, וכתיב ויפל אברהם על פניו, שעד שלא מל לא הי' בו כח לקבל פני השכינה, והנה לפי טעם זה הי' נראה לכאורה דמי שנולד מהול א\"צ להטיף ממנו דם ברית, כיון שהוסר ממנו הערלה עכ\"פ, ואין בו עוד מזוהמת הנחש, וכבר נשתלם צורת גופו בתולדה, ואין בו עוד מפגם הערלה."},{"passage_id":"devurim_b2be3b81_p72","passage_content":"אמנם ישנם עוד טעמים על מצות מילה, ואחד מהם כדי לזכור בריתו של א\"א, כמ\"ש בפדר\"א (פרק כ\"ט) כל שנה ושנה הקב\"ה רואה דם הברית של א\"א ומכפר על כל עונותיו, ואמרו שם שאמר הקב\"ה בזכות דם הברית גאלתי אתכם ממצרים, ובזכות זה אתם עתידים ליגאל בסוף, ודרשו כן ממ\"ש הכתוב גם את בדם בריתך שלחתי אסיריך מבור אין מים בו (זכרי' ט'), וכתבו התוס' (במס' שבת נ\"ה) דאע\"ג דזכות אבות תמה, אבל ברית אבות לא תמה עיי\"ש."},{"passage_id":"devurim_b2be3b81_p73","passage_content":"ופרשתי בזה הפסוק (מלאכי ג') ומלאך הברית אשר אתם חפצים הנה בא וגו', דקאי על אלי' הנביא, ויש להבין למה קראו הכתוב מלאך הברית, ומצינו בפרדר\"א (פרק כ\"ט) על שקנא אלי' על הברית, שנא' (מלכים א' י\"ט) ויאמר קנא קנאתי לד' אלקי צבאות כי עזבו את בריתך, א\"ל הקב\"ה חייך שאין ישראל עושין ברית מילה, עד שאתה רואה בעיניך, מכאן התקינו חכמים שיהיו עושין מושב כבוד למלאך הברית ע\"כ, מבואר שם דעל כן נקרא מלאך הברית על שקנא על הברית, אבל עדיין יש להבין, הרי קנא גם על ע\"ז במעשה דאחאב, וקנא בשטים על גלוי עריות, דפנחס זה אלי' וכמ\"ש שם, ופעל ועשה עוד דברים גדולים ונפלאים, כדמצינו בכ\"מ בפסוקים ובדברי חז\"ל, ולמה קראוהו מלאך הברית ע\"ש המפעל הזה דוקא."},{"passage_id":"devurim_b2be3b81_p74","passage_content":"אמנם מפני שאליהו הנביא בא יבוא לבשר לנו הגאולה ב\"ב, ומתפלל תמיד על הגאולה, וכל עבודתו למהר הגאולה, ע\"כ צריך הוא להזכיר תמיד לפניו ית' דם הברית, כי בזכות זה יהי' הגאולה, ולכן נקרא מלאך הברית ע\"ש פעולתו התמידית, שמזכיר תמיד דם הברית כדי למהר הגאולה, והנה לפי טעם זה אף מי שנולד מהול, וכבר הוסר ממנו הערלה בתולדה, אבל עדיין צריך להטיף ממנו דם ברית, כדי להזכיר דם בריתו של א\"א, וע\"כ אמרו במדרש הנ\"ל צריך להטיף ממנו דם ברית מפני בריתו של א\"א, ואי לאו יתורא דקרא מכפל לשון דהמול ימול, הייתי אומר דא\"צ להטיף ממנו דם ברית, כיון שכבר הוסר ממנו הערלה, ולטעם הראשון שאמרנו סגי לי' בהכי, וע\"כ הוצרכו להביא עוד דרשא דהמול ימול להורות דצריך לחוש גם לטעם השני, ומעתה צריך להטיף ממנו דם ברית מקרא וגם ידעינן טעמא דקרא."},{"passage_id":"devurim_b2be3b81_p75","passage_content":"ומעתה א\"ש סמיכות הלכה זו לפרשת שילוח הקן, דאיתא במד\"ר שלח תשלח אם אתה משלח את הקן, את זוכה למהר את אלי' הנביא שנא' הנה אנכי שולח לכם את אלי' הנביא, וכן איתא בזוה\"ק, שסגולת מצוה זו למהר את הגאולה, ולעורר יללת אימא עילאה על כנס\"י, ואלי' הנביא מזכיר תמיד בריתו של א\"א, כדי למהר הגאולה כנ\"ל, ע\"כ הסמיכו הלכה זו לפ' שלוח הקן, דצריך להטיף ממנו דם ברית כדי לזכור בריתו של א\"א, וחדא טעמא לתרווייהו."},{"passage_id":"devurim_b2be3b81_p76","passage_content":"ועתה נבוא לבאר סיפא דזוה\"ק הנ\"ל בפרשת בן סורר ומורה, שסיימו דבריהם ועם כל דא צאי לך בעקבי הצאן אלו בתי כנסיות ובתי מדרשות וכו', והדקדוקים נפרטו לעיל, ויובן עפימ\"ש רשיז\"ל בשה\"ש עה\"כ אם לא תדעי לך היפה בנשים, שחדל הרועה מלהנהיג אותך, צאי לך בעקבי הצאן, הסתכלי בפסיעת דרך שהלכו הצאן, והעקבים נכרים, ופירשתי בספרי ויואל משה (מאמר א' סי' קס\"א) שנרמז בדברי רש\"י ז\"ל שכתב, שחדל הרועה מלהנהיג אותך, ולא כתב שלא יהי' לך רועה, נראה שכיוון בדבריו הקדושים להמצב השפל הזה השורר בדורנו, שישנם רועי ישראל, אלא שהם נמשכים ונשפעים ע\"י הדור, וחדלו מלהיות מנהיגי הדור, כי אדרבה הדור מנהיגים אותם, וממשיכים את רועי ישראל לדעתם הנכזבה, ועל אותו הזמן אמר הכתוב אין לך עצה אחרת אלא צאי לך בעקבי הצאן ורעי את גדיותיך, ופרש\"י התבונני בדרכי אבותיך הראשונים, והסתכלי בפסיעת דרך שהלכו הם והעקביים נכרים וכו' עיי\"ש."},{"passage_id":"devurim_b2be3b81_p77","passage_content":"והנה בזוה\"ק הנ\"ל פירשו כל הפרשה דבן סורר ומורה על כנס\"י בגלותא, ואפשר לפרש עוד עפ\"י דרכם עפ\"י מ\"ש האוהחה\"ק איננו שומע בקול אביו וגו', ודקדק הוא ז\"ל שהול\"ל אינו שומע ולמה אמר הכתוב לשון שלילה, ופירש עפ\"י משל, למלך שהיו שועריו גנבים ולסטים, והבאים לקבול לפני המלך עליהם, השוערים האלו ימנעוהו, ולא יתנו לו רשות ליכנס לחייבם לפני המלך, כן הדבר הזה בבן סורר ומורה, כי כשאדם ממליך בתוכו יצה\"ר, והוא היושב ושורר על מפתחי הלב, נשללת ממנו הידיעה והשמיעה מכל המצות, כי היצר עומד על מפתחי הלב, ומונע הדברים מהגיע אל הנפש, כי הם יחייבוהו לצאת משם, וע\"כ אמר הכתוב איננו שומע וגו', כי הוא מושלל בערך השמיעה, ואין בכחו לשמוע עכת\"ד."},{"passage_id":"devurim_b2be3b81_p78","passage_content":"וכמו\"כ אפ\"ל עפ\"י דרך הזוה\"ק דקאי על כנס\"י, ועיי\"ש שפי' איננו שומע בקול אביו דא קוב\"ה, ועל כן אמר הכתוב איננו שומע בלשון מושלל, לרמוז על מצב השפל שבדורנו, שהם מושללים בערך השמיעה, כמשל שהמשיל האוהחה\"ק, על כי המנהיגים היושבים בשערים, ימנעם מליכנס ללבם דברי אמת, והנמשל והמשל מובן לכל ולא נאריך בה, וע\"כ מסיים בזוה\"ק ועם כל דא יש עוד עצה ותרופה, צאי לך בעקבי הצאן אלו בתי כנסיות ובתי מדרשות, ותראה ותלמוד דרך ד' בתוה\"ק, ותתבונן בדרכי אבותיך הראשונים, וע\"כ נקראו בתי כנסיות ובתי מדרשות עקבי הצאן, שעל ידם בלימוד התוה\"ק אפשר להתבונן בעקבות הראשונים, ורעי את גדיותיך אלו ינוקי דבי רב וכו', על משכנות הרועים אלו מלמדי תנוקות וראשי הישיבות, שזה יסוד גדול וקיום האומה בגלות, שינטעו בתשב\"ר דרך התוה\"ק, והתנהגות אבותינו הקדושים שילכו בעקבותיהם, וא\"ש קישור דרשה זו לפרשת בן סורר ומורה לפי דרך הזוה\"ק."},{"passage_id":"devurim_b2be3b81_p79","passage_content":"ולפי דרכנו אפשר לפרש הפסוק והי' עקב תשמעון את המשפטים וגו' דפירשו בו הרמב\"ן ז\"ל והראב\"ע, וכן הוא במדרש דעקב פירושו אחרית וסוף, וע\"כ פי' דשכרו בעקב יהי', דשכר מצוה בהאי עלמא ליכא, ולכאורה קשה כי עקב דקרא מוסב על תשמעון, והשמיעה מחוייבת בכל עת מתחלה ועד סוף, ולמה אמר הכתוב עקב המורה על אחרית זמן, ולדרכנו ירמוז הכתוב על דורות האחרונים בעיקבתא דמשיחא, כשלא יהיו בישראל מנהיגי אמת, וכשירצו לשמוע אל משפטי התורה, לא יהי' עצה אחרת אלא לפנות אל העקב, כמשה\"כ צאי לך בעקבי הצאן ולהתבונן בדרכי הראשונים, ע\"כ אמר הכתוב והי' עקב שתסתכל בפסיעות של הראשונים, ואז תשמעון את המשפטים האלה, ושמרתם ועשיתם אותם שתזכו לבוא לכלל שמיעה ועשי'."},{"passage_id":"devurim_b2be3b81_p80","passage_content":"ואפשר למצוא עוד רמז מוסר בזה, עפ\"י מה שפרשיז\"ל עקב אלו המצות קלות שאדם דש בעקביו, והנה אם נתבונן ונעריך עבודתינו בתורה ובתפלה, מול ונגד עבודת הראשונים, אינו אפי' כצלו של צל, ואינו אפי' בגדר משל נגד עבודתם, ואין לנו השגה אפי' לצייר בשכלנו, איך הי' וכמה גדלה, עבודתם בדורות הראשונים, וק\"ז הייטב פנים זלל\"ה אמר פעם בהושענא רבא לפרש החרוז דמתה לתמר, כי מי שראה אור פני קדשו של ק\"ז הישמח משה זלל\"ה, ירא וישפוט שכל מה שהוא עושה ומסגל בתורה ומצות, אינו אלא דמיון לתמר, דתמר אלו הצדיקים כמ\"ש במדרש."},{"passage_id":"devurim_b2be3b81_p81","passage_content":"ובעוה\"ר בדורותינו אלה, אפי' דמיון ליכא, ואין לו שום השתוות כלל למעשיהם של צדיקים, וכל מה שאנו עושין אינו אלא מצות קלות שאדם דש בעקביו, בערך המצות שהיו עושים הצדיקים בדורות הקודמים, וע\"כ ירמוז הכתוב אל כל הפירושים, והי' עקב בעיקבתא דמשיחא ובאחרית הימים, אעפ\"י שיהיו ישראל בשפל המדריגה, והמצות ומע\"ט שלהם יהי' בבחי' עקב, ומצות קלות שאדם דש בגדר עבודתם של ראשונים, אעפ\"כ אם תסתכל בעקבי הצאן, בפסיעות עקבי הראשונים, ותתבונן בדרכיהם, אע\"פ שלא תוכל עשות כמעשיהם, ובגדר שהם היו עושים אבל עכ\"פ תשמעון את המשפטים האלה, ושמרתם ועשיתם אותם, ותזכה לשמירה ועשי' במצות ד'."},{"passage_id":"devurim_b2be3b81_p82","passage_content":"ואפשר לפרש המשך הפסוק, עפ\"י מ\"ש ק\"ז הישמח משה זלל\"ה, ואלה המשפטים אשר תשים לפניהם וגו' כי תקנה עבד עברי וגו', ודקדק דלמה התחיל הכתוב בדיני עבד עברי, הרי כמה משפטים יש בין אדם לחבירו, ולעתיד לא יהי' נוהג דין ע\"ע כלל, כי אין ע\"ע נוהג אלא בזמן שהיובל נוהג, ולמה הקדים הכתוב משפט ע\"ע לכל המשפטים, ותוכן תירוצו בקיצור, עפ\"י מ\"ש בס' נחלת יעקב, דלכאורה קשה על צדקתו ית', שהוא ית\"ש שומר משמרתה של תורה, והאיך מכר אותנו לעבדים והלא גזירתו ית' בתוה\"ק, כי לי בנ\"י עבדים ולא עבדים לעבדים, אבל התירוץ הוא כיון שבכל יום ויום זמן גאולה הוא, כמ\"ש חז\"ל זכו אחישנה, א\"כ לאו עבדות הוא כלל, עפ\"י מ\"ש התוס' בב\"מ (דף י' ע\"א) דמ\"מ מותר אדם להשכיר עצמו לפועל, דדוקא עבד עברי שאינו יכול לחזור בו, ואינו יוצא קודם זמנו אלא בשטר שחרור, עובר משום עבדי הם, אבל פועל שיכול לחזור בו, ויוצא בכל שעה שירצה לאו עבדות הוא כלל, וכמו\"כ בגלותינו כיון דזמן הגאולה בכל יומא, אין זה עבדות כלל, עכ\"ד בס' נחלת יעקב ובזה פי' הישמח משה זלל\"ה, דע\"כ אמר הכתוב ואלה המשפטים אשר תשים לפניהם, דהיינו לכללות ישראל ולדורות הבאים, והתחיל בעבד עברי, דמשפטים אלו נחמה הוא להם, דמכאן מוכח דגאולה כל יומא זמני', דאל\"ה איך מכר הוא ית' אותנו לעבדים וכנ\"ל, עכ\"ד הישמח משה זלל\"ה."},{"passage_id":"devurim_b2be3b81_p83","passage_content":"והנה לכאורה לפי דברי הירושלמי, שדרשו ושמרתם את משמרתי מכאן שהקב\"ה שומר תורתו, יש להבין איך הקב\"ה מקיים מצות שלוח עבדים, ונראה לומר דבמה שהקב\"ה יגאלנו מהיות עבדים בגלות, בזה הוא מקיים בחי' שלוח עבדים, וכן נראה מדברי הישמח משה הנ\"ל עיי\"ש בהמשך דבריו, וכתב רש\"י ז\"ל (בפ' ראה) בדין הענקה וזכרת כי עבד היית באמ\"צ, והענקתי ושניתי לך מביזת מצרים ומביזת הים, וכתב הפרשת דרכים דביזת מצרים מגיע לנו מדין הענקה, וא\"כ כיון שהשי\"ת נותן לנו מדין הענקה, ע\"כ שמקיים בגאולתינו מצות שלוח עבדים, דאל\"ה אין דין הענקה נוהג כלל."},{"passage_id":"devurim_b2be3b81_p84","passage_content":"ובמד\"ר פ' קדושים אם אתם מקדשים את עצמכם, מעלה אני עליכם כאלו קדשתם אותי (ועיין בחידושינו פ' אחרי קדושים) שפי' דברי המדרש בכמה אופנים ובאופן א' פירשתי, דאם ישראל מרבים כבוד שמים ע\"י מעשיהם הטובים, מעלה עליהם הקב\"ה כאלו נתקדש שמו ית' על ידיהם אף שבין כך ובין כך הוא מקודש בכל מיני קדושות, ובאמת בחינה זו נוהג בכל המצות, דע\"י שהאדם גורם ומסייע למצוה שתיעשה, ה\"ה כאלו עשאו בעצמו."},{"passage_id":"devurim_b2be3b81_p85","passage_content":"וכמו\"כ בשילוח עבדים, דהבוי\"ת מקיים מצות שלוח עבדים ע\"י גאולתינו כנ\"ל, וע\"י שישראל מסגלין מצות ומע\"ט, וגורמין שימהר ויחיש השי\"ת את גאולתינו, מעלה עליהם הקב\"ה כאלו גם הם קיימו מצות שלוח עבדים, ואפשר לפרש הפסוק והי' עקב תשמעון את המשפטים האלה, דמשפטים הם דיני עבד עברי כמ\"ש הישמח משה הנ\"ל וכמשה\"כ ואלה המשפטים וגו' ומונה ומפרש דין עבד עברי, ע\"כ אמר הכתוב והי' עקב תשמעון, שנרי שתשמע ותקיים התומ\"צ, תגרום את המשפטים האלה שיקיים השי\"ת שלוח עבדים ע\"י גאולתינו, ויהי' נחשב לך כאלו ושמרתם ועשיתם אותם, כאלו אתה בעצמך עשית מצוה זאת."},{"passage_id":"devurim_b2be3b81_p86","passage_content":"ומעתה יבואר דברי המדרש הנ\"ל בפ' שילוח הקן, וז\"ל שלח תשלח רבנן אמרי, אם שלחת מצות הקן, את זוכה לשלח עבד עברי, מנין שנא' וכי תשלחנו חפשי מעמך ע\"כ, והדקדוקים מפורטים לעיל, ולדרכנו הכוונה עפ\"י מ\"ש במדרש, דע\"י מצות שלוח הקן, אתה ממהר להביא את אלי' הנביא ומלך המשיח, ואיתא בזוה\"ק שמצוה זו מעוררת הגאולה, ועי\"ז יקיים השי\"ת בנו מצות שלוח עבדים, ונחשב לך כאלו נעשה על ידך, וע\"כ את זוכה לשלח ע\"ע."},{"passage_id":"devurim_b2be3b81_p87","passage_content":"וא\"ש מה שהביא המדרש פסוק הנאמר גבי הענקה, ולמה לא הביא מקרא אחר ובשנה השביעית תשלחנו חפשי, שנאמרה במצות שלוח עבדים כמו שהקשה החתם סופר ז\"ל, ולדרכנו א\"ש כי ממצות הענקה נשמע, דע\"י גאולתינו מקיים השי\"ת מצות שלוח עבדים דביזת מצרים היתה מדין הענקה כמ\"ש רש\"י ז\"ל בפרשת הענקת ע\"ע, והבאנו לעיל דברי הפרשת דרכים בזה עיי\"ש, וע\"כ הביא פסוק זה לראיה, דע\"י מצות שלוח הקן תזכה למצות שלוח עבדים."},{"passage_id":"devurim_b2be3b81_p88","passage_content":"ונבוא לבאר דברי המדרש הנ\"ל, כי תצא מחנה על איביך וגו' כי ד' אלקיך מתהלך בקרב מחניך להצילך וגו' מהו להצילך, חד אמר להגן עליך להיות צל על ראשו, וח\"א לרוקן כל נכסי אומות וליתן לך, כמ\"ש ונצלתם את מצרים, על מנת והי' מחניך קדוש וגו' וצ\"ב (עיין לעיל קושיא כ\"ה). ולדרכנו כוונת הכתוב לומר, כי הצלתינו מיד האומות במלחמה תלוי בכח מעשינו, וכשנתנהג בקדושה, כמשה\"כ ונשמרת מכל דבר רע והי' מחניך קדוש ולא יראה בך ערות דבר, גם הקב\"ה יקדש שמו ית', ויצילנו מיד האומות, כמ\"ש במדרש (המובא לעיל) אם אתם מקדשים את עצמכם כאלו קדשתם אותו, ועתה מה שדרשו במדרש להצילך מלשון צל שיהי' לצל על ראשך, באמת הכוונה על הצלה כפשוטו של מקרא, אלא שרצו להורות, כי הכל תלוי כפי מעשינו, והקב\"ה מתנהג עמנו בבחי' ד' צלך."},{"passage_id":"devurim_b2be3b81_p89","passage_content":"ולאידך מ\"ד שדרשו להצילך מלשון ונצלתם את מצרים, לרוקן נכסי אומות וליתן לך, ולכאורה למה לא דרשו על הצלת נפשות שהוא העיקר ופשוטו של מקרא מוכח כן, ולמה דרשו על הצלת ממונם שהוא הטפל ורחוק ממשמעות, ונראה עפימ\"ש האריז\"ל לפרש, מ\"ש ואח\"כ יצאו ברכוש גדול, שהכוונה על הרכוש רוחני, שהוציאו משם כל הניצוצות הקדושות, כמשה\"כ ונצלתם את מצרים, שעשאוהו כמצודה שאין בה דגים, ונשארה ריקן מקדושה, עיי\"ש, ולפי הפשטות רכוש משמעותו קניני עוה\"ז, אבל לפי מ\"ש ק\"ז הייטב לב זלל\"ה (בפ' בהר) בפ' וכי תמכרו ממכר, דרכושו של אדם יש בו ניצוצות הקדושות ששייכים אל שורש נשמתו, וכמו\"כ בעניני משא ומתן, כ\"א עוסק במסחר החביב לו, וטעם הדבר כי באותו דבר יש בו נה\"ק של נפשו עייש\"ד, עכ\"פ היינו הך רכוש הגשמי וקניני עוה\"ז המובן עפ\"י פשוטו, וניה\"ק שיש בהם."},{"passage_id":"devurim_b2be3b81_p90","passage_content":"ופירשתי דברי רשיז\"ל (בפ' בשלח) עה\"פ ויהפך לבב פרעה וגו' פרש\"י בשביל ממונם שהשאילום, ולכאורה הלא מפורש בפסוק כי שלחנו את ישראל מעבדנו, ולמה פירש רש\"י בשביל ממונם, אבל לדברי האריז\"ל שע\"י ממונם שהשאילום הוציאו משם כל ניצוצי הקדושות, ולא יחזרו עוד למצרים שכבר תקנו הכל, וא\"כ הדרש והפשט עולים בקנה א', דע\"י שהשאילום ממונם, שלחו את ישראל מעבוד אותם, ולא יחזרו עוד עולמית, ולפי\"ז א\"ש מה שדרשו במדרש כאן, להצילך לרוקן נכסי אומות מלשון ונצלתם את מצרים, ובאמת הכוונה על הצלה ממש כפשוטו, אלא כדי שיהי' הצלה נצחיות, ולא יהי' לאויביך תקומה לפניך, ע\"כ יוציאו מהם כל הניצוצות הרך, ע\"י שירוקן ד' את כל נכסי האומות ויתן לך, ועם הרכוש הזה יקחו מהם כל הניה\"ק, וישארו ריקן ולא יהי' להם עוד אחיזה ושייכות למשול בישראל, ופשוטו ומדרשו עולים בקנה א'."},{"passage_id":"devurim_b2be3b81_p91","passage_content":"ומה שהקשינו לעיל, כי איך דרשו מלהצילך על הפרשת ממונם של האומות, דא\"כ הול\"ל להצילם ותיבת להצילך מוסב על ישראל, אבל הא בהא תליא דע\"י שישראל מובדלים ומופרשים מן האומות, עי\"ז ממונם של האומות כשיגיע לידם, יהי' מובדל ומופרש מן הטומאה, ויתעלו ניה\"ק שבתוכם למקור הקדושה ויתוקנו."},{"passage_id":"devurim_b2be3b81_p92","passage_content":"וכתב בספה\"ק אגרא דכלה (פ' שופטים) עה\"פ כי הגוים האלה אשר אתה יורש אותם וגו', ואתה לא כן נתן לך ד' אלקיך, דכוונת הכתוב דהנה הגוים האלה אשר אתה יורש אותם אל מעוננים ואל הקוסמים ישמעו, וכדי שלא יבוא לך ע\"י ירושת ממונם, פועל מגונה ומידות רעות ח\"ו, ע\"י כח הפועל שבממונם, ע\"כ אמר הכתוב נתן לך ד' אלקיך, כי השי\"ת הוא הנותן לך, והוא הבעלים, ואין כאן בית מיחוש עייש\"ד, וזה מאה\"כ כאן כי ד' אלקיך מתהלך בקרב מחניך להצילך, לרוקן נכסי האומות, וליתן לך, וכיון שהשי\"ת בעצמו הוא הנותן לך, ע\"כ והי' מחניך קדוש שלא יזיק לך ממונם, וא\"ש קישור דברי המדרש וביאור הכתוב עפ\"י מדרשו."},{"passage_id":"devurim_b2be3b81_p93","passage_content":"וזהו כי תצא למלחמה על איביך, ופי' בספרי כנגד איביך, והנה מלחמה זו רומז על מלחמת היצה\"ר, כמו שפי' האריז\"ל ומבואר בספה\"ק, ובדורות הראשונים הי' המלחמה זה לעומת זה, מערכה מול מערכה, וכוחות הקדושה היו חזקים, להתגבר נגד כוחות הטומאה, דהי' דתן ואבירם אבל הי' כנגדם בכח הקדושה משה ואהרן, ובדורות שאחריהם אע\"פ שהיו נביאי הבעל ונביאי אשירה, אבל הי' כנגדם נביאי אמת, ובבית שני היו תנאים ואמוראים ובעוה\"ר בעיקבתא דמשיחא חוצפא יסגי, וכח הסט\"א חזק ומתגבר, ואין לנו כח בקדושה להתגבר כנגדם, ואין לנו להשען אלא על אבינו שבשמים, ואיך נתגבר למולם במלחמה כבידה כזו, והיינו כגבור שאין בידו כלי זיין, הי תורה והי מצוה דמגנו עלן, ואין לנו במה לחזק עצמנו, אבל יש עצה כמ\"ש רש\"י בשה\"ש, צאי לך בעקבי הצאן התבונני בדרכי אבותיך הראשונים והסתכלי בפסיעותיהם, ואמרו ז\"ל ההולך בדרכי אבות, מזכירין לו זכות אבות, ולכאורה כיון שהולך בדרכיהם, למה צריך עוד זכות אבות, הרי יש לו זכות עצמו, אמנם הכוונה שאינו הולך ועושה כדרכיהם, אלא בפסיעותיהם של דרכי האבות ורוצה לעשות כמעשיהם, וע\"כ מזכירין לו זכות אבות."},{"passage_id":"devurim_b2be3b81_p94","passage_content":"ומעתה יבואר דברי הספרי כי תצא למלחמה על איביך כנגד איביך, זה מלחמת היצר והסט\"א, שתתגבר ותערוך מלחמה כנגדם זה לעומת זה כנ\"ל, אבל איך יהי' בדורות האחרונים בעקבתא דמשיחא, כשלא יהי' להם כח זה בקדושה להתגבר כנגדם, ע\"כ מסיים הספרי אם תעשה כל האמור בענין, ונכלל בזה צאי לך בעקבי הצאן כדברי הזוה\"ק, סוף שנתנם ד' אלקיך בידך, שהתגברות הקדושה שהי' להם בדורות הראשונים, יהי' לה המשך עד סוף כל הדורות, אם נלך בפסיעותיהם ונתבונן בדרכיהם, וההולך בדרכי האבות מזכירין לו זכות אבות וינצחו את המלחמה בזכותם."}]},{"dvar_torah_id":"devurim_ef0edda9","title":"חילול שם שמים ועבודת ע\"ז","summary":"דוד המלך חשש לחילול שם שמים בפרהסיא, ולכן שקל לעבוד ע\"ז. חושי הארכי הסביר לו את הסכנה שבחילול השם, והדגיש את חשיבות ההתרחקות מעבודת ע\"ז, כדי לשמור על כבוד ה' ועל מלכות בית דוד.","contents":[{"passage_id":"devurim_ef0edda9_p1","passage_content":"עוד אפשר לבאר כל הענין באופן אחר, בהקדם דברי הגמ' סנהדרין (דף ק\"ז ע\"א) א\"ר יהודה אמר רב בקש דוד לעבוד ע\"ז, שנא' (ש\"ב ט\"ו) ויהי' דוד בא עד הראש אשר ישתחוה שם לאלהים, ואין ראש אלא ע\"ז וכו', וכתיב (שם) והנה לקראתו חושי הארכי וגו', א\"ל לדוד מלך שכמותך יעבוד ע\"ז, א\"ל מלך שכמותי יהרגנו בנו, מוטב יעבוד ע\"ז ואל יתחלל ש\"ש בפרהסיא, פרש\"י שיהיו מתרעמין על מדותיו של הקב\"ה, ונמצא ש\"ש מתחלל וכו', א\"ל חושי הארכי לדוד, מ\"ט נסבת יפת תואר, א\"ל יפ\"ת רחמנא שריא, א\"ל לא דרשת סמוכין, דסמיך לי' כי יהי' לאיש בן סורר ומורה, כל הנושא יפ\"ת יש לו בן סורר ומורה, עכ\"ד הגמ', לכאורה צ\"ב, מה היתה טענתו של חושי הארכי, במ\"ש לא דרשת סמוכין וכו', סוכ\"ס לא נדחה בזה תשובתו של דוד, שרצה לעבוד ע\"ז, מפני שחשש לחילול ש\"ש בפרהסיא, שיאמרו מלך שכמותו יהרגנו בנו, ובמה דדרשינן סמוכים, עדיין לא נמלט מחשש חילול ש\"ש, דסוף סוף יפ\"ת רחמנא שריא, וצ\"ב."},{"passage_id":"devurim_ef0edda9_p2","passage_content":"להלן בפרשה לא יבא עמוני ומואבי בקהל ד' וגו', על דבר אשר לא קדמו אתכם בלחם ובמים בדרך בצאתכם ממצרים, ואשר שכר עליך את בלעם בן בעור וגו', פרש\"י על דבר, על העצה שיעצו אתכם להחטיאכם, וכן איתא בספרי, ועוד איתא בספרי הביאו רש\"י ז\"ל, מצרים טבעו את ישראל בים, ואדומים קדמו את ישראל בחרב, ולא אסרם הכתוב אלא עד ד' דורות, עמונים ומואבים שנטלו עצה להחטיא את ישראל, אסרם הכתוב איסור עולם, ללמדך שהמחטיא את האדם, קשה לו מן ההורגו וכו', ולכאורה צ\"ב דעיקר חטאם, מה שיעצו להחטיא את ישראל, לא אמרה הכתוב אלא ברמז, דנרמז במלת על דבר, ומפרש הכתוב טעם אחר, אשר לא קדמו אתכם בלחם ובמים דהוא מילתא זוטרתי, לגבי רעת המחטיא, דגדול המחטיא אף יותר מההורגו."},{"passage_id":"devurim_ef0edda9_p3","passage_content":"גם הטעם השני הנזכר בקרא, אשר שכר עליך את בלעם בן בעור וגו', קשה הרבה יותר מן הראשונה, שרצה להכחידם ולמחותם ח\"ו, אלא שלא אבה ד' לשמוע אל בלעם וגו', ובחסדי השי\"ת הצילנו ממנו, אבל למה הקדים הכתוב טעם אשר לא קדמו בלחם ובמים, שאינו אפי' בגדר השתוות להני שני טעמים אחרים, גם לא הי' צורך להם לישראל כ\"כ, שיקדמו פניהם בלחם ומים, כי הי' מספיק להם המן ובאר, והיו נזונים בדרך נס בלחם מן השמים, ויספיק הכתוב בהזכרת ב' הטעמים האחרים, ואשר לא קדמו אתכם מיותר לגמרי."},{"passage_id":"devurim_ef0edda9_p4","passage_content":"גם צ\"ב קישור הכתוב, דלכאורה לפי דברי הספרי, הם ב' דברים נפרדים, על דבר, היינו העצה שיעצו להחטיאכם בדבר בלעם, ואמר עוד אשר לא קדמו בלחם ובמים, והוא מילתא באנפי נפשי' וחטא אחר וכתב הרא\"ם ז\"ל דה\"ה כמו שנכתב על דבר ועל אשר לא קדמו בוא\"ו המוסיף אבל עדיין אינו מובן קישור הפסוק, דעצה זו להחטיאם הי' ע\"י בלעם, ורצו לקללם ג\"כ ע\"י בלעם, והו\"ל לשלב ב' דברים אלו, על דבר שיעצו להחטיאם ואשר שכרו את בלעם לקללם, ולמה הפסיק הענין באשר לא קדמו בלחם ובמים, שהוא ענין נפרד לגמרי."},{"passage_id":"devurim_ef0edda9_p5","passage_content":"ונבוא אל הביאור, ונקדים דברי הגמ' יבמות (דף ע\"ז) שא\"ל דואג לשאול, עד שאתה משאיל על דוד, אם הגון הוא למלכות אם לאו, שאל עליו אם ראוי לבוא בקהל, משום דקא אתי מרות המואבי', א\"ל אבנר תנינא עמוני ולא עמונית מואבי ולא מואבית, אלא מעתה ממזר ולא ממזרת מצרי ולא מצרית, שאני הכא דמפרש טעמא דקרא, על דבר אשר לא קדמו וגו', דרכו של איש לקדם ואין דרכו של אשה לקדם, והקשה עוד דואג הי' להם לקדם אנשים לקראת אנשים ונשים לקראת נשים אשתיקו, בעי לאכרוזי עלי', מיד ועמשא בן איש וגו', יתרא הישמעאלי, אמר רבא מלמד שחגר חרבו כישמעאל, ואמר כל מי שאינו שומע הלכה זו ידקר בחרב, כך מקובלני מבית דינו של שמואל הרמתי, עמוני ולא עמונית מואבי ולא מואבית, מ\"מ קשיא דהי' להם לקדם נשים לקראת נשים, ותירצו כל כבודה בת מלך פנימה, ופרש\"י דאין דרך אשה לצאת מביתה עכ\"ל, והגם דמואביות לא היו צנועות כ\"כ, שלא לצאת מפתח ביתם, אבל מ\"מ כיון שהמידה כך הוא, א\"א לחייבם על מה שלא קדמו."},{"passage_id":"devurim_ef0edda9_p6","passage_content":"ובמד\"ר רות (פ\"ד ס\"ד) איתא מאמר זה בשנוי קצת, ששאל דואג לאבנר כל הני קושיות, והי' להם לנשים להוציא לקראת נשים וכו', נתעלמה הלכה מעיניו של אבנר לפי שעה, הלך ושאל לשמואל ובית דינו, א\"ל שמואל הדא מנין לך, לא מן דואג, דואג מין הוא וכו', אלא להוציאך חלק אי אפשר, דכתיב כל כבודה בת מלך פנימה, דרכו של איש להוציא ואין דרכה של אשה להוציא, וכתיב ואשר שכר עליך וגו', דרכו. של איש לשכור ואין דרכו של אשה וכו' עכ\"ד המדרש."},{"passage_id":"devurim_ef0edda9_p7","passage_content":"והמהרש\"א ז\"ל הקשה וז\"ל, יש לדקדק בענין זה, שדואג וסייעתו חשבו לאסור עמונית ומואבית וכו', והאיך חשבו שבועז זה אבצן, והי' שופט כל ישראל כמה שנים, ואיך נשא פסולי קהל ברבים, כמ\"ש ויקח עשרה אנשים וגו', ותירץ למאי דמסקינן בפ' כיצד (יבמות דף כ' ע\"ב) דעשה דיבמה דוחה ל\"ת, וחייבי לאוין מתיבמין מן התורה, אלא דאנן גזרינן ביאה ראשונה אטו ביאה שני' דאסור בה, דכבר קיים המצוה בביאה ראשונה, ואפשר דאז בימי בועז עדיין לא גזרו על כך, וחשב דע\"כ הותרה לו, דעשה דיבמה דוחה ל\"ת דמואבית, אבל באמת גם מואבית אסורה עכת\"ד המהרש\"א ז\"ל."},{"passage_id":"devurim_ef0edda9_p8","passage_content":"אמנם תירוצו קשה, דמפורש בקרא יתן ד' את האשה הבאה אל ביתך כרחל וכלאה אשר בנו שתיהם את בית ישראל, ואין הו\"א בעולם שהי' חשש פסולי קהל בזה. וגם בעיקר תירוצו כבר הקשו עליו, דלא הי' בזה מצות עשה דיבמה כלל, דאחר שניתנה תורה נתחדשה הלכה, ואין דין יבמה נוהג אלא באחים מן האב ולא בשאר קרובים, גם לא הי' שייך כאן יבום כלל שלא הי' קידושין תופסין בהם, שלא גיירום מחלון וכליון, ואיך יעלה על הדעת שתדחה היבום מצות ל\"ת."},{"passage_id":"devurim_ef0edda9_p9","passage_content":"ואפשר דהקושיא מעיקרא לא קשה, דהם היו סמוך לדורו של בועז, והי' יכולת בידם לחלוק עליו, וכמ\"ש הרמב\"ם ז\"ל (בפ\"ב מה' ממרים ה\"א), ב\"ד גדול שדרשו בא' מן המדות שהדין כך ודנו כך, ועמד ב\"ד אחר ונראה לו טעם אחר לסתור אותו, הרי זה סותר ודן כפי מה שנראה בעיניו, וס\"ל להרמב\"ם דמ\"ש אין ב\"ד יכול לבטל דברי ב\"ד חבירו אא\"כ גדול ממנו בחכמה ובמנין, זה רק בתקנה או גזרה עיי\"ש, וכתב הכ\"מ דלמד רבינו דין זה, ממה דחזינן תנאי בתראי דפליגי אקמאי, ומה שאין בכח אמוראים לחלוק על התנאים, כתב הכ\"מ ז\"ל שמיום חתימת המשנה קיימו וקבלו, שדורות האחרונים לא יחלקו על הראשונים, ואעפ\"כ אם יש לו תנא דמסייע לדבריו, יוכל גם האמורא לחלוק על תנא, וכמ\"ש בכ\"מ הוא דאמר כהאי תנא, עייש\"ד. עכ\"פ ברור דבענין הדרש דעמוני ולא עמונית מואבי ולא מואבית, הי' בידם לחלוק על בית דינו של בועז, אע\"פ שכבר עשה מעשה עפ\"י הוראתו, ואיהו דעבד שפיר עבד, דבדורו כך הי' הכרעת הב\"ד."},{"passage_id":"devurim_ef0edda9_p10","passage_content":"ועוד דאיתא בירושלמי ובמד\"ר רות עה\"פ אל עם אשר לא ידעת מתמול שלשום, אילו באת מתמול שלשום לא היו מקבלין אותך, דאותו היום נתחדשה הלכה זו עמוני ולא עמונית מואבי ולא מואבית, ומבואר בספה\"ק הטעם דלא נתגלה הלכה זו עד אותו היום, אף שכבר ניתנה הלממ\"ס אבל נסתרה ונעלמה מחכמי ישראל כל אותן הדורות, כדי שלא יתודע למקטרגים, ששורש הלכה זו, הוא יסוד קיומה של מלכות בית דוד, והי' הצורך שיתעלם מהם ידיעה זו, עכ\"פ כל בתי דינים בדורות שלפניהם, אסרו גם מואבית מה\"ת, והי' אפשר לדואג לחלוק על ב\"ד של בועז, גם בענין הלממ\"ס, ולהורות כפי קבלת בתי דינים הראשונים."},{"passage_id":"devurim_ef0edda9_p11","passage_content":"ואפשר עוד דאותו היום שנשא בועז את רות נתחדשה הלכה זו, לפי שהי' צורך השעה והכרח, דאלמלי כן היתה אסורה לבועז, אבל אח\"כ חזרה ונתעלמה הלכה זו ושכחום, והי' הדבר בסוד כדי להסתיר מהמקטריגים, וחזר ונתגלה להם בדורו של דוד ושמואל, ודואג הי' חולק עליהם, ורצה לפסול את דוד לבוא בקהל, ול\"ק קושית המהרש\"א ז\"ל."},{"passage_id":"devurim_ef0edda9_p12","passage_content":"וביפ\"מ על הירושלמי דקדק, על מ\"ש חגר חרבו כישמעאל והול\"ל חגר חרבו כאדומי, שעשו הוא בעל החרב שנתברך בעל חרבך תחי' עיי\"ש, ולא תירץ כלום, ועוד ראוי להבין למה אמר ידקר בחרב, ואין זו הדרך לברר הלכתא. ולבאר הענין נקדים עוד מ\"ש ז\"ל (שם בגמ' הנ\"ל) דרש רבא מ\"ד (תהלים מ') רבות עשית אתה ד' אלקי נפלאותיך ומחשבותיך אלינו, אלי לא נאמר אלא אלינו וכו', ופרש\"י עלי ועל רחבעם בן בני חשבת לטובה, כשהתרת את הנקיבות, ועוד דרש רבא מאי דכתיב (שם) אז אמרתי במגלת ספר כתוב עלי, אמר דוד אני אמרתי עתה באתי, ולא ידעתי שבמגלת ספר כתוב עלי, התם כתיב (בראשית י\"ט) שתי בנותיך הנמצאות, הכא כתיב (תהלים פ\"ט) מצאתי דוד עבדי וגו', פרש\"י אני אמרתי עתה באתי בשעה שנמשחתי באתי לגדולה, ומקרוב פסקו לי גדולה זו, ולא ידעתי שמימי אברהם נכתב עלי במגלת ספר, ואמרז\"ל בב\"ר מצאתי דוד עבדי היכן מצאתיו בסדום וכו', ובזכות זה ניצול לוט, לפי שהשתלשלות מלכות בית דוד עתידה לצאת ממנו, ואיתא בספה\"ק שהי' ההכרח להיות בדרך זה, כדי שלא יבינו המקטריגים, עכ\"פ הי' כל הענין הכרח, וגזירה קדומה, שיהי' השתלשלות מלכות ב\"ד באופן זה, ומה\"ט לא נאסרה מואבית."},{"passage_id":"devurim_ef0edda9_p13","passage_content":"ופירשתי כבר (עיין בדברינו לעיל פ' תצא) דברי המדרש שבבעה\"ט, שדרשו לא יוכל לבכר את בן האהובה אלו אומה\"ע וכו', כי אם בני בכורי ישראל, ויתבאר עפימ\"ש בב\"ר פ' חיי שרה (פס\"א ס\"ז) בימי אלכסנדרוס מוקדן, באו בני ישמעאל לעורר על ישראל על הבכורה וכו', אמרו ישמעאלים אנו תובעים מידן ומתורתן אנו באים עליהם, כתיב כי את הבכור בן השנואה יכיר, וישמעאל בדין שיטול פי שנים, א\"ל גביעה בן קוסם, אדוני המלך אין אדם עושה מה שהוא רוצה לבניו, א\"ל הן, א\"ל והכתיב ויתן אברהם כל אשר לו ליצחק, אמרו לו והיכן שטר שילוח שחילק בין בניו, א\"ל ולבני הפילגשים אשר לאברהם נתן אברהם מתנות, ונסתלקו משם בבושת פנים, עכ\"ד המדרש, וכעי\"ז איתא בגמ' סנהדרין (צ\"א ע\"א) אלא שלא נזכר שם תביעתן על חלק בכורה, אלא ליטול חלק בארץ עיי\"ש."},{"passage_id":"devurim_ef0edda9_p14","passage_content":"ואפשר לפרש בזה דברי רש\"י ז\"ל (בפ' לך) עה\"פ למען ייטב לי בעבורך וחיתה נפשי בגללך, פרש\"י יתנו לי מתנות, לכאורה צ\"ב וכי רצה אברהם מתנות, והלא מצינו שאמר למלך סדום, אם מחוט ועד שרוך נעל ואם אקח מכל אשר לך וגו', גם הול\"ל להקדים וחיתה נפשי שהוא העיקר, דכל אשר לאדם ותן בעד נפשו, (ועיין בדברינו פ' לך), - אמנם האבות הקדושים עשו פעולות ותפילות, עבור כל ישראל עד סוף כל הדורות, ומבואר כן במד\"ר שמ\"ש יעקב הצילני נא מיד אחי מיד עשו, התפלל בזה על דורות העתידים שינצלו מאותם שבאים מכוחו של עשו, וכתב רש\"י ז\"ל עה\"פ ולבני הפילגשים נתן אברהם מתנות, שמה שניתן לו מפרעה על אודות שרה, ושאר מתנות שנתנו לו, הכל נתן להם שלא רצה ליהנות מהם, וכמו כן מצינו שאמז\"ל שנטל יעקב כל כסף וזהב שהביא מבית לבן ועשה אותו כרי, ונתנה לנפשו בשביל חלקו במערה, אבל לא רצה ליתן לו מאותן שעלו לחלקו וגורלו, שהם מחלק הקדושה, ונתן לו נכסי לבן שהם מסטרא דילי', כדאיתא בספה\"ק הטעם."},{"passage_id":"devurim_ef0edda9_p15","passage_content":"וכמו\"כ אברהם אבינו הוצרך למתנות אלו, ליתנן לבני הפילגשים, כדי שיסתתם טענתם, ולא יוכלו לטעון עוד על חלק בכורה וירושת הארץ, ובזה יבואר הפסוק למען ייטב לי בעבורך יתנו לי מתנות, ועי\"ז וחיתה נפשי בגללך, והכוונה על דורות ישראל, שלא יוכלו בני ישמעאל להיצר להם וליטול חלקם מדין בכורה, גם כי הבכורה מוכן לדוד כמבואר להלן מדברי הילקוט, ואברהם אבינו עשה פעולות למלכות בית דוד כמבואר לעיל, דע\"כ השתדל בהצלתו של לוט, וכמשפרש\"י ביבמות שמימי אברהם נכתב עלי במגלת ספר, וע\"ז כיוון וחיתה נפשי בגללך, על מלכות בית דוד וגאולת ישראל דתליא זה בזה."},{"passage_id":"devurim_ef0edda9_p16","passage_content":"עכ\"פ ביקשו בני ישמעאל חלק בכורה, ובאמת מוכן היא הבכורה לדוד, כמשה\"כ אף אני בכור אתנהו כיליון למלכי ארץ, ואיתא בילקוט תהלים (רמז תת\"מ) וכי בכור הי' דוד, והרי כתיב ודוד הוא הקטן, ולמה קורא אותו בכור, אלא מה בכור נוטל פי שנים בנחלה, אף דוד נוטל המלכות בעוה\"ז ובעוה\"ב עכ\"ל, והכוונה בעוה\"ז אחר ביאת המשיח, שיהיו ישראל ומלכות בית דוד ברום המעלה, והעיקר לעוה\"ב יום שכולו שבת, וזה כוונת המדרש שבבעה\"ט לא יוכל לבכר את בן האהובה אלו אומה\"ע, שלא יועיל טענתם על חלק בכורה, כי אם בני בכורי ישראל, והבכורה הוכן לדוד ולזרעו עד עולם."},{"passage_id":"devurim_ef0edda9_p17","passage_content":"והנה דואג שרצה לפסול את דוד משום פסולי קהל, א\"כ אבדה כל תקוה ח\"ו, דאין ציון וירושלים נבנית כ\"א בזכות דוד, כמ\"ש בזוה\"ק פ' ויקהל (דף קצ\"ח ע\"א) (הובא בדברינו כ\"פ) עה\"פ לא בחרתי בעיר ואבחר בדוד, לא בחרתי בירושלים עד דאסתכלנא בדוד למהוי רעיא על ישראל וכו' עיי\"ש, וא\"כ דואג שרצה לפסול את דוד, א\"כ הי' נמנע הגאולה ח\"ו, ונתארך גזירת הגלות וחרב על שונאי ישראל על ידו, וע\"כ מדה כנגד מדה חגר חרב לקראתו, ובעיון יעקב פי' דהמורד במלכות בית דוד נדון בסייף עיי\"ש, ואפשר דע\"כ הזכירו כאן חגר חרבו כישמעאל, לרמז לו דרצה לבטל חזקת הבכורה מדוד, ובזה עושה מעשה ישמעאל, דגם בני ישמעאל רצו לעשות כן, ומתורץ קושית היפה מראה."},{"passage_id":"devurim_ef0edda9_p18","passage_content":"ואפשר לבאר עוד, עפימ\"ש ז\"ל ויהי דוד לכל דרכיו משכיל וד' עמו שהלכה כמותו בכל מקום, שע\"י השראת השכינה שעליו כיון ההלכה לאמיתו, ולפי דעתו של דואג שרצה לפסול את דוד, לא הי' מציאות שיזכה להשראת השכינה, דאין השכינה שורה אלא על המיוחסין שבישראל, א\"כ בטענתו זו עשה פגם במקור ההלכה האמיתית, ואמרז\"ל באבות (פ\"ה מ\"ח) חרב בא לעולם על עוות הדין ועל המורים בתורה שלא כהלכה, וע\"כ רמז לו דבזה שרצה לפסול את דוד, מביא חרב לעולם, וראוי לידקר בחרב מידה כנגד מידה."},{"passage_id":"devurim_ef0edda9_p19","passage_content":"ועתה נבוא לבאר מאמר הכתוב על דבר אשר לא קדמו אתכם בלחם ובמים וגו' (עיין לעיל קושיא ב' ג'), ואפ\"ל עפ\"י פשטות דאיתא במד\"ר (פ' בלק) שהיו בנות מואב אומרות לבני ישראל, למה אנו אוהבים אתכם, ואתם שונאים אותנו, כולנו בני איש אחד בני תרח אבי אברהם, אם אין אתם רוצים לאכול מזבחנו, הרי לך עגלים ותרנגולים, שחטו כמצותכם ואכלו, מיד משקתו היין ובוער בו השטן והוא נשטה אחרי', עכ\"פ נכשלו ישראל אחר עצתו של בלעם ע\"י אכילה ושתי', שהאכילום והשקום המואבים, ומבואר כן בכתוב ותקראן לעם וגו' ויאכל העם וישתחוו לאלהיהן."},{"passage_id":"devurim_ef0edda9_p20","passage_content":"ואולי הי' אפשר למואבים להצטדק שלא האכילום והשקום למחשבה רעה למען החטיאם, כי אם לטובת ישראל שהיו אוהבים אותם, כאמרם כולנו בני אב אחד, או שרצו התחברות עם ישראל כדי ללמוד מהם להיישיר מעשיהם, אמנם תברא בצידה, דמעשיהם מוכיחים דלא לשם אהבת ישראל עשו כן, דעד שלא שכרו את בלעם, לא הקדימו את ישראל בלחם ובמים, א\"כ נתגלה קלונם דלהחטיאם נתכוונו, ובזה יובן קישור הכתוב, לא יבוא עמוני ומואבי בקהל ה', על דבר, בשביל דבר העצה שיעצו להחטיאם כמו שדרשו בספרי, והמבחן שלרעה נתכוונו, לפי שלא קדמו אתכם בלחם ובמים בדרך בצאתכם ממצרים, אלא כאשר שכר עליך את בלעם בן בעור וגו', וע\"כ הרחיקם התוה\"ק מלבוא בקהל, וסרו כל הקושיות והבן."},{"passage_id":"devurim_ef0edda9_p21","passage_content":"ולדרכנו הנ\"ל אפ\"ל עוד, דמשה\"כ אשר לא קדמו אתכם בלחם ובמים וגו', אינו טעם על התרחקותם מלבוא בקהל, אלא טעם התרחקותם מפני שיעצו להחטיאם, וזהו מבואר במלות על דבר כמו שדרשו בספרי, אלא שהוצרך הכתוב לתת טעם אשר לא קדמו בלחם ובמים, כדי למעט את הנקיבות מכלל האיסור, דעל דרשא דעמוני ולא עמונית מואבי ולא מואבית איכא פירכא, כמו שהקשה דואג דנימא נמי מצרי ולא מצרית, ועוד דאי טעם התרחקותן משום שיעצו להחטיא את ישראל א\"כ ראוי לאסור את הנשים יותר, שהם היו בעצמם המחטיאים."},{"passage_id":"devurim_ef0edda9_p22","passage_content":"ע\"כ כדי להכשיר מלכות בית דוד, הוצרך הכתוב לטעם אשר לא קדמו, למעט את הנקיבות מכלל האיסור, וכמבואר בגמ' דיבמות ובמד\"ר רות, שזו היתה התשובה לסתור דברי דואג, אלא שלא רצה התוה\"ק לגלות בפירוש, דמואביות לא נאסרו, ורק אותו היום נתחדשה הלכה זו, וכמ\"ש לעיל שהי' הכרח להסתיר הלכה זו מפני הקטרוג, וע\"כ נכתב פסוק זה אשר לא קדמו, לסתום פיהם של המינים, שרוצים להכחיש באמיתתו של מלכות בית דוד."},{"passage_id":"devurim_ef0edda9_p23","passage_content":"ובאמת כן הוא דמאמר אשר לא קדמו, הוא ביאור להשלים הטעם על דבר אשר יעצו להחטיאם, כאשר ביארנו לעיל דזהו המבחן שכוונתם הי' רעה להחטיאם, אבל עוד טעם בדבר שכתבה תוה\"ק על דבר אשר לא קדמו, להורות לנו שלא אסר הכתוב אלא הזכרים, שדרכם לקדם ולא הנקיבות, ואפשר שהי' רצון הבוי\"ת כן בעבור להוציא מהם ב' פרידות טובות, שהי' ההכרח להיות השתלשלותם בדרך מוצנע ומוסתר מפני המקטריגים כמ\"ש לעיל, וא\"ש מה שנכתב מאמר אשר לא קדמו, ובאמת עיקר הטעם על שיעצו להחטיאם, אבל יש הכרח בטעם זה להתיר את הנקיבות ומתורץ קושיא ב' הנ\"ל וגם קישור הפסוק א\"ש."},{"passage_id":"devurim_ef0edda9_p24","passage_content":"ועתה נבוא לבאר דברי הגמ' סנהדרין הנ\"ל, מ\"ש דוהמע\"ה מלך שכמותו יהרגנו בנו וכו', ומה שהשיב לו חושי הארכי אמאי לא דרשת סמוכין (עיין לעיל קושיא א') ונקדים בהתרת הספק שעמדנו עלי' (עיין בדברינו לעיל) על מ\"ש רש\"י ז\"ל, בטעם שהתירה תורה יפת תואר, דלא דיברה תורה אלא כנגד יצה\"ר, שאם אין הקב\"ה מתירה ישאנה באיסור, וכן אמרז\"ל במס' קידושין (דף כ\"א ע\"ב) מוטב שיאכלו ישראל בשר תמותות שחוטות, ואל יאכלו בשר תמותות נבילות, ולכאורה אין סברא זו מספקת, להתיר בשבילה איסור דאורייתא, דא\"כ הי' אפשר להתיר כל איסורין שבתורה בדרך זה, דעד שלא יעשנו באיסור יעשנו בהיתר, ומה נשתנה איסור זה שהתירה תוה\"ק לטעם זה, גם קשה דכל ההולכים למלחמה היו כולם צדיקים, דאמרז\"ל אפי' שח בין תפלה לתפלה, חוזר עלי' מעורכי המלחמה, ואיך אפשר שיתאוו תאוה לישא כותית, עד שהוצרך הכתוב להתירה להם פן ישאנה באיסור, אתמהה."},{"passage_id":"devurim_ef0edda9_p25","passage_content":"ובסודן של דברים נתבאר בספר הלקוטים מהאריז\"ל, וכ\"כ האוהח\"ק והחיד\"א ז\"ל, והובא בספה\"ק בכ\"מ, דע\"כ התירה תורה יפ\"ת, להוציא בלעם מפיהם, ניצה\"ק אשר שבוי בקרבם, ולזה היתה תשוקתו ולא לגולם הנגלם (עיין לעיל העתקנו דבריהם באריכות), אבל עדיין קשה דאין זה מתאים עם הטעם, שאמרז\"ל עד שלא ישאנה באיסור ישאנה בהיתר, וצ\"ב להשוות דבריהם, וכבר ביארנוהו לעיל ועוד לאלקי מילין."},{"passage_id":"devurim_ef0edda9_p26","passage_content":"ונקדים מה שפירשנו דברי המדרש רבה פ' ראה (פ\"ד ס\"ט) (עיין לעיל בדברינו פ' ראה) וז\"ל המדרש ואמרת אוכלה בשר בכל אות נפשך תאכל בשר, זש\"ה (תהלים קמ\"ו) עושה משפט לעשוקים נותן לחם לרעבים ד' מתיר אסורים, מדבר בישראל וכו', רבנן אמרי ח' דברים אסר להן הקב\"ה, והתיר להן שמונה בהן וכו', הוי ד' מתיר אסורים, אף להלן אסר בשר תאוה, וכאן התירו להן, מנין רק בכל אות נפשך תזבח ואכלת בשר עכ\"ל המדרש. ולכאורה יל\"ד בפסוק מה נתינת טעם הוא זה, כי תאוה נפשך לאכול בשר, גם מדוע כפל הכתוב עוד בכל אות נפשך תאכל בשר, הכי יזהירנו הכתוב לאכול לתאות נפשינו אתמהה, ויובן עפימ\"ש בעש\"ט הק' לפרש הפסוק רעבים גם צמאים נפשם בהם תתעטף, דלכאורה למה ברא השי\"ת את האדם, באופן שיהי' רעב וגם צמא ויוכרח לאכול ולשתות, ולא ימנע מד' דבר, שיהי' הבריאה בשלימות ולא יצטרך האדם לכ\"ז, אמנם לפי שבדבר המאכל והמשקה מעוטפים בו, נשמות ונצוה\"ק אשר הצורך להעלותם ולתקנם, ע\"כ יוכרח האדם ליהנות מהם, ובאופן זה יש להם העלאה ותקון, וז\"ש רעבים גם צמאים לפי שנפשם בהם תתעטף, ר\"ל ניצה\"ק משורש נפשם ונשמתם עטופים בהם, וע\"כ הצורך שיהי' בריאת האדם בדרך זה, כדי שיהי' מקום ואפשרות להעלותם עיי\"ש."},{"passage_id":"devurim_ef0edda9_p27","passage_content":"ובזה יובן טעם הכתוב, שהתירה התורה בשר תאוה, שהי' נאסר להם לישראל כל ימי היותם במדבר, ונתן הכתוב טעם כי תאוה נפשך לאכול בשר, לפי שיש בו מחלק נפשך, וניצה\"ק משרשי נשמתך, וזה אשר יביאך להתאוות תאוה לאכל בשר, וכעין שהבאנו לעיל דברי האוהחה\"ק, שהתשוקה ביפת תואר לצד הנפש והניצה\"ק אשר בה, וזה שהזהירנו הכתוב בכל אות נפשך תאכל בשר, שיהי' אכילתך ע\"ד כן, למלאות תאות נפשך ונשמתך, ולתקן הניצה\"ק, ולהוציא בלעם מפיהם."},{"passage_id":"devurim_ef0edda9_p28","passage_content":"ובזה יתבאר דברי המדרש הנ\"ל הה\"ד עושה משפט לעשוקים נותן לחם לרעבים ד' מתיר אסורים וכו'. ועשוקים הן המה הניצה\"ק והנשמות, שנעשקים ונשבים ביד הקליפות והחיצונים ר\"ל, והקב\"ה עושה דין לאלה העשוקים, וחותר להם חתירה לתקנם ולהעלותם, ומזה הטעם נותן לחם לרעבים כנ\"ל, ומה\"ט ד' מתיר אסורים, שהתיר בשר תאוה הנאסר להם עד הנה, דאל\"כ לא הי' התוה\"ק מתיר בשר תאוה, ומה שלא הותר להם כל זמן היותם במדבר, לפי שלא הוצרכו לזה, שלגודל קדושתם הי' אפשר להם לתקן ולהעלות ניצה\"ק גם בלא\"ה שהיו נמשכים מעצמם אליהם כדוגמת אבן השואבת, וכדוגמת אור קטן בהתקרב אל אבוקה, יקפוץ ממקומה להתדבק באורה עיי\"ש כי הארכנו בזה."},{"passage_id":"devurim_ef0edda9_p29","passage_content":"ואפ\"ל עוד כוונה בפירוש הכתוב ד' מתיר אסורים, כי טעם התורה בהיתר בשר תאוה, כדי להתיר הניצה\"ק ממאסרם, אשר המה אסורים ושבויים בה, וכמ\"ש התניא בלקוטי אמרים (הו\"ד לעיל פ' תצא) דכל מה שאסרה תוה\"ק נקרא בשם איסור, לפי שחיות הדבר ההוא קשור ואסור ביד החיצונים, וקשה להעלותו משם וכו', ולשון מותר יורה שאינו קשור ואסור בידי החצונים, ואפשר בניקל להעלותם לשורשם ולתקנם ע\"ש, עכ\"פ הי' הכרח להתיר האיסור, כדי להתיר הניצה\"ק ממאסרם ויהי' אפשרות לתקנם, והפשט והרמז בקנה א' עולים שלטעם זה התירה התוה\"ק האיסור, כדי להתיר הניצה\"ק ממאסרם."},{"passage_id":"devurim_ef0edda9_p30","passage_content":"וכמו\"כ בענין יפת תואר, בהכרח התירה התוה\"ק האיסור שעלי', לטעם שכתבו חכמי האמת כדי להעלות הניצה\"ק אשר בה, כמו שיתבאר, - כי אמנם הי' גם אופן ואפשרות אחר, להעלות הניצה\"ק אשר בה ע\"י גרות, כמ\"ש האוהחה\"ק בפ' תצא, שיש נפש קדושה בין הקליפות, שבמקום שכונתה תטה לב השוכנת בתוכו להטיב, ויגרשו חלק הרע או ימתקוהו, והם הגרים המתגיירים מן האומות מעצמם וכו', וכתב האריז\"ל לפרש מאמרם ז\"ל לא הגלו ישראל לבין האומות, אלא כדי שיתוספו עליהם גרים, דהכוונה על ניצה\"ק והנשמות הנטמעין ומשוקעין בהם, דגם אלו נקראים גרים, ונשמת הגרים המה מנשמות אלו שנדחו מישראל ונטמעו בהם כנודע - ולפי\"ז עדיין צ\"ב לפי טעם חכמי האמת, שהתירה תוה\"ק איסור יפ\"ת, כדי להעלות הניצה\"ק השוכנת בתוכה, והלא הי' יאות יותר שיתעביד התקון הזה באופן מעולה, נרי שיסייעוהו מן השמים לניצה\"ק והנפש היקרה, שתגביר על לב השוכנת בתוכה, ותטה את לבה להתגייר, ולמה עשה ד' ככה להתיר את האיסור, ושיהי' התקון בדרך זה."},{"passage_id":"devurim_ef0edda9_p31","passage_content":"אמנם יבואר עפי\"מ שאמרז\"ל במס' יבמות (דף מ\"ז ע\"א) גר שבא להתגייר בזמה\"ז, אומרים לו מה ראית שבאת להתגייר, אי אתה יודע שישראל בזמה\"ז דוויים דחופים וסחופים וכו', ומודיעין אותו מקצת מצות קלות ומקצת מן החמורות וכו', מ\"ט דאי פריש נפרוש, דא\"ר חלבו קשים גרים לישראל כספחת וכו', והרמב\"ם כתב (בפי\"ג מאיסורי ביאה הי\"ח) דמפני זה אמרז\"ל קשים גרים לישראל כנגע צרעת, שרובן חוזרין בשביל דבר ומטעין את ישראל, וקשה הדבר לפרוש מהם אחר שנתגיירו, צא ולמד מה שאירע לישראל במדבר, במעשה העגל ובקברות התאוה, וכן רוב הנסיונות האספסוף היו בהן תחלה."},{"passage_id":"devurim_ef0edda9_p32","passage_content":"ועוד אמרז\"ל במס' יבמות (דף ע\"ו ע\"א) אין מקבלין גרים לא בימי דוד ולא בימי שלמה, וכתב הרמב\"ם ז\"ל בפרק הנ\"ל, בימי דוד שמא מן הפחד חזרו, ובימי שלמה שמא בשביל המלכות והטובה והגדולה שהיו בה ישראל חזרו, שכל החוזר מן העכו\"ם בשביל דבר מהבלי העולם, אינו מגירי הצדק וכו', ולפי שגייר שלמה נשים ונשאן, וכן שמשון גייר ונשא, והדבר ידוע שלא חזרו אלו אלא משום דבר וכו', חשבן הכתוב כאלו הן עכו\"ם וכו', ועוד שהוכיח סופן על תחלתן שהן עובדות ע\"ז שלהן וכו', עוד כתב שם שאם מל וטבל ולא בדקו אחריו, אפי' נודע אח\"כ שבשביל דבר הוא נתגייר, הואיל ומל וטבל יצא מכלל עכו\"ם, ובדיעבד ה\"ה גר, אבל אם ידוע לנו מתחלה שבשביל דבר בא להתגייר ולא לש\"ש אין מקבלין אותו, כ\"כ הרמב\"ם וכ\"כ הכ\"מ בשם המרדכי עיי\"ש."},{"passage_id":"devurim_ef0edda9_p33","passage_content":"עכ\"פ מבואר דמצד עצם ההלכה, אם מתגיירין בשביל דבר ולא לש\"ש לא נחשב לגירות, אלא שלא נצטווינו לחשוש על מסתרי לבבם, ואע\"פ שרובם חוזרין ומתגיירין בשביל דבר כמ\"ש הרמב\"ם ז\"ל, אעפ\"כ אם קבל עליו המצות מלין אותו מיד, ואע\"פ שאפשר שאין קבלתו אמיתית ואין מתגייר לש\"ש, לא נצטווינו לחשוש על ככה, אלא מודיעין להם מקצת מצות קלות ומצות חמורות, ואין מרבין עליו דברים לאיים כדי שיפרוש, כמ\"ש בגמ' דיבמות שם, והטעם לפי שלא רצתה התוה\"ק לדחותם, מפני הנשמות הקדושות שבהם שלא ידחו דחי' עולמית, ובלא\"ה אין בידינו לברר מסתרי לבבם, ע\"כ מסרו לנו חז\"ל בדרך כלל, דאם יקבל עליו עול מצות מגיירין אותו, דאם נחשוש ע\"צ הספק ידחו גם הכשרים שבהם, וכעין שכתב הרמב\"ם ז\"ל (בפ\"ז מה' יסודי התורה) בנביא הראוי לנבואה, ועשה אות ומופת מצוה לשמוע לו, ואע\"פ שאפשר שאינו נביא, וזה האות יש לו דברים בגו, אעפ\"כ בכך נצטוינו לשמוע לו, וכמו שנצטוינו לחתוך את הדין עפ\"י ב' עדים כשרים, ואע\"פ שאפשר שיעידו בשקר וכו', ועל זה נאמר הנסתרות לד' אלקינו עכ\"ל, אבל מצד עצם הדין וכלפי שמיא גליא אם נתגיירו שלא לש\"ש ולצד אחה סיבה לא נחשב לגירות כלל."},{"passage_id":"devurim_ef0edda9_p34","passage_content":"ומעתה הגם שהי' אפשר שיתדבק הניצה\"ק אשר בה משורש נשמתו, ע\"י שישאנה בהיתר דרך גרות, שצרי רצון החושק של הניצה\"ק, תטה לב השוכנת בתוכו להתגייר, אמנם רובם מתגיירין שלא לש\"ש כמו שכתב הרמב\"ם ז\"ל, וקמי שמיא גליא, ובעצם ארי' רביע עלה והויא דבר איסור, אע\"פ שעפ\"י הלכה אנו סומכין להתירה, לפי שאין בידינו לברר, וכך נצטוינו לסמוך על דבריה אם מקבלת עלי' המצות, אבל קמי שמיא גליא, והויא חתיכה דאיסורא, וע\"כ כח הסט\"א והיצה\"ר מתחזק עלי' מאוד, דזהו גדר דבר האיסור, שקשור ואסור בידי החצונים, כמ\"ש בלקוטי אמרים כנ\"ל, ואם ישאנה בדרך זה הי' קשה להוציא בלעם מפיהם ולתקן הניצה\"ק אשר בה, ע\"כ התירה התורה וישאנה בדרך היתר, ועקרה תורה לאיסורה לגמרי."},{"passage_id":"devurim_ef0edda9_p35","passage_content":"וכמ\"ש התוס' במס' קידושין (דף כ\"א ע\"ב) דאע\"ג שמתגיירת בעל כרחה, עשאה הכתוב כגיורת גמורה, ור\"ת ס\"ל דביאה ראשונה מותרת במלחמה לפני שנתגיירה, אלא ביאה שני' אסורה עד שתהא בביתו גיורת, ורש\"י ס\"ל דגם ביאה ראשונה לא הותרה אלא לאחר כל המעשים שנתגיירה וכתבו התוס' דבירושלמי אפליגי בה אמוראי עיי\"ש, אבל לד\"ה לאחר שנתגיירה מותרת, ואע\"ג שמתגיירת בעכ\"ח, ובעלמא לא הוי גירות, אבל ביפ\"ת התירה תורה ועקרה לי' לאיסורה, ומעתה הויא דבר היתר, והניצה\"ק אשר בה אינם קשורים ואסורים בידי החיצונים, ויקל יותר להעלות ניצה\"ק אשר בה ולהוציא בלעם מפיהם."},{"passage_id":"devurim_ef0edda9_p36","passage_content":"וז\"ש רש\"י ז\"ל לא דברה תורה אלא כנגד היצה\"ר, וע\"כ הי' רצון הבוי\"ת שישאנה בהיתר ועקר לאיסורה לגמרי, ולא ישאנה באיסור ר\"ל ע\"י גירות, ובאמת תהי' מותרת עפ\"י הלכה, כי לא נחשדו צדיקים יוצאי צבא לעבור על איסור, אלא שיהי' איסורה גליא כלפי שמיא, ועכ\"פ יהיו הניצה\"ק קשורים ואסורים, וקשה להעלות אותם כנ\"ל, וע\"כ להכרח זה התירה תוה\"ק, כדי שיקל להוציא ניצה\"ק אשר בה, ולפי\"ז מתאים טעמם של חכמי אמת, ויתפרש מאמחז\"ל עד שלא ישאנה באיסור וכו' גם לפי דבריהם וא\"ש."},{"passage_id":"devurim_ef0edda9_p37","passage_content":"ועתה נבוא לבאר פרשת כי תהיין לאיש שתי נשים וגו' והדקדוקים מפורטים לעיל, גם דברי המדרש שבבעה\"ט א' אהובה אלו אומה\"ע וכו' (עיין לעיל), ונקדים דברי הגמ' ברכות (דף י' ע\"א) א\"ל ההוא צדוקי לר' אבהו כתיב (תהלים ג') מזמור לדוד בברחו מפני אבשלום בנו, וכתיב (תהלים נ\"ז) לדוד מכתם בברחו מפני שאול במערה וכו', מכדי מעשה שאול הוי ברישא לכתוב ברישא, א\"ל אתון דלא דרשיתין סמוכין קשיא לכו, אנן דדרשינן סמוכים לא קשיא לן, דא\"ר יוחנן סמוכים מן התורה מנין וכו', למה נסמכה פרשת אבשלום לפרשת גוג ומגוג, שאם יאמר לך אדם כלום יש עבד שמורד ברבו, (פרש\"י ויבוא להכחיש את דברי הנביא שהתנבא על מלחמת גוג ומגוג), אף אתה אמור לו כלום יש בן שמורד באביו, אלא הוה הכא נמי הוה. והקשה הצל\"ח למה הוצרך להביא דמיון מאבשלום, להביא ראי' דאפשר המציאות עבד שמורד ברבו, וכבר מצינו בפרעה שהי' עבד מורד על אדוניו, שאמר מי ד' אשר אשמע בקולו, וכן נמרוד שהמריד את כל העולם כולו על הקב\"ה, ועוד הרבה רשעים, ועוד דקדק מ\"ש בגמ' הכא נמי הוי וקאי על מלחמת גוג ומגוג לפום רהטא דגמ', ועדיין לא הי' והול\"ל הכא נמי עתיד למהוי, ובאמת רש\"י נדחק לפרש ה\"נ הוה סופו להיות, אבל אין משמעות המלה סובל לשון עתיד."},{"passage_id":"devurim_ef0edda9_p38","passage_content":"ותירץ הצל\"ח דתשובתו של פרעה למשה, אינו מורה שהי' סבור להלחם עם ד' בחוזק יד, אבל הי' מאותן האומרים עזב ד' את הארץ, כי אין כבודו להשגיח בשפלים, ולכך מסר עולמו ביד המזלות, והי' בוטח במזלו שהוא טלה ראש המזלות, ואף שהאמת הוא שפרעה מרד ג\"כ מרידה כגוג וכן נמרוד וכו', מ\"מ לא מצינו ראי' ע\"ז בתורה, שיסופר בכתוב אופן מרידתם על זה הדרך, אבל על גוג אמר דוד ורוזנים נוסדו יחד על ד' ועל משיחו, מבואר שנתנבא שיוסדו יחד על ד' כביכול, לנתק מהם מוסרותימו במלחמה ובחוזק יד, ובזה חשש דוד שיאמרו כלום יש עבד שמורד על אדוניו מרידה כזו ויכחישו את נבואתו, ולכך הוצרך להביא דמיון מאבשלום וכו', ומ\"ש הכי נמי הוה לשון עבר, תירץ הצל\"ח דבאמת כבר היו בעולם רשעים כאלה שמרדו כך, כגון פרעה ונמרוד וכיו\"ב עכת\"ד."},{"passage_id":"devurim_ef0edda9_p39","passage_content":"אמנם תירוצו קשה קצת, דמשמעות הלשון מי ד' אשר אשמע בקולו, מורה על מרידה בבוי\"ת כביכול, ולא כאותן האומות שהאמינו בבוי\"ת, אלא שאמרו אין כבודו וכו', וגם לפי קבלת חז\"ל מצינו בדור הפלגה שאמרו נעלה ונעשה מלחמה וכו', ואם באת לחלק ולפרש תשובתו של פרעה שלא ע\"צ המרידה, כמו\"כ אפשר שתתפרש מאמה\"כ נוסדו יחד האמור בגוג ג\"כ ע\"ז הדרך, ואין הכרח בכתוב לחלק ביניהם."},{"passage_id":"devurim_ef0edda9_p40","passage_content":"אמנם יתבאר עפי\"מ שפירשנו (בקונטרס על הגאולה ועל התמורה) דברי המדרש אסתר רבתי עה\"פ ויקראו סופרי המלך וגו', והובא בילקוט (תהלים ב') א\"ר לוי ארורים הרשעים שהם מתעסקים בעצה רעה על ישראל, וכ\"א מהם יועץ לפי דרכו, ואומר עצתי טובה מעצתך, פרעה אמר שוטה הי' עשו וכו', וכן המן התחכם בגזרתו יותר משל פרעה, ואף גוג ומגוג לע\"ל עתיד לומר, שוטים היו הראשונים שהיו מתעסקין עם מלכיהם בעצות על ישראל, ולא היו יודעין שיש להם פטרון בשמים, אני איני עושה כן, אלא הריני מזדווג עם פטרונן תחלה, ואח\"כ אני מזדווג להם, שנאמר יתיצבו מלכי ארץ וגר על ד' ועל משיחו וכו' עכ\"ל, (וכן הוא בזוה\"ק בשלח נ\"ח כרב), וכתב ביפה ענף דלא יתפרש זה כפשוטו, דמי הוא האויל אשר יצא למלחמה נגד ד' וממנ\"פ אם יאמין בהשי\"ת שהוא פטרונן של ישראל, ידע ג\"כ שא\"א ללחום עמו כביכול, ואם לא יאמין למ\"ל להלחם."},{"passage_id":"devurim_ef0edda9_p41","passage_content":"אמנם יתחכמו גוג ומגוג להפריד הדבוק האלקי בין ישראל לאביהם שבשמים, ויבטלו התורה והמצות מישראל, ובזה ינתקו את המוסרות המקשרות את ישראל לאביהם שבשמים, וזה כוונת אומרם שיזדווגו בפטרונם של ישראל, שיתעמלו להדיח את ישראל מתומ\"צ, כדי שלא יציל אותם פטרונם, וכ\"כ בהגהות על מדרש תהלים בשם הגאון רשמ\"י מינץ בן הגאון מהר\"ם פאדוואה זלל\"ה וכו', מבואר מזה דמרידת גוג ומגוג בבוי\"ת, יהי' גדולה מכל רשעי אומות שקדמוהו, ויתחכמו בעצתם להיות עולה על כולנה כמ\"ש שוטה הי' פרעה וכן כולהו."},{"passage_id":"devurim_ef0edda9_p42","passage_content":"ולכוונה הנ\"ל ביארתי דברי הזוה\"ק פ' שמות (דף ז' ע\"ב) שהאריך שם בענין מלחמת גוג ומגוג וז\"ל, וכל מלכין דעלמא יתערון לאתחברא לאגחה קרבא בי', וכמה מפריצי יהודאין יתהפכו לאהדרא לגבייהו, וייתון עמהון לאגחה קרבא על מלכא משיחא, וכו' עכ\"ל, והתפלא גדול א' בדברי הזוה\"ק הרל, דהיתכן שימצאו בישראל אנשים כאלו שילחמו נגד מלך המשיח, ובעוה\"ר אין זו קושיא ואין זו תמי' בדורנו זה, ואנו רואין בחוש שכבר התחילו במלחמתם זו לנתק את ישראל מפטרונן, ולעקור מישראל כל זיק ושורש אמונת אומן בבוי\"ת, ועל דרך זה יהי' מלחמתם של גוג ומגוג כמבואר באסתר רבתי, ובזוה\"ק הנ\"ל, אלא שהמלכות הרשעה וחיילותם, ופריצי ישראל שבדורנו הקדימו לגוג ומגוג, וכל תחבולותיהם לעקירת הדת ר\"ל, וגוזרין גזירות רעות והכל לכוונה זו, ולא היתה כמותם מיום הוסדה הארץ ועד עתה, ועליהם כוונו בזוה\"ק, שיעזרו לגוג ומגוג במלחמתו לנתק את ישראל מפטרונם."},{"passage_id":"devurim_ef0edda9_p43","passage_content":"ונרמז זה בכתוב (תהלים ב') יתיצבו מלכי ארץ ורוזנים נוסדו יחד על ד' ועל משיחו, דלכאורה צ\"ב דבמ\"ש מלכי ארץ כלל כל המלכים אשר עלי ארץ, ומה זה הוסיף לומר ורוזנים נוסדו יחד, ואם כוונת הכתוב על שרי המלוכות, שיתיעצו עם מלכיהם במלחמה זו, הרי כן דרך כל המלכים עם שריהם, שיתיעצו יחדיו בדבר המלחמה, הכי צריך קרא לפרש דבר ההווה וידוע."},{"passage_id":"devurim_ef0edda9_p44","passage_content":"ויובן עפי\"ד הזוה\"ק הנ\"ל, דרוזנים שהזכיר הכתוב, אינם מהמלכי ארץ שהזכיר תחלה, דמלכי ארץ המה ע' אומות, שיש להם מלוכה וממשלה מן השמים, וע' שרי מעלה המושלים עליהם, אבל פריצי ישראל שיצטרפו אליהם, לא כלל הכתוב במלכי ארץ, שאין מלכותם מן השמים אלא בכח הס\"מ, שהעמיד חיילותיו שרי החליפות ושרי הטומאה, ויצטרפו עם חיילותיו של גוג ומגוג, והמה הרוזנים שכוון עליהם הכתוב, ולא נכללו במלכי ארץ, וזשה\"כ יתיצבו מלכי ארץ ורוזנים נוסדו יחד על ד' ועל משיחו, וכבר התחילו במלחמה זו, ועליהם התכוין הזוה\"ק, ועליהם התנבא דוד המלך ע\"ה בהנבאו על מלחמת גוג ומגוג."},{"passage_id":"devurim_ef0edda9_p45","passage_content":"ולדרכנו נבין דברי הגמ' ברכות הנ\"ל, שחשש דוד המע\"ה שמא יאמר אדם כלום יש עבד שמורד ברבו, ויבוא להכחיש דברי הנביא, ואע\"ג דהוה נמרוד ופרעה וכן הרבה רשעים כיו\"ב, אבל יגדל התמי' מה שנרמז בנבואה שימצאו בישראל מורדים כאלו, וז\"ש כלום יש עבד שמורד ברבו, דישראל אפי' באין עושים רצונו של מקום נקראו עכ\"פ עבדים, ולא כן רשעי האומות שלא נקראו עבדים למקום, ומתורץ בזה קושית הצל\"ח, מה שתמה על התמי' דכלום יש עבד שמורד ברבו, והא הוי פרעה וכן נמרוד, אמנם התמי' על ישראל דלא היתה כזו מימות עולם, וחשש דוד שמא יבואו להכחיש דברי הנבואה, ע\"כ נסמכה פרשת אבשלום, ואף אתה אמור לו כלום יש בן שמורד באביו ומרד במלכות בית דוד, הרי שיש מציאות כזו בעוה\"ר גם בישראל, ועי\"ז יאמינו בדברי הנבואה, - ואפשר דמ\"ש בגמ' הכא נמי הוה בלשון עבר, לרמז דבעוה\"ר יתחילו במרידה זו ללחום בפטרונם של ישראל, ולנתק את ישראל מפטרונם עוד לפני מלחמת גוג ומגוג, וז\"ש הכא נמי הוה שכבר היה כן לפני מלחמת גוג ומגוג, וזהו נותן טעם להסביר גם המציאות של זמננו בערה, והגם שרש\"י ז\"ל פי' סופו להיות, לפי שבימיו עדיין לא הי' מציאות שפלות כזו, אבל על זמן מלחמת גוג ומגוג שייך לומר הוה, דיתודע אז ויתגלה לעיני כל, שכבר הוכן ונעשה פעולות למלחמה זו ע\"י פריצי ישראל לנתק את ישראל מפטרונם."},{"passage_id":"devurim_ef0edda9_p46","passage_content":"ואפשר שזה נרמז במאמר המדרש המובא בבעה\"ט כי תהיין לאיש זה הקב\"ה, אחת אהובה אלו העכו\"ם שמראה להם פנים, שנואה אלו ישראל שמסתיר מהם פנים, ביום הנחילו לע\"ל לא יוכל לבכר וגו', כי אם בני בכורי ישראל, ולדרכנו ירמוז אהובה אלו העכו\"ם על פריצי ישראל, כמו שהבאנו (בקונטרס על הגאולה ועל התמורה) דברי הרמב\"ם ז\"ל באגרת תימן, שכל מי שנטה מדרך הדת הנתונה במעמד הר סיני, אינו מזרע ישראל ולא עמדו אבותיו בהר סיני, והרשב\"א ז\"ל כתב (בתשו' מהדו\"ק סי' תי\"ד) על אלו שמוציאין דברי התוה\"ק למינות, שאינם מזרעו של אברהם, ואפי' מזרעו של עשו וישמעאל, רק משדין ולולין וכו', ובארנו שם בכוונת הרשב\"א ז\"ל, שאף שאנו רואין באלו המינים שנולדו מזרע אנשים, ולפעמים גם מבתי הכשרים שבישראל, ונתפסו אח\"כ למינות, והם בדמות וצלם אנשים, אולם העיד הרשב\"א ז\"ל שנתחלף נשמתם בשדין ורוחין ולילין, ולדברי הרמב\"ם בנשמת עכו\"ם."},{"passage_id":"devurim_ef0edda9_p47","passage_content":"ובאמת דברי הרמב\"ם ודברי הרשב\"א ז\"ל מבוארים בזוה\"ק פ' בראשית (דף כ\"ה ע\"א) חמש מינין אינון בערב רב ואנון נפילים וכו', עמלקים, וכתב האור החמה על דברי הזוה\"ק הנ\"ל, דאף באלו הנולדים מזרע ישראל, יתרמי ששורש נשמותיהם מסטרא דעמלק, (ובדף כ\"ז ע\"ב) איתא בזוה\"ק אית ערבוביא (ערב רב) מסטרא דאומי עכו\"ם וכו', ואיתא ערבוביא מסטרא דמזיקין, דנשמתא דחייביא אנון מזיקין דעלמא ממש, ואית ערבוביא דשדים ורוחין ולילין וכולא מעורבבין בישראל וכו'."},{"passage_id":"devurim_ef0edda9_p48","passage_content":"ועל אלו הערב רב ירמוז אהובה, לא שהם באמת אהובים לפני המקום, אלא שלגודל הערבוביא ובלבול המוחות השורר בזמננו אלה, כשרואין הצלחת הרשעים יש שמחשבין ומדמין שהמה האהובים לפני המקום, כמ\"ש הנביא (מלאכי ב') באמרכם כל עושי רע טוב בעיני ד' ובהם הוא חפץ, והשנואה אלו ישראל הכשרים, שלגודל בלבול המוחות יחשבו שהמה שנואים בעיני המקום, - והי' ביום הנחילו לעתיד לבוא כשנזכה אל המנוחה ואל הנחלה, לא יוכל לבכר כו אם בני בכורי ישראל, ויתגלה לעיני כל אהבתו של הקב\"ה אל ישראל, ואלו הערב רב ימחו מן העולם, כמ\"\"ש בזוה\"ק דעלייהו אתמר תמחה את זכר עמלק ומלחמה לד' בעמלק מדר דור."},{"passage_id":"devurim_ef0edda9_p49","passage_content":"או אפ\"ל דירמוז, עפ\"י מה שכתבנו לעיל, עה\"פ וירא ד' כי שנואה לאה, ודרשו חז\"ל ששנואין מעשה עשו בפני' וכו', ובארנו דהפשט והדרש בקנה אחד עולים, דלפי שהיו שנואין מעשה עשו בפני', ע\"כ היתה שנואה בעיני הבריות, דסר מרע משתולל, ומתורץ קושית הגמ\" (ב\"ב קכ\"ג) דאין הכתוב מספר בגנותה, אדרבה זה שבחה שהיתה שנואה לפי ששנואין מעשה עשו בפני' (עיין באריכות בדברינו לעיל) ואלו שאהובים מעשה עשו בעיניהם המה אהובים בעוה\"ז, שמשתווים בדרכי העולם ובדרכי האומות, וע\"ז ירמוז אחת אהובה על ערב רב ופריצי ישראל, שהמה אהובים בעוה\"ז ולא שהקב\"ה אוהבן, ומ\"ש במדרש שהקב\"ה מראה להם פנים, הכונה שלצד הנסיון מצליחים ומראה להם פנים, שנראה כאלו היו אהובים לפני המקום, והשנואים אלו ישראל שהמה שנואים בעיני הבריות, כמ\"ש יראי חטא ימאסו וסר מרע משתולל, - והי' ביום הנחילו לע\"ל, יודע לכל כי בני בכורי ישראל, והמה האהובים לפני המקום באמת."},{"passage_id":"devurim_ef0edda9_p50","passage_content":"ויתבארו דברי הגמ' דסנהדרין הנ\"ל שהתחלנו בו, א\"ר יהודה א\"ר בקש דוד לעבוד ע\"ז שנא' (ש\"ב ט\"ו) ויהי דוד בא עד הראש וגו', א\"ל חושי הארכי מלך שכמותך יעבוד ע\"ז וכו', ולכאורה צ\"ב למה הטעים טענתו לומר מלך שכמותך, ואי לאו מלך, ואם לא יהי' כמותו של דוד, הכי מותר לו לעבוד ע\"ז, ומהו הכוונה באמרו מלך שכמותך."},{"passage_id":"devurim_ef0edda9_p51","passage_content":"ויובן עפימ\"ש המהרש\"א ז\"ל, דמ\"ש בקש דוד לעבוד ע\"ז, הכוונה שביקש לילך ולברוח מפני בנו מא\"י לחו\"ל, דהו\"ל כעוע\"ז, כמ\"ש דוד בהיותו בורח מפני שאול, כי גרשוני היום מהסתפח בנחלת ד' וגו', עכ\"ל המהרש\"א ז\"ל, והנה מבואר בזוה\"ק פ' ויקהל (דף קצ\"ח נרא) שלא בחר ד' בירושלים אלא אי דוד איהו ברישא, ורק כשיש שם מלכות דקדושה, עיי\"ש בפירושא דקרא לא בחרתי בעיר מכל שבטי ישראל ואבחר בדוד (הבאתיו בספרי ויואל משה מ\"ב סי' מ\"ג) נמצא מבואר דרק אז נקרא א\"י נחלת ד', והיוצא מא\"י לחו\"ל נחשב כעוע\"ז, וז\"ש לו חושי הארכי מלך שכמותך, ר\"ל עכשיו שיש בארץ ישראל מלך שכמותך, ודוד איהו רישא, א\"כ אין לך ליצא לחו\"ל דהוי כעובד ע\"ז, ויפה הטעים טענתו באמרו מלך שכמותך, דאל\"ה לא נחשב היוצא ממנה כעוע\"ז כמבואר מתוך דברי הזוה\"ק הנ\"ל."},{"passage_id":"devurim_ef0edda9_p52","passage_content":"והשיב לו דוד מלך שכמותי יהרגנו בנו, מוטב יעבוד ע\"ז ואל יתחלל ש\"ש בפרהסיא וכו' עד א\"ל אמאי לא דרשת סמוכין וכו' ואפשר הכוונה דמאן דדרש סמוכין, בכל התורה דריש, וגם בספר תהלים שכולה ברוה\"ק נאמרה ובכח הנבואה, וז\"ש לו חושי הארכי אלו דרשת סמוכין, הי' נתברר לך שמה שאבשלום רצה להרוג אותך לא יתחלל ש\"ש עי\"ז, ואדרבה עי\"ז יאמינו בדברי הנבואה ובמלחמת גוג ומגוג, כמו שדרשו ז\"ל בגמ' דברכות הנ\"ל דע\"כ נסמכה פרשת אבשלום לפרשת גוג ומגוג כדי שיאמינו שיש עבד שמורד ברבו, וכדפירשנו שהכוונה על פריצי ישראל שיעזרו לגוג ומגוג, ובעוה\"ר בימינו אלה צריך לידע בירור דברים אלו כדי לידע להתרחק מהם ומהמונם עד קצה האחרון, ובזה יבואר הענין קצת."},{"passage_id":"devurim_ef0edda9_p53","passage_content":"ועתה נבאר במה שהתחלנו כי תצא למלחמה על איביך וגו', שהתחיל אויביך לשון רבים, וגמר אומר ונתנו לשון יחיד, ועוד דקדוקים שהבאנו לעיל (בדרוש הקדום), ויתבאר בהקדם מ\"ש האוהחה\"ק (פ' ראה) עה\"פ אבד תאבדון את כל המקומות אשר עבדו שם הגוים אשר אתם יורשים אתם את אלהיהם על ההרים וגו', בהעיר למה הפסיק הכתוב במאמר אשר אתם יורשים אותם, בין זכרון העובדים והנעבדים, שהי' לו לומר על זה הדרך אשר עבדו שם הגוים את אלהיהם וגו' ואח\"כ אשר אתם יורשים אותם, עיי\"ש שפירשו בכמה אופנים, ובדרך רמז יכוין הכתוב לרמוז איבוד לכח הנעלם של ע\"ז, שזה ג\"כ בכח עם בני ישראל, כאשר יתעצמו בתעצומות המעשה הטוב, יאבדו נגלה ונסתר מהם, והוא אמרו כל המקומות אשר עבדו שם, ר\"ל כל מקום שמגעת שם עבודתם שהוא כסא ס\"מ הרשע לעקרו, ובנפילת כח זה יתעצם כח העליון, והי' ד' למלך על כל הארץ עכלה\"ק."},{"passage_id":"devurim_ef0edda9_p54","passage_content":"ואפשר לפרש סיומא דקרא, עפימ\"ש האוהחה\"ק בפ' יתרו עה\"פ לא יהי' לך אלהים אחרים על פני, וז\"ל כי כל ע\"ז שבעולם אין פעולת העובד פועלת הדרגה בנעבד לעשותו אלהים, כאשר תעשנה פעולת איש ישראל, כי נותן כח גדול בבחי' הרע וכו', והוא אומרו לא יהי' לך אלהים, פי' הוי' שלך תעשנו אלהים, וזשה\"כ אשר אתם יורשים אותם אלהיהם, ר'ל הוי' שלך תעשנו אלהים כדברי האוהחה\"ק, ובעוה\"ר בדורנו זה שנכבשו מקומות עם הע\"ז שבתוכם ע\"י ישראל ונעשו ע\"ז של ישראל, ובזה נתחזק כח הס\"מ ר\"ל, ולהיפך ע\"י איבודה של ע\"ז נחלש כח הס\"מ וכל המקומות אשר עבדו שם הגוים ויתעצם כח העליון כנ\"ל."},{"passage_id":"devurim_ef0edda9_p55","passage_content":"ובזה יתבארו הפסוקים, כי תצא למלחמה על איביך, יכוין הכתוב באמרו בלשון רבים לרמוז, שכאשר תעשה מלחמה עם אומה עובדי ע\"ז, תדע שמלחמתך עם אויבים רבים, וכל המקומות אשר עבדו שם הגוים וכל ע\"ז שבעולם, וכאשר תזכה לנצח ולאבד ע\"ז של אומה זו, בזה יחלש כוחה בכל מקום, וגם כח הנסתר שבו כנ\"ל, וז\"ש ונתנו ד' אלקיך בידך לשון יחיד, אע\"פ שלמראית עין לא נכבשה על ידך רק ע\"ז של אומה זו, אבל באמת ושבית שביו, כאשר תתעצם עלי' לאבד אותם, בזה נשבו כל שביו מכל המקומות אשר עבדו שם הגוים כדברי האוהחה\"ק הנ\"ל."},{"passage_id":"devurim_ef0edda9_p56","passage_content":"וזה נרמז בדברי הספרי, אם תעשה כל האמור בענין, ר\"ל להתגבר על איביך ולאבד הע\"ז, לסוף ונתנו ד' אלקיך בידך, והאלילים כרות יכרתון ואת רוח הטומאה יעביר מן הארץ ויתרומם קרן הקדושה, - וזה נרמז במ\"ש הספרי כי תצא למלחמה וגו' כנגד איביך, ור\"ל שמלחמתך באומה זו, היא כנגד כל איביך וכל כוחות הרע, שהויית וקיום כולם תלויים במלחמתך זו, שכאשר תתעצם במלחמה זו לאבדה יחלש כח כולם וח\"ו להיפך ע\"י קיומה, הוי' שלך תעשנו אלהים כנ\"ל."},{"passage_id":"devurim_ef0edda9_p57","passage_content":"ואפ\"ל רמז במשה\"כ כי תצא למלחמה, ולא כתיב כי תלחם, עפי\"מ דאיתא במד\"ר (הובא לעיל) שהי' עצת בלעם ע\"י התחברות, שאמרו כולנו בני איש אחד אנחנו וכו', והמואבים האכילום והשקום ועי\"ז נכשלו ר\"ל, ובעוה\"ר בדורנו היום, עצת היצה\"ר כן להכשיל את ישראל גם מהכשרים שבהם, ע\"י שמסיתם להתחבר עם עושי רשעה ומושלי הציונים, ומטעה אותם לאמר שבהתחבר עמהם, יוכלו ללחום נגד עצתם בעקירת הדת והתוה\"ק, אבל החוש מעיד על ההיפך, דבהתחבר עמהם יסכים לכל תועבותם, ונעשה משוחד להם ע\"י הכבוד והנאה שמקבל על ידיהם ומידם."},{"passage_id":"devurim_ef0edda9_p58","passage_content":"וזה ירמוז הכתוב על מלחמת היצר, כי תצא למלחמה על איביך, כי במלחמה עם אויבי ד' ונגד היצה\"ר וכת דילי', מתנאי המלחמה שתצא מחבורתם, ותתרחק מהם בכל אופני התרחקות, ואז תלחם בהם, וע\"כ לא אמה\"כ כי תלחם, אלא כי תצא, להורות דתנאי המלחמה היא ההתרחקות מהם, וז\"ש בספרי כנגד איביך שתנאי המלחמה שתהי' בהתנגדות עם איביך ולא ע\"י התקרבות והתחברות."},{"passage_id":"devurim_ef0edda9_p59","passage_content":"וז\"ש אם תעשה כל האמור בענין אז ונתנו ד' אלקיך בידך, משא\"כ אם תתחבר לעושי רשעה לא תוכל להם, ולא יתנם ד' בידך, אלא ח\"ו להיפך אתה תנתן בידיהם, אבל אם תעשה כל האמור בענין, ותצא למלחמה ותתרחק מהם ותלחום על כוחות הרע, אז יתקיים ונתנו ד' אלקיך בידך, וכל הרשעה כולה כעשן תכלה כי תעביר ממשלת זדון מן הארץ והי' ד' למלך על כל הארץ בב\"א, ונזכה במהרה לקבל פני משיח צדקנו בהתרוממות קרן התורה וישראל, ובהתגלות כבוד שמים עלינו בב\"א."},{"passage_id":"devurim_ef0edda9_p60","passage_content":"R"}]}]
