[{"dvar_torah_id":"vayikru1_95ba86ab","title":"","summary":"","contents":[{"passage_id":"vayikru1_95ba86ab_p1","passage_content":"פתיחה לתלמידי הישיבה תשכ\"ג"}]},{"dvar_torah_id":"vayikru1_9f46dc0d","title":"תורת המצורע וקדושת התורה","summary":"במאמר זה נדונה חשיבות כבוד אב ואם ורבו, והקשר בין לימוד תורה להתנהגות ראויה. יש להקפיד על נימוס ודיבור נאה, כדי לקדש שם שמים ולמנוע חילול כבוד התורה. עיקר תכלית התורה היא בהוויה ובקיום מעשית.","contents":[{"passage_id":"vayikru1_9f46dc0d_p1","passage_content":"וידבר ה' אל משה לאמר זאת תהי' תורת המצורע ביום טהרתו וגו'. בילקוט (רמז תקנ\"ט והוא במנחות דף ה' ע''א) איתא זאת תהיה תורת המצורע תהי' בהוייתה תהא, וצ\"ב."},{"passage_id":"vayikru1_9f46dc0d_p2","passage_content":"ב) בגמרא (ברכות י''ז ע''א) איתא מרגלא בפומיה דרבא תכלית חכמה תשובה ומעשים טובים שלא יהא אדם קורא ושונה ובועט באביו ובאמו וברבו ובמי שהוא גדול ממנו בחכמה ובמנין. והקשה המהרש''א ז''ל דאמאי נקט הני עבירות דוקא, ותירץ דגם בעושה מעשים רעים אחרים קרי ליה בועט באביו ורבו, כמ\"ש ביומא (דף פ''ו ע''א) מי שקורא ושונה ומשמש ת''ח ואין משאו ומתנו באמונה ואין דבורו בנחת עם הבריות מה הבריות אומרות עליו אוי לו לפלוני שלמד תורה אוי לו לאביו שלמדו תורה אוי לו לרבו שלמדו תורה ראו כמה מקולקלים מעשיו וכמה מכוערין דרכיו וכו'. ובזה מובן, שבכל מעשה רע שהוא עושה הריהו גורם שיהיו הבריות מזלזלים בכבוד אביו ורבו שטיפחוהו וריבוהו, באמור להם ראו גידולים שגידלתם, וז''ש הגמ' שלא יהא קורא ושונה ובועט באביו וברבו, כלומר שבמעשיו המכוערים ובדרכיו המקולקלים הריהו כבועט באביו וברבו, זה תוכן דברי המהרש\"א ז\"ל. אמנם אכתי לא מצאנו נייחא ומנוחה בפירושו, דכיצד יפרנס הא דקאמר בגמ' ובועט וכו' במי שגדול ממנו בחכמה ובמנין, והרי לפי דבריו לא מיירי הכא כלל במי שמעיז פנים לאביו ולרבו, אלא שע\"י מעשיו הרעים הוא גורם שיקילו בכבודם, ומה שייך לומר כן במי שגדול ממנו בחכמה ובמנין, והרי הם לא למדוהו תורה, ולא עמלו בו ולא גידלוהו, ומה להם ולו, שיהיו המה לשיחה בתי הבריות בעבור מעשיו הרעים של אותו תלמיד שסרח, הלא אין לשות אשם בעבור כך אלא על אביו ורבו."},{"passage_id":"vayikru1_9f46dc0d_p3","passage_content":"ג) במסכת קידושין (דף ל''א ע\"א) איתא דריש עולא רבה אפיתחא דבי נשיאה מאי דכתיב יודוך ה' כל מלכי ארץ כי שמעו אמרי פיך (תהלים קל\"ט) מאמר פיך לא נאמר אלא אמרי פיך בשעה שאמר הקב\"ה אנכי ולא יהי' לך אמרו אומות העולם לכבוד עצמו הוא דורש כיון שאמר כבד את אביך ואת אמך חזרו והודו למאמרות הראשונות בבא אמר מהכא ראש דברך אמת (תהלים קי''ט) ראש דברך ולא סוף דברך (בתמיה) אלא מסוף דברך ניכר שראש דברך אמת, ע\"כ. וצריך ביאור להבין דכיון שאוה\"ע הרחיבו פיהם לדבר סרה על ה', כי לכבוד עצמו הוא דורש, א\"כ היו מפקפקים באמונה בכללותה, ואב למה חזרו והודו לדברות הראשונות, אחר ששמעו מאמר כבד את אביך ואת אמך, וכי בעבור שיש תועלת בדיבור א', ורב טוב צפון במצות כבוד אב ואם, כבר סרו הפקפוקים והקושיות שהיו להם בתחלה. עוד יל\"ד מה דנקטו בלשונם לכבוד עצמו הוא דורש, הו''ל לכבוד עצמו הוא אומר, כלישנא דקרא \"אמרי\" פיך."},{"passage_id":"vayikru1_9f46dc0d_p4","passage_content":"ד) בגמרא (שבת ל''א סע\"א) איתא אמר רבה בר רב הונא כל אדם שיש בו תורה ואין בו יראת שמים דומה לגזבר שמסרו לו מפתחות הפנימיות ומפתחות החיצוניות לא מסרו לו בהי עייל (פירש\"י באיזה פתח נכנס לפתוח את הפנימיים) מכריז ר' ינאי חבל על דלית ליה דרתא ותרעא לדרתא עביד (ופירש\"י (ביומא ע\"ב ע\"א) שהתורה אינה אלא שער להכנס בה ליראת שמים לכך צריך שתקדום לו יראת שמים) והקשה הרי\"ף בעין יעקב וז\"ל, ויש לדקדק דמשמע דהיראה היא מפתח החיצון, והכתוב אומר יראת ה' היא אוצרו (ישעי' ל''ג). ועוד קשה שמכריז ר' ינאי ההיפך מזה, דאמר חבל על מאן דלית ליה דרתא ותרעא לדרתא עביד, דהיראה היא בית, וקרא לחכמה פחח, ודוחק לומר דפליגי, ועיי''ש מה שתירץ לפי דרכו (ועי' בדברינו פ' לך עמוד רס\"ג ובפ' שמות עמוד פ''ט מ''ש בזה)."},{"passage_id":"vayikru1_9f46dc0d_p5","passage_content":"ונראה לבאר הענין עפ\"י מה דאיתא בגמ' יבמות (דף ו' ע\"א) יכול יתיירא אדם מן המקדש ת''ל את שבתותי תשמורו ואת מקדשי תיראו נאמרה שמירה בשבת ונאמרה מורא במקדש מה שמירה האמורה בשבת לא משבת אתה מתיירא אלא ממי שהזהיר על השבת אף מורא האמורה במקדש לא ממקדש אתה מתיירא אלא ממי שהזהיר על המקדש. וכתבו התוס' שם בד\"ה יכול וז\"ל, גבי אביו לא הוצרך לומר כן דפשיטא שלא ישתחוה לו לשם אלהות אבל גבי המקדש איצטריך משום דהוי דבר שבקדושה וכו', ע''כ. ואינו מובן שהרי מהות המורא שצריך הבן להתיירא מאביו מבואר במס' קידושין (דף ל''א ע\"ב) ובשו\"ע יו\"ד סימן ר''מ איזהו מורא שלא יעמוד במקומו המיוחד לו ולא סותר את דבריו, ואין לכ''ז שום דמיון למשתחוה לשם אלהות ח\"ו, ומה היתה ההו\"א בדברי התוס'. והרי\"ף והעיון יעקב נדחקו בפירוש דברי התוס'."},{"passage_id":"vayikru1_9f46dc0d_p6","passage_content":"ואמרתי לבאר כוונת התוס', דהנה בגמ' שבת (דף רו ע\"א) אמרינן אוריה החתי מורד במלכות הוה שאמר ואדוני יואב (שמואל ב' י\"א), ופירש''י דלאו אורח ארעא לקבל עליו מרות אחרים בפני המלך, והתוס' (שם ד\"ה דאמר) כתבו דאין נראה להם פירש''י ז\"ל דאין זה מרד שלא היה בלבו להמליכו ולקרותו מלך אלא כמו שפירש רבינו מאיר דהוה מורד משום דבסיפיה דקרא כתיב ואני אבא אל ביתי וגו' שדוד צוה לו לעשות ולא רצה לעשות, עכ''ד התוס'. וכ\"כ התוס' בקידושין (דף מ''ג ע\"א ד\"ה מורד במלכות) בשם רבינו מאיר אביו של ר\"ת שאמר לו דוד שילך לביתו לאכול ולשתות והוא מיאן בדבר כדכתיב וכל עבדי אדוני על פני השדה חונים ואני אבוא אל ביתי וגו' בתמיה ולא היה לו לסרב, ע\"כ. אמנם התוס' ביומא (דף ס\"ו ע\"ב ד\"ה מהו) הסכימו לפירש''י דלהכי הוי אוריה מורד במלכות שקרא ליואב אדוני בפני המלך, וביארו התוס' שם דדבר זה אם הוי אוריה מורד במלכות משום שקרא ליואב אדוני בפני המלך או לא, פלוגתא היא בפ' יש נוחלין (קי''ט ע\"ב) אם חולקין כבוד לתלמיד במקום הרב או לא, דאי אמרינן חולקין כבוד לתלמיד במקום הרב, אין בכך מרידה במלכות, במה שחלק כבוד ליואב בפני דוד, עכ\"ד התוס'. והנה שם בפ' יש נוחלין מסקנת הגמ' הלכתא חולקין כבוד לתלמיד במקום הרב היכא דפליג לי' רבי' יקרא, דאז ניחא לי' שגם אחרים יחלקו לו כבוד, והיכא דלא פליג ליה רביה יקרא אין חולקין. היוצא מזה כי חלוקת כבוד לתלמיד במקום הרב, הויא מרידה בכבוד הרב, זולת אם הרב בעצמו חולק לו כבוד ויקר."},{"passage_id":"vayikru1_9f46dc0d_p7","passage_content":"ובזה תתבאר כוונת התוספות יבמות הנ\"ל, דהנה אם חולקין כבוד לאב ואם מצד עצמת הויא כמרידה במלכות שמים, והוי כעובד ע\"ז, כאשר ביארתי בספרי (ויואל משה סי' קמ\"ו) שהרי הקב\"ה מלא כל הארץ כבודו ובכל מקום הויא בפניו, ואין חולקין כבוד לתלמיד במקום הרב. ועל כן כתבו התוס' דפשיטא שלא ישתחוה לאביו לשם אלהות, פירוש שלא יחלוק לו כבוד ויירא מפניו מצד עצמו, כי אם מחמת שהקב''ה צוה לכבדם הריהו מכבדם לעשות רצונו יתברך. וזה הוא דומה להיכא דפליג ליה רביה יקרא דשרי, משום דמסתמא ניחא ליה במה שאחרים מכבדים אותו, וכ''ש הכא שהקב\"ה צוה לכבדם. אמנם במורא המקדש היה מקום לחשוש, פן יבואו לטעות שצריך להתיירא מן המקדש מצד עצמו, מחמת שהוא דבר שבקדושה, על כן איצטריך להזהיר שלא יתיירא מן המקדש אלא ממי שצוה עליו, וממילא אחר שמיעט הכתוב שלא יתיירא מן המקדש, המתיירא מן המקדש מחמת עצם קדושתו ולא מחמת ציווי הבוי''ת, הריהו כעובד ע\"ז, כאשר כתבו התוס' באביו, כי צריך להתיירא מפניו ולכבדו בעבור צווי הבוי\"ת, ולא בכוונה אחרת ח\"ו, כי הבוי\"ת הוא יחיד ומיוחד בתכלית היחוד במורא ובכבוד ואין לתא כבודו לאחר ח\"ו."},{"passage_id":"vayikru1_9f46dc0d_p8","passage_content":"והנה ידוע מה שחקרו הקדמונים כיצד יוכל האדם להשיג השפעה אלקית ולהתקרב אל הקב\"ה ע\"י לימוד דיני ממונות, שור שנגח את הפרה וכדומה, והלא כיון שהוא עוסק בדברים גשמיים גם נפשו דבוקה בהם לכאורה, ובמה יושפע עליו אור הקדושה, וביאר המהר\"ל מפראג ז''ל דכיון שהוא לומד הלכות אלו כדי להשיג רצון השי''ת, ע''י שידע דיני המשפטים נמצא כי שכלו ונפשו דבוקים בהשכלת רצון ה', וזהו המביא אותו להתקרב אל השי''ת ולדבקה בו."},{"passage_id":"vayikru1_9f46dc0d_p9","passage_content":"ועל פי זה יש לחוש פן אמור יאמר הת''ח העוסק בתורה, הלא כל ישעי וחפצי בלימוד התוה''ק הוא להשיג ולדעת רצון הבוי''ת, ואם כן נפשי דבוקה באור החיים, ואיך מותר לי לחלוק כבוד לאבי ולאמי או לרבי ולמי שגדול ממני בחכמה ובמנין, הרי אני כחולק כבוד לתלמיד בפני הרב, וכמורד במלכות שמים. על כן להוציא מטעות זו אמר רבא שלא יהא אדם קורא ושונה, וע''י לימודו יבא להיות בועט באביו וברבו ובמי שגדול ממנו בחכמה ובמנין, ונקט דוקא הני עבירות, כי בשאר עבירות אין לחוש שיבא לטעות בהם מחמת עסק התורה, כיון שכל עצמו הוא עוסק בתורה לשמור ולעשות ולקיים, פשיטא שלא יביאהו לימוד התורה לידי עבירה. אבל בענין חלוקת כבוד לאביו ואמו ולרבו ולמי שגדול ממנו בחכמה ובמנין, יש מקום לחשוש שע''י עסק התורה יטעה לומר הלא נפשי דבוקה במושכלות ושויתי ה' לנגדי תמיד, וכיצד אחלוק כבוד לבשר ודם בפני הקב''ה, הלא כמורד במלכות שמים אחשב, על כן הוה מרגלא בפומיה דרבא להזהיר על כך, כי דיעה זו בטעות יסודה, דאין בכך משום אין חולקין כבוד לתלמיד במקום הרב, ואדרבה כיון שרצון הבוי''ת הוא שנכבדם, עושים נחת רוח לפניו במה שמכבדים אותם, בעבור כי כן צוה לנו המלך מ''ה הקב''ה. ולכן חובה כפולה מוטלת על כל מי שעוסק בתורה לכבד את אביו ואמו ורבו וכל מי שגדול ממנו בחכמה ובמנין, ולא יהא בועט בהם ח''ו, כי בכך הרי הוא מבזה כבוד התורה, ומשניא את התוה''ק על הבריות. וגם יהא דבורו בנחת עם הבריות, ואם אינו עושה כן הרי הוא מחלל ש''ש. וכל בר בי רב צריך להרבות כבוד שמים, בהראותו גלוי לכל העמים כמה נאים ומתוקנים המה דרכיו של הת\"ח העוסק בתורה."},{"passage_id":"vayikru1_9f46dc0d_p10","passage_content":"ובדרך זו נלך לפרש מאמר הגמרא קידושין הנ''ל (קושיא ג') שאמרו אומות העולם לכבוד עצמו הוא דורש, כי הנה תיבת דורש פירושה לפעמים תובע, כמאה\"כ (מיכה ו') ומה ה' דורש ממך וגו'. והנה אומות העולם בשמעם אנכי ולא יהי' לך, חשבו בתחלה כי מאחר שהשי''ת צוה על יחודו ואחדותו, ושלא יתנו כבודו לאחר ותהלתו לפסילים, משום שהנותן כבוד לאחר בפני הקב\"ה הוי כמורד במלכות שמים, א''כ אף לאביו ולאמו ולרבו וכו' אין לחלוק כבוד, שהרי הקב''ה דורש ותובע רק כבוד עצמו, ולפיכך לא רצו האומות להצדיק ב' הדברות הראשונות, כי אמרו שאם לא יחלקו כבוד לאב ואם ולרב ולמי שגדול בחכמה ובמנין, לא יהי' קיום לחורה, כי אם יהי' אדם בועט באביו ובאמו וברבו ובמי שגדול ממנו, יתחלל ש''ש על ידו, וישניא את התורה בעיני הבריות, ונמצא שלא יהי' ח''ו קיום לכבוד שמים בעולם, וכיצד יתקיימו הדברות אנכי ולא יהי' לך. אמנם כיון ששמעו כבד את אביך ואת אמך, אז חזרו והודו לדברות הראשונות, כי מכיון שהקב''ה הזהיר גם על כבוד אב ואם, יהי' קידוש שם שמים בעולם והתורה תהא אהובה על הבריות, ויהי' קיום גם לדברות הראשונות. ובזה יבוארו דברי רבא דאמר מסוף דברך ניכר שראש דברך אמת, דהנה הרמב\"ן ז''ל כתב בפ' וישלח עה\"פ קטנתי מכל החסדים ומכל האמת, דאמת שייך לומר על דבר המתקיים, וז''ש מסוף דברך היא מצות כבוד אב ואם, ניכר שראש דברך מצות אנכי ולא יהי' לך היא אמת, כלומר דבר שיש לו קיום, שע''י מצות כבוד א''א יהי' קידוש ש''ש בעולם, ותתקיים האמונה."},{"passage_id":"vayikru1_9f46dc0d_p11","passage_content":"ועתה נבוא לבאר דברי הגמרא שבת (קושיא ד') דמעיקרא קאמר שהתורה היא המפתח הפנימי והיראה המפתח החיצוני, והדר קאמר להיפך שהיראה היא הבית והתורה שער הבית. ונראה עפ''י מה שפירשנו מאמר הגמרא (ברכות ח' ע''א) אמר ליה רבא לרפרם בר פפא לימא לן מר מהני מילי מעליותא דאמרת לן משמיה דר' חסדא במילי דבי כנישתא א''ל הכי אמר ר' חסדא מאי דכתיב (תהלים פ''ז) אוהב ה' שערי ציון מכל משכנות יעקב אוהב ה' שערים המצויינים בהלכה יותר מבתי כנסיות ובתי מדרשות. ולכאורה צריך ביאור דרבא שאל מיניה דרפרם שיאמר לו מילי מעליותא דבי כנישתא, והוא השיב אמריו לו כי איכא דעדיף מיניה והם השערים המצויינים בהלכה, שהם אהובים לפני המקום יותר מבתי כנסיות ובתי מדרשות, וא''כ לא אמר לו מילי מעליותא דבי כנישתא, אדרבה הך מילתא הויא גריעותא לבי כנישתא. ונראה כי הנה בזמן שישראל יושבים ועוסקים בתורה בבתי מדרשות השכינה שרויה ביניהם כאמרם ז''ל (אבות פ''ג מ''ה), ואמרינן בסנהדרין (ל''ט ע''א) כל בי עשרה שכינא שריא. ולכאורה לפי זה נמצא כי בזמן שיוצאין העשרה מביהמ''ד וכל איש לדרכו פונה הוי כחורבן ביהמ''ד בכל יום, שמסתלקת קדושת השכינה ממנו, ואנן קיימא לן מעלין בקדש ואין מורידין (יומא י\"ב ע\"ב), וכיצד ניתן להשמר מכך שלא תהי' הורדה לקדושת ביהמ\"ד, והרי לא יתכן להיות בכל עת בביהמ''ד, ובהכרח לצאת משם מדי פעם. אמנם הנה תכלית ישיבת בתי כנסיות ומדרשות היא, שע''י שילמוד תורה במחשבות טהורות והוא נקי מחטא ומחשבתו דבוקה בלימוד התורה, נעשה הקשר אמיץ, וגם בצאתו משם ומתהלך בחוץ בשוקים וברחובות, או בשבתו בביתו, יהא ניכר עליו שלמד תורה, כי מעשיו יוכיחו עליו אם יתנהג כתורה וכהלכה בכל עניניו, וכל רואיו יכירו ויודו כי התורה שלמד מישרת אורחותיו, ומדריכתו ללכת בדרך טובים וארחות צדיקים לשמור, ואם כך יעשה אין ביציאתו מביהמד''ר הורדה לקדושתו, אדרבה מעלה יתירה היא לביהמ\"ד, כי בכל עת ובכל מקום ניכרת השפעת התורה שלמד בביהמ''ד."},{"passage_id":"vayikru1_9f46dc0d_p12","passage_content":"וזה יש לפרש בדברי הגמרא, כי נשאל רפרם לומר מהני מילי \"מעליותא\" דבי כנישתא, כלומר דהוי תמהין ושיילין ליה כיצד יתכן לעשות עליה תמידית לקדושת בית המדרש, ולא תהי' לקדושה זו נפילה עולמית, והרי בצאתו את הקדש מסתלקת הקדושה משם, וירידה היא לקדושתו, ועל כך שפיר השיב להם כי אוהב ה' שערים המצויינים בהלכה מכל משכנות יעקב, כלומר כי לא נפלאת ולא רחוקה היא להחזיק קדושת ביהכ\"נ וביהמ''ד בעליה תמידית, שלא תמוט עולם ועד, כי בזמן שלומדי תורה מצויינים במעשיהם, שכל תהלוכותיהם מצויינות בהלכה בכל מקום שהם פונים, קדושת ביהמ\"ד קביעא וקיימא, ואין לה ירידה אדרבה עליה יש לה."},{"passage_id":"vayikru1_9f46dc0d_p13","passage_content":"ובזה יתבארו היטב דברי ר' ינאי שהכריז חבל מל דלית ליה דרתא ותרעא לדרתא עבד, דהנה בית הכנסת ובית המדרש אין נחשבים כבית דירה כדקיי\"ל (עירובין נ\"ה ע''ב שו''ע או\"ח שצ\"ח סעיף ו') לענין עירוב. והנה ידוע מ''ש בספה''ק סידורו של שבת לפרש הכתוב (במדבר ה') ואיש את קדשיו לו יהיו, דעיקר האדם הוא הנפש, אבל הגוף הוא רק כמלבוש אל הנפש, כמבואר בזוה''ק (פ' יתרו דף ע\"ה סע\"ב ועי' זה''ק פ' בראשית כ' ע\"ב) עה\"פ עור ובשר תלבישני וגו' (איוב י') אי הכי האדם מהו אי תימא דאינו אלא עור ובשר ועצמות וגידים לאו הכי הוא דהא ודאי האדם לאו איהו אלא נשמתא ואילין דקאמר עור ובשר עצמות וגידים כלהו לא הוו אלא מלבושא בלחודוי מאנין אינון דבר נש ולאו אינון אדם. ולפי זה נמצא כי כל מה שהאדם עושה לצורך הנפש הרי הוא שלו, כי עשהו לצורך עצמו, אבל הדברים שעושה לצורך גופו אינם קרויים שלו, כי משאם רק לצורך מלבושו הוא הגוף, וז\"פ הפ' ואיש את קדשיו, היינו דברים שבקדושה שהוא עושה, לו דייקא יהיו. שהם בלבד נקראים שלו, עכת''ד ז\"ל."},{"passage_id":"vayikru1_9f46dc0d_p14","passage_content":"היוצא מזה כי האיש אשר עוסק בביתו בצרכי גופו באכילה ושתיה ושאר דברים גשמיים שהם לצורך הגוף, אין הבית קרוי שלו, כי נשמתו שהיא האדם אין לה בית כלל. אכן בזמן שהוא ממשיך אל ביתו קדושת ביהמ''ד, ומתנהג גם בענינים גשמיים עפ\"י התורה, והוא מצויין בהלכות שלמד בביהמ\"ד, אזי הבית קרוי שלו, כי יש בו תועלת לנשמתו."},{"passage_id":"vayikru1_9f46dc0d_p15","passage_content":"והיינו דקאמר ר' ינאי חבל על דלית ליה דרתא. כלומר שאינו מתנהג בתהלוכות ביתו כתורה וכהלכה, שאז אין ביתו שלו, שהרי הוא רק מקום דירת גופו, ונשמתו לא מצאה בה מנוח, ונמצא שאין לנשמתו שהיא האדם עצמו בית דירה כלל, שהרי ביתו אינו ברשותו, וגם ביהמ\"ד לא יחשב למקום דירה. כמו שנתבאר. וז\"ש דלית ליה דרתא, היינו מדור לנשמתו, ותרעא לדרתא עבד, כלומר שהוא לומר תורה בביהמ''ד הקרוי בית שער, כי זה השער לה' שבו יקנה האדם קנין הקדושה בנפשו, וימשיך משם את ההשפעה לביתו, ובזה יעשה ביתו שלו, כי גם בהתעסקו בעניניו הגשמיים חזותו מוכחת עליו כי למד תורה, וביתו שלו הוא מעון לנשמתו. אך זה האיש שלא זכה להמשיך קדושת ביהמ\"ד אל תוך ביתו, מתאונן עליו ר' ינאי כי חבל על שעשה שער לביתו בתורה שלמד בביהמ''ד, ואל הבית עצמו לא זכה, משום שאינו עוסק בביתו בצרכי נשמתו ואין הבית שלו."},{"passage_id":"vayikru1_9f46dc0d_p16","passage_content":"ובזה אתי שפיר, דאין סתירה בין מה שהכריז ר' ינאי שהתורה היא שער ליראת שמים, לבין הא דאמר רב הונא התם מי שיש לו תורה ויראת שמיה דומה לגזבר שמסרו לו מפתחות הפנימיות ומפתחות החיצוניות לא מסרו לו, הרי שהמשיל את התורה למפתח הפנימי והיראה לחיצוני. והשתא לק\"מ, דר' הונא מיירי בלימוד התורה בביהמ\"ד שהיא מקום התורה, שם היראה היא המפתח החיצון להכנס על ידה אל התורה, אבל ר' ינאי מיירי בשבת האדם בביתו, שאינו מקום המיוחד לתורה בלבד, אלא עוסקים שם בדברים גשמיים, על כן שייך שפיר לקרות את התורה תרעא, כי היא השער והפתח לקנות לו בית דירה לצרכי נשמתו, ע''י שיתנהג כראוי בביתו, ויהי' מקושר בכל עניניו עם התורה שלמד בביהמ''ד."},{"passage_id":"vayikru1_9f46dc0d_p17","passage_content":"ועתה נחזור לבאר דברי הגמר' המוצגים בראש הדרוש, במאה\"כ זאת תהי' תורת המצורע תהי' בהויותה תהא, ואפ''ל כי בא לרמוז על הכוונה המבוארת לעיל בדברינו, כי עיקר תכלית התורה היא אם גם בביתו הוא מתנהג על פיה בכל דרכיו ומעשיו, כי רק באופן זה יש קיום והויה לתורה שלמד בבית המדרש, משא\"כ אם בצאתו חוץ לכתלי ביהמ''ד אינו מתנהג על פי ההלכה, אזי הורדה היא לקדושת בית המדרש, שהרי אין קיום לתורה זו."},{"passage_id":"vayikru1_9f46dc0d_p18","passage_content":"וזה רמוז בדברי הכתוב זאת תהי' תורת המצורע, הוא האדם המנוגע בתחלואי הנפש, ביום טהרתו שהוא בא ליטהר ולעשות תשובה, תנאי הוא הדבר \"תהיה'' בהוייתה תהא, כלומר שיעשה הויה וקיום לתורתו ע''י שיתנהג בביתו ובכל מקום בואו עפ''י התורה שלמד."},{"passage_id":"vayikru1_9f46dc0d_p19","passage_content":"כללא דמילתא צריכים להיות מקושרים בתורה שלומדים בביהמ\"ד, וע\"י כך ממשיכים קדושת ביהמ''ד על ההתנהגות מחוץ לכותלי בית המדרש. וחייב כל אחד לייגע עצמו להבין דברי הגמרא והתוס' על בוריין, ולא סגי במה ששפתיו ימללו דברי התוספות, כי אם לבו בל עמו, והוא בער ולא מבין, אין תועלת בלימוד זה, ועלול הוא להשאר ע''ה, אלא עליו לתת לב להבין קושית התוס' ותירוצם, עד שיהיו הדברים מיושבים על לבו, ויבואו כמים בקרבו וכשמן בעצמותיו. גם יש צורך להזהיר שתתנהגו בנחת עם הבריות, ויהיו כל מעשיכם בנחת ובנימוס וד''א, כי בלא''ה הרי משניאים את התוה\"ק ומשפילים כבודה ח''ו, והבריות מה אומרים אוי לו למי שגדלו, וביותר צריך להזהר בכך בזמנינו זה שהושפל כבוד התורה וכבוד שמים עד מאד, ע''כ צריכים לקדש ש\"ש במעשים ובהתנהגות, כדי שיכירו ויודו כי זרע בירך ה' המה, ישראל אשר בך אתפאר, ואז תתקיים התורה הקדושה בכם לעד לעולם. וצריך לכבד ולשמוע למי שמדריך ומסייע ללימוד התוה\"ק, כדתנן במתניתין (אבות פ\"ו מ\"ג) הלומד מחבירו פרק אחד וכו'. והבוכ''ע יעזור שנזכה לראות דור ישרים יבורך עמוסים בתורה וביראת שמים, ונהי' דבוקים בה' ובתורתו הקדושה, ונזכה כולנו לגאולה שלמה ולהתרוממות קרן התורה וישראל ולקבל פני משיח צדקנו בב''א."}]},{"dvar_torah_id":"vayikru1_5a72701b","title":"","summary":"","contents":[{"passage_id":"vayikru1_5a72701b_p1","passage_content":"זאת תהי' תורת המצורע וגו' במד\"ר (פט\"ז ב') איתא הה\"ד (תהלים ל\"ד) מי האיש החפץ חיים וגו', מעשה ברוכל אחד שהיה מחזיר בעיירות שהיו סמוכות לציפורי והיה מכריז ואומר מאן בעי למזבן סם חיים וכו', ר' ינאי יתיב וכו' שמעיה דמכריז מאן בעי סם חיים, א''ל תא סק להכי זבין לי וכו', הוציא לו ספר תהלים הראה לו פסוק מי האיש החפץ חיים מה כתיב בתריה נצור לשונך מרע סור מרע ועשה טוב א\"ר ינאי אף שלמה מכריז ואומר שומר פיו ולשונו שומר מצרות נפשו. א\"ר ינאי כל ימי הייתי קורא הפסוק הזה ולא הייתי יודע היכן הוא פשוט, עד שבא רוכל זה והודיע מי האיש החפץ חיים וכו', ע''כ."}]},{"dvar_torah_id":"vayikru1_258518d1","title":"חובת הזהירות בלשון הרע","summary":"בדרכי הזהירות מלשון הרע, יש להבחין בין הצורך להוכיח את הרשעים לבין שמירת הלשון. ר' ינאי למד כי יש לשמור על פינו מלהתבטא רעה, אך חובה עלינו להתריע על מעשי הרשעים, ולא לשתוק למול פגיעותיהם.","contents":[{"passage_id":"vayikru1_258518d1_p1","passage_content":"והדקדוקים רבו בדברי המדרש, חדא מה שהכריז אותו רוכל מאן בעי \"למזבן\" סמא דחיי קשה, שאין נופל לשון מכר וקנין אלא בדבר הנקנה בכסף ולא בדברי תוכחה. גם צ''ב מה נתחדש לו לר' ינאי בשמעו הכרזת הרוכל, עד שאמר כל ימי הייתי קורא מקרא זה ולא הייתי יודע היכן הוא פשוט. עוד יל\"ד בדברי הכתוב מי האיש החפץ חיים וגו'. מדוע הוצרך הכתוב להקדים מי האיש החפץ חיים וגו', הלא עיקר כוונת הכתוב להזהיר על איסור לשון הרע, וסגי ליה לכתוב נצור לשונך מרע ושפתיך מדבר מרמה, ואין זה דרך המקראות בכל מקום להקדים ולהודיע טוב המצוה והאושר המושג על ידי קיומה, והירא דבר ה' מבין מדעתו כי מצוות ה' מביאות חיים לעושיהם, וכל רעה אליהם לא תאונה. עוד צ\"ב בדברי הכתוב נצור לשונך וגו' ושפתיך מדבר מרמה, למה שינה הכתוב דבריו, דמעיקרא כתיב \"לשונך'' והדר \"שפתיך'', משמע דתרי מילי נינהו. וכמו כן יל''ד במקרא שהביא ר' ינאי ראיה ממנו שומר פיו ולשונו, מדוע כתיב תרתי פה ולשון."},{"passage_id":"vayikru1_258518d1_p2","passage_content":"ב) בגמרא (ע''ז י''ט ע''ב) איתא כעין עובדא זו וז''ל, מכריז ר' אלכסנדרי מאן בעי חיי מאן בעי חיי כנוף ואתו כולי עלמא לגביה אמרו ליה הב לן חיי אמר להו מי האיש החפץ חיים וגו' נצור לשונך מרע שמא יאמר אדם נצרתי לשוני מרע אלך ואתגרה בשינה ת''ל סור מרע ועשה טוב אין טוב אלא תורה וכו' ע\"כ. וגם במאמר זה יש לדקדק כנ''ל בדברי המדרש. וביותר תמוה מה שמסיים בגמרא שמא יאמר אדם נצרתי לשוני מרע אלך ואתגרה בשינה, האם משום שהוא מנוקה מעוון לשון הרע הוה אמינא שנעשה חפשי מן המצוות, והותרה לו הרצועה לילך ולהתגרות בשינה. והנה כל המפרשים האריכו למעניתם איש לפי דרכו בביאור מאמרים הללו, וגם אני חלקי אמרה נפשי לבארם בעזהי\"ת."},{"passage_id":"vayikru1_258518d1_p3","passage_content":"ויתבאר עפ''י הקדמה אחת, והוא דהנה ידוע כמה הפליגו חז''ל בחומר איסור לשון הרע, עד שאמרו (ערכין ט\"ו ע\"ב) כל המספר לשה''ר מגדיל עוונות כנגד שלש עבירות ע''ז וגילוי עריות ושפיכות דמים. ושם איתא סיפר לה''ר אין לו תקנה שכבר כרתו דוד ברוה\"ק וכו'. אמנם כשם שמחובת האדם לשמור עצמו מחטוא בלשונו, כמו כן לאידך גיסא מוטלת עליו החובה למחות על פרצות הדור, ולדבר בלשונו במקום שהדבר נוגע לכבוד המקום, ולא ישים מחסום לפיו בעוד רשע לנגדו, אלא יגלה החוטאים למען ידעו להשמר מהם ולא ילכדו ברשתם. ומי שמחניף לרשעים ומכסה על פשעיהם, קורא אני עליו את המקרא הזה חבר הוא לאיש משחית. והוא עפ\"י מה שאמרו ז\"ל (ברכות ל\"ה ע''ב) אמר ר' חנינא בר פפא כל הנהנה מן העוה\"ז בלא ברכה כאילו גוזל להקב''ה וכנסת ישראל שנאמר (משלי כ\"ח) גוזל אביו ואמו ואומר אין פשע חבר הוא לאיש משחית וכו' מאי איש משחית אמר ר' חנינא בר פפא חבר הוא לירבעם בן נבט שהשחית את ישראל לאביהם שבשמים. ופירש\"י ז''ל דלפי שהוא מיקל רואים האחרים ולמדים ממנו לעשות כן ולכן נקרא זה המיקל חבר לאיש משחית, ע''כ. הרי כי הגורם שע\"י מעשיו ילמדו אחרים ממנו להקל, עליו הכתוב אומר חבר הוא לירבעם בן נבט שהשחית את ישראל לאביהם שבשמים. וא''כ לא עדיף מיניה מי שמחפה על עוונות הרשעים, לכל פשעיהם ולכל חטאתם, ואומר אין פשע, והריהו חבר לאיש משחית, כי הוא חוטא ומחטיא את הרבים, להפילם ברשת זו טמנו הרשעים, לצוד נפשות נקיות ותמימות, כי יאמרו מדשתקי רבנן למעשיהם, ואין פוצה פה כנגדם, ש''מ דניחא להו בהו, ואין בהם כל עול, ולמה אגרע אנכי מהם, ובזה ימצאו פתח התרה ללמוד ממעשיהם ולהתחבר עמהם."},{"passage_id":"vayikru1_258518d1_p4","passage_content":"ולכן על כל יראי ה' באשר הם שם למחות ולהתריע נגד רשעי הדור, ולהודיע את כל תועבותיהם בפומבי. וכמו שכתב הרמב''ן ז\"ל עה\"פ והיה עקב תשמעון את המשפטים האלה. שהזכיר הכתוב את המשפטים, ולא זכר שאר המצוות, להזהיר מאד במשפטים, כי לא יהי' עם רב כולו נזהר במצוות כולן שלא יחטאו בהן כלל רק במשפטים יעמידו התורה כמו שנאמר בהן וכל ישראל ישמעו ויראו וכו', והזהיר הכתוב שלא יראו מן התקיפים ומן המטעים, כמ\"ש הכתוב לא תגורו מפני איש כי המשפט לאלקים הוא והזכיר כל אלה במסית לא תאבה לו ולא תשמע אליו וגו' ולא תכסה עליו, שלא תשתוק בעבור תקפו ויראת בני משפחתו, עכ''ד. הרי כמה הזהירה תורה שלא לשתוק למעשי הרשעים, ובכך יעמידו הדת על תלה, וזה שהיראים מחפים על מעשי הרשעים ומבליגים על כל מעלליהם, היא עיקר הפירצה בדורנו, והיא שהביאה את החורבן הגדול והנורא על כלל ישראל בזמנינו, ועדיין השטן הזה מרקד בינינו, והכתוב צווח נביאיך חזו לך שוא ותפל ולא גילו על עוונך להשיב את שבותך."},{"passage_id":"vayikru1_258518d1_p5","passage_content":"כללא דמילתא היא, כי בכל איסורים שבתורה מצוה לעשות גדרים וסייגים, ולהתרחק מצ''ט שערי היתר שלא יבואו להכשל בשער אחד של איסור, אך לא כן הדבר בשמירת הלשון, כי קשה מאד לעשות גדרים וסייגים בזה, שהרי חייבים לשנוא בשנאה עזה את הרשעים המכשילים בני הדור בפשעיהם, והמחניף להם קללו הכתוב בקללה נמרצת, כאמרם ז\"ל (סוטה מ\"א ע''ב) אר\"א כל אדם שיש בו חנופה אפילו עוברין שבמעי אמן מקללין אותו שנאמר (משלי כ''ד) אומר לרשע צדיק אתה יקבוהו עמים יזעמוהו לאומים וכו' ואין לאום אלא עוברין וכו', ע''כ. וצריך האדם לסייעתא דשמיא שישיג דעת אמיתית, דבלא זה בקל יוכל להכשל במצודתם. אמנם לפי שאי אפשר לאדם לעשות גדרים וסייגים בעון לשה''ר כבשאר עבירות יוכל בקל להכשל בסיפור לה''ר בשגגה. ובזה פירשנו מאה''כ (קהלת ז') אין צדיק בארץ אשר יעשה טוב ולא יחטא. ויל\"ד למה נקט קרא צדיק \"אשר יעשה טוב'', דפשיטא הוא שאם בשם צדיק יכונה הריהו עושה טוב, וסגי ליה למיכתב אין צדיק שלא יחטא."},{"passage_id":"vayikru1_258518d1_p6","passage_content":"אכן יתבאר עפ''י מ''ש בספה''ק באר מים חיים פ' נח לפרש אמרם ז''ל (קידושין מ' ע''א) עה''פ (ישעי' ג') אמרו צדיק כי טוב וגו', וכי יש צדיק טוב וצדיק שאינו טוב אלא טוב לשמים ולבריות זהו צדיק טוב טוב לשמים ורע לבריות זהו צדיק שאינו טוב, עכ''ד הגמרא. ולכאורה יפלא וכי איש אשר הוא רע לבריות צדיק יתקרי, הלא עבירות שבין אדם לחבירו חמורות ביותר, ואין יוהכ''פ מכפר עד שירצה את חבירו. אלא הכוונה שיש ב' מיני צדיקים ההולכים לפני ה', האחד הוא הצדיק אשר עובד בצדקו תמיד יום ולילה לא יחשה מקול תורה ותפלה ודבקות בה', והוא הצנע לכת עם אלקיו, שיושב בבית מדרשו סגור ומסוגר, אין יוצא ואין בא להיות מעורב עם הבריות, זהו טוב לשמים, אבל אינו טוב לבריות, כיון שאינו מקשר ומדבק עצמו לשום אדם, לקרבו וללמדו דרך ה', ואת המעשה אשר יעשה. ויש צדיק אשר מקרב ומדבק עצמו עם בני אדם, ללמדם דרך ה' ואת המעשה אשר יעשון, הוא הנקרא טוב לשמים וטוב לבריות, כי הוא מטיב טובה גדולה עם הבריות שמקרבם לעבודת השי\"ת, עכתדה\"ק. היוצא מזה כי הצדיק שאינו בבחינת טוב, דהיינו שהוא בדד יושב ולא שיג ולא שיח לו עם בני אדם, להורותם דרך ה' ולהזהירם מהתחברות לרשעים, ולבל ילמדו מתועבותיהם, לו נקל מאד להיות זהיר ונשמר מאיסור לשון הרע, שהרי דבר אין בפיו ובלשונו מלה, ואזנו לא תשמע לקול מלחשים. אך הצדיק אשר בבחינת טוב הנהו, לצד שהוא טוב לשמים וטוב לבריות ללמד לעם דרכי השי\"ת, ולהכות על קדקוד כל עושי רשע, בגלותו קלונם וחרפתם בקהל רב, ושפתיו לא יכלא מלהוכיח את העם, להרחיק מהם לבל יעשו כמעשיהם. הנה צדיק זה לא ימלט שלא יכשל פעם בחטא הלשון, אם בדבור פה או תקלוט אזנו שמץ מנהו, דברים אשר לא כדת הם. והכרח לו הדבר כדי לגלות פרצות הדור, וללמד תועים בינה. וזאת אפ''ל בכוונת הכתוב אין צדיק בארץ אשר יעשה טוב ולא יחטא, פירוש אין לך צדיק שהוא בבחינת צדיק טוב, דהיינו שהוא טוב גם לבריות ללמדם דרכי השי\"ת, כדברי הבאמ''ח הנ''ל, ולא יחטא, כי לצד שהוא מקרב עצמו אל בני אדם להורותם דרכי ה', לא יתכן שלא יכשל פעם בחטא הלשון, שהרי מוטל עליו לגלות חרפת הרשעים בקהל רב, ועלול הוא להכשל בלשונו."},{"passage_id":"vayikru1_258518d1_p7","passage_content":"ובדרך זו יש לבאר דברי הכתוב, אשר בטרם הזהיר על שמירת הלשון פתח ואמר מי האיש החפץ חיים אוהב ימים לראות טוב, והדר כתיב נצור לשונך מרע וגו'. דהנה אמרו ז\"ל (יבמות צ\"ו ע\"ב) א''ר יהודה אמר רב מאי דכתיב (תהלים ס''א) אגורה באהלך עולמים וכי אפשר לאדם לגור בשני עולמים אלא אמר דוד לפני הקב''ה רבש''ע יה''ר שיאמרו דבר שמועה מפי בעוה\"ז דא\"ר יוחנן משום רשב\"י כל ת\"ח שאומרים דבר שמועה מפיו בעוה\"ז שפתותיו דובבות בקבר, ע''כ. וז''ש הכתוב מי האיש החפץ חיים, פירוש חיים נצחיים שיהיו שמעתות מתאמרן מפיו בעוה''ז, ושפחותיו יהיו דובבות בקבר, לכן אמר אוהב ימים לראות טוב, כלומר שיוכל להשיג זאת אם הוא בחייו בבחינת \"צדיק טוב'', שהוא טוב לשמים ומטיב לאחריני, לקרבם לעבודת ה', ולהוכיחם בדברים על כל הפירצות הצריכות תיקון, וע\"י כך גם בשכבו על משכבו לא ינוח ולא יחשה, כי בשפתיו השיב רבים מעוון, ושמעתתיה מבדרן בעלמא, ודבריו נשמעים בכל מקום אשר דבר המלך מ\"ה הקב\"ה ודתו מגיע."},{"passage_id":"vayikru1_258518d1_p8","passage_content":"אמנם דא עקא כי הצדיק שהוא בבחינת טוב יוכל להכשל בעון לה\"ר, לפי שהוא מוכיח תמיד את העם לבל ילכו אחרי עצת רשעים, וחייב הוא לגלות רוע מעשיהם ושחיתותם. לכן אמר קרא נצור לשונך מרע, דאף שעליך לדבר בלשונך במקום שהדבר נוגע לפרצות הדור, מ''מ אתה חייב להזהר בלשונך, שלא להכשל בלה''ר במקום שאין צורך בכך. ולפי דברינו שפיר נקט קרא נצור \"לשונך'' מרע, ולא נקט \"שפתיך'', להודיע כי אין לבלום השפתים לגמרי מחשש פן יכשל בלה''ר, שהרי חובה היא לדבר בגנות הרשעים ולתעב מעשיהם המקולקלים, אלא שצריך הוא לשמור לשונו שלא יכשל בדבורו במקום שאסרה תורה. והדר אמר ושפתיך מדבר מרמה, כי מדבר שקר צריך להרחיק בכל ענין."},{"passage_id":"vayikru1_258518d1_p9","passage_content":"ובדרך זו נבא לביאור עובדא דהאי רוכל ור' ינאי, דהנה הרוכל הזה היה בבחינת \"צדיק טוב'', ולפיכך היה מחזר בעיירות להורות לעם ה' דרכי ה', ואת המעשה אשר יעשה אותם האדם וחי בהם. ולזאת כרוזא נפיק בחיל מאן בעי \"למזבן'' סמי דחיי, והוציא ספר תהלים והראה להם מקרא זה מי האיש החפץ חיים וגו', ומה כתיב בתריה נצור לשונך מרע. והיתה כוונתו להוכיח להם שלא יטעו לומר כי לפי שהזהיר הכתוב על איסור לה\"ר, באמרו נצור לשונך מרע, א\"כ מוטב שישים האדם מחסום לפיו ויאנק דום, מחשש פן יבא לדבר לה''ר במקום שאסרה תורה, על כן הראה להם מתחלה דברי הכתוב מי האיש החפץ חיים וגו' וכמו שנתבאר שהקדים הכתוב מקרא זה ללמד שהאיש החפץ חיים עליו להיות בבחי' אוהב ימים לראות טוב, שילמד דעת את העם ויוכיחם באמרי פיו, וקרא בגרון לא יחשוך להכריז בפומבי על תועבות הרשעים, ושחובה היא להתרחק מהם. ומכאן שאין לו לאדם לבלום פיו ושפתיו לגמרי מחשש שמא יכשל בלה''ר, שהרי בשתיקתו הוא כמחפה על מעשה הרשעים, וגורם שיכשלו בהם בני אדה אלא עליו לגנות מעשי הרשעים, ואל יתן דמי לו. ולכן אמר הכתוב בתר הכי נצור לשונך מרע, להזהיר שישמור לשונו מדבור לה''ר במקום שאסרה תורה."},{"passage_id":"vayikru1_258518d1_p10","passage_content":"ולכוונה זו פתח הרוכל דבריו בהכריזו מאן בעי \"למזבן\" סמא דחיי, דהנה איתא במד''ר פרשת יתרו עה\"פ ומשה עלה אל האלקים (שמו''ר פכ\"ח א') הה''ד (תהלים ס''ח) עלית למרום שבית שבי וכו' יכול מפני ששבה אותה נטלה חנם ת''ל לקחת מתנות באדם בלקיחה נתנה לו יכול יהא חייב ליתן לו דמים ת\"ל מתנות במתנה נתנה לו, ע''כ. ודייק ביפה תואר דפתח בלקיחה וסיים במתנה, ועוד מאי הו\"א איכא שיתחייב לתת דמים ולמי יתן. ופירש כוונת המדרש יכול נטלה חנם פירוש בלא יגיעה, ת\"ל לקחת לשון קנין הבא ביגיעה גדולה. והדר קאמר יכול יהא חייב ליתן לו דמיה פירוש שלא ישיג האדם בתורה אלא כפי יגיעתו בה, וא''כ הוא כיצד יוכל האדם להשיג כל דבר בתורה אשר היא ארוכה מארץ מדה, לכן אמר ת\"ל מתנות במתנה נתנה לו, פירוש שהאדם חייב לטרוח בתורה בכל כוחו, ואחרי שיגע וטרח בה, משמיא קא זכו ליה, והתורה ניתנת לו במתנה, שהיא משיג בה השגות שלא היה בידו להשיגם ע\"י יגיעתו, עכ''ד ז''ל."},{"passage_id":"vayikru1_258518d1_p11","passage_content":"היוצא מזה כי ענין \"מקח'' מורה על דבר המושג אל האדם אחרי טורח גדול ויגיעה עצומה, ולכן הכרח הרוכל מאן בעי \"למזבן\" סמא דחיי, כלומר כדי להגיע לקיום דברי הכתוב מי האיש החפץ חיים וגו' נצור לשונך מרע, צריך יגיעה רבה ועצומה, כאשר נתבאר, שלא יתכן לעשות למצוה זו גדרים וסייגים ולהיות כאילם לא יפתח פיו, שהרי חייבים להוכיח את העם ולגלות את מעשה הרשעים ותועבותיהם. אך מאד צריך האדם להזהר לבל יכשל בסיפור לה''ר במקום שאסור לדבר, כי גדול עוונו, וחייב האדם לשקול במאזני שכלו שלא יעבור את הגבול לאחד מן הצדדים. וכשמוע ר' ינאי הכרזת הרוכל מאן בעי \"למזבן'' סמא דחיי, התבונן בדבריו דודאי לא בכדי נקט לשון מקח, המורה על דבר הניתן להשגה אחרי יגיעה רבה, ועל כרחך לא יתכן לפרש מקרא זה שבא להזהיר על שמירת הלשון בלבד, כי אין זה קשה כ''כ להשיגו, שאם ישים האדם מחסום לפיו ולא ידבר מטוב עד רע, ממילא הוא נשמר מחטוא בלשונו. ומתוך כך השכיל לדעת, כי במקרא זה כלולים ב' ענינים המנוגדים זה לזה, ששניהם חובה על האדם לקיימם, מחד גיסא צריך להיות בבחינת צדיק טוב, ולהוכיח בשער על פירצות הדור, ולאידך גיסא חייב האדם לנצור לשונו ובמקום שאסרה תורה לדבר לה''ר, ולפי שקשה מאד להזהר בקיום ב' ענינים הללו, שהם הפכיים זה מזה, ובקל יוכל האדם לנטות מני הדרך, ולהכשל בדבור האסור, לכן שפיר שייך לכנות השגת ענינים אלו בלשון מקח."},{"passage_id":"vayikru1_258518d1_p12","passage_content":"וז''ש ר' ינאי כל ימי הייתי קורא מקרא זה ולא הייתי יודע היכן הוא פשוט, מד שבא רוכל זה והודיע וכו'. כי הרוכל העמידו על אמיתות המכוון במקרא זה, שכלולים בו ב' ענינים אלו גם יחד, ולא סגי בכך שישים האדם מחסום לפיו, ולפיכך נקט קרא נצור לשונך וגו', להורות שיהי' פיו פתוח ויוכיח את העם בדבריו להבדילם מדרך רשעים, אלא שהוא חייב לשמור לשונו שלא יכשל בדבור האסור. ובתר הכי כתיב ושפתיך מדבר מרמה, כאן צוה הכתוב שיהי' פיו סתום לגמרי, ולא יפתח כלל ועיקר לדברי מרמה ושקר, כמבואר לעיל. והוסיף ר' ינאי להביא ראי' לכך מדברי החכם מכל האדם, שומר פיו ולשונו שומר מצרות נפשו, מדנקט תרתי \"פיו\" \"ולשונו'' משמע כי שני ענינים נפרדים הם, פעמים צריך לשמור פיו סתום ולא יפתחנו כלל, כגון לדברי שקר ומרמה, ויש אשר חייב הוא לפתוח פיו ולדבר בלשונו, אלא שישמור לשונו מלדבר לה''ר היכא שאסרה תורה."},{"passage_id":"vayikru1_258518d1_p13","passage_content":"ובדרך זו מבוארת גם כוונת ר' אלכסנדרי בגמרא שם (עיין אות ב'), וגם יובן מה שמסיים בגמרא שם שמא יאמר אדם נצרתי לשוני מרע אלך ואתגרה בשינה, דהנה המג''א כתב בהלכות ר\"ה (תקפ''ג ס''ק ו') על הא דאמרו ז''ל בירושלמי מאן דדמיך בריש שתא דמיך מזליה שאין הכוונה על הישן ממש, אלא על היושב בטל דכישן דמי. וכמו כן י''ל דכוונת הגמרא לבאר האי קרא, שלא יאמר האדם כיון שכ''כ חמור הוא חטא הלשון, א\"כ מוטב לי להיות יושב בטל כישן, ולא אפתח פי להוכיח בני האדם ולהבדילם מן הרשעים, כי ירא אנכי פן אכשל ונלכדתי בעוון לה\"ר החמור, על כן קאמר ת\"ל סור מרע ועשה \"טוב'', דלא סגי במה שיהי' סר מרע, אלא חייב הוא גם להיות טוב לבריות להוכיחם ולרדותם, ולהשניא עליהם את דרך הרשעים."}]},{"dvar_torah_id":"vayikru1_987c6d08","title":"תורת המצורע וחשיבות התשובה","summary":"המצורע נדרש להביא עץ ארז ואזוב ביום טהרתו, כדי לשוב בתשובה על גסות רוחו. לימוד תורה שאינו נחקק בלב הוא חסר ערך, ועל כן יש לשאוף לקיום מעשי שיביא לשינוי פנימי.","contents":[{"passage_id":"vayikru1_987c6d08_p1","passage_content":"זאת תהיה תורת המצורע ביום טהרתו וגו', דקדקו המפרשים ז\"ל דתיבת \"תהיה'' יתירא היא, וסגי לכתוב זאת תורת המצורע, כמו שכתבה תורה בשאר מקומות זאת תורת או וזאת התורה."},{"passage_id":"vayikru1_987c6d08_p2","passage_content":"ב) במד\"ר (פט''ז ד') זאת תהי' תורת המצורע הה''ד (תהלים נ') ולרשע אמר אלקים מה לך לספר חקי ותשא בריתי מלי פיך. וצ''ב שייכות פסוק זה לפרשת מצורע. גם צ''ב מה שאמר הכתוב ותשא בריתי מלי פיך, מה כוונתו באמרו \"מלי פיך''."},{"passage_id":"vayikru1_987c6d08_p3","passage_content":"ונראה דהנה רש''י ז''ל כתב בטעם שצותה תורה על המצורע שיביא ביום טהרתו עץ ארז ואזוב ושני תולעת, דעץ ארז שהוא הגבוה באילנות רומז שהנגעים באו עליו בעבור גסות הרוח, ולפיכך תקנתו שישפיל עצמו כתולעת וכאזוב. היוצא מזה כי עיקר הטעם שצותה תורה שיקח המצורע דברים אלו ביום טהרתו, הוא כדי שיתן אל לבו את אשר חטא על הנפש, וכי מאת ה' היתה זאת להלקותו בצרעת, בעבור רמות רוחו וגאון לבו, וישנה דרכו לטוב ושב ורפא לו. אמנם אם מוסר לא לקח ולא נכנע לבו, ועדיין הוא עומד במרדו כבראשונה, א''כ לא הועיל בהבאת עץ ארז ואזוב וכו', שהרי לא נשלמה הכוונה שבעבורה צותה תורה להביאם. וזאת יש לרמוז במה שכתבה תורה זאת \"תהיה'' תורת המצורע, ודרשו ז''ל במנחות ה' ע\"א) שאני הלכות מצורע דכתיבא בהו הויה דאמר הכתוב תהי' בהוייתה תהא. כלומר שתהי' הויה וקיום לתורתו של מצורע, דהיינו שמכל הפעולות הללו שצוותה עליו תורה לעשות ביום טהרתו יתן אל לבו לחזור בתשובה, וע''י כך יהי' הויה וקיום לדברים אלו, שעשו שינוי בנפשו, ונהפך והיה לאיש אחר. ולא כן הדבר אם עודנו עומד בגאותו ולא השפיל רוחו, א''כ אין הוייה וקיום לתורת טהרתו, שהרי לא פעלו מאומה בנפשו, וכל מעשהו כמצות אנשים מלומדה ולבו בל עמו."},{"passage_id":"vayikru1_987c6d08_p4","passage_content":"ועפ''י זה נבא לביאור המד' הנ''ל (קושיא ב') דהנה אמרו ז''ל (פסחים דף נ' ע''ב) א\"ר יהודה אמר רב לעולם יעסוק אדם בתורה ובמצוות אפילו שלא לשמה שמתוך שלא לשמה בא לשמה. וכתבו התוספות בכמה מקומות (ברכות י\"ז ע\"א ובתענית ז, ע\"א ובנזיר כ''ג ע''א) ליישב דלא תקשה מהא דאמרו ז''ל (ברכות י\"ז ע''א) העושה שלא לשמה נוח לו שלא נברא וכן אמרו (תענית דף ז' ע''א) כל העוסק בתורה שלא לשמה תורתו נעשית לו סם המות, וכתבו לחלק דתרי גווני שלא לשמה נינהו, דהא דאמרינן לעולם יעסוק אדם בתורה ומצות אפילו שלא לשמה, היינו כדי שיקרא רבי או שיכבדוהו, ומה דאמרינן כל העושה שלא לשמה נוח לו שלא נברא היינו בלומד לקנטר. וכבר הארכנו בזה במקום אחר, שדברי התוס' הללו סותרים עם מה שכתבו התוספות בסוטה (דף כ''ב ע''ב ד''ה לעולם) דהתם פירשו התוספות הא דאמרו ז\"ל לעולם יעסוק אדם בתורה ובמצות אפילו שלא לשמה דמיירי בלומד לתקות השכר או מיראת העונש, ומשמע מדברי התוס' הללו דהעוסק ע''מ שיקראוהו רבי או שיכבדוהו אינו בכלל מה שאמרו ז''ל לעולם יעסוק אדם בתורה ומצוות אפילו שלא לשמה, שהרי הלומד על מנת שיכבדוהו גרוע הרבה מהעושה מיראת העונש או מאהבת השכר, וכמ''ש בחובת הלבבות (שער יחוד המעשה פ''ד) דמי שעושה מצוה ע\"מ שיכבדוהו בני אדם גרוע בכמה דברים מעובד ע''ז. וכדברי התוספות בסוטה משמע ברמב''ם פ\"י מהלכות תשובה ה''ה. ובמקום אחר ביארנו החילוקים בדברי התוס' בענין זה, ואין כאן מקומו להאריך (ועיין בספרי ויואל משה מאמר ישוב א''י סימן קכ''ג, ועיי' בדברינו לעיל פרשת ויחי עמוד תק\"כ מה שכתבנו בזה)."},{"passage_id":"vayikru1_987c6d08_p5","passage_content":"גם בהא דאמרו ז''ל הלומד שלא לשמה נוח לו שלא נברא, כתבו התוספות בסוטה שם לפרש באופן אחר ממה שכתבו התוספות בשאר מקומות, דבכ''מ כתבו התוספות דהיינו כשלומד לקנטר, והתם פירשו דהיינו דוקא באינו עוסק בתורה כדי לקיים מצוותיה לא מאהבה ולא מיראה, אלא להוסיף על חטאתו פשע, שעתה שגגות נעשו לו זדונות, שאע\"פ שיודע שעובר אינו מונע כל תאוות לבו וכו', ע\"כ."},{"passage_id":"vayikru1_987c6d08_p6","passage_content":"היוצא מדבריהם כי כל זמן שהאדם לומד תורה על מנת לשמור ולעשות, אף שאינו עוסק בתורה לשמה, מ\"מ יש ערך לתורה זו, וחשובה ומקובלת היא לפני הקב''ה לפי שהתורה נקנתה בנפשו ובפנימיותו ועשתה בו רושם, וכמו כן כאשר האדם מקיים מצוה, מעלתה הגדולה ביותר היא באופן שתעשה רושם בנפשו. ולא כן הדבר במי שלומד תורה ואינו מקיימה, א''כ לא עשתה התורה רושם בנפשו, וכל תורתו היא מן השפה ולחוץ. וזאת כוונת הכתוב ולרשע אמר אלקים מה לך לספר חקי, כלומר מה לך ללמוד תורה, הרי ותשא בריתי \"עלי פיך'', כלומר מה ערך לדברי תורה שאתה לומד, אם אינם אלא על פיך, ולא חקקת אותם בפנימיות לוח לבך, שהרי אינך חפץ לקיימם."},{"passage_id":"vayikru1_987c6d08_p7","passage_content":"ולפי זה יתבארו לנו דברי המדרש זאת תהי' תורת המצורע זש\"ה הכתוב ולרשע אמר אלקים מה לך לספר חקי ותשא בריתי עלי פיך, דהנה נתבאר לעיל כי רמז הכתוב באמרו זאת \"תהיה\" וגו' שתהא הויה וקיום לתורת המצורע, דהיינו שכל המעשים שציותה אותו התורה לעשות ביום טהרתו כלקיחת עץ ארז ואזוב, יעשו רושת בפנימיות לבו, ויקבל על עצמו לחזור בתשובה על חטאו שבעבורו לקה בצרעת, ולפיכך הביא המדרש דברי הכתוב ולרשע אמר אלקים וגו' ותשא בריתי עלי פיך, שהרי משם למדנו שאין חשיבות בלימוד התורה אלא בלומד לשמור ולעשות, שאז היא נחקקת בפנימיות הלב, ולא בלומד מן השפה ולחוץ, ושפיר שייך מקרא זה לאומרו זאת \"תהיה\" תורת המצורע המורה על כוונה זו, שצוה הכתוב שתהא הויה וקיום לתורת המצורע ע\"י שיבואו הדברים בקרבו ויעשו רושם בפנימיות לבבו."},{"passage_id":"vayikru1_987c6d08_p8","passage_content":"והבוכ\"ע יעזור שנזכה לטהרת הלב ולקבל עול מלכות שמים, ונזכה לעשות רצון הבורא ית', ולא נתפס חלילה בנסיונות המרים הנמצאים בעולם, וכאשר רמזו באמרם ז\"ל שאחד מעשרה נסים שנעשו בביהמ\"ק היה שלא הסריח בשר הקדש \"מעולם\", כלומר מן העולם שלא הבאיש ולא קיבל סרחון ממעשי העולם, ובימינו אלה באמת צריכים אנחנו לנסים לבל נתפס במה שהעולם נתפס אף לרגע חלילה, ונזכה לאמונה שלמה ואמיתית בהשי\"ת ובתורתו הקדושה. והבוכ\"ע יעזור שנזכה לקבל באמת עול תורה ועומ\"ש, וננצל מכל צרה וצוקה, ובמהרה נוושע בכל מיני ישועות טובות, ונזכה לראות הישועה האמיתית, בהתגלות כבוד שמים עלינו במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru1_72bfe08a","title":"","summary":"","contents":[{"passage_id":"vayikru1_72bfe08a_p1","passage_content":"לשבת הגדול"}]},{"dvar_torah_id":"vayikru1_59ff0976","title":"הובא אל הכהן: טהרת המצורע","summary":"בפרשת המצורע נדרש מדוע נאמר 'והובא אל הכהן', והאם הכהן בא אל המצורע או להיפך. המדרשים עוסקים בטעמים שונים לביאת הנגעים, וחשיבות התשובה וההשפעה על אחרים, תוך הדגשת הקשר בין חטא לשון הרע לתהליך הטהרה.","contents":[{"passage_id":"vayikru1_59ff0976_p1","passage_content":"וידבר ה' אל משה לאמר זאת תהיה תורת המצורע ביום טהרתו והובא אל הכהן. האה\"ח הקדוש הקשה דכל הכתוב מיותר, שלא היה לו לומר אלא כי יטהר המצורע והובא אל הכהן וגו'."},{"passage_id":"vayikru1_59ff0976_p2","passage_content":"ב) יל\"ד באומרו והובא אל הכהן, דמשמע מיניה שהמצורע מובא אל מקום הכהן, וזה נראה כסותר למקרא שלאחריו, דכתיב ויצא הכהן אל מחוץ למחנה, הרי שהכהן הולך אל מקומו של המצורע."},{"passage_id":"vayikru1_59ff0976_p3","passage_content":"ג) עוד יל\"ד דהול\"ל ובא אל הכהן מאי והובא. והאה\"ח הקדוש כתב ליישב אומרו והובא, וז\"ל, ואולי שיחייבוהו ב\"ד או תקפו כהן לבא, וכמו כן מה שאמר הכתוב נגע צרעת וגו' והובא אל הכהן, יכוין לומר שיחייבוהו לבא אם נתעצל, ע\"כ. והנועם מגדים הביא דבריו הקדושים וכתב עליהם וז\"ל, ולדעתי אין זה מספיק, דמדוע ישתנה מכל מצוות שבתורה, שהוזהרו כל איש מישראל על עצמו, ואזהרה דבית דין ממילא לאינו מקיים מועשית אזהרה לבית דין שיעשום, או מוקדשתו דכהן, חוץ ממצות עשה שמתן שכרה בצדה שאין בית דין מוזהרין עליה. וכמו כן גם כאן יאמר הכתוב ובא, ואזהרה לב\"ד נדע כמו בשאר מצוות, עכ\"ד הנועמ\"ג ז\"ל. ובאמת גם בלא\"ה קשה להבין אומרו והובא, דבשלמא מאה\"כ נגע צרעת כי תהיה באדם והובא אל הכהן מובן היטב, שהרי הסברא נותנת כי בעת הראות בו נגע צרעת אינו חפץ להראותו אל הכהן, פן יסגירו או יחליטנו וישלחנו אל מחוץ למחנה, ועל כן אמר קרא והובא אל הכהן, שיביאו אותו בעל כרחו, שלא בטובתו, משא\"כ הכא שהוא יושב בדד מחוץ למחנה, וכבר נרפא ממנו הנגע, ודאי כי ברצונו הטוב יחפוץ לבא אל הכהן לטהרו מטומאתו, ולחלצו ממסגרו, ומה צורך לכתוב והובא אל הכהן, דמשמעו שיביאוהו בעל כרחו."},{"passage_id":"vayikru1_59ff0976_p4","passage_content":"ד) במד\"ר (פט\"ז ד') איתא זאת תהיה תורת המצורע הה\"ד (תהלים נ') ולרשע אמר אלקים מה לך לספר חוקי ותשא בריתי עלי פיך, וצ\"ב שייכות מקרא זה להכא."},{"passage_id":"vayikru1_59ff0976_p5","passage_content":"ה) להלן בפרשה כי תבואו אל ארץ כנען אשר אני נותן לכם לאחוזה ונתתי נגע צרעת בבית ארץ אחוזתכם. במד\"ר (פי\"ז א') הה\"ד (תהלים ע\"ג) אך טוב לישראל אלקים לברי לבב יכול לכל ת\"ל לברי לבב אלו שלבן ברי במצוות, וצ\"ב שייכות דרשה זו לפרשת נגעים."},{"passage_id":"vayikru1_59ff0976_p6","passage_content":"ו) ובא אשר לו הבית והגיד לכהן לאמר כנגע נראה לי בבית יל\"ד דתיבת לאמר יתירא לכאורה, שבכל מקום משמעות לאמר הוא שיאמר הדברים לאחרים, והכא ליכא למימר הכא, דלמי יאמר הכהן דברים אלו."},{"passage_id":"vayikru1_59ff0976_p7","passage_content":"ז) בתורת כהנים דרשו מדכתיב לאמר שיאמר לו הכהן דברי כבושים בני אין הנגעים באים אלא על לה\"ר. ולפי\"ז מיושב מה שדקדקנו בתיבת לאמר, אמנם לפי דרש זה יקשה, שאם לאמר הוא ציווי לכהן שיוכיח את בעה\"ב בדברי כבושין, היה ראוי לכאורה שיאמר הכתוב והגיד לכהן כנגע נראה לי בבית שהם דברי האיש אשר לו הבית, ואח\"כ יכתוב ציווי אל הכהן שיאמר דברי כבושים, ומדוע הפסיק הכתוב באמצע הודעת דברי בעל הביח, במילת לאמר, ואח\"כ הודיע המשך דבריו כנגע נראה לי בבית, הלא זה ודאי שהכהן היה מניח לבעה\"ב לסיים דבריו, ואח\"כ היה אומר לו דברי תוכחה."},{"passage_id":"vayikru1_59ff0976_p8","passage_content":"ח) עוד יש להקשות לפי דרשת הת\"כ, שהרי כללא היא דהגדה מורה על דבור קשה, ואמירה מורה על אמרות נעימות ועריבות לשומעיהן, וכמו שפירש\"י ז\"ל בפרשת יתרו עה\"פ כה תאמר לבית יעקב אלו הנשים להם יאמר בלשון רך, ותגיד לבני ישראל אלו הזכרים ידבר אליהם דברים קשים כגידין. וא\"כ היה ראוי שיאמר בדברי בעל הבית אל הכהן אמירה רכה, שהרי דבריו נאמרים בהכנעה ובלשון רך, ובדברי הכהן אליו יאמר לשון קשה, שהרי הכהן מיסרו בתוכחות על עון, ובקרא איפכא כתיב, דבדברי בעה\"ב כתיב והגיד, ואילו דברי תוכחתו של הכהן רמוזים בתיבת לאמר."},{"passage_id":"vayikru1_59ff0976_p9","passage_content":"ובטרם נבא לביאור כל המדרשים והקושיות נקדים לבאר אומרו והובא אל הכהן, דהנה במד\"ר פרשת תזריע (פט\"ו ו') איתא ר' אבין בשם ר' יוחנן אמר כתיב (ויקרא י\"ב) ואם לא תמצא ידה די שה ומה כתיב בתריה אדם כי יהיה בעור בשרו וכי מה ענין זה אצל זה אמר הקב\"ה אני אמרתי לך הבא קרבן לידה ואתה לא עשית כך חייך שאני מצריכך לבא אצל כהן שנאמר והובא אל אהרן הכהן, ע\"כ. מבואר מזה כי הטעם שהקב\"ה הביא עליו את הנגעים הוא לצד שהיתה מוטלת עליו החובה להביא קרבן ולא הביא, סיבב הקורה שיבואו עליו נגעים ובהכרח יבא אל הכהן. ובזה מובן שפיר מה שאמר הכתוב והובא אל הכהן, כי אף שעתה הוא בא אל הכהן מרצונו הטוב, באין אונס ומכריח, מ\"מ חשבינן ליה כאילו בא בכפיה, שהרי הקב\"ה הביא עליו את הנגעים כדי להצריכו לבוא אל הכהן, משום שהיה זקוק מכבר לבא אל הכהן להקריב קרבן לידה ולא בא, וא\"כ נמצא כי ביאת הנגעים היא המכריחתו לבא אל הכהן, כדי לשלם חובתו אשר היה חייב מכבר, על כן כתיב ביה והובא."},{"passage_id":"vayikru1_59ff0976_p10","passage_content":"ובאופן אחר יתבאר אומרו והובא אל הכהן, דבדברי חז\"ל בכ\"מ מבואר כי צרעת בא לו לאדם בעוון לשון הרע, וכהא דאיתא במדרש זאת תהיה תורת המצורע המוציא שם רע. והנה במסכת ערכין (דף ט\"ו ע\"ב) פליגי אמוראי אי מהניא תשובה למספרי לשון הרע, ונציעה לפניך דברי הגמרא שם וז\"ל, א\"ר חמא בר' חנינא מה תקנתו של מספר לה\"ר אם תלמיד חכם הוא יעסוק בתורה שנא' (משלי ט\"ו) מרפא לשון עץ חיים וכו' ואם עם הארץ הוא ישפיל דעתו שנא' (שם) וסלף בה שבר ברוח ר' אחא ברבי חנינא אמר סיפר אין לו תקנה שכבר כרתו דוד ברוח הקדש שנאמר (תהלים י\"ב) יכרת ה' כל שפתי חלקות לשון מדברת גדולות (פירש\"י יכרת, לשון כרת) אלא מה תקנתו שלא יבא לידי לה\"ר אם ת\"ח הוא יעסוק בתורה ואם ע\"ה הוא ישפיל דעתו, ע\"כ. ולכאורה יש לתמוה מאד על הא דאמר ר' אחא בר' חנינא סיפר אין לו תקנה, שהרי כלל זה מסור בידינו אין לך דבר העומד בפני התשובה (ירושלמי פ\"א ה\"א), וכן כתב הרמב\"ם ז\"ל (בפרק ג' מהלכות תשובה הי\"ד) אחר שמונה והולך כל אחד מאלו שאין לו חלק לעוה\"ב וז\"ל, בד\"א שכל אחד מאלו אין לו חלק לעוה\"ב כשמת בלא תשובה אבל אם שב מרשעו ומת והוא בעל תשובה הרי זה מבני עוה\"ב, שאין לך דבר שעומד בפני התשובה וכו', ע\"כ."},{"passage_id":"vayikru1_59ff0976_p11","passage_content":"ועוד יש להקשות על דברי ר' אחא, דקאמר סיפר אין לו תקנה שכבר כרתו דוד ברוה\"ק שנא' יכרת ה' וגו', והוא תימה דאף אם נימא שהמספר לה\"ר דין כרת עליו, מ\"מ הרי התשובה מועלת אף לחייבי כריתות, כדאיתא במסכת יומא ארבעה חילוקי כפרה שהיה ר' ישמעאל דורש, וחדא מינייהו כריתות ומיתות בי\"ד שתשובה ויוהכ\"פ תולין ויסורין ממרקין, וכ\"פ הרמב\"ם ז\"ל בריש הלכות תשובה. ואף בזמן שביהמ\"ק היה קיים שלא הועילה תשובה לחייבי מיתות ב\"ד, כבר כתב הרחיד\"א הטעם (שמחת הרגל על הגש\"פ ועי' ויוא\"מ ח\"א סי' ע\"ב) שאין הדבר מסור ביד אדם לדעת להבחין אם עשה תשובה כראוי, שהרי התשובה תלויה בנקודה פנימית שבלב, ואין יודע ומכיר בכך כי אם יודע תעלומות החופש כל חדרי בטן ובוחן כליות ולב, ולפיכך מצווים ב\"ד של מטה להרגו, אף אם עשה תשובת דלפניהם מי גלוי, אבל כלפי ב\"ד של מעלה ודאי מועלת תשובה על הכל, ואם כן מדוע איפוא לא תועיל תשובה למספרי לשון הרע."},{"passage_id":"vayikru1_59ff0976_p12","passage_content":"ובר מן דין קשה, שהרי מהך קרא גופיה דיליף ר' אחא דמספר לשון הרע אין לו תקנה, משם יש להוכיח כי עונשן של מספרי לה\"ר קיל מעונש כרת האמור בתורה, שהרי בחטאים שחייבה תורה כרת, כתיב ונכרתה הנפש ההיא וכיו\"ב, ואילו הכא לא כתיב אלא יכרת ה' כל \"שפתי\" חלקות \"לשון\" מדברת גדולות, הרי כי לא קלל בכרת אלא את לשונו ושפתיו, ולא את הנפש. והוא כעין מה שפירש\"י ז\"ל בפ' בלק עה\"פ מה אקב לא קבה א-ל וגו', אפילו כשהזכיר יעקב אבינו את עוונם כי באפם הרגו איש לא קלל אלא אפם שנא' ארור אפם וגו', ע\"כ. הרי מזה דקיל טפו אם הקללה אינה נאמרת על הנפש בעצם. ולפי זה תגדל התמיהה, דמה אם במקום שאמרה תורה ונכרתה הנפש וגו', מועלת תשובה לכפר, עאכו\"כ שתועיל התשובה למספרי לה\"ר, שלא נאמר בהם כ\"א יכרת ה' כל שפתי חלקות וגו', ומאי האי דקאמר סיפר אין לו תקנה."},{"passage_id":"vayikru1_59ff0976_p13","passage_content":"ולבאר הענין נקדים עוד מה שיש להתבונן בדברי הזה\"ק עה\"כ זאת תהיה תורת המצורע (דף נ\"ג ע\"א), וז\"ל, ת\"ח כל חובי עלמא קב\"ה מכפר עלייהו בתשובה בר מההוא לישנא בישא דאפיק שום ביש על חבריה והא אוקמוה דכתיב זאת תהי' תורת המצורע זאת היא תורתו של מוציא רע ר' חייא אמר כל מאן דאפיק לישנא בישא איסתאבן ליה כל שייפו (אבריו) בגין ההוא מלה בישא סלקא ואתער רוחא מסאבא עלוי ואסתאבא וכו'. ובסוף הענין מסיים הזה\"ק וז\"ל, ר' יהודה אמר וכו' והובא אל הכהן מאי קמ\"ל, משמע מאן דאית ליה לישנא בישא צלותיה לא עאלת קמיה קב\"ה דהא איתער עליה רוח מסאבא כיון דאהדר בתשובה וקביל עליה תשובה מה כתיב ביום טהרתו והובא אל הכהן וראה הכהן, ע\"כ. ולכאורה דברי הזה\"ק סותרין אהדדי, דפתח לומר כל חובי עלמא קב\"ה מכפר עלייהו בתשובה בר מההוא לישנא בישא, והדר קאמר שאף מספר לה\"ר תקנה יש לו בתשובת ודוחק לומר דתרי אמוראי נינהו בזה\"ק, ופליגי בהא אי מהניא תשובה לעוון לה\"ר או לא. ובס' זהר חי נדחק לחלק מכח קושיא זו, דהא דקאמר ברישא שאין תשובה מועלת לעוון לה\"ר, היינו לפי שבסיפור לה\"ר שתים רעות עשה, חדא שחטא כלפי מעלה, והב' שציער את חבירו. והנה כלפי מה שחטא לפני הקב\"ה מועלת התשובה, אבל על שהקניט את חבירו והוציא עליו ש\"ר אין לו תקנה בתשובה, כמו בכל עבירות שבין אדם לחבירו, שאין מתכפר לו עד שירצה את חבירו. אכן קשה להעמיס תי' זה בדברי הזה\"ק, כי לא נראה כן מדבריו הקדושים, וצריך ביאור ליישב דבריו שלא יסתרו אהדדי."},{"passage_id":"vayikru1_59ff0976_p14","passage_content":"ונראה ליישב הענין בשנאמר כי דברי הגמרא והזה\"ק על כוונה אחת נאמרו, והכל סובב הולך אל מקום אחד. ויתבאר בהקדם מה שכתב הכלי יקר (בד\"ה ולקח למטהר) לבאר טעמו של ר' אחא בר' חנינא דס\"ל סיפר לה\"ר אין לו תקנה, שהדין נותן שלא תועיל לו תקנה, לפי שאם כבר סיפר לה\"ר והטיל מום בקדשים והוציא שם רע, ונתפשט קול ענות זה בכל העולם, פשיטא שאין תקנה לזה שעליו סופר הלה\"ר, ואף אם המספר יקריב כל אילי נביות, אין בידו להשיב מחשבתו הרעה ודבריו, וכי ילך מקצה השמים ועד קצהו, ויכרח לאמר שקר דברתי וכו', והוא בעצמו לא יוכל לתקן את אשר עיוות. על כן דין הוא שכשם שאין תקנה לזה שסופר עליו, כך אין תקנה למספרו, ולכך כרתו דוד ברוה\"ק, ואמר יכרת ה' כל שפתי חלקות וגו', עכ\"ד הכלי יקר ז\"ל."},{"passage_id":"vayikru1_59ff0976_p15","passage_content":"היוצא מדבריו כי הטעם שאין תקנה למספרי לה\"ר, משום שהקול נשמע מקצה השמים ועד קצהו, ושוב אין בידו לתקן את אשר קלקל, כי מה בצע אם יתחרט על חטאו ויחזור ויכחיש הדברים, מ\"מ קולו כנחש ילך, וישיחו בדבריו יושבי שער, וישאו ויתנו בהם מוזרות בלבנה, ואין לאל ידו להשתיק את הקול. והנה אף שאין טעם זה מוזכר בגמרא מ\"מ יתכן שחז\"ל נתכוונו לטעם זה באמרם שכבר כרתו דוד ברוה\"ק, שנא' יכרת ה' כל שפתי חלקות. דהנה כללא הוא דכאשר אדם מישראל חפץ ומשתוקק לעשות תשובה שלימה על חטאיו לפני הבוי\"ת, זקוק הוא לסייעתא דשמיא, שתעלה בידו לעשות תשובה כהוגן, וכמאה\"כ (הושע י\"ד) שובה ישראל עד ה' אלקיך כי כשלת בעונך ופירש הראב\"ע וטעם כי כשלת בעונך ואין מי יקימך רק ה' לבדו. ברם אינו דומה התשובה על שאר עבירות, לתשובה על עוון לשון הרע, כי השב על שאר עבירות ומתחרט על מעשיו, ומבקש מחילה מלפני רבון כל העולמים, הרי הוא מתקן בתשובתו את הפגם כפי כוחו, ומה שנבצר ממנו לתקן יסייעוהו מן השמים. אבל שאני מספר לשון הרע, דאף אם הוא מתחרט על מה שחטא בסיפור לה\"ר, לא סגי בהכי, שהרי אין בידו לתקן מה שנכשלו אחרים על ידו בשמיעת לה\"ר, ואח\"כ חזרו וסיפרו דבריו לאחרים, ועד מהרה ירוץ דברו ממזרח שמש עד מבואו. אמנם הנה הבוכה\"ע הוא כל יכול, ואם המספר יעשה תשובה שלימה ורצויה על מה שחטא בלשונו, בידו של הקב\"ה לבטל את הקול שהוציא זה בסיפור הלשון הרע, ולהשכיח מלבות כל השומעים ענין זה לגמרי. והוא דוגמת הא דאיתא בגמרא (ברכות ט' ע\"ב) כשהקריב אליהו בבמה התפלל ענני ה' ענני א\"ר אבהו למה אמר אליהו ענני ב' פעמים מלמד שאמר אליהו לפני הקב\"ה רבש\"ע ענני שתרד אש מן השמים וכו' וענני שתסיח דעתם כדי שלא יאמרו מעשי כשפים הם שנא' (מלכים א' י\"ח) ואתה הסבות את לבם אחורנית. ופירש\"י ז\"ל שתסיח דעתם, מלבא בלבם מזמה של רשע להכחישני ולומר ע\"י כשפים הבאתי את האש הזאת, ע\"כ. הרי שהתפלל אליהו שיעקור ה' ממחשבתם מזמת רשע, למען לא יאמרו מעשי כשפים הם, ושמע ה' בקול תפלתו, והסב את לבם אחורנית, והאמינו לו כי ירדה האש מן השמים ותאכל את עולתו."},{"passage_id":"vayikru1_59ff0976_p16","passage_content":"וכיוצא בזה מצינו גבי יוסף הצדיק, דאיתא במד\"ר (וישב פ' פ\"ח א') עה\"פ ויהי אחר הדברים האלה חטאו וגו' הה\"ד (תהלים ל\"ט) מכל פשעי הצילני חרפת נבל אל תשימני וכו' מכל פשעי הצילני זה יוסף לפי שכתוב בו ותקרא לאנשי ביתה וגו' נתנה אותו בפיהם של כולם אמר הקב\"ה מוטב שיפנו אלו באלו ואל יפנו לצדיק הזה הה\"ד ויהי אחר הדברים האלה חטאו, עכ\"ד המדרש. מבואר מזה שהטרידם הקב\"ה שיתעסקו אלו באלו כדי להשכיח ממחשבתם את יוסף הצדיק, למען לא יפנו אליו. וכמו כן אם נכשל האדם בסיפור לה\"ר, והריהו מתחרט על עוונו, זקוק הוא לסייעתא דשמיא שכשם שהוא פסק מלדבר לה\"ר, כן ישתיק הבוי\"ת את פי הבריות שלא יוסיפו לדבר בזה, ותשתכח אותה דבה רעה מלבות השומעים. ונתקנה על כך תפלה שלא אהיה לשיחה בפי הבריות, ותפלה מהניא שירחם עליו הבוכ\"ע ברוב רחמיו וחסדיו להשתיק פיות הבריות לבל יוסיפו לדבר סרה בגרמתו."},{"passage_id":"vayikru1_59ff0976_p17","passage_content":"וכדרך זו מתבארת כוונת אומרם ז\"ל (יומא פ\"ו ע\"ב) תניא היה ר' מאיר אומר גדולה תשובה שבשביל יחיד שעשה תשובה מוחלין לכל העולם כולו וכו', דלכאורה יש לתמוה, מדוע יהיו נמחלין עוונותיהם של כל בעלי עבירה בעבור יחיד ששב. אמנה אפ\"ל דהנה ע\"י שיחיד עובר עבירה הרי הוא גורם בכך להכשיל גם אחרים באותו עוון, כי ממנו יראו וכן יעשו, באמרם הרי לא טוב אני ממנו, ואם לו הותרה הרצועה, אעשה כן גם אני. ונמצא כי ע\"י חטאו הקיר וצינן אותו חטא בעיני ההמון, ולפיכך בעת שהוא מתנחם על חטאו וחוזר בתשובה, הקב\"ה מוחל לכל אותם שנכשלו באותו עוון על ידו, כי בלאו הכי מאי אהני ליה תשובתו, וזהו שאמרו יחיד שעשה תשובה מוחלין לכל העולם, כלומר לאותם שנכשלו בעבירה בסבתו."},{"passage_id":"vayikru1_59ff0976_p18","passage_content":"ובזה יתבארו דברי ר' אחא בר' חנינא סיפר לה\"ר אין לו תקנה, \"לו\" דייקא, כלומר דהמספר בעצמו אין בידו לתקן את אשר עוות, כי כבר נשמע הקול בכל העולם, ומה יועיל אם הוא מתחרט על דבריו. אמנם אף הוא מודה שעל ידי הבוי\"ת שפיר יש תקנה למספר לה\"ר, והיינו אם יעשה תשובה שלימה לפני הבוי\"ת שמו, ויבך ויתחנן לפניו שיגמור ה' בעדו להכרית מלבות כל השומעים את דבוריו הרעים, ולא יוסיפו לדבר בזה כלל, אזי יכרית ה' מפי השומעים את דברי הבלע, ולא יוסיפו לדבר סרה בגללו. וז\"ש סיפר אין לו תקנה שכבר כרתו דוד ברוה\"ק וכו', בא לתת טעם להא דקאמר סיפר אין לו תקנה, וכדאמרן דהכוונה שאין הוא עצמו יכול לתקן חטאו, כי אם בחמלת הבורא עליו. לכן אמר שכבר כרתו דוד ברוה\"ק שנאמר יכרת ה' כל שפתי חלקות לשון מדברת גדולות, פירוש כדי לתקן חטא לשון מדברת גדולות, יש צורך שיכרית ה' כל שפתי חלקות, היינו שיכרית השי\"ת את הלה\"ר מפיות כל האנשים ששמעו את הדברים, ודבר זה איננו מסור בידו, ולפיכך אין לו תקנה, היינו שאין בכוחו לתקן עוונו, דכל זמן שהבריות עדיין סחים בדברי הרכילות שלו, עדיין לא נמחל חטאו לגמרי, וכהא דאמרו ז\"ל (יבמות כ\"ב ע\"ב) מאי מעוות לא יוכל לתקון זה הבא על הערוה והוליד ממזר, דכל זמן שהממזר שנולד ע\"י עוונו עדיין בעולם, לא יתכן שתתקבל תשובתו. וה\"נ כן הוא דעד שלא נכרת הלשון הרע שהוציא, אין לו תקנה, כי הוא הגורם לכך שרבים נכשלים בחטא זה, ורק ע\"י שיכרת ה' כל שפתי חלקות, תקנה תהיה לו ושב ורפא לו."},{"passage_id":"vayikru1_59ff0976_p19","passage_content":"ואתי שפיר הא דפליגי הני תרי אמוראי, דר' חמא בר' חנינא אמר דתקנתו של מספר לה\"ר היא לעסוק בתורה, שנאמר מרפא לשון עץ חיים, דס\"ל דבהכי סגי לתקן חטא זה, ור' אחא ס\"ל שאין לו תקנה בעצמו, אלא שצריך עזר אלקי, שיתבטל הקול שהוציא, וישתכח כליל מלבות בני אדם."},{"passage_id":"vayikru1_59ff0976_p20","passage_content":"ועפ\"י האמור נבא ליישב דברי הזה\"ק הנראים כסותרים זה את זה, דמעיקרא קאמר שאין מועלת תשובה לבעלי לה\"ר, ואח\"כ דרש מדברי הכתוב והובא אל הכהן, שאם חזר בתשובה מה כתיב ביה ביום טהרתו והובא אל הכהן וראה הכהן. דבאמת אין כאן סתירה כלל, דהא דאמר הזה\"ק בתחלת דבריו שאין התשובה מועלת, היינו שבתשובה לבד לא סגי לתקן חטא הלשון, מטעם שעדיין לא נתבטלו גידולי כוחות הטומאה שנוצרו ע\"י חטאו, שהרי הבריות מספרים בלה\"ר על ידו, אך אעפי\"כ אם הוא שב בתשובה שלימה, אזי והובא אל הכהן רמז להשי\"ת הקרוי כהן, כדאי' בסנהדרין (ל\"ט ע\"א) אלקיכם כהן הוא שנא' ויקחו לי תרומה. והכוונה שע\"י שיעשה תשובה, והובאה תשובתו לפני הקב\"ה, דהיינו שהתחיל הבוכ\"ע לקבל תשובתו, אזי תהיה תקנה לחטאו, כי השי\"ת בגודל רחמיו וחסדיו ישכיח את הדברים מלבות בני אדם, וימחה עוונו מן העולם."},{"passage_id":"vayikru1_59ff0976_p21","passage_content":"ובאופן אחר נראה לפרש אומרו והובא אל הכהן, עפ\"י מה שכתב בסה\"ק זרע קדש במאה\"כ זאת תהיה תורת המצורע, דהול\"ל זאת היא תורת המצורע דתהיה לשון עתיד הוא, וביאר וז\"ל, כי הנה בגאולת מצרים היה הנס דרך הפלא ופלא, שהיתה ההוצאה מעבדות לחירות ומשעבוד לגאולה שלא בדרך הדרגה מדרגא לדרגא, רק תיכף ברגע אחת שהיו בחושך גדול, יצאו ברגע אחת מאפילה לאור גדול, וכל החשכות הוסר מכל העולמות, רק הכל היה אור גדול, ובאו ישראל פתאום שלא בהדרגה להשגה גדולה ונפלאה, כי אמרו ז\"ל (מכילתא פ' בא) ראתה שפחה על הים מה שלא ראה יחזקאל, והשגת ישראל בליל התקדשות חג הפסח היתה יותר מהשגה שהיה להם על הים, וכן לעתיד אילו היינו צריכים ללכת מדרגה לדרגה, היה צריך זמן ארוך לזה, אבל השי\"ת עתיד להעלות אותנו תיכף ומיד ברגע הגאולה לכל המדרגות ולכל המעלות הטובות יותר מבגאולת מצרים, כי תהיה יציאת מצרים טפלה כאמרם ז\"ל (ברכות י\"ב ע\"ב). והנה חז\"ל המשילו הגלות לענין תורת המצורע וכו', וכמו שדרשו ז\"ל בחורבן כתיב איכה ישבה בדד ובמצורע כתיב בדד ישב מחוץ למחנה. וזהו שאמה\"כ זאת תהיה לעתיד תורת המצורע, שזה יהיה דרך הגאולה בבחינת טהרת המצורע, שתיכף ביום טהרתו, בעת רגע הגאולה, שיקויים מאה\"כ (יחזקאל ל\"ז) וזרקתי עליכם מים טהורים, מיד והובא אל הכהן, תיכף נעלה ונגיע לפניו יתברך, כי יעלה אותנו מיד לכל המעלות והמדריגות ונהיה מובאים לפני הכהן ית', ע\"ד אלקיכם כהן הוא, עכדה\"ק ז\"ל. ועפ\"י דברי קדשו יתבאר מה שאמר הכתוב והובא ולא כתיב ובא. כי לפי שמקרא זה רומז על הגאולה העתידה, שבאותה עת יטהרו בני ישראל מטומאתם, ויתקרבו אל הבוי\"ת, על כן רמז הכתוב, דאף אם לא יהיו בידי ישראל מצות ומעשים טובים, שעל ידם יוכלו להטהר מעוונותיהם ולהתקרב אל הקדושה, אפי' הכי יגאלם הקב\"ה בלא זכותם, כי כמעט אי אפשר שיזכו בני ישראל אל הגאולה בזכות עצמם. וז\"ש הכתוב והובא שמן השמים יתעוררו רחמים וחסדים על ישראל, שיובאו ויתקרבו אל הכהן הוא הקב\"ה ויגאלו, כמאה\"כ (ישעי' מ\"ח) למעני למעני אעשה."},{"passage_id":"vayikru1_59ff0976_p22","passage_content":"ובדרך זה יתיישב גם מה שאמה\"כ זאת תהיה \"תורת\" המצורע, דהנה איתא במד\"ר (ויקרא פ\"ז ג') אין הגליות מתכנסות אלא בזכות תנויי שנא' (הושע ח') גם כי יתנו בגוים עתה אקבצם. וה\"נ איתא בזוה\"ק דלעת\"ל יהי' משרע\"ה הגואל ולא יגאל את ישראל אלא בכח התורה, ולפיכך כיון שפרשה זו רומזת על הגאולה העתידה, כמו שנתבאר בזרע קדש, ע\"כ אמר זאת תהי' תורת המצורע, לרמוז שהגאולה תהיה בזכות עסק התורה."},{"passage_id":"vayikru1_59ff0976_p23","passage_content":"ועפ\"י בחינה זו יתבאר לנו הטעם שקורין שבת שלפני הפסח בשם שבת הגדול, כי בגאולת מצרים נעשה הכל בלי הכנת והתעוררות התחתונים, וברגע אחד יצאו מאפילה לאור גדול. והנה ידוע מה שהאריך בספה\"ק סידורו של שבת בטעם הדבר שבתפלת המועדים אומרים מקדש ישראל והזמנים, משא\"כ בשבת אומרים מקדש השבת, ולא מזכירים ישראל כלל, כי המועדים תלויים בקידוש ב\"ד, אבל השבת מקודש ועומד משמים מאז ששת ימי בראשית. והביא שם בשם בעהמ\"ח שערי ג\"ע שיום השביעי קדוש מעצמו בלא פעולת התחתונים, ואינו תלוי במעשי התחתונים להחליף אותו לזולתו, או לקדשו עפ\"י בית דין, כשם שהב\"ד מקדשין מועדות וראשי חדשים, רק ויקדש אלוקים את יום השביעי, שהוא קדוש מפי הקב\"ה. ושאר הזמנים והימים ע\"י תפלתינו וכוונותינו ע\"י עובדא דלתתא יתער עובדא דלעילא, להעלות כל העולמות, כפי ערך הזמן שנוכל להעלות העולמות על ידי כוונתינו. אבל כוונת שבת אין אנו מכוונים לעשות ע\"י פעולת כוונותינו שום עליה למעלה, כי הוא נעשה מאליו, רק כמו שיש עליה בשבת כפי הזמנים שבו נעשה מאליו, כך אנו מכוונין איזה פעולה בכל תפלה, לכוון בזו התפלה כפי העליה שבאותו הזמן. ולפי זה פירש הפסוק (תהלים צ\"ב) כי שמחתני ה' בפעלך במעשי ידיך ארנן, פירוש שאתה בעצמך שמחתני בפעליך, במה שאתה לבד פועל בשבת בלי אתערותא שלי, ואני רק לפי מעשה ידיך כפי התחלקות קדושת העתים שביום השבת כן אני ארנן, לעשות ולכוון בכל עת ועת כפי ערך אור קדושת ה' המאיר בו, עכ\"ד הקדושים ז\"ל. והנה בפסח שבו נגאלו ישראל ממצרים, ירדה עליהם ההארה בבת אחת בפתע פתאום ללא כל הזמנה והכנה, על כן היה צורך לכח קדושת השבת שבו ההארה נשפעת מאליה, ובאמצעותו הוכן להם כלי לקבל ההארה."},{"passage_id":"vayikru1_59ff0976_p24","passage_content":"ובזה מיושב מה שהקשו המפרשים ז\"ל, מאי טעם קבעו זכר לנס שנעשה ביו\"ד בניסן, ליום השבת, הי' ראוי להם לקבעו ליום שנעשה בו הוא העשירי בניסן, אמנם הנה המג\"א הביא בהל' תענית (סימן תק\"פ סק\"ט) כתב התניא ביום הששי פ' חקת נהגו יחידים להתענות, שבאותו היום נשרפו כ' קרונות מלאים ספרים בצרפת, ולא קבעו אותו בימי החדש, מפני שמתוך שאילת חלום נודע להם שיום הפרשה גורם גזירת התורה, דזאת חקת התורה מתרגמינן דא גזירת אורייתא, ע\"כ. והכא נמי לפי שע\"י קדושת השבת נעשו מוכנים לקבל התעוררות הקדושה שנתגלתה להם בליל ט\"ו בניסן, קבעוהו ליום השבת, כי יומא הוא דקא גרים, ולכן נקרא שמו שבת הגדול."},{"passage_id":"vayikru1_59ff0976_p25","passage_content":"ולפי מה שביארנו בבחינה הקודמת מאמר הגמרא יחיד ששב מוחלין לכל העולם כולו, יתבאר לנו מדרש פליאה המובא בספה\"ק בני יששכר בשם ס' צפנת פענח וז\"ל, האדם שעשה עבירה וחזר בו ועשה תשובה הקב\"ה מוחל לו כל עוונותיו ולכך נקרא שבת הגדול, ע\"כ. והוא פלאי, דכי בעבור שעשה תשובה על עבירה אחת, גם כל עוונותיו אשר עשה בימי חלדו לא יזכרו לו, אתמהה, הלא ודאי שצריך לעשות תשובה על כל חטא וחטא בפני עצמו. אמנם לפי מה שנתבאר כי כלל גדול הוא שאם אדם עובר עבירה אחת נעשית אותה עבירה קלה בעיני ההמון, ולומדים ממנו לעשות כמעשהו, דבלאו הכי קיי\"ל אחזוקי אינשי ברשיעי לא מחזקינן, אלא דאחר שפרץ החוטא הזה את הגדר, יגררו אחריו בני אדם לחטוא, ולכן אף שהוא לא עבר אלא עבירה אחת, מכל מקום הקולר תלוי בצוארו שבסיבתו נכשלו הרבה בני אדם באותה עבירה עצמה. ואחריות גדולה מוטלת עליו בכל עבירה שעושה, ואף בעת שהוא כבר מתחרט על חטאו ועושה תשובה עליו, מ\"מ הרי אין בכוחו לשוב כי אם על מה שחטא הוא עצמו, ולא על מה שחטאו אחרים בסיבתו, וכמו שכתב הכלי יקר ז\"ל גבי לה\"ר כנ\"ל. אמנם אם הוא חוזר בתשובה שלימה על העבירה שעשה, אזי יערה הקב\"ה רוח טהרה ממרום על האנשים אשר ראוהו בעת שחטא, שיחזרו בתשובה על חטאם, ושלא יבואו ללמוד עוד ממעשהו הרע, או שהקב\"ה מסבב כך שלא יזדמן לידם אותו החטא כלל."},{"passage_id":"vayikru1_59ff0976_p26","passage_content":"היוצא מזה כי בלא עזר אלקי לא יתכן שתתקבל התשובה, כי אין ביכולת האדם לתקן את אשר פגם וקלקל אצל אחרים, אלא שאם הוא יעשה את אשר ביכולתו, יגמור השי\"ת בעדו שלא בהדרגה מה שנבצר ממנו לעשות, שימנע השי\"ת מכל אותם האנשים שראוהו עובר עבירה, לעשות כמעשהו. וכמו שהיה בעת גאולת מצרים, שלא נשפעה לישראל השפעת הקדושה בהדרגה בזכות הכנתם ומעשיהם, כי אם בבת אחת יצאו מאפילה לאור גדול שלא בהדרגה."},{"passage_id":"vayikru1_59ff0976_p27","passage_content":"וזהו יהי' ביאור המדרש אדם שעבר עבירה ועשה תשובה הקב\"ה מוחל לו על כל עוונותיו, כלומר שהקב\"ה מוחל לו על כל העוונות שנתהוו מכח עבירה זו שעבר, דהיינו שאחרים נכשלו בסיבתו. ואם לחשך אדם לומר שלא יתכן שיתקן בתשובתו כ\"א מה שחטא הוא בעצמו, ולא מה שלמדו אחרים ממנו, אף אתה אמור לו כי הקב\"ה טוב ומטיב ומוחל אף שלא בהדרגה, וכמו שהי' במצרים שהיו שקועים במ\"ט שערי טומאה, וברגע א' יצאו מתוך המ\"ט שערי טומאה לשערי הקדושה, משום שלא יכלו להתמהמה, והגאולה התחילה משבת שלפני הפסח, ולכך נקרא שבה\"ג, כי באה עליהם בב\"א הארת הקדושה שלא בהדרגה. והם הם דברי המדרש אדם שעבר עבירה ועשה תשובה מוחלין לו על כל עוונותיו, אף מה שנכשלו אחרים על ידו, וכדאמרן דאף שאין זה בכוחו אפ\"ה מכיון שהוא משתוקק לשוב יעזרהו השי\"ת שלא בהדרגה ושלא לפי מעשיו וזכיותיו, ולכך נקרא שבת הגדול מטעם זה עצמו, שהקב\"ה הושיע את ישראל בבת אחת שלא בהדרגה."},{"passage_id":"vayikru1_59ff0976_p28","passage_content":"ועתה נחזור לביאור המדרשים והדקדוקים המוצגים בתחלת הדרוש, בהקדם מה דאיתא במד\"ר כי תבואו אל ארץ כנען וגו' ונתתי נגע צרעת בבית ארץ אחוזתכם, וז\"ל, ארץ אחוזתכם זה בית המקדש שנא' הנני מחלל את מקדשי גאון עוזכם, ובא אשר לו הבית זה הקב\"ה שנא' וכו' והגיד לכהן זה ירמי' וכו' כנגע נראה לי בבית זו טינופת ע\"ז וכו' וצוה הכהן ופינו את הבית ויקח את אוצרות בית ה' ונתץ את הבית וביתא דלא סתריה והוציא אל מחוץ למחנה ועמא הגלו לבבל יכול לעולם ת\"ל ולקחו אבנים אחרות שנא' לכן כה אמר ה' אלקים הנני יסד בציון אבן אבן בוחן פנת יקרת מוסד מוסד המאמין לא יחיש, עכ\"ד המדרש. ולכאורה צריך להבין דבריו שהוא מוציא פרשה זו מפשוטה, ודורשה על חורבן הבית, ואין זה שייך כלל לפשטות הפרשה דמיירי בהלכות נגעים, ולא קרב זה אל זה. ואפשר לומר דשפיר שייכי הדרש עם הפשט, עפ\"י מה דאיתא במסכת ערכין (דף ח' ע\"ב) עה\"פ (תהלים ל\"ו) צדקתך כהררי א-ל אלו נגעי אדם משפטיך תהום רבה אלו נגעי בתים. ופירש המהרש\"א ז\"ל בח\"א עפ\"י מה דאי' בספ\"ק דקידושין (ל\"א ע\"ב) דרש אבימי מזמור לאסף וכו'. ופירש\"י (ד\"ה איסתייעא מילתא) קינה לאסף מבעי לי' אלא שאמר שירה על שכלה הקב\"ה חמתו על עצים ואבנים ומתוך כך הותיר פליטה וכו' וכה\"א (איכה ד') כלה ה' חמתו ויצת אש בציון, עכ\"ד רש\"י ז\"ל. וכמ\"כ קאמר הכא צדקה עשה הקב\"ה שלא כלה חמתו על האדם בנגעיו, אלא על הבתים, משפטו תהום רבה שיהיו הנגעים בהם ג' שבועות, עכ\"ד המהרש\"א ז\"ל. ועפי\"ז מבואר מה שדרשו ז\"ל פרשת נגעי בתים על החרבן, דחד טעמא אית להו, דכשם שאין בעל הרחמים פוגע בנפשות תחלה, ואינו מכלה חמתו באדם, כי אם שולח נגעים על ביתו, ה\"נ צדקה עשה הקב\"ה עם ישראל שכילה חמתו בעצים ובאבנים, והותיר את ישראל לפליטה."},{"passage_id":"vayikru1_59ff0976_p29","passage_content":"אמנם אכתי עלינו ליישב מה שמצינו בדברי חז\"ל שני מדרשים הסותרים להדדי בענין נגעי בתים, דהנה במד\"ר (פי\"ז ד') איתא עה\"פ ונתתי נגע צרעת בבית ארץ וגו' אין בעל הרחמים פוגע בנפשות תחלה אלא בתחלה הם באים על ביתו אם חזר בו מוטב, ואם לאו באים על בגדיו וכו', הרי להדיא שהנגעים מחמת חטא הם באים, לעורר לבות בני אדם לתשובה. ואילו שם בסמוך איתא במד\"ר טעם אחר לביאת נגעי בתים, וז\"ל, רשב\"י אומר בשורה טובה היא להם שהנגעים באים עליהם לפי שהטמינו אמוריים מטמוניות של זהב בקירות בתיהם כל מ' שנה שהיו ישראל במדבר וע\"י הנגע נותץ הבית ומוצאן. וזה סותר לכאורה לדברי המדרש הנ\"ל, שהרי הכא מבואר שהנגעים בשורה טובה הם לישראל, ואב אין טעם ביאתן של נגעים להורות תשובה."},{"passage_id":"vayikru1_59ff0976_p30","passage_content":"ואפ\"ל דאף לפי טעמא דמטמוניות, מ\"מ היה קצת עונש בדבר, ורמזו לו מן השמים שיפשפש במעשיו ויעשה תשובה, שהרי אם באו לו המטמוניות בתורת שכר בלבד, היה הקב\"ה ממציא לו את המטמוניות באופן שלא יצטרך לסתור את הבית, דהרבה דרכים למקום, כגון שימצא המטמון במקום הנגע בשעת חילוץ האבנים, ומדלא נמצא כ\"א אחר סתירת הבית, זה לו לאות כי אינו ראוי למטמוניות כי אם ע\"י צער שיסתור בתחלה את הבית, ומזה יקח מוסר לעשות תשובה. ואפ\"ל עוד כי באמת שני הטעמים המבוארים בענין נגעי בתים הם אמיתיים, דפעמים בא הנגע לטובה לגלות מטמוניות, ופעמים לייסר את האדם ולהוכיחו על רוע מעלליו."},{"passage_id":"vayikru1_59ff0976_p31","passage_content":"ועפ\"י זה יובן גם מה שדרשו חז\"ל פ' נגעי בתים על החורבן, דהנה אמרו ז\"ל (ילקוט תהלים רמז תתפ\"ו) כל דור שלא נבנה ביהמ\"ק בימיו כאילו נחרב בימיו. וכ' אא\"ז זלה\"ה בייטב פנים (מאמר יפה לעינים א') וז\"ל, דלכאו' הדברים מתמיהים, דמאי אית לן למיעבד יותר ממה שאנו מחכים ומתפללים בכל יום שישוב ברחמים לביתו במהרה בימינו. ושמעתי מפי אבא מארי הגאון הצדיק מו\"ה אלעזר ניסן זצ\"ל שפירש דבריהם ותורת חסד על לשונו, והוא כי עיקר הפדות של חורבן ביהמ\"ק היה, בשביל שהדור שבימיהם נחרב הבית אין לשער גודל הצער שהיה להם באותו זמן, וכמו כן עתה הדור שמשים אל לבו ענין החורבן, ומחכה מתי יבנה, ועודנה תכלנה עינינו, ועבר קציר כלה קיץ ואנחנו לא נושענו וכו', ומצטער על דלותן ושפלותן של ישראל וגלות השכינה, ואשר עוד לא נבנה הבית, הנה זה מכפר עוון הדור כאילו נחרב בימיו, שהיה כפרתן של ישראל, עכ\"ד ז\"ל. אמנם אף שהחורבן היה הצלה לכללות ישראל, מ\"מ לא היו שוין בזה כל ישראל, דלאו כל אדם בכוחו לסבול עול הגלות והצרות והנגעים הבאים עליו, ועלול הוא ליפול בחשכות. ואין זה דומה לזמן שבית המקדש היה קיים, שאז היו יכולים להתחזק בקדושה, כי היתה עליהם השפעת מקום הקדש, כהנים בעבודתם ולויים בשירם ובזמרם וישראל במעמדם. וע\"י עבודתם הקדושה נתקבלו התפלות, ונתחזקו הלבבות הנשברות, וגם הרחוקים מתורה ומצוות והשפלים במדרגתם, כיון שראו עבודה הקדושה הזו נתקרבו אל הקדושה. ולא כן בחורבנה של ירושלים, שאין במה להתחזק, ובמה להתעורר בתשובה, בזמן שהנגעים באים עליהם, וע\"כ נופלים בחשכות יותר ויותר."},{"passage_id":"vayikru1_59ff0976_p32","passage_content":"הן אמת שמי שרוצה ללכת בדרך התורה מסייעין אותו משמים וניצול מן הנסיונות, ובאמצעות הצרות והיסורין לבו מתעורר לתשובה, וכמו שדרשו ז\"ל במדרש איכה (פ\"ד כ\"ז) עה\"פ תם עוונך בת ציון, עיי\"ש. וכמו כן כאשר עומדים בנסיונות ובחשכות הגלות, מתחזקים בלבם יותר לעבודת השי\"ת ע\"י הנסיונות, אמנם לא כל אדם יכול לסבול את הנגעים והיסורין, ורבים כרעו ונפלו תחת כובד הצרות. ואתי שפיר מה שדרשו ז\"ל פרשת נגעי בתים על החורבן, דדמיין זה לזה, דכשם שנגעי בתים פעמים הם בשורה טובה לישראל, ופעמים הם באים לייסר את האדם בתוכחות, כן בענין החורבן, לכללות ישראל היה החורבן הצלה והתחזקות ע\"י היסורין, אמנם היו גם כאלו שנפלו על ידי כן בחשכות, מבלי יכולת לסבול הנסיונות ועול הגלות והיסורין."},{"passage_id":"vayikru1_59ff0976_p33","passage_content":"ובדדך זה נראה לפרש כוונת המד\"ר עה\"פ ונתתי נגע צרעת בבית ארץ אחוזתכם הה\"ד אך טוב לישראל אלקים לברי לבב, יכול לכל ת\"ל לברי לבב, אלו שלבן ברי להם במצוות. דהכי פירושו לפי שפרשה זו רומזת על החורבן והגלות, על כן אמר יכול לכל, פירוש דלכל אדם הוי ענין החורבן והנגעים טובה, שיתעורר לתשובה באמצעות הנסיונות והיסורין, ת\"ל לברי לבב אלו שלבן ברי להם במצוות, דדוקא בני אדם המשתוקקים לקיים מצות הבורא בכל לב ונפש ובכל מאודם, יכולים הם להתחזק ע\"י הצרות והיסורין, משא\"כ שאר בני אדם."},{"passage_id":"vayikru1_59ff0976_p34","passage_content":"ועפ\"י דברינו אפ\"ל מה דתנן במסכת נגעים (פי\"ב מ\"ה) אפילו ת\"ח ויודע שהוא נגע ודאי לא יגזור ויאמר נגע נראה לי בבית אלא כנגע נראה לי בבית (הביאו רש\"י ז\"ל בפרשה זו). וכתב התוס' יו\"ט וז\"ל, א\"ת למה אסרה תורה לומר נגע והלא עד שיאמר הכהן טמא עדיין אין כאן טומאה, והרא\"ם כתב בשם רבותיו דכיון דבדיבורו לא יוכל לשפוט הלכך לא יאמר בלשון ברור, ע\"ד אמרם למוד לשונך לומר איני יודע. ולי נראה מפני דרך ארץ שצריך לנהוג עם הכהן וכו', א\"נ שלא ימהר הכהן ויגזור טומאה, ע\"כ. ובגור אריה כתב משום דובר שקרים לא יכון, דהא כל זמן שלא נזקק הכהן לאו נגע הוא, ואיך יאמר נגע וכו'. וכתב בעל קרבן אהרן דלא דק בזה, שהכהן אינו עושה נגע, אבל הטומאה עושה בו, וקודם שיבא הכהן נגע הוא. ואפשר לתרץ קושייתו שכשיאמר נגע המכוון ממנו מה שקוראין נגע, והיינו נגע טמא, ומכיון שעדיין אינו טמא, הרי דובר שקרים, עכ\"ד התוספות יו\"ט ז\"ל. היוצא מזה דאף שתיבת נגע היא מילתא דמשתמע לתרי אנפי, דאפשר שיהי' נגע טהור או נגע טמא, אפילו הכי חזינן שהקפידה תורה שלא יאמרו נגע, משום דמיחזי כשיקרא."},{"passage_id":"vayikru1_59ff0976_p35","passage_content":"והגם שמצינו בכ\"מ דמתאמרא מילתא דמשתמעא לתרי אנפי, כגון ביעקב אבינו שאמר אנכי עשיו בכורך, ופירש\"י ז\"ל אנכי המביא לך ועשיו הוא בכורך. וכן במד\"ר פ' וירא (פנ\"ו ח') איתא אר\"א התחיל אברהם תמיה וכו' א\"ל הקב\"ה כשאמרתי קח נא את בנך לא אמרתי שחטהו אלא והעלהו וכו'. איברא דהתם שאני דאף אילו הוה כתיב ושחטהו אין זה שיקרא ח\"ו, משום דחישב לעשות מצוה ונאנס ולא עשאה מעלה עליו הכתוב כאילו עשאה. וא\"כ בכל אופן שתפרש והעלהו הרי זה אמת, אלא דאפ\"ה הקפידה תורה שלא לכתוב ושחטהו, משום שלא נתקיים בפועל. וכן ביעקב אבינו ע\"ה היה מותר לו לשנות בדיבורו, משום שהיה בכך פיקוח נפש, שהרי לא היה יכול ליטול הברכות באופן אחר, ואילו היה עשיו נוטל את הברכות היה ח\"ו מתגבר כוחה של אדום. אלא דאעפ\"כ כל כמה דאפשר למעט בשקרא עדיף, וע\"כ אמר לישנא דמשתמע לתרי אנפי."},{"passage_id":"vayikru1_59ff0976_p36","passage_content":"ועפ\"י מש\"כ הגור ארי' דטעם שעליו לומר כנגע הוא משום דובר שקרים לא יכון, אפשר לבאר מ\"ש הכ' והגיד לכהן לאמר כנגע נראה לי בבית, ואי' בת\"כ לאמר יאמר לו הכהן דברי כבושין, והקשינו דלפי\"ז מדוע הפסיק הכ' דברי בעה\"ב בתיבת לאמר (עיין קושיא ו'). אמנם אפ\"ל שכוונת הת\"כ שעל הכהן לעורר את העם בכל עת בדברי כבושים שיתרחקו מפגם הלשון, ובכלל זה שיזהרו מדברי שקר, ושלא ידברו אף בלישנא דמשתמע לתרי אנפי. ודברי תוכחתו של הכהן יגרמו שיאמר הבע\"ב אליו כנגע נראה לי בבית ולא יאמר נגע, משום דהוא לישנא דמשתמע לתרי אנפי, דאיכא נגע טהור ואיכא נגע טמא. וזה יהי' ביאור הכ' והגיד לכהן לאמר, כלומר שבעת בואו אל הכהן ישפיעו עליו דברי כבושים שאמר הכהן בכל עת, שיתרחק מפגם הלשון, ולפיכך יאמר כנגע נראה לי בבית, ולא יאמר נגע נראה לי. והשתא אתי שפיר מה שהקדים הכתוב תיבת לאמר הרומז על דברי הכבושין של הכהן, לדברי בעל הבית כנגע נראה לי בבית, דאין הכוונה שעתה יבא הכהן לומר לו דברי כבושין שהרי בתחלה על בעה\"ב לסיים דבריו, אלא שהכתוב רמז בזה כי דברי כבושין שהכהן אומר בכל עת, המה המביאים לידי כך שיתרחק בעה\"ב מדברי שקר ויאמר \"כנגע\" נראה לי בבית."},{"passage_id":"vayikru1_59ff0976_p37","passage_content":"אמנם עפ\"י מה שנתבאר בדברינו, כי ביאת הנגעים על הבית תהיה לאחת משתי סיבות, או לגלות מטמוניות, או כדי לעוררו לשוב על חטאיו, יתבאר באופן אחר מה שגזר הכתוב שלא יאמר נגע נראה לי בבית, אלא כנגע. דהנה לפי שהנגעים באים לאחת מב' טעמים הנ\"ל, א\"כ בעת שהוא בא אל הכהן לספר לו כי נראה הנגע בקירות ביתו, עדיין אין ברור אצלו בשל מה בא עליו הנגע הזה, והולך הוא אל הכהן לבקש מלפניו שימתיק את הדינים מעליו בטרם יצאו לפועל, דכל זמן שלא יצאו מכח אל הפועל, עדיין יש שהות להמתיקם ולשנותם לטוב, ואף דברים הנאמרים בנבואה אפשר להמתיקם בתפלה בטרם יצאו לפועל, ולפיכך אמר הכתוב והגיד לכהן, שהוא מדבר אליו דברים קשים, אשר הנגע בקירות ביתו, ומתיירא הוא מפני תוקף הדין, והוא מבקש ממנו שימתיק את הדין. וזהו שאמה\"כ \"לאמר\" שמדברים קשים כגידין אלו, יתהפך לו לאמירה רכה. והיינו טעמא נמי שהוא אומר כנגע לשון ספק, משום שעדיין לא ברור אצלו מה טיבו של נגע זה, ושמא יעלה בידו למצוא מטמון, ומעז יצא מתוק. וכמו שכתבו הספה\"ק במאה\"כ והנה הנגע לא הפך עינו, כי הצדיק בכוחו לשנות צירופי אותיות, ולהפוך מנגע לענג, ורמז הכתוב והנה הנגע לא הפך \"עינו\", שלא נהפך ה\"עין\" שבתיבת נגע מסוף התיבה לתחלתה, שיעשה ממנה ענג, עכ\"ד."},{"passage_id":"vayikru1_59ff0976_p38","passage_content":"והנה כאשר הוא בא אל הכהן, אינו יודע עדיין אם הוא נגע, ע\"כ יאמר כנגע, כי אולי יזכה בכפליים שימצא מטמון בקירות הבית, ומזה יוודע לו שלא חטא, שהרי מציאת המטמוניות תוכיח, וא\"כ זהו לו לענג ולא נגע, ושמחה כפולה תהי' לו. אמנם עכשיו שעדיין לא נתבררה לו סיבת הנגע ומהותו, אם הוא נגע או ענג, אמור יאמר אל הכהן כנגע בכ\"ף הדמיון, כי אינו יודע עדיין מה טיבו, אלא שידוע לו כי הוא מצירופי אותיות שבתיבת נגע."}]},{"dvar_torah_id":"vayikru1_22548fac","title":"רמזי הגאולה והגלות בפרשת נגעים","summary":"בפרשת נגעים רומזים על חורבן וגלות, והגאולה תלויה במעשי ישראל. יש ב' בחינות לגאולה, בזכות עצמם או למען כבוד שמו. ימי ניסן מסוגלים לגאולה, ובשנה זו יש כח מיוחד לעורר אורות הגאולה.","contents":[{"passage_id":"vayikru1_22548fac_p1","passage_content":"עוד אפ\"ל בדרך רמז מה שאמה\"כ זאת תהיה תורת המצורע וגו' והובא אל הכהן, ואח\"כ אמר ויצא הכהן אל מחוץ למחנה (קושיא א' ב') עפ\"י מה שנתבאר לעיל, כי פרשתא דנגעים רומזת על החורבן והגלות. והנה בזה\"ק פ' וירא (דף קט\"ז ע\"ב) איתא כי גזירת הגלות היתה רק על האלף החמישי, ויליף לה מקרא דכתיב (איכה א') נתנני שוממה כל היום דוה, ויומו של הקב\"ה אלף שנים, עיי\"ש. אך בסיבת עוונות ישראל נתארך זמן הגלות, ונמשך גם באלף הששי. וכמו שכתב הרמב\"ן ז\"ל בפרשת בא עה\"פ ומושב בני ישראל אשר ישבו בארץ מצרים שלשים שנה וארבע מאות שנה, כי הגזירה היתה ארבע מאות שנה, והשלשים שנה שנוספו עליהם הם בעבור עוונות ישראל. כי אם נגזר על האדם גלות ועינוי שנה או שנתיים, והוא יוסיף על חטאו פשע בהם, יוסיפו עליו שבע על חטאותיו גלות ויסורין כהנה וכהנה, שאין ענשו הראשון הבטחה שלא יענש עוד וכו'. וזו היתה הסבה שיצאו בני אפרים שלשים שנה קודם לביאת משרע\"ה, כי הם מנו ולא טעו, אלא שלא נודע להם שנוספו עוד שלשים שנה בעבור החטא, עכת\"ד הרמב\"ן ז\"ל. וכמו כן הוא בגלות החל הזה, דאילו זכינו לא היתה הגזירה כ\"א על האלף החמישי, ועכשיו בעוונות ישראל נתארך זמן גלותינו, ונתרחק זמן הקץ, ואנחנו לא נושענו, ולולא החטאים כבר היתה הגאולה בבחינה אחרת."},{"passage_id":"vayikru1_22548fac_p2","passage_content":"וזאת אפ\"ל בכוונת הכתובים בפרשתן, שאמה\"כ והובא אל הכהן ואח\"כ חזר ואמר ויצא הכהן אל מחוץ למחנה. דהנה פרשת נגעים נדרשת על החורבן והגלות, ולפיכך רמז לנו הכתוב כאן על ב' הבחינות שתתכן הגאולה בהם, וכאמרם ז\"ל (סנהדרין צ\"ח ע\"א) אין בן דוד בא אלא בדור שכולו זכאי או כולו חייב. וכלפי ב' קיצים אלו נתכוון הכתוב, ופתח לומר והובא אל הכהן זה הקב\"ה, ע\"ד (סנהדרין ל\"ט ע\"א) אלקיכם כהן הוא וכו', וזה ירמוז אל בחי' כולו זכאי, וזה בזמן שישראל ראויים להגאל בזכות עצמם, שיהיו דבוקים אל הקדושה, ותהי' השראת שכינתו יתברך בקרבם, כי היכל ה' המה. וכיון שהשכינה בתוכה הרי הם בחינת מחנה ישראל. אמנם אפ\"ה לא כתיב בהו ובא אל הכהן, אלא והובא, משום שאף אם יהיו ישראל ראויים להגאל, יתרוממו ויתעלו בעת הגאולה למדריגה גבוהה ממה שיהיו ראויים על פי בחינתם. כי מן השמים יסייעו בעדם לעלות מעלות רמות, ולהגיע לבחינה גדולה מאד, כשם שהיה בקריעת י\"ס, שנתרוממו בבת אחת לבחינה עליונה, וזכו לראות שכינתו יתברך, ועליה ירמזון זה א-לי ואנוהו, ובעת הגאולה העתידה יתעלו למדרגה גבוהה יותר מזה. ועל כן כתיב והובא שבסייעתא דשמיא יתעלו ויתרוממו ויובאו אל הקב\"ה."},{"passage_id":"vayikru1_22548fac_p3","passage_content":"ואח\"כ אמר הכתוב ויצא הכהן אל מחוץ למחנה וגו', מקרא זה רומז על בחינת כולו חייב, שלא יזכו ישראל לגאולה בעבור מעשיהם, ועל אותו הזמן אמרו חז\"ל (סנהדרין צ\"ז ע\"א) דור שבן דוד בא בו וכו' ותהי האמת נעדרת (ישעי' נ\"ט) מאי ותהי האמת נעדרת אמרי דבי רב מלמד שנעשית עדרים עדרים והולכת לה, וכתב המהרש\"א ז\"ל בח\"א דבילקוט ישעי' (רמז תצ\"ז) איתא שנעשית עדרים עדרים במדבר. ונראה דר\"ל כי אנשי אמת יהיו הולכים ונחבאים במדברות מפני הדור הרע ההוא, עכ\"ד ז\"ל. ועל אותה העת שלא יהיו ישראל ראויים להגאל אמר הכתוב (ישעי' מ\"ח) למעני למעני אעשה, שתהי' הגאולה אך ורק למען כבוד שמו יתברך."},{"passage_id":"vayikru1_22548fac_p4","passage_content":"וז\"ש הכתוב ויצא הכהן אל מחוץ למחנה, דהנה האה\"ח הקדוש פ' שמות כתב כי בדור האחרון יהיו ישראל משוקעין אף בשער הנו\"ן משערי הטומאה. והנה בגאולת מצרים כתיב ועברתי בארץ מצרים, ודרשו ז\"ל אני ולא מלאך אני ולא שליח אלא כביכול הקב\"ה בכבודו ובעצמו הלך לגאול את ישראל משום שכבר היו משוקעים במ\"ט שערי טומאה, ולא יכלו להתמהמה. ואיתא במד\"ר פרשת בא (פט\"ו ו') א\"ר שמעון גדולה חיבתן של ישראל שנגלה הקב\"ה במקום ע\"ז ובמקום טינופת ובמקום טומאה בשביל לגאלן משל לכהן שנפלה תרומתו לבית הקברות אמר וכו' מוטב לטמא עצמי פעם אחת וחוזר ומטהר ולא לאבד תרומתי כך ישראל תרומתו של מקום וכו' אמר הקב\"ה להניחן אי אפשר מוטב לירד ולהצילן וכו', ע\"כ. ולכאורה יש לשאול הלא הרבה שלוחים למקום לשלחם לגאול את ישראל, ומה לכהן בבית הקברות שירד הקב\"ה בכבודו ובעצמו להצילן. אמנם טעמא דמילתא איתא בזה\"ק פ' וירא (דף קי\"ז ע\"א במדרש הנעלם) וכי לא הי' להקב\"ה מלאך או שליח לשגר לעשות נקמה במצרים וכו', אלא א\"ר יהודה מכאן למדנו גבורתו של הקב\"ה ומעלתו שהוא גבוה על הכל אמר הקב\"ה אומה זו של מצרים מזוהמת ומטונפת ואין ראוי לשגר מלאך ולא שרף בין רשעים ארורים מטונפים וכו', עכדה\"ק."},{"passage_id":"vayikru1_22548fac_p5","passage_content":"ולפיכך אמר הכתוב ויצא הכהן אל מחוץ למחנה, כי אילו היו ישראל ראויים, היתה הקדושה בתוך מחניהם, אך אם הם ח\"ו בחינת כולו חייב, שהם משוקעים בשערי טומאה, והם מחוץ למחנה הקדושה, אזי יצא הקב\"ה אליהם אל מחוץ למחנה הוא מקום הטומאה. וראה והנה נרפא נגע הצרעת מן הצרוע, כלומר שירפא הקב\"ה ויבטל את כוחות הטומאה, ויחזירם אל הקדושה. ובזה אפ\"ל גם מה דאיתא במד\"ר ר\"פ זו הה\"ד ולרשע אמר אלקים מה לך לספר חקי וגו', ולהלן במד\"ר בפרשת נגעי בתים עה\"פ ונתתי נגע צרעת וגו' הה\"ד אך טוב לישראל אלקים לברי לבב. נתכוונו לרמוז בזה אל ב' הבחינות שתהיה הגאולה באחת מהם."},{"passage_id":"vayikru1_22548fac_p6","passage_content":"והנה הימים האלה ימי ניסן המה מסוגלים לגאולה, וביותר בשנה זו שהיום גורם, דהנה בשנה מעוברת עושים פורים באדר שני כדאיתא פ\"ק דמגלה (מגילה דף ו' ע\"ב) משום דמיסמך גאולה לגאולה עדיף, ומשום הכי מוטב לעשותו באדר שני שהוא סמוך לניסן. ועי\"ז גדולה זכות ב' החדשים לעורר הגאולה, והנה בשנה זו שערב פסח חל בשבת, ונקרא שמו שבה\"ג בעבור שבו התחילה התעוררות הגאולה, א\"כ מיסמך גאולה לגאולה עדיף, שמצטרפים יחד כח קדושת שבת הגדול, שהשיגו בו ישראל אור גדול וזכו למדריגת גבוהות, יחד עם הארת חג הפסח, ובהצטרפות שניהם גם יחד, בלא הפסק ימות החול בינתיים כבשאר השנים, כוחם יפה ביותר לעורר אורות הגאולה. כן יעזרנו השי\"ת בנחת ובשמחה, ונזכה לעשות תשובה שלימה לפניו יתברך. והבוכ\"ע ירומם וישמח לבבות בנ\"י, ונזכה לראות את ישועת ה' בגאולה שלימה ואמיתית, בהתרוממות קרן התורה וישראל, ובהתגלות כבוד שמים עלינו, במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru1_20c261b8","title":"ביאור נגעים ותשובה בראי הכהן","summary":"הדבר תורה עוסק בהבנת נגעים, טומאה וטהרה, והצורך בשמחת הכהן בעת התשובה. נגעים באים על האדם מחטאיו, ויש צורך בשמחה כדי לתקן את הלב. הכהן, המייצג שמחה, הוא המדריך לתשובה שלמה.","contents":[{"passage_id":"vayikru1_20c261b8_p1","passage_content":"באופן אחר יתבאר אומרו והובא אל הכהן, דלכאורה קשה שהרי אין הוא בא אל הכהן, אלא הכהן צריך לצאת אליו אל מחוץ לשלש מחנות כמבואר להלן בקרא. עוד יל\"ד באומרו והובא דמשמע שאחרים יביאו אותו, והוה ליה למימר ובא."},{"passage_id":"vayikru1_20c261b8_p2","passage_content":"ב) להלן בפרשת נגעי בתים כתיב ובא אשר לו הבית והגיד לכהן לאמר כנגע נראה לי בבית. בתורת כהנים איתא לאמר יאמר לו הכהן דברי כבושין בני אין הנגעים באים אלא על לה\"ר וכו'. ולכאורה יש להתבונן בענין דבשלמא ראיית הנגע צריך שיהא ע\"י כהן דוקא משום דגזירת הכתוב הוא שתהא טומאת הנגע וטהרתו עפ\"י כהן, כדתנן במסכת נגעים (פ\"ג מ\"א) הכל כשרים לראות את הנגעים אלא שהטומאה והטהרה ביד כהן אומרים לו אמור טמא והוא אומר טמא אמור טהור והוא אומר טהור, ע\"כ. ואיתא בתורת כהנים מה ת\"ל או אל אחד מבניו הכהנים אלא ללמד שאין טומאה וטהרה אלא מפי כהן הא כיצד חכם שבישראל רואה את הנגעים ואומר לכהן אפילו שוטה אמור טמא והוא אומר טמא אמור טהור והוא אומר טהור, עכ\"ד. אבל מדוע צריך שתהא גם אמירת דברי כבושים על ידי הכהן דווקא, הלא אם הכהן אינו בר הכי, הת\"ח שם בפיו אמור טמא או טהור, א\"כ מדוע לא יאמר אליו הת\"ח בעצמו דברי כבושים להוכיחו על חטאיו."},{"passage_id":"vayikru1_20c261b8_p3","passage_content":"ג) במדרש רבה (פט\"ו ד') איתא משל למטרונה שנכנסה לפלטין של מלך וכו' כך כיון ששמעו ישראל פרשת נגעים נתייראו א\"ל משה אל תתייראו אלו לאוה\"ע אבל אתם לאכול ולשתות ולשמוח, עכ\"ד המדרש, וקשה שהרי אין הנגעים שייכים באוה\"ע כדתנן במסכת נגעים, ומה זה שאמר להם אלו לאוה\"ע. גם אומרו אבל אתם לאכול ולשתות ולשמוח אין לו ביאור לכאורה, דמה שייכא הבטחה זו ליראתם מפני הנגעים."},{"passage_id":"vayikru1_20c261b8_p4","passage_content":"ונראה בהקדם מה שביארנו לעיל בפרשת תזריע באורך דברי המד\"ר (פט\"ו א') עה\"כ אדם כי יהי' בעור בשרו שאת וגו' הה\"ד (איוב כ\"ח) לעשות לרוח משקל ומים תכן במדה וכו' אדם היה משוקל חציו מים וחציו דם בשעה שהוא זוכה לא המים רבין על הדם ולא הדם רבין על המים ובשעה שהוא חוטא וכו' ופעמים שהדם רבין על המים ונעשה מצורע הה\"ד אדם או דם, עכ\"ל. ולכאורה לאיזה צורך משמיענו המדרש הרכב גופו של אדם וסיבת ביאת הנגעים עליו. וביארנו דהנה המפרשים חתרו ליישב הא דאיתא במד\"ר אין בעל הרחמים פוגע בנפשות תחלה וכו', ואף נגעים הבאים על האדם תחלה הם באים על ביתו וכו' הם באים על בגדיו וכו', לא חזר בו הם באים על גופו. והתמיהה מבוארת שהרי סדר הכתובים לא כן יגיד, דבקרא כתיבא תחלה פרשת נגעי הגוף ואח\"כ פרשת נגעי בגדים ובתים. אמנם הנה ביאת נגעי הגוף תתכן בשני אופנים, האחד בצדיקים שהקב\"ה משגיח עליהם בעינא פקיחא תדיר, וחפץ להצילם מכל מכשול ועון, על כן בעת אשר ימצא בהם שמץ חטא, הקב\"ה שולח עליהם נגעים להעירם כי לא טוב עשו ועליהם לשוב על חטאתם, אמנם ענין זה לא יהי' כ\"א בשלימים אשר הם דבוקים תמיד בה' ית' כמש\"כ הרמב\"ן ז\"ל, ועוד יתכן שיבואו הנגעים על האדם שלא בתורת עונש על החטאים, אלא בדרך הטבע מחמת חולי, וענין זה יהי' בבינונים אשר מחמת עוונותיהם הקב\"ה מסיר השגחתו מעליהם ומניחם לפגעי הזמן, וכאשר כתב הרמב\"ן ז\"ל בפרשת וירא כי בחסידיו דוקא ישים הקב\"ה לבו לדעת אותו בפרט, ותהי' שמירתו דבקה בו תמיד, משא\"כ בשאר בני אדם, עיי\"ש. ובזה א\"ש דברי המד\"ר דאין בעל הרחמים פוגע בנפשות תחלה, ולא תקשי ממה שהקדים הכתוב נגעי הגוף, דבמד\"ר מיירי דוקא בנגעים הבאים בתורת עונש, שאז הם נשלחים במדת הרחמים, ותחלה הם באים על ביתו וכו', משא\"כ קרא מיירי בנגעים הבאים בטבע העולם, ואז יתכן שיבואו אף נגעי הגוף תחלה."},{"passage_id":"vayikru1_20c261b8_p5","passage_content":"ובזה יתבארו גם דברי המדרש (קושיא ג') שמבאר והולך הרכבת גוף האדם וכיצד מתהוה בו נגע צרעת, דבא ליישב מה שהקדים הכתוב נגעי הגוף תחלה, והלא כללא אית לן דאין בעל הרחמים פוגע בנפשות תחלה, לזאת אמר דהכא מיירי בנגעים הבאים על האדם בדרך הטבע מחמת ריבוי דם הבא מאכילה ושתיה. ובהא לא שייך לומר כלל זה, דאין זה בא על האדם בתורת עונש, כי אם מחמת שהוא מונח למקרי הטבע."},{"passage_id":"vayikru1_20c261b8_p6","passage_content":"והנה הנגעים הבאים על הגוף בדרך הטבע תהיינה לאחת מב' סיבות, הא' ריבוי דם הבא מחמת אכילה ושתיה, והב' מחמת עצבות ומרה שחורה, כאשר ידוע מה שכתבו המפרשים ז\"ל משם חכמי הרופאים כי הצרעת באה מתגבורת השחורה, ורפואתו שילך בין בני אדם, וסיבת ריבוי הדם הבא מחמת אכילה ושתיה הוא יען שהמאכלים המקולקלים מביאים לכך, והעצה היעוצה להנצל מריבוי דם, גילה לנו הכתוב בפרשת משפטים ועבדתם את ה' אלקיכם וברך את לחמך ואת מימך והסירותי מחלה מקרבך, וכתב הרמב\"ן ז\"ל שם שיהיו המאכלים והמשקים טובים ובריאים לא יולידו מחלה אבל ירפאו ממנה עכ\"ד."},{"passage_id":"vayikru1_20c261b8_p7","passage_content":"וגדולה מזו כתב בסה\"ק אוהב ישראל בביאור הך קרא ע\"ד מה שאמרו ז\"ל (פסחים קי\"ב ע\"א) כל הנוטל פרוטה מאיוב מתברך. והיינו לאשר היתה הברכה שורה בכל אשר לו, לזה כל שנטל ממנו איזה דבר שכבר שרתה עליו ברכת ה', הוא ג\"כ מתברך. וז\"ש הכתוב ועבדתם את ה' אלקיכם, הבטיחנו השי\"ת וית' ובירך את לחמך וגו' והסירותי מחלה מקרבך, היינו שהשי\"ת יברך את לחמו ומימו של הצדיק העובד את ה', וכל מי שיאכל ויטעום אצלו כלום ישלח לו השי\"ת מבוקשו הצריך לו, כגון רפואה למי שצריך רפואה וכדומה שאר מבוקשים בגשמיות וברוחניות כיר\"א, עכדה\"ק ז\"ל. וכן ראיתי אצל אבא מארי זלה\"ה שפ\"א נתן לאיש אחד דבר מאכל לרפואה ואמר לו את דברי האוהב ישראל הנ\"ל."},{"passage_id":"vayikru1_20c261b8_p8","passage_content":"וזה יהיה ביאור המדרש בשעה ששמעו ישראל פרשת נגעים נתייראו, וסבת היראה היתה מחמת שהקדימה תורה פרשת נגעי הגוף תחלה, וזה לא יהיה כ\"א בעת שליטת מדת הדין הקשה, דבלא\"ה כללא אית לן דאין בעל הרחמים פוגע בנפשות תחלה, ועל כך השיבם משה אל תתיראו אלו לאומות העולם, כלומר לפי שפ' זו יפה נדרשת על לעת\"ל, שילקה הקב\"ה את אוה\"ע בנגעים גדולים וקשים, כמבואר במדרש, וה\"ט שהקדימה תורה נגעי הגוף, שאין הקב\"ה מתנהג עם האומות במדה\"ר. ועפ\"י פשטות הפרשה דמיירי בישראל אפשר לומר טעם שהקדימה תורה פרשת נגעי הגוף, משום שיתכן שיבואו עליהם הנגעים בדרך הטבע מחמת אכילה ושתי' הגורם לריבוי דם, או מחמת עצבות ושממון הרוח, ובאופן זה יתכן שיבואו נגעי הגוף בתחלה, שהרי אין זה מצד מדת הדין כי אם בדרך הטבע, וכלפי נגעים אלו הבאים מחמת טבע העולם השמיעם עצה טובה שלא ישלטו בהם, באמרו אבל אתם לאכול ולשתות, כלומר שתהיה אכילתכם בקדושה, ואז לא יהיו מזיקים לכם המאכלים והמשקים, \"ולשמוח\" פירוש כלפי החשש שיבואו עליהם הנגעים מחמת ריקות ושממון, העצה היא לשמוח, ואם תהיו בשמחה בכל עת לא יוכלו הנגעים לשלוט בכם."},{"passage_id":"vayikru1_20c261b8_p9","passage_content":"ונבוא לביאור שאר הקושיות, דהנה בזהר הקדוש פרשת ויקרא איתא וז\"ל, פתח ר' יהודה ואמר עבדו את ה' בשמחה הכי אוליפנא דכל פולחנא דבעי ב\"נ למיפלח לקב\"ה בעי בחדוותא דליבא בגין דישתכח פולחניה בשלימו ואי תימא פולחנא דקרבנא הכי הוא לא אפשר דהא ההוא ב\"נ דעבר על פיקודיה דמאריה וכו' ותב לקמיה מאריה במאן אנפין יקום קמיה הא ודאי ברוח תבירא ברוח עציב אן הוא שמחה אן הוא רננה וכו' אלא במאי אתקין בהני כהני וליואי דהא אינון אשלימו שמחה ורננה בגינהו שמחה בכהני אתקיים וכהנא בעי לאשתכחא תדיר באנפין נהירין חדאן יתיר מכל טמא, עכ\"ל הקדוש. מבואר מזה ששמחתו של הכהן מצטרפת אל תשובתו של בעה\"ב בשעת הקרבת הקרבן, ובזה יהיה תיקונו בשלימות, ולא סגי בלאו הכי, משום דאין שלימות העבודה אלא בחדות הלב."},{"passage_id":"vayikru1_20c261b8_p10","passage_content":"ובזה מצאנו טוב טעם על שהקפידה תורה שתהיה ראיית הנגע ע\"י כהן דוקא, דהנה הנגעים באים על האדם בסבת חטאו, אם לעוררו לתשובה, או מחמת שהניחו הקב\"ה הפקר לפגעי הזמן בסיבת חטאיו. והנה בעת בוא החוטא לשוב על חטאתיו שגרמו לביאת הנגעים עליו נצבת כמו נד שאלת הזה\"ק, הלא עליו לבו דוי מחמת עוונו, ולב יודע מרת נפשו, ואיך ישא פנים להתרצות פני אדוניו בעוד רוחו שבורה ונדכאה וערבה כל שמחה, הרי לא תהיה תשובתו תמה כי אם ע\"י השמחה, לזאת צריך הוא לצרף אל תשובתו את שמחת הכהן, כמו בקרבן, ובהצטרפם יחד תתקבל תשובתו לרצון לפני בוראו. והיינו טעמא שאף דברי כבושין לאיש אשר לו הנגע הרי הם נאמרים מפי הכהן כדאיתא בת\"כ יאמר לו הכהן דברי כבושין, שהרי דברי כבושים אלו מעוררים לבו לתשובה, ולבו נשבר ונדכה מחמת עוונותיו, לפיכך יש צורך שיצאו הדברים מפי כהן דוקא, משום שהכהנים הנם בשמחה בכל עת תמיד, ותצטרף שמחת הכהן אל תשובתו."},{"passage_id":"vayikru1_20c261b8_p11","passage_content":"ובזה אפ\"ל ביאור הכתוב זאת תהיה תורת המצורע ביום טהרתו, היינו בעת בואו להטהר ולשוב מחטאיו שגרמו לו ללקות בצרעת, העצה היעוצה שתתקבל תשובתו לרצון לפני הקב\"ה, והובא אל הכהן שעבודתו ותשובתו תובא ותצורף אל הכהן שהוא תדיר בשמחה, ובזה תהי' התשובה בשלימות, ועפ\"י מה שנתבאר כי העצבות גורמת לביאת הנגעים, אפ\"ל שרמז הכתוב באומרו זאת תהיה \"תורת\" המצורע, כי אם הצרעת באה עליו מחמת ריקנות ושעמום המביאים לעצבות, תקנתו היא שיעסוק בתורה, ופיקודי ה' ישרים משמחי לב ולא יוסיף עצב עמהם."}]},{"dvar_torah_id":"vayikru1_83cc15d7","title":"תורת המצורע ודרכי הטהרה","summary":"הדבר תורה עוסק בפרשת המצורע, קושיות על פסוקים, והקשרים בין נגעי בתים לנגעי גוף. נדונה השפעת החטא על טהרת האדם והארץ, והצורך בתשובה כדי להימנע מהנגעים. כמו כן, נבחנים טעמים שונים לביאת הנגעים והדרשות הנלמדות מהם.","contents":[{"passage_id":"vayikru1_83cc15d7_p1","passage_content":"וידבר ה' אל משה לאמר זאת תהיה תורת המצורע ביום טהרתו והובא אל הכהן, ויצא הכהן אל מחוץ למחנה וראה הכהן והנה נרפא נגע הצרעת מן הצרוע. הקשו המפ' ז\"ל מדוע האריך הכ' כ\"כ בלשונו, באמרו זאת תהיה תורת המצורע ביום טהרתו, שלא היה לו לומר אלא כי יטהר המצורע והובא אל הכהן וגו'. ומלבד זאת יל\"ד בגוף דברי הכתוב, דתיבת תהי' יתירא לכאורה, דהוה סגי שיאמר זאת תורת המצורע כדרך הכתוב בכ\"מ."},{"passage_id":"vayikru1_83cc15d7_p2","passage_content":"ב) ותו קשה שהמקרא סותר עצמו מרישא לסיפא, דפתח לומר והובא אל הכהן משמע לכאורה שהמצורע בא אל מקום הכהן, והדר כתיב ויצא הכהן אל מחוץ למחנה, הרי שהכהן צריך לצאת אליו."},{"passage_id":"vayikru1_83cc15d7_p3","passage_content":"ג) במד\"ר (פט\"ז ד') איתא זאת תהיה תורת המצורע הה\"ד (תהלים נ') ולרשע אמר אלקים מה לך לספר חוקי ותשא בריתי עלי פיך. וצ\"ב להבין שייכות הך קרא לפרשתא דמצורע. ובפשטות נראה שכוונת המדרש עפ\"י מה דמסיק להלן במדרש א\"ר לוי מצינו בתורה בנביאים ובכתובים שאין הקב\"ה חפץ בקילוסו של אדם רשע, מן התורה (ויקרא י\"ג) ועל שפם יעטה וטמא טמא יקרא (ופירש ביפ\"ת דילפינן באלו מגלחין מדכתיב ועל שפם יעטה שיהיו שפתותיו מדובקות זה לזה ואסור בתלמוד תורה) מן הנביאים (מלכים ב' ח') ויהי הוא מספר למלך את אשר החיה את המת זאת האשה וזה בנה אשר החיה אלישע ודילמא לאחורי תרעא הוה קאים (פירוש וכי לאחורי הדלת היתה עומדת האשה עם בנה שמיד שהתחיל גיחזי לספר המאורע באו שניהם לפניו שנאמר זאת האשה וזה בנה) רבנן אמרי אפילו בסוף העולם הטיסה הקב\"ה והביאה כדי שלא יספר אותו רשע בשבחו של הקב\"ה, בכתובים מנין שנאמר ולרשע אמר אלקים מה לך לספר חקי וגו', עכ\"ד המדרש. ופירש היפה תואר שעל כן הביא המדרש ראיה מג' מקראות אלו שאין הקב\"ה חפץ בקילוסו של רשע, מפני שקילוסו של הקב\"ה יהי' באחד מג' ענינים, או בבחינת מה שהוא מטיב לבריות, או בבחינת הנסים והנפלאות המחודשים, או בדברים הטבעיים כמעשה שמים וארץ וכל צבאם. ולצד הבחינה הא' הביא ראיה מן המצורע, שהקילוס הנוהג בו הוא סיפור חסדי ה', כי בעת בואו להתפלל לפני ה' שישלח דברו וירפאהו, הריהו מזכיר חסדיו יתברך, ואעפ\"כ אין הקב\"ה חפץ בקילוסו. וכפי בחינת הנסים, הביא ראי' מגיחזי וכו', וכפי בחינת הטבעיות, אמר מה לך לספר חוקי, היינו סיפור חוקות שמים וארץ, עכ\"ד היפה תואר ז\"ל. ועל פי זה מובנת שייכות הכתוב ולרשע אמר אלקים מה לך לספר חקי ותשא בריתי עלי פיך לפרשה זו, דהכא נמי אין הקדוש ברוך הוא חפץ שיספר המצורע שהוא בעל עבירה את חסדיו עם הבריות. אכן אכתי קשה דפשטות הכתוב בדברי תורה קא מיירי, כדכתיב מה לך לספר חקי ותשא בריתי עלי פיך, ופירש\"י ז\"ל דקאי על דברי תורה. וכיצד מוציא המדרש דברי הכתוב ממשמעותן, ודורשם על סיפור חסדי המקום. ועוד קשה לפי זה דמאי שייכא דרשה זו לפרשת זאת תהיה תורת המצורע, דמיירי בדיני טהרתו של מצורע, ומקומה ראוי להיות בפרשה הקודמת, ששם הכתוב מדבר בדיני המצורע בזמן טומאתו, והתם הוא דכתיב ועל שפם יעטה, דמיניה ילפינן שהמצורע אסור בתלמוד תורה, ואין הקב\"ה חפץ בקילוסו."},{"passage_id":"vayikru1_83cc15d7_p4","passage_content":"ד) להלן בפרשה כתיב כי תבואו אל ארץ כנען וגו' ונתתי נגע צרעת בבית ארץ אחוזתכם. במד\"ר (פי\"ז ד') איתא ר' הונא וכו' בשם ר' לוי אין בעל הרחמים פוגע בנפשות תחלה וכו' ואף נגעים הבאים על האדם תחלה הם באים בביתו חזר בו טעון חליצה ואם לאו טעון נתיצה הרי הן באין על בגדיו חזר בו וכו' ואם לאו טעון שריפה הרי הן באין על גופו חזר בו יטהר ואם לאו בדד ישב, עכ\"ד. והקשו המפרשים דלפי זה היה ראוי שיקדים הכתוב פרשת נגעי בתים ובגדים, ובאחרונה יכתוב פרשת נגעי הגוף, ואילו בקרא איפכא כתיב, דתחלה כתיבא פרשת נגעי הגוף ואחריה דין נגעי בגדים ובתים."},{"passage_id":"vayikru1_83cc15d7_p5","passage_content":"ה) עוד איתא במד\"ר (שם ה') ד\"א כי תבואו אל ארץ כנען ז' עממין הם ואתה אומר ארץ כנען רבנין אמרי רמזו (רמז להם) מה חם סירסו וכנען לקה אף כאן ישראל חוטאין והארץ היא מתקללת, ע\"כ. ובתר הכי איתא במדרש טעמי אחריני למה שכינה הכתוב לארץ ז' אומות בשם ארץ כנען וז\"ל, ר\"א בן יעקב אומר ע\"י שהיה כנען אביהם של כולם, ורבנן אמרי ע\"י שהיו כולם תגרין וכו' (כנען פירושו תגר) ולבסוף מסיק המדרש לפיכך משה מזהיר את ישראל כי תבואו אל ארץ כנען, עכ\"ד. וכתב היפ\"ת דסיום דברי המד' אתי כרבנן קמאי דקאמרי מה חם חטא וכנען נתקלל וכו', ולהכי קאמר לפיכך משה מזהיר את ישראל וכו', כלומר שמכאן שמענו אזהרה לישראל שישמרו מן החטא שלא תתקלל האדמה בעבורם, דלאידך לישני אין כאן אזהרה, עכ\"ד. והנה עפ\"י דברי המדרש הללו מצאנו טעם נכון למה שנתקשה השל\"ה הקדוש בפ' שלח מדוע נקראת ארץ ישראל בכל מקום בתורה ארץ כנען, והלא מוחזקת היא לנו מאבותינו, וראוי שיהיה שמנו נקרא עליה, ומדוע תתכנה עדיין על שם הכנענים, עיי\"ש מה שכתב בטעם הדבר. אכן לפי דברי המדרש יובן, דטעם הדבר הוא שהתורה מזהרת את ישראל שיזכרו תמיד מה שאירע לכנען, שנתקלל בעבור חטאו של חם, וכמו כן אם יחטאו ישראל ויפגמו בקדושת הארץ, ארורה האדמה בעבורם ח\"ו. אמנם אכתי צ\"ב למה העמיד המדרש דרשה זו בפרשת נגעי בתים דוקא, והרי כמ\"פ כינה הכתוב את הארץ בשם את כנען בפרשיות הקודמות, ואמאי נטר עד הכא."},{"passage_id":"vayikru1_83cc15d7_p6","passage_content":"ו) עוד איתא במד\"ר (פי\"ז ז') דפרשת נגעי בתים כולה נדרשת על חורבן הבית וז\"ל, בבית את אחוזתכם זה ביהמ\"ק שנא' (יחזקאל כ\"ד) הנני מחלל את מקדשי גאון עוזכם וגו', ובא אשר לו הבית זה הקב\"ה שנאמר וכו', והגיד לכהן זה ירמי' וכו', כנגע נראה לי בבית זה טינופת ע\"ז, וי\"א צלמו של מנשה, וצוה הכהן ופינו את הבית שנא' (מלכים א' י\"ד) ויקח את אוצרות בית ה', ונתץ את הבית (עזרא ה') וביתא דנה סתריה, והוציא אל מחוץ למחנה (שם) ועמא הגלי לבבל, יכול לעולם ת\"ל ולקחו אבנים אחרות שנא' (ישעיה כ\"ח) לכן כה אמר ה' אלקים הנני יסד בציון אבן אבן בוחן פנת יקרת מוסד מוסד המאמין לא יחיש, עכ\"ד המדרש. והנה לפי דרשה זו יתיישב מה שדקדקנו לעיל בסמוך (קושיא ד'), בטעם הדבר שהעמידו חז\"ל דרשתם למה נקרא שמה את כנען וכו' לפרשה זו דייקא, דשפיר מישך שייכא להכא, כיון דפרשת נגעי בתים נדרשת על חורבן הבית, שבעבור זאת לקתה הארץ ונתקללה, כדאיתא בגמרא (סוטה מ\"ח ע\"א) משחרב ביהמ\"ק אין לך יום שאין בו קללה. ולפיכך שייך לכאן הך דרשה למה נקרא שמה את כנען, להודיע שאם יחטאו ישראל יארע להם כאשר אירע לכנען, שנתקלל בעבור חטאיו של חם, וה\"נ בסבת חטאם הארץ לוקה. אכן אכתי צריך ביאור להבין דברי המדרש דפרשת נגעי בתים קאי על חורבן בית המקדש, דלכאורה הרי כללא אית לן שהפשט והדרש המה מצומדים, ועל קוטב אחד תסוב כוונתם. והכא מאי שייכי להדדי פשטות המקראות דמיירי בנגעי בתים, ומהם למדו חז\"ל הלכות עמוקות בדיני נגעים, עם דברי המדרש דכל הפרשה נדרשת על חורבן הבית והבנותו מחדש במהרה בימינו."},{"passage_id":"vayikru1_83cc15d7_p7","passage_content":"ובטרם נבא לפתור כל הספיקות הנ\"ל, נקדים לבאר מה שמצינו בדברי חז\"ל בענין נגעי בתים כמה טעמים הנראים כסותרים זה את זה לכאורה, ומוטל עלינו לתת לב להשוות דבריהם לבל יסתרו להדדי, כי כל דבריהם חיים וקיימים ואין בהם נפתל ועיקש, ואלו ואלו דברי אלקים חיים. דהנה במד\"ר הנ\"ל (קושיא ד') מבואר להדיא כי נגעי בתים באים על ישראל להוכיחם ולייסרם שישובו מדרכם הרעה, בטרם ילקו בגופם, דהאריך שם בראיות מן הכתובים דאין בעל הרחמים פוגע בנפשות תחלה, ולבסוף סיים ואף כאן נגעים הבאים על האדם תחלה הן באים בביתו חזר בו טעון חליצה ואם לאו טעון נתיצה, הרי הן באין על בגדיו חזר בו טעון כביסה ואם לאו טעון שריפה, הרי הן באין על גופו חזר בו יטהר ואם לאו בדד ישב, עכ\"ד המד'. וכן מבואר לעיל מיני' במד\"ר (שם אות ג') על עשרה דברים נגעים באים על ע\"ז ועל ג\"ע ועל ש\"ד וכו'. וכיוצא בזה איתא בתנחומא פרשה זו ובמסכת ערכין (דף ט\"ז ע\"ב) שמונה והולך שם על כמה חטאים הנגעים באים. וכן העתיק הרמב\"ם ז\"ל בספר הי\"ד (הלכות טומאת צרעת פט\"ז ה\"י) וז\"ל זה השינוי האמור בבגדים ובבתים וכו' אינו ממנהגו של עולם אלא אות ופלא היה בישראל כדי להזהירן מלה\"ר שהמספר לה\"ר משתנין קירות ביתו אם חזר בו יטהר הבית ואם עמד ברשעו וכו' משתנין הבגדים שעליו וכו' ואם עמד ברשעו משתנה עורו ויצטרע ויהי' מובדל ומפורסם לבדו וכו', ע\"כ."},{"passage_id":"vayikru1_83cc15d7_p8","passage_content":"אכן במסכת הוריות (דף י' ע\"א) איתא טעמא אחרינא לביאת נגעי בתים וז\"ל, ונתתי נגע צרעת בבית ארץ אחוזתכם בשורה היא להם שהנגעים באים עליהם דברי ר\"י. ובפשטות נראה דהבשורה היא מה דאיתא במד\"ר פ' זו (פי\"ז ו') תני רשב\"י כיון ששמעו כנענים שישראל באים עליהם עמדו והטמינו ממונם בבתים ובשדות אמר הקב\"ה אני הבטחתי לאבותיהם שאני מכניס בניהם לארץ מליאה כל טוב וכו' מה הקב\"ה עושה מגרה נגעים בביתו והוא סותרו ומוצא בו סימא, עכ\"ד המדרש. וכן ביאר בתוספות הרא\"ש בהוריות שם כוונת הגמרא. והיפה תואר כתב דהך מימרא דרשב\"י שהנגעים באים לגלות מטמוניות, פליגא על הא דאיתא במדרש דאין בעל הרחמים פוגע בנפשות תחלה, שהרי לדברי רשב\"י הנגעים בשורה טובה הם ולא עונש, עכ\"ד. אכן לא מסתברא כלל לומר כן לעשות פלוגתא בין שני מאמרים הסמוכים זה לזה במדרש, ולא הוזכר שם כלל דפליגי אהדדי."},{"passage_id":"vayikru1_83cc15d7_p9","passage_content":"ומתורתו של הרשב\"י בספר הזה\"ק למדנו טעם נוסף לביאת נגעי בתים וזלה\"ק (פ' תזריע דף נ' ע\"א) כגוונא דא מאן דעביד עבידתא לע\"ז או לסט\"א וכו', כיון דאדכר ליה על ההוא עבידתא הא רוח מסאבא שריא עלוי וכד סליק עבידתא במסאבא סליק כנענים פלחי לע\"ז אינהו וכו', והוו בניין בנין וכו' לסטר מסאבא לע\"ז וכו', כיון דעאלו ישראל לארעא בעא קב\"ה לדכאה לון ולקדשא לון ארעא ולאפנאה אתר לשכינתיה דלא תשרי שכינתא גו מסאבא ועל דא בההוא נגע צרעת הוה סתרין בנינין דאעין ואבנין דאתעבידו במסאבא, ע\"כ. ובתר הכי מוכיח הזה\"ק שאין לומר דנגעי בתים באו בעבור המטמוניות בלבד, וז\"ל, ת\"ח אי עובדא דא (ביאת הנגעים) הוה לאשכחא מטמונין בלחודוי יהדרון אבנין לבתר כמה דאינון לאתרייהו ועפרא לאתריה (יחזירו אח\"כ אותם האבנים והעפר למקומן) אבל קרא כתיב וחלצו את האבנים וכתיב ועפר אחר יקח בגין דיתעבר רוח מסאבא ויתפני ויתקדש וכו' וישתכחו ישראל בקדושה וכו', ע\"כ. מבואר מזה כי סבירא ליה דבעבור ב' טעמים באה הצרעת בבתים, בעבור המטמוניות, ובשביל שיתבער רוח הטומאה מן הארץ ויהיה מחניהם של ישראל קדוש (וכ\"כ בניצוצי אורות שם). ובסוף המאמר (שם ע\"ב) מסיק הזה\"ק לקשר ב' הטעמים גם יחד וז\"ל, ר\"ש אמר כל דא ודאי הוה לאתקדשא ארעא ולאעברא רוח מסאבא מארעא ומגו ישראל וכד ביתא הוה נתיץ הוה אישתכח ביה ממונא למיבניה ליה ולמלייא ביתיה בגין דלא יצטער על ביתא וישרון בדיורא דקדושה, עכלה\"ק."},{"passage_id":"vayikru1_83cc15d7_p10","passage_content":"ולפי מסקנת הזה\"ק נמצא כי עיקר הטעם שהביא הקב\"ה נגעי בתים, הוא כדי לגרש משם כוחות הטומאה שהיו שרויים במדורות העכו\"ם, אלא שלא רצה הקב\"ה שיצטערו ישראל על נתיצת הבית, על כן המציא להם מטמוניות בקירותיו, כדי שיהיה בידם לחזור ולבנותו ולמלאותו בכל טוב. ולכאורה לא יתאימו דברי הזה\"ק עם דברי הגמרא הוריות שהוא כדעת רשב\"י במד\"ר, שהנגעים בשורה טובה הם לישראל, שהרי במד\"ר איתא להדיא דעיקר טעם הנגעים הוא משום מטמוניות, דקאמר כיון ששמעו כנעניים וכו' עמדו והטמינו ממונם בבתים ובשדות וכו' אמר הקב\"ה אני הבטחתי לאבותיהם שאני מכניס את בניהם לארץ מלאה כל טוב וכו' מה הקב\"ה עושה מגרה נגעים בביתו וכו' ע\"ב. הרי מבואר שגילה להם הקב\"ה גנזי מטמוניות, למען הקים את ההבטחה שהבטיח לאבותיהם, ואילו מדברי הזה\"ק מוכח שכל מה שנתגלו להם המטמוניות הוא כדי שלא יצטערו בעבור סתירת הבית. ואף אם נדחוק להשוות דברי הזה\"ק עם דברי המד\"ר, ונאמר דתרי טעמי אית ביה, מ\"מ הא מוכח להדיא דהזה\"ק לא ס\"ל כדברי שאר המדרשים הנ\"ל והגמרא בערכין, שהנגעים מחמת חטא הם באים."},{"passage_id":"vayikru1_83cc15d7_p11","passage_content":"אמנם לאמתו של דבר לא קשה כלל, דלאו סתראי נינהו הני מאמרים להדדי, אלא מר אמר חדא ומר אמר חדא ולא פליגי. כי הנה מצינו בדברי חז\"ל בכמה ענינים שכלולים בהם טעמים שונים וכולם אמת, דהא והא איתנייהו ביה, והוא כעין הא דאיתא בגמרא (מכות דף י' ע\"ב) ר\"ל פתח ואשר לא צדה והאלקים אנה לידו וגו' (שמות כ\"א) כאשר יאמר משל הקדמוני מרשעים יצא רשע (שמואל א' כ\"ד) במה הכתוב מדבר בשני בני אדם שהרגו את הנפש אחד הרג בשוגג ואחד הרג במזיד לזה אין עדים ולזה אין עדים הקב\"ה מזמינן לפונדק אחד זה שהרג במזיד יושב תחת הסולם וזה שהרג בשוגג יורד בסולם ונפל עליו והרגו זה שהרג במזיד נהרג וזה שהרג בשוגג גולה, ע\"כ. הרי מזה דלולא היה היושב תחת הסולם חייב מיתה, לא היה הקב\"ה מסבב שיעלה אותו שהרג בשוגג על הסולם ויפול עליו, ואף שהוא חייב גלות, הי' נענש על עוונו באופן אחר. וכן להיפך אילו לא הי' האיש העולה בסולם חייב גלות לא הי' הקב\"ה מסבב שיפול מן הסולם ויהרוג את היושב תחתיו, אף שאותו האיש חייב מיתה על שהרג את הנפש במזיד, כבר יקבל הוא ענשו בדרך אחר, דהרבה דרכים למקום להפרע מעוברי רצונו. אמנם בהצטרף כל הסיבות יחדיו שזה הרג בשוגג וחייב גלות, וזה הרג במזיד וחייב מיתה, אזי הקב\"ה מזמינן לפונדק אחד, ונפרע משניהם גם יחד, זה מת וזה גולה. ועל זה אמר הכתוב משפטי ה' אמת צדקו יחדיו, כלומר שכל הסיבות והצדדים במשפטי השי\"ת המה אמיתיים וצודקים יחדיו, כי כך דרכו של המקום לצרף יחד כמה ענינים וסבות, ולהפרע מהם כאחת. וכמו שנתבאר דתרוייהו היו חייבים עונש כל אחד על חטאו, והקב\"ה עושה משפט לשניהם בבת אחת, איש על פי פעלו."},{"passage_id":"vayikru1_83cc15d7_p12","passage_content":"וכיוצא בזה אף אנו נאמר בנגעי בתים, שנאמרו בהם כמה טעמים בדברי חז\"ל, דהנה לכאורה להך טעמא דאיתא במדרש ובגמרא ערכין שהנגעים באו לעורר לבות בני ישראל לתשובה, איכא למיפרך שהרי כמה דרכים למקום לעורר את ישראל בתשובה, ומה צורך שתבא ההתעוררות באופן זה דוקא. וביותר יש להפליא לפי מה שכתב הרמב\"ם ז\"ל הנ\"ל, כי ענין נגעי בתים הוא אות ופלא מן השמים, ולא יתכנו בדרך הטבע כלל, וקשה מה צורך היה לנס ופלא מחוץ לדרך הטבע, כדי להחזיר את ישראל בתשובה, והלא יתכן שתבא ההתעוררות בדרך הטבע, דבלא\"ה הוצרך הכהן להגיד לו דברי כבושין, כדאיתא בתורת כהנים והגיד לכהן לאמר יאמר לו הכהן דברי כבושים וכו'. ומצינו בדברי חז\"ל שבעת עבודת הקרבן היו הכהנים בעבודתם והלויים בשירם ובזמרם מכניסים הרהורי תשובה בלב הבעלים, ומדוע איפוא הוצרכו כאן לנס פלאי כ\"כ כדי לעוררם בתשובה."},{"passage_id":"vayikru1_83cc15d7_p13","passage_content":"גם לטעם הגמרא הוריות, שהביא הקב\"ה נגעי בתים למען יתגלו מטמוניות שהטמינו הכנעניים, קשה דכמה דרכים לפני הקב\"ה לגלות מטמוניהם, בלא נסים נגלים כ\"כ, כגון שישלח רוח סערה אשר תקרקר קירות הבית, ויגלו ויראו מחבואיהם. ואף לדברי הזה\"ק קשה, כי אם לא חפץ ה' שידורו ישראל בבתי העכו\"ם, משום רוח הטומאה השורה בהם, היה יכול לנתוץ בתיהם באופנים אחרים שאין בהם נסים נגלים כ\"כ. וכן מצינו שהשמיד הקב\"ה וכלה את הנותרים מז' אומות שלא בדרך נס מפורסם, כדכתיב (דברים ז') וגם את הצרעה ישלח ה' אלקיך בם עד אבוד הנשארים וגו'. אמנם הוא הדבר אשר דברנו, כי כך דרכו של מקום לצרף כל הטעמים והסבות יחד, ובהזדמנם למקום אחד נעשה הנס היוצא מגדר הטבע, בעבור כל הסבות המצורפות. כי הנה אדם זה חטא בעבירה ורצה הקב\"ה להעיר לבו על כך, אולי ישוב ונחם, אמנם לסבה זו בלבד היתה ההתעוררות באה עליו בדרך אחרת, אלא שהקב\"ה חפץ לגלות לו מטמון בקירות ביתו, וגם לבער כוחות הטומאה השורים במדורות העכו\"ם."},{"passage_id":"vayikru1_83cc15d7_p14","passage_content":"ברם לולא הטעם שרצה הקב\"ה לעורר לבו לתשובה, לא היה הקב\"ה עושה נס מפורסם כזה, למען יתגלו המטמוניות או כדי שיתבערו כוחות הטומאה, שהרי יתכן שיעשו כל אלו באופנים אחרים, אלא שנזדמנו כל הטעמים לפונדק אחד, ובצירוף כולם נעשה הנס הגדול הזה, שינגע ה' את ביתו ויבא אל הכהן, והוא יעורר לבו בתוכחות מוסר שישוב על חטאו, ואז יחלצו האבנים ויגלו המטמוניות, ויסתר בנין שנעשה במחשבת ע\"ז, ובאותם אוצרות שנתגלו יחזור ויבנה ביתו בקדושה ובטהרה, וימלאהו בכל טוב."},{"passage_id":"vayikru1_83cc15d7_p15","passage_content":"ואכתי פש גבן לברורי מאמר אחד בדברי חז\"ל הנראה כסותר לכל הטעמים שנאמרו בנגעי בתים, והוא פליאה נשגבה לכאורה, וצ\"ע ליישבו על מכונו. והוא דאיתא בגמרא (סנהדרין דף ע\"א ע\"א) בית המנוגע לא היה ולא עתיד להיות ולמה נכתב דרוש וקבל שכר כמאן כר' אלעזר בר' שמעון דתנן ר\"א בר\"ש אומר לעולם אין הבית טמא עד שיראה כשתי גריסין על שתי אבנים בשתי כתלים בקרן זוית ארכו כשני גריסין ורחבו כגריס וכו', עכ\"ד הגמרא. ובתר הכי איתא בגמרא שם תניא אמר ר' אליעזר בר' צדוק מקום היה בתחום עזה והיו קורין אותו חורבתא סגירתא (ופירש\"י מצורע מתרגמינן סגירתא שניתץ משם בית המנוגע) א\"ר שמעון איש כפר עכו פעם אחת הלכתי לגליל וראיתי מקום שמציינין אותו ואמרו אבנים מנוגעות פינו לשם, ע\"כ."},{"passage_id":"vayikru1_83cc15d7_p16","passage_content":"והנה הך ברייתא דס\"ל בית המנוגע לא היה ולא עתיד להיות, לכאורה ודאי פליגא על כל הני טעמי, שנאמרו בענין נגעי בתים, שהרי בין לדעת המד\"ר והגמרא ערכין דס\"ל שביאת הנגעים היא לעורר את ישראל בתשובה, בין לדעת הגמרא הוריות שבשורה טובה היא לישראל, ובין לדעת הזה\"ק דקאמר שביאת הנגעים היא כדי שיסתרו הבתים שנבנו לשם ע\"ז, מ\"מ כולהו סבירא להו דנגעי בתים היו במציאות, ואילו להך ברייתא נמצא כי מעולם לא היתה כזאת בישראל שיבואו על בתיהם נגעים, וכל הפרשה לא נאמרה אלא לדרוש. ותו קשה דברייתא זו לכאורה פליגא גם על הא דקאמר בגמרא שם, דר' אליעזר בר' צדוק העיד על מקום בתחום עזה שהיו קורין אותו חורבתא סגירתא, ור\"ש איש כפר עכו ראה במו עיניו מקום שמציינין אותו ואומרים אבנים מנוגעות פינו לשם. ולכאורה לא נראה כן מלשון הגמרא דפליגי מדלא מייתי להו בלשון פלוגתא, וצ\"ע."},{"passage_id":"vayikru1_83cc15d7_p17","passage_content":"ובר מן כל דין גוף המאמר עצמו קשה להולמו, דקאמר בית המנוגע לא היה ולא עתיד להיות, ולא נכתב אלא בעבור דרוש וקבל שכר, והוא תימה האם בעבור דרוש וקבל שכר כתבה תורה פרשה שלימה שלא היתה מעולם ולא תהיה עד עולם, הלא התורה הקדושה ארוכה מארץ מדה ורחבה מני ים, זה הים גדול ורחב ידים לצלול במעמקיו, ולהעלות ממנו מרגליות, ואין חקר לעומק חכמת התורה הק', ואף אותם הלכות הצריכות למעשה אין ביד האדם להשיגם על בוריים ומתכונתם, ומה צורך להוסיף עוד פרשה אחת, רק בעבור דרוש וקבל שכר, אם אינה נוהגת למעשה."},{"passage_id":"vayikru1_83cc15d7_p18","passage_content":"ותגדל התמיהה על ברייתא זו, על פי מה שכתבו הרמב\"ם והרמב\"ן ז\"ל כי לא יתכן שיבואו נגעי בתים ובגדים כי אם בדרך נס מחוץ לטבע העולם. ולפי זה נמצא כי נגעי בתים אינם במציאות כלל בעולם, ולא תתכן ביאתם אלא בדרך נס, וא\"כ בשלמא אי נימא כחד מהנך טעמי דלעיל שהביא הקב\"ה עליהם נגעים למען יתעוררו בתשובה, או כדי שיתגלו להם המטמוניות, וכדי שיגורשו כוחות הטומאה מבתיהם. ניחא מה שכתבה תורה פרשה זו, שהרי הקב\"ה יעשה נס זה בפועל להביא נגעים על הבית לצורך התכלית הנרצה. משא\"כ להך ברייתא דסברה בית המנוגע לא היה ולא עתיד להיות, א\"כ הניחא אילו יתכן שיבואו הנגעים על הבית בדרך הטבע, איכא למימר שכתבה תורה פרשה זו בעבור דרוש וקבל שכר, כיון שענין נגעי הבתים ישנו במציאות בעולם, אלא שלא נזדמן שיצטרפו יחד כל התנאים המתחייבים כדי שיטמא הבית. כדמפרש בגמרא שאינו מטמא עד שיראו כשתי גריסין בשתי אבנים על ב' כותלים בקרן זוית. אך לפי מה שכתבו הרמב\"ם והרמב\"ן ז\"ל שלא יבואו נגעים על הבית כי אם בדרך נס, א\"כ נגעי בתים הוא דבר שאינו שייך במציאות בעולם כלל, משום שלא תתכן ביאתו אלא ע\"ד הנס, וכל זמן שלא נעשה הנס אין דבר זה במציאות בעולם כלל. וא\"כ תימה כיצד כתבה תורה דבר שלא היה מעולם, וגם אינו שייך במציאות כלל, כל זמן שלא יעשה הקב\"ה נס זה, דלא מסתברא כלל שתכתוב תורה דברים שאינם במציאות, בעבור דרוש וקבל שכר."},{"passage_id":"vayikru1_83cc15d7_p19","passage_content":"ואשר אנכי אחזה להבין קצת דברי חכמים וחידותם וליישבם על מכונם, דהנה צרעת הבית כך דינה, דכאשר יראה את הנגע בקירות הבית מסגירין אותו שבעת ימים, ואם יראה הכהן ביום השביעי והנה פשה הנגע בקירות הבית וצוה הכהן וחלצו את האבנים אשר בהם הנגע וגו', ולקחו אבנים אחרות והביאו אל תחת האבנים ועפר אחר יקח וטח את הבית, ואחרי כן אם ישוב הנגע ופרח בבית אחר חילוץ האבנים, אזי יתוץ את הבית את אבניו ואת עציו וגו'. ומבואר בדברי רש\"י ז\"ל שם והוא מדברי הת\"כ דאין נתיצה אלא בנגע החוזר אחר חליצה וקיצוי וטיחה, וכן פסק הרמב\"ם ז\"ל בהלכות טומאת צרעת (פרק ט\"ו) ולפי המבואר כי ביאת הנגעים היתה בדרך נס, נמצא כי היו כאן מעשי נסים שני פעמים בזה אחר זה, הראשונה פריחת הנגע בקירות הבית, והב' שאחרי חילוץ אבנים ושימת האבנים אחרות במקומן חזר הנגע לפרוח בבית. ולכאורה קשה דאם חפץ ה' שיתצו את הבית, מה צורך שיבוא הנס ב' פעמים. והלא היה די באחת מהנה, ומיד יתצו את הבית, דכללא אית לן לא עביד קב\"ה ניסא למגנא."},{"passage_id":"vayikru1_83cc15d7_p20","passage_content":"אמנם נראה עפ\"י מה שביארנו כי כל שלשת הטעמים הנאמרים בענין נגעי בתים הנם לאחדים, והן משלימות אחת את חבירתה, והנה מחמת הטעם המבואר בגמרא הוריות ובמד\"ר שיתגלו להם מטמונית, הוה סגי שיבא הנס בבית פעם אחת, ומיד יתצו את הבית ויתגלה המטמון, וכן לטעם הזה\"ק שהבית צריך נתיצה בעבור כוחות הטומאה, נמי הוה סגי בביאת הנגע חדא זימנא, לגלות איזה בית אשר כוחות הטומאה שורין עליו, ומיד יתצוהו ותעקר ע\"ז מארצינו. אכן מחמת אידך טעמא, שיש צורך בנגעים כדי לעורר לתשובה, לא די במה שיבא הנגע על ביתו פעם אחת, שהרי כיון שישנם גם טעמים אחרים לביאת הנגע, מנא ידע שהנגעים באו מחמת חטאו, דילמא לא באו אלא מטעמא דמטמוניות, או כדי לבער כוחות הטומאה מן הארץ, על כן צוה הכתוב שאם יפשה הנגע אחר ההסגר, יחלצו את האבנים ויתנו אבנים אחרות תחתיהם, והכהן היה מייסר אותו בדברי כבושין, בני אין הנגעים באים אלא בעבור לה\"ר, כדאיתא בתורת כהנים, ואם יתן אל לבו לשוב על חטאו, שוב לא יופיע הנגע בקירות ביתו שנית, ואם עדיין יעמוד במרדו ישוב הנגע ופרח בקירות ונתצו את הבית."},{"passage_id":"vayikru1_83cc15d7_p21","passage_content":"והשתא דאתאן להכא, נראה לומר דאף תנא דהך ברייתא דסבר בית המנוגע לא היה ולא עתיד להיות, אזיל ומודה שנמצאו והיו נגעי בתים בארץ ישראל, אלא שכוונתו לומר שלא היתה מעולם כזאת שיחזור הנגע לפרוח בבית אחרי חילוץ האבנים ואחרי הטוח, שהרי הנגע לא חזר לפרוח בבית שנית, כי אם באופן שלא עשה תשובה אחרי הראות הנגע בביתו בפעם הראשון. אמנם מכיון שנגעי הבתים לא באו אלא בדרך נס מופלא, לא היתה ביאתם כי אם בהיות ישראל שלמים לה', ורוח השם עליהם תמיד, וכמבואר כ\"ז באורך ברמב\"ן ס\"פ תזריע, שלא נהג ענין נגעי בתים אלא בארץ שהיא נחלת ה' ודוקא אחר כיבוש וחילוק, משום שאז נתיישבה דעתם עליהם לדעת את ה' ותשרה שכינה בתוכם. וכיון שהיתה ביאת הנגעים רק על בתי השלימים שנפשם זכה וטהורה, על כן בעת אשר בא בעל הבית אל הכהן לאמר לו כנגע נראה לי בבית, החל הכהן מייסרו בתוכחות על עוון, ודברי הכהן היוצאים מקרב לב טהור, ירדו לחדרי בטנו ועשו בו רושם, ונתעורר מיד לשוב על עוונו, ושוב לא היה צורך שיחזור הנגע לפרוח בבית, אחרי חילוץ האבנים ושימת אבנים אחרות במקומן, שהרי כבר סר עוונו וחטאתו נתכפרה ושב ורפא לו."},{"passage_id":"vayikru1_83cc15d7_p22","passage_content":"וזה יהיה ביאור הברייתא בית המנוגע לא היה וכו', כלומר שלא היה במציאות מעולם שתתקיים כל פרשת בית המנוגע, כי מיד היה האיש אשר לו הבית חוזר בתשובה, ולא יסף הנגע להראות בביתו עוד, וכמו שנתבאר שלא נשלחו נגעי בתים אלא לבני העליה, להעירם ולעוררם כי עבירה בידם, ועליהם לשפר מעשיהם, ומי שלא היה בר הכי לא נעשה לו נס מופלא כ\"כ, שיראה הנגע בביתו, כדי לעוררו כי ה' סר מעליו."},{"passage_id":"vayikru1_83cc15d7_p23","passage_content":"והא דקאמר ולא עתיד להיות היינו משום דכל הטעמים שנאמרו בנגעי בתים, לא ינהגו כלל לעתיד. דטעם המבואר בגמרא ערכין ובמד\"ר שהנגעים באים משום חטא, לא יהיה שייך כלל לעת\"ל שאז יתמו חטאים מן הארץ. וכיו\"ב כתבו התוספות בזבחים (דף מ\"ה ע\"א ד\"ה הלכתא) בשם רבינו חיים כהן זצ\"ל, דלא פריך בגמרא אמאי איצטריך לאשמעינן הלכתא למשיחא, אלא היכא דאיכא תרתי הלכתא למשיחא וגם עושה איסור, דכיון דליכא נפקותא אלא ע\"י איסור לא שייך לפסוק הלכתא למשיחא, ע\"כ. (וביאר התוי\"ט ביומא משום דאחרי ביאת המשיח לא יהיו חטאים). ובדרך זו כתב היפה תואר בפרשת צו לבאר אמרם ז\"ל (פ\"ט ג') לעת\"ל כל הקרבנות בטלין חוץ מקרבן תודה, דלכאורה קשה הרי זאת התורה לא תהא מוחלפת, וכיצד יבטלו מצוות אלו. ופירש שכוונת המדרש על קרבנות הבאים על חטא דוקא, דכיון שלא יחטאו לא יצטרכו להביא קרבנות אלו, ועל כן נקט חוץ מקרבן תודה, והכוונה דכל הקרבנות שאינם באים מחמת חטא דומיא דתודה, לא יבטלו לעתיד."},{"passage_id":"vayikru1_83cc15d7_p24","passage_content":"ואף לטעם המדרש שנגעי בתים באים לגלות מטמוניות, לא יהיו שייכים לעתיד, דדוקא כשנכנסו ישראל לארץ, וכבשוה מן ז' אומות אשר ישבו בה בשלום ובשלוה ואכלו מטוב הארץ שהיתה מלאה ברכת ה', ארץ זבת חלב ודבש, ופירותיה משונים ומופלגים בגדלם, ונתעשרו בה ז' האומות עושר רב, וכשמעם אשר ישראל באים עליהם למלחמה, הטמינו את ממונם בבתיהם שלא ישלטו ידי ישראל בהם, והקב\"ה חפץ להוריש לישראל עמל לאומים, על כן שלח על בתיהם נגעים, כדי להנחיל לאוהביו ממונם ואוצרותיהם למלאות. משא\"כ בזמן הגאולה העתידה לא יהיה שייך ענין זה, כי מאז גלינו מארצינו ונתרחקנו מעל אדמתינו, שוב אין ארץ ישראל זבת חלב ודבש, ונשתלחה המאירה בפירותיה ובתבואותיה, כדאיתא בשלהי מסכת כתובות. והכתוב אמר (בחקותי פכ\"ו) ושממו עליה אויביכם היושבים בה (ועי' ברמב\"ן ז\"ל שם), וא\"כ אין ביד האומות יושבי הארץ אוצרות לגנזם מפני ישראל, ולא שייך כלל ענין נגעי הבתים."},{"passage_id":"vayikru1_83cc15d7_p25","passage_content":"ומלבד זאת אין דמיון בין כיבוש הארץ בימי יהושע בן נון לכיבושה בימות המשיח, וכמו שפירש החות דעת אמרם ז\"ל (שבת ס\"ג ע\"א) אין בין עוה\"ז לימות המשיח אלא שעבוד מלכיות בלבד, דהכוונה שבעת כיבוש הארץ מיד ז' עממין לא היו האומות משועבדים ונכנעים לישראל, משא\"כ לימות המשיח עתידין האומות להשתעבד להם ולהכנע תחתם, וכמו שאמר הכתוב וירד מיד ועד ים וגו'. ואמרו ז\"ל (שמו\"ר פל\"ה ה') שעתידין אומות העולם להביא דורונות למלך המשיח, וגם יחזירו לישראל כל מה ששללו ובזזו מהם בזמן הגלות (עי' פירש\"י סוף שה\"ש עה\"פ האלף לך שלמה) וא\"כ ודאי דלא שייך לומר כי יהיו מטמינין ממונם, אדרבה מעצמם יבואו להוביל שי למלך המשיח."},{"passage_id":"vayikru1_83cc15d7_p26","passage_content":"ואף טעמא דע\"ז לא יהי' שייך לעתיד, שהרי רוח הטומאה יעבור מן הארץ והאלילים כרות יכרתו. ופוק חזי מה דאיתא בזה\"ק פרשת פנחס, שלא זו בלבד שביהמ\"ק העתיד יהי' מעשי ידי היוצר ב\"ה, אלא ירושלים כולה תבנה ותכונן ע\"י הקב\"ה בכבודו ובעצמו, כמאה\"כ (יחזקאל ל\"ו) כי אני ה' בניתי הנהרסות וגו', וזה ודאי שלא ישאר שריד מכל הבנינים שבונים המינים והאפיקורסים בא\"י, כי הכל יהיה לעיי חרבות מק\"ו מס\"ת שכתבו מין ישרף, כדי שלא להשאיר שם למינים, כמ\"ש הרמב\"ם ז\"ל (הלכות יסוה\"ת פ\"ו ה\"ח) וכ\"ש אלו הבנינים, (ועי' בדברינו לעיל פ' שמיני רמ\"ד ע\"ב) וא\"כ כיון שכל כוחות הסט\"א יהיו בטלין ומבוטלין, לא שייך לשלוח נגעים לבער כוחות הטומאה. והשתא יתבארו דברי ר\"א בר\"ש בסגנון זה, בית המנוגע לא הי', כלו' שלא נתקיימו כל פרטי הדינים האמורים בפרשת בית המנוגע, שלא הגיע מעולם לידי כך שיהיה צורך לנתוץ את הבית, וכמו שנתבאר דאחרי שנראה הנגע בבית בפעם הראשונה, נתעורר בעל הבית לתשובה, ומיד נרפא הנגע, \"ולא עתיד להיות\" פירוש דבעת הגאולה לא יהיה שייך ענין הנגעים כלל, כדאמרן דכל הטעמים שנאמרו בענין בית המנוגע לא שייכו לעתיד."},{"passage_id":"vayikru1_83cc15d7_p27","passage_content":"ולדרך זה יתבאר גם הא דפריך בגמרא ולמה נכתב ומשני דרוש וקבל שכר, בהקדם מה שכתבנו בביאור דברי הגמרא (ע\"ז ה' ע\"א) דפריך למימרא דאי לא הוו חטאי לא הוו מייתי והכתיב פרשת יבמות ופרשת נחלות ומשני דנאמרו על תנאי, ע\"כ. ולכאורה צ\"ב איך שייך לומר שהקב\"ה נתן מצוות אלו על תנאי אם יחטאו, והרי הכל צפוי, וליכא ספיקא קמיה שמיא, והיה גלוי לפניו שעתידין ישראל לחטוא, ויהיו פרשיות אלו נוהגות בהם. וביארנו דקושית הגמ' היא דאף דהכל גלוי לפניו וידע מראש שעתידין ישראל לחטוא, מ\"מ איך נאמרו פרשיות אלו בשעת מ\"ת, והלא בשעת מ\"ת היו טהורים ונקיים מחטא, ולא שלט בהם מה\"מ, ומכיון שנכתבו בתורה פרשיות אלו הבאות רק ע\"י חטא, א\"כ דבורו של הקב\"ה מכריח את הבחירה לחטוא, ושוב היו ישראל מוכרחין לחטוא, כדי שיתקיימו פרשיות אלו, וכלל גדול הוא שאין הקב\"ה מכריח את הבחירה, ומשני דנאמרו על תנאי, וכיון שלא נאמר הדיבור בהחלט, אין זה דבור המכריח את הבחירה."},{"passage_id":"vayikru1_83cc15d7_p28","passage_content":"אמנם כל שקלא וטריא זו שייכא בפרשת יבמות ונחלות, שהיה גלוי לפניו שעתידין פרשיות אלו להתקיים, אלא שאמרן בדרך תנאי כדי שלא להכריח את הבחירה, משא\"כ בפרשת נגעי בתים, שלא נתקיימו מעולם כל הפרטים הנאמרים בפרשה, כדאמרן שלא אירע מעולם שיחזור הנגע להראות בבית אחרי החילוץ, א\"כ קשה בפשטות כיצד נכתב בתורה דבר שלא נתקיים מעולם, ואינו עתיד להיות עד עולם, והכא לא שייך לשנויי דעל תנאי נאמרו, שהרי היה גלוי לפניו ית' מראש שלא תתקיים פרשה זו לעולם, והיינו דקא פריך ולמה נכתבה, ומשני דרוש וקבל שכר, כלומר שכדי שיתוקן בשלימות החטא שבעבורו באו הנגעים, היה צורך בקריאת פרשת נגעים ולימוד הדרשות היוצאות ממנה, בצירוף לתשובתו של בעה\"ב, כשם שהיה צורך שיחזור האדם בתשובה בעת הקריב את קרבנו, לכפר על חטאתו אשר חטא, ואפ\"ה לא הוה סגי ליה בתשובה בלבד, ולא היתה כפרתו שלימה, כי אם אחרי הקרבת הקרבן, ה\"נ מסגולת הדרשה והלימוד בפרשת נגעיה לכפר על החטא שבעבורו באו, בנוסף לתשובתו של בעה\"ב, ובעבור כך נכתבה פרשה זו ולא שתתקיים כולה בפועל."},{"passage_id":"vayikru1_83cc15d7_p29","passage_content":"ולפי זה לא יסתרו דברי ר\"א בר\"ש דסבר בית המנוגע לא היה ולא עתיד להיות, לעדותו של ר\"ש איש כפר עכו, פ\"א הלכתי לגליל וראיתי מקום שמציינין אותו ואמרו אבנים מנוגעות פינו לשם, שהרי אף ר\"א בר\"ש אזיל ומודה שהיו במציאות נגעי בתים בארץ ישראל, והיו חולצין את האבנים המנוגעות ומפנים אותם, אלא דס\"ל שלא היה כזאת מעולם שיחזור הנגע לפרוח בבית, ויוצרכו לנתוץ את הבית כולו. וגדולה מזו נראה לומר, שאף בעדותו של ר\"א בר' צדוק דאמר מקום היה בתחום עזה שהיו קורין אותו חורבתא סגירתא, על שם שניתץ שם בית המנוגע, אין כאן סתירה לדברי ר\"א בר\"ש, דסבר בית המנוגע לא היה וכו'. ויתבאר עפ\"י דברי הזה\"ק הנ\"ל, כי לפי שבתי הכנענים נבנו במחשבת ע\"ז, היו כוחות הטומאה גדולים שורים עליהם, ולפיכך היה צורך לנתוץ ולהאביד בתים אלו, לבער כוחות הטומאה משם. והאריך שם בזה\"ק בגודל ההיזק העלול לבא על האיש הדר בבתים שנבנו לשם סט\"א, ויהיב סימנא לדעת בבירור כי החיצונים שורים על הבית, אם ניזוקו באותו בית ג' בני אדם שדרו בו, ומסיק הא ודאי יערוק אינש לטורא ולא ידור ביה. ובתר הכי מייתי עובדא דר' יוסי שנכנס בחד ביתא ושמע קול אחד האומר הנה בר פלוגתא דילן, התכנסו ונזיק אותו בטרם יצא, והאחרים השיבוהו שאין הם יכולים להזיקו אלא א\"כ ידור בבית זה."},{"passage_id":"vayikru1_83cc15d7_p30","passage_content":"והנה דברים אלו לא מצד ההלכה נאמרו, שהרי לפי\"מ שנתבאר ביאת הנגעים על הבית הם לייסר אותו על חטאיו, ואם ישוב מיד תתקבל תשובתו, והנגע יסור מן הבית ולא יחזור להראות בו עוד. אלא שטעמו של הזה\"ק הוא רק מצד מדת חסידות וזהירות בעלמא, דוגמת הדברים שהזהיר עליהם רבינו יהודה החסיד בצוואתו, שאין להם מקור בהלכה, אלא ששומר נפשו ירחק מהם. וה\"נ בנגעי בתים, מכיון שלא באו נגעים כי אם על בתי השלימים בעלי הנפש, על כן אף אחר שכבר חזרו בתשובה, ולא הוסיף הנגע להראות בקירות הבית אחרי חילוץ האבנים, והיה להם לאות כי תשובה עשו כהוגן ונתקבלה, אפילו הכי מסתמא חששו לאזהרת הזה\"ק, שביאת הנגע רומזת גם לכוחות הטומאה הנמצאים בבית זה, ומכיון שכנגע נראה להם בבית, הבינו את הרמז ונתצו את הבית, כדי לבער את כוחות הטומאה, אף שלא היו חייבים בכך מצד ההלכה."},{"passage_id":"vayikru1_83cc15d7_p31","passage_content":"ומה גם לפי המבואר בזה\"ק, כי בני העליה היו משיגים בשכלם הזך אחה הבית אשר כוחות הרע שרויים בו, א\"כ מעצמם הבחינו כי עליהם לסתור אותם הבתים. ועוד אפשר שהיו סותרין אותו מטעמא דמטמוניות, אף שכבר לא היו חייבים בכך מחמת ההלכה, שהרי כבר נרפא הנגע ע\"י שחזרו בתשובה, אפ\"ה הם ראו והשיגו כי בביאת הנגע בישרו להם מן השמים שימצאו מטמון בקירות הבית, אלא שלא נצטוו לסותרו מחמת כן, דזהו רק בשורה טובה ולא חובה, ואם הוא חפץ במציאת האוצר עליו לסותרו."},{"passage_id":"vayikru1_83cc15d7_p32","passage_content":"והשתא אתי שפיר אף לדעת ר\"א בר' שמעון הא דקאמר ר' צדוק מקום היה בתחום עזה והיו קורין אותו חורבתא סגירתא, דהנה לכאורה יל\"ד מדוע קראו אותו מקום שנתצו משם בית המנוגע בשם חורבתא סגירתא, הלא מכיון שנתצו את הבית כבר היה טמא מוחלט, שהרי בתחלה מסגירין אותו, ואחר ג' שבועות נותצים אותו, אם עדיין הנגע עמד בעיניו, א\"כ יותר היה ראוי שתקרא אותה חורבה בשם חורבה טמאה וכדו', דחורבתא סגירתא אינו מורה כ\"כ על טומאה מוחלטת. אמנם ע\"פ דברינו יובן היטב, דאותו בית באמת לא היה אלא טמא מוסגר, ואחרי שהסגירוהו חזר בעל הבית בתשובה ונרפא הנגע, וכדאמרן שלא היה כזאת מעולם שלא יתעורר בעה\"ב לתשובה אחרי ההסגר, אלא דאפ\"ה נתצו את הבית מן הטעמים האחרים הרמוזים בביאת נגעי בתים, הלא המה טעמיה דהזה\"ק משום זהירות ושמירת הנפש מכוחות הטומאה השורים בו, וטעמא דמטמוניות, ולפיכך שפיר קראוהו חורבתא סגירתא דייקא, לרמוז שלא היה אותו בית שניתץ כי אם טמא מוסגר, ולא טמא מוחלט, ולא היה צריך נתיצה מצד ההלכה אלא שנתצוהו משאר הטעמים."},{"passage_id":"vayikru1_83cc15d7_p33","passage_content":"ובדרך זו נבא לביאור כל הדקדוקים המוצגים בפתח הדרוש, כי הנה נתבאר בדברינו ענין דרוש וקבל שכר, דהיה צורך בלימוד פרשת נגעים כדי לכפר על החטא שבעבורו באו הנגעים, ושוב לא חזרו הנגעים לפרוח בביתו אחרי החילוץ. והנה לכאורה אם בלימוד הפרשה סגי, א\"כ מה צורך היה שיעשה הנס בפעם הראשונה, ואח\"כ יעסוק בפרשה זו ויתכפר לו, הלא מוטב היה שיעסוק בפרשה במקום שיבואו עליו נגעים בפועל. וצריך לומר דלא סגי בלאו הכי. דמכיון שהצרעת באה בעבור החטא, לא מהני לימוד התורה בעוד שלא שב על חטאו, ולפיכך יש צורך שיבוא עליו הנגע בפועל, ויתעורר לתשובה על ידי דברי כבושין שיאמר אליו הכהן, ואחרי שובו מחטאו יועיל לו לימוד הפרשה, ולא יבואו על ביתו הנגעים שנית."},{"passage_id":"vayikru1_83cc15d7_p34","passage_content":"אמנם יתכן כי בענין זה ישנם דרגות חלוקות זו מזו, ואין ענינם שוה בכל אחד, דאף שנגעי בתים לא באו אלא על בתי הצדיקים, כמבואר בדברי הרמב\"ן ז\"ל, וה\"נ איתא בזה\"ק דכוחות הטומאה שבאותם בתים אינם מזיקים אלא לצדיקים שהם בני פלוגתא שלהם, משא\"כ הרשעים אפשר שידורו שם ולא יזיקום, אפילו הכי לאו כל אנפין היו שוין בזה, דבצדיקים עצמם יש מדריגות חלוקות, וישנם בני עליה שהם בבחינה גבוהה ביותר, ולא הוצרכו כלל שיבואו עליהם הנגעים אפילו פעם ראשונה, אלא בלימוד הפרשה בלחוד הוה סגי להו, ונפטרו מביאת הנגעים בפועל, כי ע\"י לימוד הפרשה נחשב להם כאילו באו עליהם הנגעים, וגם נתבערו מבתיהם כוחות הטומאה, ונתגלו להם המטמוניות, מבלי שיהיה להם צורך בנתיצת הבית."},{"passage_id":"vayikru1_83cc15d7_p35","passage_content":"וזהו שאמרו דרוש וקבל שכר דלדידהו בדרשת הפרשה בלבד סגי ויטלו שכרם משלם שיתבערו כוחות הרע מביתם ויתגלו להם מטמוניות. אך לא כולם זכו למדריגה זו, אלא היו ביניהם אנשים שלא היה די להם בקריאת הפרשה כדאמרן. וכדמות ראיה לחילוק זה יש מהא דאיתא בערכין (דף ט\"ו ע\"ב) דר' אחא בר' חנינא סבירא ליה שאם סיפר אדם לה\"ר אין לו תקנה שכבר כרתו דוד ברוה\"ק, אלא מה תקנתו של אדם שלא יבא לידי לה\"ר אם ת\"ח הוא יעסוק בתורה וכו', וה\"נ כן הוא לענין הנגעים שאם עדיין לא חטא מהני ליה לימוד הפרשה, ושוב אין לו צורך שיבואו עליו הנגעים בפועל, משא\"כ אם חטא, יש צורך שיבואו עליו הנגעים בפועל, ואח\"כ אם ישוב וניחם על חטאו ויעסוק בפרשת נגעים יתכפר לו, ולא יוסיף הנגע עוד להראות בביתו."},{"passage_id":"vayikru1_83cc15d7_p36","passage_content":"ועפ\"י זה יתיישב מה שהקשו המפרשים על הא דאיתא במד\"ר אין בעל הרחמים פוגע בנפשות תחלה, אלא בתחלה הן באים על ביתו וכו', דא\"כ מדוע כתבה תורה פרשת נגעי הגוף תחלה, והדר נגעי בגדים ובתים, היפך סדר ביאתן. ולדברינו א\"ש, דכיון דזמנין מהני לימוד התורה לחוד, ואין צורך שיבואו הנגעים בפועל כלל, על כן הקדים הכתוב נגעי הגוף, לפי שרצון הבוי\"ת שיהיו ישראל עושי רצונו בשלימות הגמור, ויתעסקו בלימוד הפרשה, ולא יצטרכו לביאת הנגעים עליהם בפועל כלל, והיכא דסגי בלימוד הפרשה שפיר דמי להקדים נגעי הגוף, שהרי אין מדת הדין שולטת."},{"passage_id":"vayikru1_83cc15d7_p37","passage_content":"ועל דרך זה ביארנו מאמר הכתוב בתהלים (פצ\"ד) אשרי הגבר אשר תיסרנו י-ה ומתורתך תלמדנו, ולכאורה מאי מעליותא היא לאדם שהוא סובל יסורים הלא אמה\"כ (ישעי' ס') בכל צרתם לו צר ודרשו ז\"ל (חגיגה ט\"ו ע\"ב) בזמן שאדם מישראל בצער שכינה מה אומרת קלני מראשי וכו', וביארנו דכשם שאפשר לצאת ידי חובת קרבן בלימוד הפרשה כמאה\"כ (הושע י\"ד) ונשלמה פרים שפתינו, ה\"נ אם זוכה האדם בסייעתא דשמיא ללמוד תורה לשמה, ולעבוד את השי\"ת, אזי אף אם נגזרו עליו יסורין, יוצא הוא במה שהוא לומד בתורה בפרשת הנגעים והיסורין, ונחשב לו כאילו באו עליו יסורין בפועל. וז\"ש הכתוב אשרי הגבר אשר תיסרנו, אימתי שבחו של אדם שהקב\"ה מיסרנו, באופן שמתורתך תלמדנו, כלומר שיוצא יד\"ח היסורין בלימוד התורה, ולא שיבואו עליו בפועל. ובאופן זה ביארנו גם דברי הגמרא בזבחים (דף צ' ע\"א) במה שמצינו שהקדים הכתוב עולה לחטאת ומשני למקראה הקדימה הכתוב (עיין בדברינו לעיל פרשת ויקרא)."},{"passage_id":"vayikru1_83cc15d7_p38","passage_content":"ובבחינה זו יתבארו מקראי קדש בפרשתא הדין, דפתח הכתוב לומר זאת תהיה תורת המצורע וגו' \"והובא אל הכהן\", ואח\"כ אמר ויצא הכהן אל מחוץ למחנה, הרי שאין מביאין אותו אל הכהן, אלא שהכהן יוצא אליו. ונראה כי לפי שרצון השי\"ת הוא שיועיל לימוד התורה בלבד, ולא יהי' צורך לביאת הנגעים בפועל, ע\"כ פתח קרא לאמר זאת תהי' תורת המצורע, כלומר שתהי' הויה וקיום לתורת המצורע, מבלי שתבא עליו הצרעת בפועל, תנאי הם הדברים, ביום טהרתו, שיקבל על עצמו שמהיום והלאה יעשה תשובה שלימה באמת, ויקבל עליו עול מלכות שמים ועול תורה ועול מצוות, ואז יהי' די לו בלימוד התורה בלבד, ויחשב לימודו כאילו באו עליו הנגעים בפועל. וז\"ש הכתוב והובא אל הכהן, דכיון שלא בא עליו הנגע בפועל, יכול הוא לבא בעצמו אל הכהן, ואין צורך שילך הכהן אליו. והדר אמר קרא ויצא הכהן אל מחוץ למחנה, האי קרא מיירי במי שחטא ולא הועיל לו לימוד התורה בלחוד, אלא באו עליו הנגעים בפועל, ולפיכך הכהן צריך לצאת אליו אל מחוץ למחנה שהרי אינו יכול לבא אל המחנה כל עוד טומאתו בו."},{"passage_id":"vayikru1_83cc15d7_p39","passage_content":"ובזה יתבאר המד\"ר הה\"ד ולרשע אמר אלקים מה לך לספר חקי ותשא בריתי עלי פיך, דנתכוון בזה ליישב מה שאמה\"כ ויצא הכהן וגו', ולכאורה מדוע לא הוה סגי ליה בלימוד התורה, כמו ברישא דכתיב זאת תהיה תורת המצורע, לזאת אמר הה\"ד ולרשע אמר אלקים מה לך לספר חקי, כלומר כיון שכבר חטאת בפועל והנך בבחינת רשע, לא יועיל לך לימוד התורה בלבד, דמה ערך יש לתורתך, בעוד שלא עשית תשובה שלימה על החטא, לזאת יש צורך שיבואו עליו הנגעים בפועל, או אז יכנע לבבו הערל, ויתעורר לתשובה כראוי, וסר עוונו וחטאתו תכופר, ואז תהיה לו תועלת בלימוד התורה."}]},{"dvar_torah_id":"vayikru1_16891b0f","title":"סדר נגעים וחורבן הבית","summary":"הקדמת פרשת נגעי הגוף לנגעי בתים רומזת על חורבן הבית, שהוא עונש חמור יותר. יש להמתין לגאולה ולא לדחוק את הקץ, כי הגאולה תלויה בתשובה. הקב\"ה אינו חפץ בקילוסן של רשעים, כי בכך יש חירוף וגידוף.","contents":[{"passage_id":"vayikru1_16891b0f_p1","passage_content":"עוד אפ\"ל בטעם שהקדים הכתוב פרשת נגעי הגוף לנגעי בגדים ובתים, ולפי כללא דאין בעל הרחמים פוגע בנפשות תחלה, היה ראוי שיאמר הכתוב נגעי בתים בראשונה כסדר ביאתם, ונראה דאף כי לפי פשטות הכתוב היה ראוי להפך הסדר, מ\"מ הלא הפשט והדרש המה מצומדים יחדיו, ולצד שעפ\"י הדרש קאי פרשת נגעי בתים על חורבן ביהמ\"ק, לפיכך כתובה פרשת נגעי בתים באחרונה, דחורבן הבית הי' בסוף כל העונשים, שהאריך הקב\"ה אפו מספר שנים כמנין ונושנתם כאמרם ז\"ל. ואף דלפי הכלל דאין בעל הרחמים פוגע בנפשות תחלה היה בדין שיקדים נגעי בתים, אפ\"ה כתיבי נגעי הגוף תחלה, משום שחורבן הבית הוא הדין הקשה ביותר וגרע מנגעי הגוף, דדא ביה כולא ביה שהחורבן גרם לכל הצרות והרעות שעברו על ישראל, ומאז הלכו הלוך וחסור, עדי ישקיף ה' משמים וירא בעניינו, ויתקיים בנו מקרא שכתוב ולקחו אבנים אחרות וגו' ונזכה לגאולה השלימה בקרוב. ועוד אפ\"ל דלפי שסוף פרשת נגעי בתים רומזת לבנין המקווה העתיד להתגלות לנו, על כן הקדימה תורה פרשת נגעי הגוף, אף דלפי הסדר היה ראוי לכתבה באחרונה, מ\"מ כיון דבפנימיות הפרשה רמוז הבית השלישי, שאחרי הבנותו שוב לא תהיה מציאות הנגעים בעולם, משום הכי לא כתבה תורה נגעי הגוף אחרי פרשת נגעי בתים."},{"passage_id":"vayikru1_16891b0f_p2","passage_content":"ואפ\"ל באופן אחר הא דמשני בגמרא דפרשת נגעי בתים נאמרה בעבור דרוש וקבל שכר, עפ\"י דברי ק\"ז זלה\"ה בישמח משה פרשת דברים בשם הטורי זהב זלה\"ה לפרש הכתוב (ירמי' ל') כי נדחה קראו לך ציון היא דורש אין לה, דהנה איתא במדרשים דשם ציון הוא ע\"ש מצויינים בהלכה מצויינים במצוות. והנה איתא בספרים ובמדרשים דלכן נחרבה ירושלים משום שהיו עובדין בה ע\"ז ונידונה כעיר הנידחת, אמנם הנה איתא במסכת סנהדרין (ע\"א ע\"א) עיר הנדחת לא היה ולא עתיד להיות, אתיא כר' אליעזר דאמר עיר שיש בה מזוזה אחת אינה נעשית עיר הנדחת. והכוונה דכל מצוה שיש בה מצלת על כל העיר שלא תדון כעיר הנדחת, ולא יתכן כזאת שלא תהיה בה איזה מצוה. וזהו פירוש הכתוב נדחה קראו לך, שאומרים על ירושלים כי היא עיר הנדחת, והוא תרתי דסתרי אהדדי, דכיון שהיא נקראת ציון ע\"ש מצויינים במצוות, לא יתכן שתהיה עיר הנדחת. אבל הסבה שקראו לך נדחה הוא משום שדורש אין לה, כלומר שאין דורשין את הטעם מפני מה היא נקראת ציון, על כן קראו לך נדחה, אבל באמת לא נדחה את, עכת\"ד הט\"ז זלה\"ה."},{"passage_id":"vayikru1_16891b0f_p3","passage_content":"ואחר כך הביא ק\"ז זלה\"ה בשם ספר אחד להוסיף נופך באופן אחר קצת דבגמרא סנהדרין שם פריך על האי מימרא דעיר הנדחת לא היה ולא עתיד להיות, דא\"כ למה נכתבה, ומשני דרוש וקבל שכר. נמצא מזה דאם עוסקים בתורה ודורשין בה, אזי יתכן לומר כר' אליעזר דעיר הנדחת לא היה וכו', שהרי אף איהו סבר דהדרשה בתורה טובה היא מאד, ושפיר איכא למימר שכל הפרשה נאמרה בעבור דרוש וקבל שכר, אבל כיון דדורש בתורה אין לה, פירוש שאין מחשיבין זאת לדבר טוב לדרוש בתורה, א\"כ לדידהו לא יתכן לומר כר\"א דעיר הנדחת נכתבה בעבור דרוש וקבל שכר, ולפי\"ז נדחה קראו לה לציון וכו', עכת\"ד ק\"ז זלה\"ה עיי\"ש באורך."},{"passage_id":"vayikru1_16891b0f_p4","passage_content":"ולענינינו אפשר לומר דהנה פרשת נגעי בתים נדרשת על חורבן בית המקדש (עיין קושיא ו') ומסיים במדרש שם יכול לעולם תלמוד לומר ולקחו אבנים אחרות שנאמר כה אמר ה' הנני יסד בציון אבן אבן בוחן פנת יקרת מוסד מוסד המאמין לא יחיש, ע\"כ. עכ\"פ בפרשת נגעי בתים רמוז ענין חורבן הבית, ושעתיד הוא לחזור ולהבנות ע\"י הקב\"ה, בעת שיעלה רצון מלפניו לגאלינו, וכדמייתי מקרא דישעי' הנני יסד בציון וגו'. וזהו שתירצו בגמרא דרוש וקבל שכר כלומר שאם לומדים את הדרשות שבפרשת נגעים, ומשימים אל הלב כי חורבן ביהמ\"ק וגם בנינו הכל בידי שמים, אזי בשכר זאת זוכין לקבל פני משיח צדקינו."},{"passage_id":"vayikru1_16891b0f_p5","passage_content":"ויתכן דלענין זה הביא המדרש סיום דברי הכתוב בישעיה והמאמין לא יחיש, דרש\"י ז\"ל פירש המאמין דבר זה לא ימהרנה לא יאמר אם אמת הוא ימהר לבא, ע\"כ. ולכאורה מדברי הכתוב משמע דהיינו מעליותיה דהמאמין, שאינו ממהר עצמו להזדרז לגאולה. ולפי פירוש רש\"י ז\"ל היה ראוי שיאמר, המאמין אע\"פ שיתאחר לבא לא יפול מאמונתו, וע\"ד שכתב הרמב\"ם ז\"ל בי\"ג עיקרים ואעפ\"י שיתמהמה עם כל זה אחכה לו וכו'. ואפשר שכונת הכתוב לרמוז, כי המאמין בביאת משיח צדקינו אינו ממהר עצמו להיות בין אותם החוטפים לעצמם חירות וממשלה קודם זמן הקץ, אלא מצפה וממתין לביאת משיח צדקינו שיגאלינו גאולת עולמים."},{"passage_id":"vayikru1_16891b0f_p6","passage_content":"והנה מעולם נתקשיתי בדברי המהר\"ל מפראג ז\"ל בספרו נצח ישראל (פכ\"ד), שהאריך בענין שלש השבועות שהשביע הקב\"ה את ישראל שלא יעלו לחומה וכו' וסיים לפרש מאמרם ז\"ל (שהש\"ר פ\"ב י\"ח) שהשביען בדורו של שמד, שהכוונה דאף אם יהיו רוצים להמית אותם בעינויים קשים לא יהיו יוצאים מן הגלות, ולא יהיו משנים בזה, עכ\"ד ז\"ל. ולכאורה הוא פלאי מהיכן מקור דבר זה שיתחייבו ישראל למסור עצמם למיתה שלא לצאת מן הגלות קודם הזמן, ואין לומר שהוא בעבור חומר השבועה, שהרי אף שעונשה של שבועה חמור הוא יותר משאר עבירות, כדאיתא בגמרא (שבועות ל\"ט ע\"א) שנפרעין ממנו וממשפחתו ומכל העולם כולו, וביותר מבואר בשלהי מסכת כתובות חומר העונש של העוברים על שלש שבועות הללו, מ\"מ לא מצינו בשום מקום שיהיו מצווים ביהרג ואל יעבור, מלבד בשלש עבירות החמורות, ומאין הרגלים לדבר זה שישראל חייבים למסור עצמם למיתה שלא יצאו מן הגלות לפני הזמן."},{"passage_id":"vayikru1_16891b0f_p7","passage_content":"והתבוננתי בזה דבאמת בשהש\"ר מבואר דמלבד איסור השבועה, יש עוד איסור נוסף בדחיקת הקץ, דמונה והולך שם כל אותם שנענשו בעבור שדחקו את הקץ, וקאמר שנענשו על שעברו על הקץ ועברו על השבועה, הרי דשני ענינים הם, דמלבד שיש איסור בדחיקת הקץ משום העברה על השבועה, נוסף עליו עוד איסור של העברה על הקץ, ולכאורה מה מקורו של איסור העברה על הקץ בלא איסור השבועה. גם דברי הרמב\"ם ז\"ל באגרת תימן צריכים ביאור, שכתב שם בביאור השבועה שלא ידחקו את הקץ וז\"ל, לפי שידע שלמה ברוה\"ק שהאומה הזאת באורך זמן גלותה תפצר להתנועע בלא עתה הראוי, ויאבדו בשביל זה ויבואו עליהם צרות, הזהירם מלעשות זאת, והשביע האומה ע\"ד משל ואמר השבעתי אתכם וכו', עכ\"ל. ולכאורה אין דבריו ז\"ל מובנים במה שאמר שהשבועה היא ע\"ד משל, וכי משלים הוא ממשיל, והלא שבועה חמורה היא זו."},{"passage_id":"vayikru1_16891b0f_p8","passage_content":"ואפשר לומר בביאור דבריו על פי דברי בעל העקידה ז\"ל בפרשת נצבים, שנתקשה מאד במה שאמרו ז\"ל בכ\"מ שישראל מושבעין ועומדין הם מהר סיני על קיום המצוות (שבועות כ\"א ע\"ב), ותמה תמה יקרא היאך תחול שבועה על בנים מכח קבלת אבות, והאריך בענין זה טובא, ותמצית דבריו הם כי לא מכח שבועה ממש אנחנו מחוייבים לשמור התורה, כי אם זה מהכרח קיומנו וחיותינו, שהוא חמור יותר משבועה, שאם ח\"ו אנו מפירים ברית התורה והמצוות, הקב\"ה מסלק שמירתו מעלינו, והצרות באות ח\"ו ע\"י שונאינו העומדים עלינו לכלותינו, עכת\"ד בעל העקידה (הובאו דבריו בשל\"ה הקדוש ח\"א עשרה מאמרות מאמר ב')."},{"passage_id":"vayikru1_16891b0f_p9","passage_content":"ובדרך זה אפ\"ל גם דברי הרמב\"ם ז\"ל, דנקט שהשביע את האומה ע\"ד משל, דהנה הרמב\"ם ז\"ל פסק בהלכות תשובה (פ\"ז ה\"ה) וז\"ל, אין ישראל נגאלין אלא בתשובה, וכבר הבטיחה תורה שסוף ישראל לעשות תשובה בסוף גלותן ומיד הן נגאלין, שנאמר והיה כי יבואו עליך כל הדברים האלה וגו' ושבת עד ה' אלקיך ושב ה' אלקיך את שבותך וגו', ע\"כ. ומדברי הרמב\"ם ז\"ל בהלכות מלכים (פ\"י ה\"א) מבואר, דמי שסובר שיתכן שתהיה ביאת המשיח בלא שיעשו ישראל תשובה קודם לכן הריהו כופר בכל התורה כולה, וז\"ל שם, וכל מי שאינו מאמין בו או אינו מחכה לביאתו, לא בשאר נביאים בלבד הוא כופר, אלא בתורה ובמשה רבינו שהרי התורה העידה עליו ושב ה' אלקיך את שבותך ורחמך ושב וקבצך וגו' אם יהיה נדחך בקצה השמים וגו' והביאך ה' וגו', ואלו הדברים המפורשים בתורה הם כוללים כל הדברים שנאמרו ע\"י כל הנביאים וכו', עכ\"ד ז\"ל. והנה בתחלת אותו פסוק עצמו שבו נאמר ענין הגאולה וקיבוץ נדחי ישראל, מפורש גם שתקדם התשובה לביאת המשיח, וכמבואר ברמב\"ם הלכות תשובה הנ\"ל דכתיב ושבת עד ה' אלקיך וגו' ושב ה' אלקיך את שבותך. וא\"כ אין שום ספק שאין שום חילוק בין מי שאינו מאמין בהבטחת ביאת המשיח, לבין מי שאינו מאמין בהבטחת אותו פסוק עצמו, שיעשו ישראל חשובה לפני ביאתו, וכשם שהכופר בביאת המשיח הריהו כופר בתורה, כמו כן הכופר בהבטחה זו שיעשו ישראל תשובה. ומינה שהחושבין ליטול גאולה לעצמן בטרם עת קץ, לפני שעשו ישראל תשובה, הרי זה כפירה בתורה, ומשום הכי פסק המהר\"ל ז\"ל שחייבים ישראל למסור עצמם למיתה, שלא לצאת מן הגלות לפני הזמן, שהרי העובר על כך הרי הוא כופר בתורה, שנאמר בה במפורש שעתידין ישראל לעשות תשובה לפני ביאתו, ומבלי התשובה א\"א לגאולה שתבא."},{"passage_id":"vayikru1_16891b0f_p10","passage_content":"והשתא מבוארים גם דברי הרמב\"ם ז\"ל באגרת תימן, שכתב על השבועה שלא ידחקו את הקץ שהיא ע\"ד משל, כי באמת איסור דחיקת הקץ חמור הרבה יותר משבועה, כי העובר על כך הרי הוא כופר בתורה, אלא שכדי להודיענו חומר האיסור המשילוה לשבועה, וע\"ד שכתב בעל העקידה הנ\"ל בשבועת התורה. ואתי שפיר מה דאיתא במדרש איסור העברה על הקץ מלבד איסור העברה על השבועה, כי מלבד השבועה בענין הקץ, עוד יש איסור חמור יותר והיא העברה על הקץ, שזה כפירה בתורה, ועל כן חמור עד מאד עונש הדוחקין את הקץ, כדאיתא בגמ' סוף כתובות הריני מתיר בשרכם ח\"ו."},{"passage_id":"vayikru1_16891b0f_p11","passage_content":"וחזינן דאף בעל העקידה עצמו שנתקשה מאד בענין שבועת התורה, שהושבעו במעמד הר סיני כל הדורות העתידין לבא, וס\"ל דאין זו שבועה ממש, אפ\"ה כתב הוא עצמו כמה חמור עונש הדוחקים את הקץ, וז\"ל בפרשת וישלח (שער כ\"ו) עה\"פ נסעה ונלכה ואלכה לנגדך, שאין ספק שסוף הסיפור מוכיח על אחרית הימים, והוא כשאמר לו נסעה ונלכה ואלכה לנגדך, הראה מדבריו שהיה אפשר שיהיה ענינם על מצב שוה או קרוב אליו, ויעקב אבינו ע\"ה אמר בתשובתו אם ידפקום יום אחד למהר את הקץ בטרם יחפץ ומתו כל הצאן, עכ\"ד העקדת יצחק ז\"ל. הרי דאף דלדבריו לא שייך להשביע מתחלה את הדורות העתידים לבא, ועל כרחך דאף שלש שבועות הללו אינם שבועות ממש לפי דעתו, אפ\"ה עונש העובר עליהם גדול מאד, וע\"כ לומר כדפרישנא בדברי הרמב\"ם ז\"ל, דאיסורו חמור מאד משום שהוא כופר בתורה, (ועיין בענין זה בארוכה בספרי ויואל משה מאמר שלש שבועות מסימן ל\"ב ועד סימן ע\"ז)."},{"passage_id":"vayikru1_16891b0f_p12","passage_content":"ועפ\"י המבואר כי אותם הדוחקין את הקץ הם כופרים בתורה, יתבאר היטב הכתוב והמאמין לא יחיש עפ\"י פשטות, דכל עוד שהוא מאמין בתורה שנאמר בה שיעשו ישראל תשובה בטרם יגאלו, אינו ממהר לקחת הגאולה לפני הזמן, ומי שהוא ממהר ודוחק את הקץ שוב אינו מאמין בתוה\"ק. ואפשר דהיינו טעמא שהביא המדרש סיום דברי הכתוב והמאמין לא יחיש לפרשת נגעי בתים, לפי שפרשה זו רומזת על החורבן ועל הגאולה העתידה, על כן הודיענו המדרש שהגאולה תלויה בזה שלא נדחוק את הקץ לפני זמנו אלא נצפה ונמתין לביאת משיח צדקינו. וכאשר הבאנו כמה פעמים דברי הילקוט פרשת בא (רמז קצ\"א) מי פורע לכם ממלכות רביעית נטרונא והיה לכם למשמרת. אל תאכלו ממנו נא לא תבעיניה מהבהבא ופירש בזית רענן נטרונא שצריכין לשמור ולהמתין לא תבעיניה מהבהבא אל תבקשו לאכול אותו בהבהוב כלומר שאינו צלוי כל צרכו, ע\"כ. מבואר מזה שבזכות שנשמור ונצפה לביאת משיח צדקינו, ולא נבקש להנות מגאולה הבאה לפני הזמן, נזכה לצאת מן הגלות ולקבל פני משיח צדקינו."},{"passage_id":"vayikru1_16891b0f_p13","passage_content":"ועתה נבא לביאור המד\"ר עה\"כ זאת תהיה תורת המצורע הה\"ד ולרשע אמר אלקים מה לך לספר חקי ותשא בריתי עלי פיך וכו' בתורה בנביאים ובכתובים מצינו שאין הקב\"ה חפץ בקילוסן של רשעים וכו'. וצ\"ב שייכות דרשה זו לענינא דמצורע (עיין קושיא ד'). ואשר אנכי אחזה בביאור דברי המדרש, דהנה התבוננתי בדברי המד\"ר בפרשתא דמצורע שיש בו מקושי ההבנה לכאורה, וז\"ל המדרש (פי\"ז ג') על עשרה דברים נגעים באים על ע\"ז ועל ג\"ע ועל שפ\"ד וכו', על ע\"ז מישראל שהעידו עדות שקר בהקב\"ה ואמרו לעגל (שמות ל\"ה) אלה אלהיך ישראל, ומנין שלקו בצרעת שנא' וירא משה את העם כי פרוע הוא שפרחה בהן צרעת וכו', עכ\"ד. וקשה דפתח לומר שעובדי ע\"ז משפטם חרוץ ללקות בצרעת, ומייתי ראיה ממה שלקו ישראל בצרעת בעון שהעידו עדות שקר, ולכאורה אין לנו מכאן אלא שבעון עדות שקר לוקין בצרעת, ואכתי מנא לן שעובדי ע\"ז עונשן ללקות בצרעת. אח\"כ מצאתי שבחידושי מהרז\"ו על המד\"ר נתקשה בזה עיי\"ש."},{"passage_id":"vayikru1_16891b0f_p14","passage_content":"ואפ\"ל בביאור המדרש דהנה הראשונים מפרשי התורה ה\"ה הרמב\"ן והאבן עזרא ובעלי התוס' והספורנו האריכו למעניתם בענין העגל שטעו אחריו ישראל, וכולם מתנבאים בסגנון אחד, שלא יתכן לומר שחשבו ישראל כי עגל הזהב הוא האלהים, כי לא יצוייר טפשות כזה באותו דור דיעה, אלא שביקשו למנות להם מנהיג במקום משה. וכתב הרמב\"ן ז\"ל בדברי הכתוב אלהים אשר ילכו לפנינו, שזה מפתח לדעת ענין העגל ומחשבת עושיו, כי בידוע שלא היו ישראל סבורים שמשה הוא האלקים, אלא היו מבקשים לעצמם מורה דרך כמשה, להורות להם דרך ילכו בה, כי טעו וחשבו שכבר מת משה. עוד כתב שם בד\"ה אלה אלהיך ישראל, שגם זה הכתוב יורה אותך כי אין טפש בעולם שיחשוב כי הזהב הזה אשר באזניהם הוא אשר הוציאם ממצרים, אבל אמרו כי כח הצורה הזאת העלם משם, ומודים במי שאמר אנכי ה' אלקיך אשר הוצאתיך מארץ מצרים, וזהו שנאמר וימירו את כבודם בתבנית שור אוכל עשב."},{"passage_id":"vayikru1_16891b0f_p15","passage_content":"והעולה מכלל דבריהם הוא, כי כשאמרו אלה אלהיך ישראל היתה כוונתם על הקדוש ברוך הוא, אלא שנתכוונו שאותה השפעה עצמה שהיתה יורדת להם על ידי משה רבינו ע\"ה אשר הוציאם ממצרים, תמשיך לרדת אליהם באמצעות העגל ובסיבתו. וזו היתה טעותם, כי משה רבינו ע\"ה היה צדיק וקדוש, ומשום כך השפיע הקב\"ה כל טוב לישראל על ידו, ושלחו לעשות את כל הנסים האלה, משא\"כ העגל שהוא דבר שאסרה תורה לעשותו, לא יתכן שיהיה הוא אמצעי להמשיך השפעות ונסים, אפילו אם כוונת ישראל היא לשמים. וכיוצא בזה כתבו בעלי התוספות, שלא נתכוונו אלא למנות להם מנהיג במקום משה וכו', ומה שאמר דוד (תהלים ק\"ו) וימירו את כבודם בתבנית שור אוכל עשב, היינו שהמירו את משרע\"ה שעשה להם הקב\"ה נסים על ידו, בתבנית שור, במה שאמרו כי אותם הנסים יעשו מעתה ע\"י העגל, עכת\"ד ז\"ל."},{"passage_id":"vayikru1_16891b0f_p16","passage_content":"מכל הלין מבואר כי דבר זה עצמו שמספרין אשר הקב\"ה עושה נסים ע\"י דבר האסור, הוא בחינת עבודה זרה, כי לא יתכן שיעשה השי\"ת נסים כי אם ע\"י צדיקים עובדי השי\"ת ההולכים בדרך התורה, לא זולת. וזה היה חטאם של ישראל במעשה העגל, שסברו לומר שיעשה להם הקב\"ה אותות ומופתים ע\"י העגל שאסור לעשותו, וכמו כן אם מחשבין שיש נסים מהקב\"ה הנעשים ע\"י דבר איסור, הוי ע\"ז גמורה כחטא העגל. ובזה מובן מה דמייתי המד\"ר ראי' לדבר שעונשן של עוע\"ז ללקות בצרעת, ממה שמצינו שלקו ישראל בצרעת על שהעידו עדות שקר בהקב\"ה, באמרם אלה אלהיך ישראל, דשפיר איכא ראיה מהכא לעבודה זרה, שהרי דבר זה עצמו שהעידו שקר באמרם שהקב\"ה ימשיך להם מעתה השפעת הנסים ע\"י העגל, כשם שעד עתה נמשכה השפעה זו ע\"י משרע\"ה, הויא עבודה זרה, דזה היה ענין הע\"ז במעשה העגל, שבדו שקר כי הקב\"ה יעשה להם נסים על ידו."},{"passage_id":"vayikru1_16891b0f_p17","passage_content":"ומזה נשמע עד היכן הדברים מגיעים, שאם בזמן שסיפרו ישראל בנסי יציאת מצרים האמיתיים כך, וכאשר נתבאר דבמה שאמרו אלה אלהיך ישראל אשר העלוך וגו' נתכוונו על הקב\"ה, אלא שאמרו שאותה ההשפעה שהוריד להם משרע\"ה, שע\"י עשה את כל המופתים האלה תרד להם מעתה באמצעות העגל, ועדות שקר זו הויא ע\"ז, כי בדברים כאלה נוטים מדרך האמונה, ועושים לאין ולאפס את הנסים האמיתיים שהקב\"ה עושה ע\"י עושי רצונו הצדיקים הקדושים, במה שמדמין להם בעדות שקר את נסי העגל, עאכו\"כ שע\"ז גמורה היא לספר בנסי הרשעים ובהצלחותיהם, וכאשר רואים בחוש, כי סיפור הנסים הנעשים ע\"י הרשעים, גורם להטות אשוריהם מדרך האמונה. ומה גם שהמה יודעים בעצמם שכל הנסים שהם מספרים שקר וכזב המה, הבל הבלים שאין בהם ממש, וכשמדמין נסים בדויים ומזוייפים אלו לנסי הקב\"ה, הוי כפירה גמורה, כי בכך הם מגלים דעתם להדיא, כי כשם שנסים מזוייפים אלו אין בהם ממש, כך כל נסי הקב\"ה אינם נחשבים אצלם למאומה."},{"passage_id":"vayikru1_16891b0f_p18","passage_content":"ועל פי הדברים האלה יובן היטב מה שסמך המדרש לענינא דמצורע את דברי הכתוב ולרשע אמר אלקים מה לך לספר חקי, ומבאר והולך שאין הקב\"ה חפץ בקילוסו של אדם רשע. דהנה לכאורה יפלא מדוע אין הקב\"ה חפץ בכך שיקלסו אותו הרשעים הלא שבח גדול הוא כשהקילוס בא מן השונאים, כדאיתא במד\"ר פ' עקב (פ\"ג ח') עה\"פ ברוך תהיה מכל העמים, א\"ר חייא בר אבא אין שבחה של מטרונה בשעה שמתקלסת מקרובותיה אלא בשעה שמתקלסת מצרותיה, ע\"כ. אמנם אפילו הכי אין הקב\"ה חפץ בקילוסו של רשת מפני שאותו רשע ודאי יספר גם נסים שנעשו ע\"י דבר האסור, וידמה אותם לנסי הקב\"ה, וזה הוי חירוף וגידוף ועבודה זרה. ולזה מוטב לו שישב בדד וידום, ולא יספר כלל בשבחו של מקום."},{"passage_id":"vayikru1_16891b0f_p19","passage_content":"ולפי זה שפיר שייך ענין זה לפרשתא דמצורע, שהרי מבואר במד\"ר הנ\"ל שבעון שמעידין עדות שקר בהקב\"ה, לבדות מן הלב שהקב\"ה ימשיך השפעת נסים ע\"י רשעים וע\"י דברים האסורים, לוקים בצרעת, דסיפורי נסים כאלה הרי הם עבודה זרה, ולפיכך מייתי להכא שאין הקב\"ה חפץ בקילוסן של רשעים, משום שמקילוסן של רשעים יוצא חירוף וגידוף. והבוכ\"ע יעזור שנזכה להיות דבוקים בתוה\"ק ובאמונה שלימה בהקב\"ה, ובימי שמחה אלו המסוגלים לגאולה בניסן נגאלו ובניסן עתידין להגאל, נזכה שהבוכ\"ע ישמח לבבות בני ישראל, ונזכה לעבדו בקדושה ובטהרה בשמחה ובנחת, ובמהרה נזכה לראות את הגאולה השלימה בלי צרה ועקתא, בישועת כל ישראל ושמחתן ובהתגלות כבוד שמים עלינו בב\"א."}]},{"dvar_torah_id":"vayikru1_1621310a","title":"בשורה טובה בנגעי בתים לישראל","summary":"בגמרא ובמדרש נאמר כי נגעי בתים הם בשורה טובה לישראל, כי הם מבטלים את כוחות הטומאה ומביאים קדושה. דברי הזהר מסבירים את הקשר בין הנגעים לביטול העבודה זרה, ומדגישים את השמחה שבביטול הטומאה והחזרת הקדושה.","contents":[{"passage_id":"vayikru1_1621310a_p1","passage_content":"באופן אחר יש ליישב הא דאיתא בגמרא בהוריות, דביאת נגעי בתים בשורה טובה היא לישראל, וכמבואר במדרש רבה וז\"ל, וכי בשורה היא להם שהנגעים באים עליהם, תני רשב\"י כיון ששמעו כנענים שישראל באים עליהם עמדו והטמינו ממונם בבתים ובשדות וכו' מה הקב\"ה עושה מגרה נגעים בביתו והוא סותרו ומוצא בו סימא. ולכאורה דברי הגמרא והמד\"ר הללו פליגי על הטעם המבואר בזה\"ק פרשת תזריע (דף נ' ע\"א) וז\"ל, מאן דעביד עבידתא לע\"ז וכו' הא רוח מסאבא שריא עליה כנענים פלחי לע\"ז נינהו ומתדבקין כולהו כחדא ברוח מסאבא בע\"ז וכו' כיון דעאלו ישראל לארעא בעא קב\"ה לדכאה לון ולקדשא לון ארעא וכו' וע\"ד בההיא נגע צרעת הוו סתרין בנינין דאתעבידו במסאבא תא חזי אי עובדא דא הוה לאשכחא מטמונין בלחודוי יהדרון אבנין לבתר כמה דאינון לאתרייהו וכו' אבל קרא כתיב וחלצו את האבנים וכתיב ועפר אחר יקח בגין דיתעבר רוחא מסאבא ויתפני ויתקדש השתא כמלקדמין וכו', עכ\"ד הזה\"ק. העתקנו דבריו לעיל באריכות. ומפרשי המדרש כתבו שהגמרא והמדרש הנ\"ל חולקים על הזה\"ק בטעם נגעי בתים. אמנם כלל גדול הוא דאפושי פלוגתא לא מפשינן, ומצוה להשוות דיעות החכמים כל מה דאפשר. ותו דלא מסתברא כלל למימר דפליגי, שהרי מאריה דהזה\"ק הוא ניהו הרשב\"י, וגם הא דאיתא במד\"ר טעמא דמטמוניות דברי רשב\"י הוא, וא\"כ שני טעמים הללו מרועה אחד ניתנו, ואב אחד לכולם, וכיצד יתכן שיסתרו זה את זה."},{"passage_id":"vayikru1_1621310a_p2","passage_content":"ונראה לומר ששני הטעמים משלימין זה לזה, והא בהא תליין, וליכא פלוגתא בינייהו כלל. דהנה לכאורה יש לתמוה מה בשורה טובה היא זו שהקב\"ה הוריש לישראל את ממונם של הכנענים הטמאים, ומאי מעליותא איכא בזה, הלא נודע מפי ספרים וסופרים ומקורו בדברי חכז\"ל עד כמה מזקת לקיחת ממון או טובת הנאה כל שהיא מאינשי דלא מעלי, כי כח הפועל בנפעל, והשפעת הנותן נכנסת בנפש המקבל ומזיקתו מאד, וכאשר האריך הרחיב בזה את הדיבור בסה\"ק אגרא דכלה פרשת שופטים (עי' בדברינו לעיל פ' צו העתקנו תוכן דבריו הקדושים). ואם כדי לקיים את מה שהבטיח הקב\"ה לאבותינו הקדושים להכניס את בניהם לארץ מלאה כל טוב, הלא הבוכ\"ע כל יכול, ואם רצונו להשפיע עשירות לישראל ביכולתו להשפיע להם שפע רב מצד הקדושה, וכאשר כן היו כמה גדולי ישראל שהיתה להם השפעת עוה\"ז במדה גדושה מצד הקדושה, כגון רבינו הקדוש (שבת קי\"ג ע\"ב) וכמוהו רבים ושלמים, וביותר קשה על פי דברי הרמב\"ם (הלכות טומאת צרעת פט\"ז ה\"י) וז\"ל, זה השינוי האמור בבגדים ובבתים וכו' אינו ממנהגו של עולם אלא אות ופלא היה בישראל וכו'. וכך כתב הרמב\"ן ז\"ל שענין נגעי בתים הוא נס נפלא מהקב\"ה ולא יתכן שיבא כי אם בארץ הנבחרת ובהיות ישראל שלמים לה'. ולפי זה תגדל התמיהה מה חשיבות יש ברכוש הטמאים האלו, עד שיעשה הקב\"ה נסים שמחוץ לדרך הטבע כדי להורישו לישראל."},{"passage_id":"vayikru1_1621310a_p3","passage_content":"אמנם עפ\"י דברי הזה\"ק נחה וגם שקטה התמיהה, שהרי במה שסתרו את הבית במצות התורה ביטלו את כוחות העבודה זרה והסט\"א השורים שם, כי בכל תנועה ותנועה שעושים על פי התורה מתקנים תיקונים גדולים בעולמות העליונים עד אין קץ בלי גבול ומדה. וכיון שכן שוב לא היה מקום לחשוש פן ישפיע ממונם של הכנענים הטמאים לרעה על ישראל, משום דכח הפועל בנפעל, שהרי כל כוחות הטומאה שהיו על אותן אוצרות נתבטלו והיו כלא היו. ומה נם לפי המבואר בתורת כהנים והגיד לכהן לאמר יאמר לו הכהן דברי כבושים וכו', ודברי תוכחה אלו שברו את לבו כחרס הנשבר, והכניסו בו הרהורי תשובה והתנוססה בו רוח טהרה, ובכל הפעולות הללו ביטלו את העבודה זרה וגירשו משם את הרוח מסאבא שהיתה שורה על אותו ממון, ולא עוד אלא ששרתה עליו רוח קדושה. וזאת היא הבשורה טובה שנתבשרו ישראל באותם מטמוניות, ע\"ד שאמרו ז\"ל במד\"ר פרשת עקב (פ\"ג ח') עה\"פ ברוך תהיה מכל העמים א\"ר חייא בר אבא אין שבחה של מטרונה וכו' אלא בשעה שמתקלסת מצרותיה, ע\"כ. וה\"נ כן הוא באותם מטמוניות שהיו מתחלה מדור לרוח מסאבא שורש העבודה זרה, וע\"י הפעולות שציוותה התוה\"ק לעשות גורשו מהם כוחות הטומאה ונהפכו אל הקדושה, ושבח גדול הוא להקב\"ה שנתבטלה העבודה זרה, והקדושה קנתה את מקומה. ולפיכך יש בזה בשורה טובה לישראל ושמחה רבה באותם המטמוניות, ובעבור כן יעשה הקב\"ה נסים שחוץ לדרך הטבע, לגרש כוחות הטומאה מן הארץ ולהשרות את הקדושה על מקומם."},{"passage_id":"vayikru1_1621310a_p4","passage_content":"והשתא אתי שפיר דטעם הגמרא והמד\"ר וטעמו של הזה\"ק הא בהא תליין, שהרי מה דאיתא בגמ' ובמדרש שמציאת המטמוניות בשורה טובה הם, אינו מובן כי אם עפ\"י דברי הזה\"ק שהיה בנתיצת הבתים ביטול ע\"ז, דבלא\"ה לא יתכן שיהיה באותו ממון הבא ממקורות טמאים בשורה טובה לישראל, וכמו שידוע מה שפירש הגר\"א ז\"ל עה\"פ (שה\"ש ח') אם יתן איש את כל הון ביתו באהבה בוז יבוזו לו, שאם רשעים רוצים לתת ממון לאיש ישראל לא די בכך שידחה אותם ולא ירצה לקבל ממונם, אלא צריך הוא להבזות אותו ממון בלבו, משום שממון הבא מרשעים צריך להיות בזוי ומבוזה אצל בר ישראל. וא\"כ מה בשורה טובה היא זו שיזכו ישראל בממונם הבזוי של הרשעים הכנענים, אלא ע\"כ צריכין אנחנו לדברי הזה\"ק, כי יש כאן ביטול הע\"ז בשרשה, ונתהפך אותו ממון אל הקדושה ע\"י הפעולות שציוותה התה\"ק לעשות בבתיהם בגזירת המלך מלכו של עולם הקב\"ה, ומה מאד עמקו מחשבותיו יתברך למעלה מהשגתינו ונשגבו מבינתינו, ולפיכך יש כאן בשורה טובה לישראל ששרתה הקדושה על אותר ממון. ות\"ל עלתה בידינו ליישב דבריהם שלא יסתרו אהדדי, ואלו ואלו דא\"ח הם וכל דבריהם ז\"ל חיים וקיימים, ואין ביניהם פלוגתא כלל."}]},{"dvar_torah_id":"vayikru1_e38d7802","title":"","summary":"","contents":[{"passage_id":"vayikru1_e38d7802_p1","passage_content":"לשבת הגדול"}]},{"dvar_torah_id":"vayikru1_05f71823","title":"תורת המצורע וקדושת השבת","summary":"בפרשת המצורע נדרש על תורתו ביום טהרתו, ודרכי ההשתתפות עם צדיקים כדי למנוע חטיפת מצוות. כמו כן, נדונה קדושת השבת והשפעתה על כח המזלות, והקשר בין לקיחת הפסח לשבת הגדול, המבטא את הכנעת העבודה זרה של מצרים.","contents":[{"passage_id":"vayikru1_05f71823_p1","passage_content":"זאת תהיה תורת המצורע ביום טהרתו והובא אל הכהן וגו'. דקדקו המפרשים דהך קרא יתירא הוא, שהיה ראוי שיאמר הכתוב וכי יטהר המצורע והובא אל הכהן, ותו לא. ומלבד זאת יל\"ד בלשון המקרא זאת תהיה תורת המצורע, דהול\"ל זאת תורת המצורע, כדרך הכתובים בכל מקום, דכתיב זאת תורת החטאת וזאת תורת האשם, ומאי ריבה כאן בתיבת \"תהיה\"."},{"passage_id":"vayikru1_05f71823_p2","passage_content":"ב) עוד יל\"ד באומרו והובא אל הכהן, דמשמע שאחרים מטפלים בו ומביאין אותו אל הכהן, ולכאורה הי' ראוי שיאמר ובא אל הכהן, כדרך הכתוב בכ\"מ, וכן בנגעי בתים כתיב ובא אשר לו הבית והגיד לכהן לאמר כנגע נראה לי בבית."},{"passage_id":"vayikru1_05f71823_p3","passage_content":"ג) במד\"ר (פט\"ז ד') איתא זאת תהיה תורת המצורע הה\"ד ולרשע אמר אלקים מה לך לספר חוקי ותשא בריתי עלי פיך. וצ\"ב להבין שייכות מקרא זה לפרשת מצורע."},{"passage_id":"vayikru1_05f71823_p4","passage_content":"ד) שבת שלפני פסח קורין אותו שבת הגדול. וכתב הטור (או\"ח סי' ת\"ל) והטעם לפי שנעשה בו נס גדול שפסח מצרים מקחו מבעשור וכו', ופסח שיצאו ישראל ממצרים הי' ביום ה', ונמצא שיו\"ד בחדש היה בשבת, ולקחו להם כ\"א שה לפסחו, וקשרום בכרעי המטה, ושאלום המצריים מה זאת, וא\"ל לשחטו וכו', והיו שיניהם קהות על ששוחטין את אלהיהם, ולא היו רשאין לומר דבר, ועל שם אותו הנס קורין אותו שבת הגדול, עכ\"ד. וגדולה מזו איתא במדרש תהלים עה\"פ למכה מצרים בבכוריהם בשעה שלקחו ישראל פסחיהם נתקבצו בכורי מצרים אצל ישראל ושאלום למה היו עושים כך אמרו להם זבח פסח הוא לה' שיהרוג בכורי מצרים הלכו אצל אבותיהם לבקש מהם שישלחו את ישראל ולא רצו ועשו הבכורות מלחמה והרגו מהם הרבה, הה\"ד (תהלים קל\"ו) למכה מצרים בבכוריהם, עכ\"ד המדרש. והקשו המפרשים דלטעם זה היה ראוי לקבוע זכרון הנס ביום החדש שאירע בו, הוא העשירי בניסן, ומדוע קבעוהו ליום השבת שלפני הפסח, בין אם הוא העשירי לחדש בין אם לאו."},{"passage_id":"vayikru1_05f71823_p5","passage_content":"וכדי לבא אל הביאור נקדים לפרש מאה\"כ בפרשת קרבן פסח וילכו ויעשו בני ישראל כאשר צוה ה' את משה ואהרן כן עשו, ופירש\"י (והוא דרשת המכילתא) אף משה ואהרן כן עשו. ולכאורה הוא פלאי, דמאי רבותא היא זו שאף משה ואהרן קיימו מצות ה' יתברך, להפריש להם קרבן, עד שהוצרך הכתוב להשמיענו שאף משה ואהרן כן עשו. ויתבאר דהנה מצינו שהקפיד הכתוב בפסח מצרים שיהא מקחו מבעשור, משא\"כ בפסח דורות, ואף שכל קרבן טעון ביקור ד' ימים קודם שחיטתו, מ\"מ לא נתחייבו לייחד להם שה לקרבן פסח ד' ימים קודם השחיטה, אלא הרשות בידם לבקר ב' או ג' טלאים ארבעה ימים קודם, ובערב פסח לפני זמן שחיטתו יפרישו להם את קרבנם, משא\"כ בפסח מצרים שבא הצווי להפריש להם את קרבנם מבעשור לחדש."},{"passage_id":"vayikru1_05f71823_p6","passage_content":"והנה טעמא דמילתא שציוותה תורה בפסח מצרים ללקחו בעשירי בניסן הוא כדאיתא במכילתא (פ\"ה א') הביאו רש\"י ז\"ל, מפני מה הקדים לקיחתו של פסח לשחיטתו ד' ימים הי' ר' מתיא בן חרש אומר וכו' הגיע שבועה שנשבע הקב\"ה לאברהם שיגאל את בניו ולא היה בידם מצוות שיתעסקו בהם כדי שיגאלו נתן להם שתי מצוות דם פסח ודם מילה שיתעסקו בהם כדי שיגאלו וכו' לכך הקדים הכתוב לקיחתו של פסח לשחיטתו ד' ימים שאין נוטלין שכר אלא ע\"י מעשה. ולכאורה לפי טעם המכילתא שנצטוו להפריש קרבנם ביו\"ד לחדש כדי לזכותם במצוות, א\"כ מסתברא דכל הזריז להקדים זמן ההפרשה לפני העשירי בניסן שפיר קא עביד והרי הוא משובח, דזריזין מקדימין למצוות. אמנם במכילתא מבואר דאין להקדים הפרשת הפסח לפני העשירי בניסן, דקאמר ר' אחא ב\"ר יאשיה דבור מר\"ח ולקיחה בעשור לחדש ושחיטה בי\"ד וכו', או אינו אלא הדיבור ולקיחה בר\"ח ושחיטה בי\"ד ת\"ל דברו אל כל עדת בני ישראל וכו', וכן משמע מדרשת המכילתא הובא ברש\"י עה\"פ וילכו ויעשו בני ישראל וגו', וכי כבר עשו והלא מראש חדש נאמר להם אלא מכיון שקבלו עליהם מעלה עליהם הכתוב כאילו עשו. ואם נאמר דמותר להקדים זמן לקיחת הפסח לפני העשירי בניסן, א\"כ מאי קא מתמה וכי כבר עשו והלא מראש חדש נאמר להם, ומה בכך דילמא מיד שנצטוו הלכו לקיים המצוה בזריזות, אלא ודאי דהחיוב הוא להפריש הקרבן בעשור לחדש דייקא ולא קודם לכן. אכן באמת טעמא בעי מדוע הקפיד הכתוב על העשירי לחדש דוקא, הלא כיון דטעמא דמילתא שפסח מצרים מקחו מבעשור, היינו כדי לזכותם במצוות, א\"כ כל כמה דאפשר להקדים לקיחתו ירבו זכויותיהם, שיתעסקו בו כל אותם הימים."},{"passage_id":"vayikru1_05f71823_p7","passage_content":"ואפ\"ל בטעם הדבר בהקדם מה שכתב הרמב\"ן ז\"ל בפרשת בא עה\"פ ויקחו להם איש שה לבית אבות וגו', ותו\"ד כי על דעת רבותינו ז\"ל שהיו המצרים עובדים לטלה הודיענו השי\"ת במצוה זו של הקרבת הפסח שהשפיל אלהיהם וכחם בחדש ניסן שאז מזל טלה הוא בכוחו הגדול ובמעלה העליונה שלו שאז זמן צמיחתו. וכן מבואר במד\"ר פ' בא עה\"פ ויקחו להם איש שה לבית אבות זש\"ה יבושו כל עובדי פסל המתהללים באלילים. (ולכאורה דברי הרמב\"ן ז\"ל הללו תמוהין כי הם סותרין למה שכתב הוא עצמו ז\"ל בפרשת ויקרא לדחות דברי הרמב\"ם ז\"ל במורה, שנתן טעם למצות הקרבנות משום שהיו העכו\"ם עובדים לבקר וצאן, כי המצרים עובדים למזל טלה וכו', על כן צוה השי\"ת לשחוט מינים אלו לשמו הנכבד, כדי שיוודע כי הדבר שהם חושבים כי הם בתכלית העבודה, הוא אשר יקריבו בו לבורא יתברך, ובו יתכפרו העוונות. ועל כך תמה הרמב\"ן ז\"ל כי אדרבה לפי שטותם של מצרים לא תתרפא מחלתם בזה, אבל תוסיף מכאוב, כי מחשבת הרשעים ההם לעבוד למזל טלה, ואם יזבחו אותם לשם הנכבד זה כבוד להם ומעלה וכו', עכ\"ד הרמב\"ן ז\"ל שם. וכאן ביאר הוא עצמו כטעם הרמב\"ם ז\"ל, כי ע\"י ששחטו ישראל את השה לקרבן השפילו אלהיהם וכוחם של המצרים וצ\"ע, ועי' מה שכתבנו בענין זה לעיל בפ' ויקרא באורך). עכ\"פ מדברי הרמב\"ן ז\"ל נמצינו למדים, כי טעם מצות קרבן פסח, הוא להכניע כח המזלות ולהשפילם, כי בזה יוודע אשר ישועת ה' כהרף עין מחוץ לדרך הטבע, והיפך הוראת המזלות."},{"passage_id":"vayikru1_05f71823_p8","passage_content":"והנה היערות דבש (ח\"ב ס\"ה ע\"ב) ביאר מאמרם ז\"ל (שבת קי\"ח ע\"ב) כל המשמר שבת כהלכתה אפי' עובד ע\"ז כדור אנוש מוחלין לו, דלכאורה מהו כהלכתה, גם מהא דנקט רבותא אפילו כדור אנוש, משמע דדור אנוש עבדו ע\"ז ביותר, ולא כן הוא דמבואר ברמב\"ם הלכות עכו\"ם (פ\"א ה\"א) דאנוש טעה וחשב אף שהקב\"ה סיבת כל הסיבות חלק כח לצבאיו ומגדולת העבד וכו', עד שנתרבו הטעות בדורות שאחריו שכחו לגמרי השם ולא עבדו רק לכוכבים וצלמיהם, ע\"כ. הרי מבואר כי בדור אנוש האמינו בשם הנכבד אלא שטעו, וא\"כ מאי אפילו דנקט."},{"passage_id":"vayikru1_05f71823_p9","passage_content":"וביאר כי הנה חז\"ל הרבו להזהיר לשמוח בשבת, וחד מן הטעמים הוא משום דבשבת שולט כוכב שבתאי, וכל השמחים בו יקרם רעה כנודע, ולכן עלינו לשמוח היפך גזירת הכוכב, להורות כי אין בגזירת הכוכב ממש, ואין אנו תחת המזל והכוכב, ונמצא כי ע\"י שאנו שמחים בשבת, נסתרת אף דעת אנשי דור אנוש, החושבים כי לצבא השמים הממשלה, כי רואים שביום השבת אנו שמחים וחוגגים, היפך גזירת הכוכב ההוא. וזהו אמרם כל המשמר שבת כהלכתה דייקא, כמו שאמרו ז\"ל לשמוח בו כראוי, אזי לא בלבד שנמחל דעת ע\"ז אחרת, אלא אפילו עובד ע\"ז כאנוש, דמודה בבריאה, מ\"מ מוחלין לו, כי בזה מודה שאין בדבריהם ממש בכל אופן, ושב ורפא לו, עכת\"ד ז\"ל. היוצא לנו מזה, כי יום השבת קדש מסוגל מאד להכנעת כוח המזלות, כי השמחה ביום קדוש זה היא היפך הוראת המזלות. ועפ\"י זה מצאנו טעם נכון שצוה השי\"ת במצרים לקחת שה לקרבן פסח ביום העשירי בניסן דוקא שחל להיות בשבת, ולא קודם לכן. כי לפי שטעם המצוה היה להכניע כח העבודה זרה של מצרים, כמו שביאר הרמב\"ן, על כן צוה הקב\"ה לקחת השה בעשור לחדש שחל בשבת, כדי שבסגולת השבת להכניע המזלות, ישבר כח מזלם של מצרים, ויכנע רום תקפם. וע\"י שהוכנע מזלם, ממילא נכנעו גם הם עצמם, וניטל כח גבורתם, וכדאיתא במדרש (שמות רבה כ\"א ה') עה\"פ יפקוד ה' על צבא המרום במרום ואח\"כ את מלכי האדמה באדמה דאין הקב\"ה מפיל את האומה עד שהוא מפיל שר שלה תחלה."},{"passage_id":"vayikru1_05f71823_p10","passage_content":"ובדרך זה מצאנו טוב טעם למה שנקבע זכרון הנס ליום השבת דוקא, ולא קבעוהו ליום העשירי בניסן בין שחל בחול בין שחל בשבת. כי יום השבת הוא דקא גרם להכניע מזלם ולשבר כחם וגבורתם, כדאמרן כי מה שיום השבת הוא יום מנוחה ושמחה לישראל, מורה על כך שהקב\"ה מתנהג עם ישראל היפך הוראת המזלות. ומה שלא כתבה תורה להדיא שיקחו להם את הקרבן ביום השבת, אלא סתמא כתיב בעשור לחדש, היינו משום שבאותה שעה עדיין לא נודע להמון העם שבישראל מתוקף קדושת השבת, והיותו יום קדוש לישראל לנוח בו ולשמוח בתענוג אכול ושתו, שהרי לא היו מצווים עדיין על השבת. ואף שכבר היו משמרין שבתות במצרים, כדאיתא במד\"ר פרשת שמות (פ\"ו ט\"ו) שמשה תיקן להם לישראל שיהיו נחים בשבת ממלאכתם, מ\"מ אותה שביתה לא היתה אלא בעבור שיהיו בטלים יום א' מעבודת הפרך, ולא לטעם מצות השי\"ת כמבואר במדרש שם, על כן כתבה תורה בסתם בעשור לחדש ויקחו להם איש שה לבית אבות. אך כל הכוונה היתה שיקחוהו בשבת מן הטעם שנתבאר."},{"passage_id":"vayikru1_05f71823_p11","passage_content":"ובזה נבוא לביאור דרשת המכילתא עה\"פ וילכו ויעשו בני ישראל כאשר צוה ה' את משה ואהרן כן עשו, אף משה ואהרן כן עשו. כי הנה אף שהמון העם עדיין לא ידעו ממצות שמירת שבת בהיותם במצרים, אלא היו שובתים בו כדי לנוח מעבודת הפרך, אמנם בני העליה שבקרב ישראל כבר ידעו והשיגו את התורה בטרם ניתנה, והיו משמרים מצוותיה של תורה, בתורת שאינם מצווים ועושים, כמו שהיו האבות הקדושים משמרין מצוותיה של תורה. וכדאיתא במד\"ר פ' וישלח (פע\"ט ז') עה\"פ ויחן את פני העיר, נכנס בע\"ש עם דמדומי חמה מבעוד יום וקבע תחומין מבעוד יום הדא אמרה ששימר יעקב את השבת קודם שניתן. וכן גבי יוסף איתא במדרש רבה (פצ\"ב ד') וטבוח טבח והכן אין והכן אלא שבת המד\"א (שמות ט\"ז) והיה ביום הששי והכינו וגו' הדא אמרה ששמר יוסף את השבת קודם שלא תנתן. וכמו כן ודאי שמשה ואהרן ויחידי סגולה שבישראל ידעו והשיגו קדושת השבת, והיו משמרין אותו כדי לקיים מצות השי\"ת."},{"passage_id":"vayikru1_05f71823_p12","passage_content":"ועל פי זה לכאורה מסתברא למימר, דהא דאמרה תורה שיקחו ישראל שה לק\"פ בעשור לחדש שחל בשבת, היינו דוקא להמון העם שבישראל שלא היו נחים בשבת מחמת שקבלו עליהם מצוה זו, על כן אין להם לחוש למלאכות שיעשו בלקיחת השה. משא\"כ משה ואהרן ויחידי הסגולה שבישראל, שכבר קבלו על עצמם לשמור את השבת מחמת מצות הבורא שעתיד לצוות בתורה, לפיכך הו\"א שהם לא היו בכלל ציווי הלקיחה בעשור לחדש שהרי לקיחת השה יש בה כמה מלאכות ושבותין, דבלקיחת השה מן השוק עובר על איסור מו\"מ בפרהסיא, ובהבאתו לביתו עובר על איסור מוציא מרשות לרשות ומעביר ד\"א ברה\"ר, וקשירת השה לכרעי המטה, יש בה משום אב מלאכה דהקושר. וא\"כ לכאורה ראוי להם להקדים לקיחת השה בימות החול, כדי שלא יבואו להכשל במלאכות אלו, ואף שמצינו שהתירה תורה איסור מלאכת שבת גבי קרבנות, שהרי היו מקריבין תמידין ומוספין בשבתות וברגלים, וכן היו מקרבין קרבן פסח בשבת, כשחל ערב פסח להיות בשבת, מ\"מ אין לנו אלא מה שהתירה תורה, והיא ההקרבה גופה, ושאר מלאכות כיוצא בה שא\"א לעשותן מבעוד יום, משא\"כ מכשירין שאפשר לעשותן מערב שבת, לא הותרו בשבת. וה\"נ אפשר לעשות הלקיחה מע\"ש, ולכן לכאו' הי' ראוי להם לאותם יחידי סגולה שקיבלו על עצמם שמירת שבת, להקדים הלקיחה. לזאת הודיענו הכתוב וילכו ויעשו וגו', כאשר צוה ה' את משה ואהרן כן עשו, ודרשו ז\"ל אף משה ואהרן כן עשו, פירוש שאף הם עשו ככל עדת ישראל ולקחו את פסחיהם בעשור לחדש שחל להיות בשבת, ולא קודם, דכיון שכך נצטוו מפי הגבורה, חל גם עליהם חיוב זה, להפריש פסחם בשבת דייקא, וטעמא כדאמרן שמסגולת השבת להכניע שליטת המזלות."},{"passage_id":"vayikru1_05f71823_p13","passage_content":"ובזה אפ\"ל הטעם שנקרא שמו שבת הגדול, דלא תימא שהי' קצת חסרון וגריעותא לקדושת אותו שבת, במה שעשו בו ישראל כמה מלאכות בלקיחת הפסח, לזאת אמר דלאו הכי הוא, דכיון שכך ציוותה התורה בעשור לחדש ויקחו להם וגו', הרי השבת נדחה מפני מצות הלקיחה, כשם שהשבת נדחה מפני הקרבת הפסח בכל השנית בזמן שחל י\"ד בשבת. אלא דהתם אין השבת נדחה אלא מפני הקרבתו, ולא בפני המכשירין שאפשר לעשות קודם השבת, משא\"כ הכא שציווה הכתוב על הלקיחה שתהיה בשבת דייקא, א\"כ אף מצות הלקיחה דינה כהקרבת הקרבן, ודוחה שבת אף לגבי משה ואהרן, שכבר קבלו עליהם לשמור שבת משום מצות השי\"ת. ולא זו בלבד שלא היה פגם וירידה בקדושת אותו שבת, אלא אדרבה קדושה יתירה ניתוספה בו, שנתגלה לעין כל כח קדושת השבת, שבזכותו הכניעו ישראל את כח המזלות, במה שהפרישו בו שה לפסחם וקשרוהו לכרעי מטתם, והיו המצרים רואים ושיניהם קהות ולא העיזו לחרוץ לשון נגדם. ועל כן נקרא שמו שבת הגדול, כי בו נודע ונתגלה קדושת השבת, וגודל ההארה הנשפעת לישראל ביום זה, שהוא היפך המזלות המורים שהוא יום עצבות ושממון רוח, גם ניתוספה להם בשבת זו זכות לקיחת השה לקרבן, ועל כן זה שמו אשר יקראו לו שבת הגדול."},{"passage_id":"vayikru1_05f71823_p14","passage_content":"וכדי לבא לביאור מקראי קדש בפרשה, נקדים מה שביארנו (בפרשת בא שי\"ט) באופן אחר דרשת המכילתא עה\"פ וילכו ויעשו בני ישראל כאשר צוה ה' את משה ואהרן כן עשו, אף משה ואהרן כן עשו. ותוכן הדברים בהקדם מה שהתמרמר מאד בהקדמת הספה\"ק דרך פיקודיך על פי המבואר בספרי חכמי האמת, שכל המצוות והמעשים טובים שהאדם עושה בעודו מלוכלך בחטאים, חוטפין הסט\"א, ומוסיף בהם כח אל הקליפות. וכבר הארכנו בזה בספר ויואל משה (מאמר ישוב ארץ ישראל סי' מ\"ז) שכיוצא בזה מבואר בדברי הרמב\"ם ז\"ל בהלכות תשובה (פ\"ז ה\"ז) וז\"ל, כמה מעולה מעלת התשובה אמש היה זה מובדל מה' אלקי ישראל שנא' עוונותיכם היו מבדילים וגו' ועושה מצוות וטורפין אותן בפניו שנאמר מי ביקש זאת מידכם וגו' והיום הוא מודבק בשכינה ועושה מצוות ומקבלין אותם בנחת ושמחה וכו', עכ\"ד הרמב\"ם ז\"ל. וכן הביאו נו\"כ השו\"ע ז\"ל ה\"ה העט\"ז והבאה\"ט באו\"ח סי' תקע\"א, שכל המע\"ט שהאדם עושה בעודו רשע, א\"צ לומר שאינו נותן כח בקדושה, אלא אדרבה מוסיף כח בקליפה, וכשחוזר בתשובה מוציא אותו כח מן הקליפה ומכניסו בקדושה, ע\"כ."},{"passage_id":"vayikru1_05f71823_p15","passage_content":"ואחרי שהאריך בזה טובא כתב הדרך פיקודיך אמנם העצה לזה שלא יוסיף כח בסט\"א בתורתו ובמצוותיו, הוא שישוב בתשובה שלימה על עוונותיו, ואין עיקר התשובה בתעניתים וסיגופים, אלא ענין התשובה היא החרטה באמת על מה שעשה והכעיס לפני הקב\"ה, ויקבל על עצמו בקבלה אמיתית שאפילו יהבי לי' כל חללי דעלמא לא ישוב עוד לדבר הרע הזה. ואם ככה היא מחשבתו ולבו טרם עסקו בתורה ומצוות, יקובל הכל לרצון לפני השי\"ת, ואם לאו הוא ח\"ו כזורע אל הקוצים, עכ\"ד ז\"ל. וכבר כתבנו שם כי הוא ז\"ל כתב כן למען הקל מעלינו עול התעניתים והסיגופים, על כן אמר דסגי בקבלה אמיתית בפנימיות הלב עד שיעיד עליו יודע תעלומות כי לא ישוב לכסלה, ונראה מדבריו כי לדעתו בנקל יוכל האדם להשיג מדה זו בכל עת ובכל שעה, אכן בעו\"ה לפי שפלות דורינו הלבבות סתומים ואטומים, וזעירין אינון שיוכלו לעשות תשובה מעולה כזו, עד שיעיד עליו יודע תעלומות."},{"passage_id":"vayikru1_05f71823_p16","passage_content":"ובספה\"ק אור לישרים (בדרוש הראשון) עצה טובה קא משמע לן, להציל המצוות והמע\"ט שלא ילכו שבי לפני צר, לומר בטרם יגש לקיים מצוה או להתפלל וללמוד תורה, לשם יחוד קוב\"ה ושכינתיה, ובזה הוי כמתנה במפורש שאינו רוצה לצאת ידי חובתו באופן אחר, אלא אם יעלו התורה והמצוות שלו לשם יחוד קוב\"ה, וזולת זה הריהו מתכוון שלא לצאת יד\"ח, ובזה כו\"ע מודי דלא יצא, דאפילו מ\"ד מצוות א\"צ כוונה היינו דוקא בסתמא, אבל בהיפוך כוונה כ\"ע ל\"פ דאינו יוצא, כמבואר בר\"ן. וזהו שאומר אני עושה מצוה זו רק לשם יחוד קב\"ה, אבל אם ח\"ו החטא גורם שלא יגרום יחוד, אז איני רוצה לצאת במצוה זו כלל, וא\"כ אין לחיצונים מה לחטוף, כיון שאין כאן מצוה, וממילא כיון שאין לחיצונים מה לחטוף בע\"כ תעלה המצוה למעלה, עכת\"ד האור לישרים בתוספת ביאורו של ק\"ז זלה\"ה בישמח משה פ' תשא, והביאו עוד בכמה מקומות, ובספרו תפלה למשה (תהלים פמ\"ה) פירש בזה דברי הכתוב רחש לבי דבר טוב אומר אני מעשי למלך, עיי\"ש."},{"passage_id":"vayikru1_05f71823_p17","passage_content":"אכן ק\"ק גם על תקנה זו, דלכאורה ממ\"נ אם התנאי הוא שהוא מכוון לעשות מצוה זו רק לשם יחוד קב\"ה, ואם לאו אין כאן מצוה כלל, ע\"כ מכיון שהמצוה אינה בשלימות הרי אינה עולה לעשות יחוד למעלה, ולפי תנאו אינה מצוה כלל, ומה הועיל בזה, דאף שלא חטפוה החיצונים, מ\"מ אין בידו מצוה, שהרי התנה בפירוש שהוא מכוון שלא לצאת. וע\"כ לומר כביאור ק\"ז זלה\"ה דכיון שאין לחיצונים מה לחטוף באותה מצוה אזי המצוה פורחת מעצמה לעילא, ולפי זה קשה שאם שוב נעשה ממנה מצוה ע\"כ עדיין יש להם מה לחטוף, וקשה להבין החילוק בזה, שכלפי החיצונים יחשב כאילו אין כאן מצוה, ואפילו הכי לא תתבטל המצוה לגמרי, כי אם פרחית לעילא. ובע\"כ לומר כי זהו מחסדי השי\"ת על עמו ישראל החפצים לעשות מצות ומע\"ט, כדי שיעלו לנחת רוח לפניו, אלא שאין בכחם לשוב בתשובה שלימה בפנימיות הלב, לפיכך מצילם הקב\"ה מידי הסט\"א ותחשב להם למצוה."},{"passage_id":"vayikru1_05f71823_p18","passage_content":"אמנם נראה לומר טעם נוסף לכך שאמירת לשם יחוד מועלת שלא יחטפו החיצונים את המצוות ומעשים טובים, על פי מה שכתב בספה\"ק נועם אלימלך פרשת מצורע בשם אחיו הרה\"ק הר\"ר זושא לפרש אמרם ז\"ל (קידושין מ' ע\"א) מחשבה טובה הקב\"ה מצרפה למעשה, ודקדק דהול\"ל הקב\"ה מחשבה למעשה, ומאי צירוף שייך הכא. וביאר כי הנה ישנם אנשים המקיימים מצוות ומעשים טובים בפועל, אך נחסר מהם חלק המחשבה, כי לבם בל עמם לכוון הכוונות הראויות במעשה המצוה, ולעומת זאת ישנם צדיקים המתאוים ומשתוקקים תמיד לקיים מצוות ומעשים טובים, כדי לעשות נחת רוח להבוי\"ת, ואין לאל ידם תמיד לקיים המצוות בפועל, כאשר עם לבבם. ונמצא כי בידם חלק המחשבה של המצוה, כי נפשם איותה מאד לקיימה, ולא חלק המעשה. והבורא ית' ברוב רחמיו וחסדיו מצרף מחשבת המצוה של הצדיק, ומעשה המצוה שנעשתה בלא הכוונה הראויה, ומשניהם יחד נעשה מצוה שלימה. וזהו ביאור אמרם מחשבה טובה הקב\"ה \"מצרפה\" למעשה, עכת\"ד הקדושים."},{"passage_id":"vayikru1_05f71823_p19","passage_content":"ולכאורה צ\"ב להבין טעם הדבר שמצטרפת מחשבת המצוה של הצדיק, לאותה המצוה שנעשתה שלא בכוונה, מה שייכות יש ביניהם שנצטרפו והיו לאחדים. ונראה עפ\"י מה שנתקן לומר קודם עשיית המצוה לשם יחוד קב\"ה ושכינתיה ביחודא שלים בשם כל ישראל, וכיון שכ\"א מישראל מצרף למעשה המצוה שלו את כלל ישראל, הרי זה כאילו התנה במפורש שכולן נעשו שותפין באותה מצוה, וא\"כ שפיר מצטרפת למעשה המצוה שלו שנעשתה שלא בכוונה, מחשבתו הטהורה של הצדיק, שהתאווה והשתוקק לקיום המצוה, שהרי מכיון שבטרם עשה בר ישראל זה את המצוה, התנה ואמר שכל ישראל שותפין בה, א\"כ בדין הוא שיהא אף הצדיק הזה שותף בכל פרט ופרט מן המצוה, ולפיכך הם מצטרפין יחד ונעשית מהם מצוה שלימה. ובזה מצאנו עצה נכונה להציל את המצוות אשר יעשה האדם בטרם יטהר מעוונותיו מידי הסט\"א, שהרי כיון ששיתף למעשי המצוות שלו את כל ישראל, ובתוכם צדיקי אמת, ובאמצעות כן נצטרפו מחשבותיהם הזכות והקדושות למצוותיו, א\"כ שוב אין לסט\"א שליטה במצוותיו. שהרי כל מה שהם באים לחטוף מצוותיו, היינו משום שהוא בעל עבירה ועוד טומאתו בו, אמנם מכיון שיש למצוותיו שותף צדיק שנצטרפו מחשבותיו להשלים המצוה, א\"כ כשם שאין בכח הסט\"א לשלוח יד לחלקו של הצדיק אמת, כך לא יוכלו לנגוע במצוותיו, שהרי אי אפשר להפריד חלקו מחלק הצדיק משום שנצטרפו למצוה אחת, וכל תנועה ותנועה של מעשי המצות שלו מונח בה חלק השייך לאותו צדיק אמת, ולפיכך אין רשות לחיצונים לגעת במצוותיו כלל."},{"passage_id":"vayikru1_05f71823_p20","passage_content":"ובזה נבא לביאור המכילתא וילכו ויעשו בני ישראל וגו' כן עשו, אף משה ואהרן כן עשו. דהנה בני ישראל בצאתם ממצרים אכתי לא היו בשלימות הראוי שיוכלו לקיים מצות קרבן פסח בכוונה רצויה ונכונה, כידוע שהיו צריכים לספור מ\"ט יום כדי שיצאו לגמרי ממ\"ט שערי טומאה, שהיו משוקעין בהם במצרים. ולפיכך לא היה בידם אלא מעשה המצוה בלבד בלא המחשבה הראויה, אמנם משה ואהרן שקיימו מצוה זו בשלימות ובכוונות קדושות, לא הסתפקו במה שקיימו בעצמם מצוה זו, שהרי לא היה בידם להקריב אלא קרבן אחד, וכן במצות אכילתו אי אפשר להם לקיים אלא כפי מה שנמנו עליו, ולזאת לא שבעה נפשם במה שקיימו מצוה זו פעם אחת. אלא נפשה נכספה וגה כלתה לחזור ולקיים במצוה זו עוד פעמים הרבה, כדי לזכות בנועם קדושתה, ולהנות מזיו אורה, דאוהב מצוות לא ישבע מצוות, אלא שלא היה בידם לחזור ולקיים מצוה זו בפועל, ונשארו בידם אותם המחשבות הזכות והקדושות שהשתוקקו לקיימה. מה עשה הקב\"ה צירף את המחשבות הק' של משה ואהרן, אל מעשה המצוה של בני ישראל שלא קיימוה במחשבה הראויה, ונעשתה מהם מצוה שלימה."},{"passage_id":"vayikru1_05f71823_p21","passage_content":"וזהו שאמר הכתוב וילכו ויעשו בני ישראל כאשר צוה ה' את משה ואהרן, כלומר שבעת עשיית המצוה נתכוונו שהם עושים על דעת משה ואהרן, וע\"י שנתקשרו בהקרבת הפסח עם משה ואהרן, נעשו שותפים עמהם ונצטרפו יחד. ומשום כך נחשב למשה ואהרן שאף הם עשו מצוות אלו יחד עם כל ישראל, שהרי הם שותפים גמורים בכל מצוה ומצוה, ואין לחיצונים רשות ליטול מאומה ממצוות אלו. וזהו שמשמיענו המכילתא רבותא אף משה ואהרן כן עשו, כלומר שקיימו מצות קרבן פסח יחד עם כל אחד מישראל, שהרי דין שותפין להם, ואית להו חלק בגוייהו. ובזה ביארנו טעם נוסף לקריאת שמו שבת הגדול עיי\"ש."},{"passage_id":"vayikru1_05f71823_p22","passage_content":"ובזה נבא לענין הפרשה שאמר הכתוב זאת תהי' תורת המצורע וגו' והובא אל הכהן, דלכאורה קשה שהרי מיד בתריה כתיב ויצא הכהן אל מחוץ למחנה, וא\"כ מה כוונתו באומרו והובא אל הכהן. ונראה דהנה הקשינו מה בא הכתוב ללמדנו באומרו זאת תהיה \"תורת\" המצורע. ואפ\"ל דקאי על התורה שעסק בה בעודנו מצורת דמסתמא היה עוסק במצוות ובמע\"ט בעת שישב מחוץ למחנה, כי נתן אל לבו מה החטא גורם, ובפרט שישב בדד ולא היתה לו חבורת מרעים, לדבר עמהם לה\"ר ורכילות ודברים בטלים. ברם אכתי לא סגי בהכי דאולי עדיין לא עשה תשובה שלימה כהוגן באותה עת, וא\"כ הרי יש כאן בית מיחוש דח\"ו לא תהי' הוי' וקיום לתורתו ולמצוותיו, כי יחטפום החיצונים. אמנם מצאנו לו תקנה, עפ\"י דברי הנוע\"א הנ\"ל, דע\"י שיתכוון במעשי המצוות שלו שהוא עושה אותם בשם כל ישראל, ממילא ישתתפו עמו מחשבותיהם הקדושות של הצדיקים המתאוים ומשתוקקים לקיים רצון בוראם בכל עת ועונה, ובצירוף זה יהיו מצוותיו שלימים ולא ישלטו בם זרים. וזהו שאמר הכתוב זאת \"תהיה תורת\" המצורע, פירוש כי העצה היעוצה שתהיה הויה וקיום לתורתו של המצורע, ולא יחטפוה החיצונים בעבור שהיא נעדרת שלימות הכוונה, \"והובא אל הכהן\", כלומר שישתף אל מצוותיו את המחשבות וההשתוקקות של הכהן, המתאוה בכל לבו ונפשו להרבות מצוות ומעשים טובים יותר ויותר ממה שבכוח אנושי לעשות, ומהשתוקקות זו יש ביד הכהן מחשבות קדושות וטהורות, ועדיין חסרה לו המצוה בפועל, וע\"י שישתף המצורע במצוותיו את הכהן עובד ה', יצרף הקב\"ה מחשבות קדושות אלו למצוותיו, ויחדיו תהיה מהם מצוה שלימה, ולא תהיה לחיצונים במצוותיו שום שליטה, כשם שאינם יכולים לנגוע בחלק השותפות של הכהן. ואף שאין אתו יודע עד מה מי האיש אשר לבו זך וטהור וראוי להשתתף עמו, מ\"מ הרי הוא מפרש ואומר בשם כל ישראל, וכלפי שמיא גליא מי ראוי והגון לשותפות זו."},{"passage_id":"vayikru1_05f71823_p23","passage_content":"ובדברים אלו יתבאר המדרש זאת תהיה תורת המצורע הה\"ד ולרשע אמר אלקים מה לך לספר חוקי ותשא בריתי עלי פיך. דהנה באותה פרשה להלן כתיב אם ראית גנב ותרץ עמו ועם מנאפים חלקך. ולכאורה צ\"ב דאי מיירי שרשע זה הנו ג\"כ גנב, א\"כ מדוע האריך הכתוב כל כך, הול\"ל בפירוש גנב אתה. וכן אח\"כ כתיב ועם מנאפים חלקך, משמע דלא מיירי במנאף עצמו, דא\"כ הול\"ל מנאף אתה. אמנם האמת נראה דהכא לא מיירי בגנב או במנאף עצמו. אלא שהכתוב מוכיחו על שראה גנב ואעפ\"כ הוא מתחבר עמו, ועם מנאפים חלקו, שהוא ריע להם. וזוהי רעה גדולה, כדאיתא באבות דר' נתן (פ\"ל ג') המתחבר לצדיקים אעפ\"י שאינו עושה כמעשיהם מקבל שכר כיוצא בהם והמתחבר לרשעים אעפ\"י שאינו עושה כמעשיהם מקבל פורענות כיוצא בהם. ועל כך הכתוב מתאונן, דלא מיירי בגנבים ומנאפים עצמם דלא דברה תורה באותן רשעים, אלא שהכתוב מדבר אל אותו שנתחבר עם כת גנבים ומנאפים, ושואל ממנו קושיא חזקה, דכיון שראית בעיניך שהם גנבים ומנאפים מה לך להתרצות אתם, ולהיות בחבורה אחת עמהם. ושייכא הך סיפא לרישא דקרא, דפתח ולרשע וגו' מה \"לך\" לספר חקי, והכוונה דכיון שאתה עוסק בתורה ומצוות בעודך בבחינת רשע, שעדיין לא חזרת בתשובה שלימה על חטאיך, א\"כ הרי עלול אתה שיחטפו הסט\"א את התורה והמצוות שלך. אלא שתקנה יש לך שתשתתף עם כל ישראל, וע\"י זה יצטרפו המחשבות הקדושות של הצדיקים, למעשי המצוות שלך, ולא תהי' לחיצונים שליטה עליהם. אמנם אם אתה חבר לגנבים ועם מנאפים חלקך, א\"כ שוב לא ירצו יהודים כשרים להשתתף עמך, להיות להם חלק במעשי התורה והמצוות שלך, כי עובדי השי\"ת באמת אינם רוצים להיות שותפים עם אנשים כאלו, המתחברים אל גנבים ומנאפים, וכיון שאינם חפצים להתחבר עמך, לא יתכן שתשתתף עמהם במצוות. ואם כן שוב לא נותר לך אלא מעשה המצוה אשר תפול שבי לפני הסט\"א."},{"passage_id":"vayikru1_05f71823_p24","passage_content":"וז\"ש הכתוב ולרשע אמר אלקים מה \"לך\" לספר חוקי, דמיירי כאן במי שחטא והמרה לפני הבוי\"ת ולא טהר עדיין מחלאת עוונותיו, וא\"כ מה \"לך\" דייקא לספר חוקי, פירוש לך לעצמך בלא השתתפות כל ישראל, אין ראוי ללמוד תורה, שהרי החיצונים יחטפו תורתך ומצוותיך. ונתן הכתוב טעם מדוע לא יצטרפו הצדיקים בקדושת מחשבותיהם אל תורתו ומצוותיו, לזאת אמר אם ראית גנב ותרץ עמו ועם מנאפים חלקך, כלומר דאף אם נסכים לדעתך שאתה אינך עושה כמעשיהם, מ\"מ מכיון שאתה רואה בעליל שהמה גנבים ומנאפים, כיצד אתה הולך עמהם, ונוטל חלק במעשיהם וברווחיהם ובהשפעות הבאות מהם. ואף שאתה טוען כי אינך כי אם מכיר וריע שלהם, וברצונך לתקנם ולהטותם לטוב, מ\"מ כיון שיש לך שותפות והתחברות עמהם, שוב לא ירצו יהודים כשרים להצטרף אליך כלל."},{"passage_id":"vayikru1_05f71823_p25","passage_content":"והשתא שפיר שייכים דברי המדרש הללו לפרשתא דמצורע, שהרי מפרשה זו למדנו איזה דרך יבור לו החוטא שלא יחטפו החיצונים מצוותיו ותורתו, וכמו שנתבאר דתקנה יש לו במה שישתתף עם הצדיקים, וע\"י כך יצטרפו מחשבותיהם הקדושות אל מעשיו, ובזה תהי' לתורתו הויה וקיום. וזש\"ה זאת תהי' תורת המצורע, דדוקא בזה תהיה הויה לתורתו של מצורע והובא אל הכהן, שיצטרפו מעשיו למחשבותיו הזכות של הכהן עובד השי\"ת. ולזאת מייתי המדרש הה\"ד ולרשע אמר אלקים מה \"לך\" לספר חוקי, פירוש לך לעצמך מבלי הצטרפות מחשבות הצדיק אין ראוי לספר חוקי, כי יחטפום החיצונים, וכיון שהתחברת אל גנבים ומנאפים, אין חפץ לצדיקים להשתתף עמך כלל."}]},{"dvar_torah_id":"vayikru1_23dbd99d","title":"תורת המצורע ופרשת נגעים","summary":"הדקדוקים בתורת המצורע מגלים את משמעות הטהרה והטומאה, והקשרים בין נגעים לבין חטאים. המפרשים דנים בשאלות על טהרת המצורע, נגעי בתים, והצורך בתשובה. כל פרט בפרשה נושא עמו רמזים לתיקון ולגאולה העתידית.","contents":[{"passage_id":"vayikru1_23dbd99d_p1","passage_content":"וידבר ה' אל משה לאמר זאת תהיה תורת המצורע ביום טהרתו והובא אל הכהן, ויצא הכהן אל מחוץ למחנה וראה הכהן והנה נרפא נגע הצרעת מן הצרוע. הדקדוקים רבו במקראי קדש הללו, חדא מדוע האריך הכתוב בלשונו, באמרו זאת תהיה תורת המצורע ביום טהרתו וגו', דהוה סגי שיאמר כי יטהר המצורע והובא אל הכהן."},{"passage_id":"vayikru1_23dbd99d_p2","passage_content":"ב) ומלבד זאת דקדק האלשיך הק' ושאר מפרשים דתיבת תהיה יתירא לכאורה, דהו\"ל למימר זאת תורת המצורע, כדרך הכתוב בכ\"מ, דכתיב זאת תורת החטאת וזאת תורת העולה. ובספר פנים יפות הקשה דמאי שנא גבי זב דלא כתיב ביה אלא זאת תורת הזב, וגבי מצורע כתיב זאת תהיה תורת המצורע, ותי' עפ\"י מה דאיתא בתורת כהנים פ' תזריע עה\"כ אדם כי יהיה וגו', מן הדבור ואילך, משא\"כ נגעים שישנם בו מלפני מ\"ת לא מטמאי, ועוד דבשעת מ\"ת הרי נתרפאו מכל מומיהן, וכ\"ש מצרעתן, לפיכך אמר קרא הכא זאת \"תהיה\" תורת המצורע דרק מכאן ולהבא יהיה שייך דינא דמצורע, משא\"כ הזבים לא מצינו שנתרפאו במ\"ת, ונמצא שהיתה הטומאה בהם מיד בשעת מ\"ת, ע\"כ לא כתיב ביה תהיה, עכ\"ד הפנים יפות ז\"ל. אך תירוצו יפלא, שהרי גם זבין נתמעטו מדכתיב איש כי יהיה זב וגו', דדוקא זיבה שלאחר הדיבור מטמאה כדאיתא בתורת כהנים, ותו קשה דודאי נתרפאו בשעת מ\"ת אף מזיבתן כשם שנתרפאו מצרעתם ומכל מומיהן, והכי מוכח להדיא במד\"ר פ' נשא (פ\"ז א') בשעה שיצאו ישראל ממצרים היו כל רובן בעלי מומין וכו' מה עשה האלקים אמר למלאכים שירדו אצל ישראל וירפאו אותם וכו', הרי לך שנתרפאו אבל כיון שעשו אותה מעשה של עגל חזרו למומן ונעשו זבין ומצורעין, ע\"כ. וא\"כ טעמא בעי מאי שנא זבים דלא כתיב בהו זאת תהיה תורת הזב, וגבי מצורע כתיב זאת תהיה תורת המצורע."},{"passage_id":"vayikru1_23dbd99d_p3","passage_content":"ג) עוד יל\"ד דממה שאמה\"כ והובא אל הכהן, משמע שהמצורע מובא אל מקום הכהן, ומיד אבתריה כתיב ויצא הכהן אל מחוץ למחנה, הרי שהכהן יוצא אליו אל מחוץ לשלש מחנות, וא\"כ האי והובא למאי אתא. ובזה\"ק איתא והובא אל הכהן כהנא עילאה לעילא, אך לפי פשוטו של מקרא לא נודע מה כוונתו של מקרא זה."},{"passage_id":"vayikru1_23dbd99d_p4","passage_content":"ד) עוד הקשו המפרשים במאה\"כ והנה נרפא נגע הצרעת מן הצרוע, דאיפכא הו\"ל למימר והנה נרפא הצרוע מן נגע הצרעת, ומדוע ייחס הכתוב את הרפואה אל הנגע, ולא אל האדם המנוגע."},{"passage_id":"vayikru1_23dbd99d_p5","passage_content":"ה) בסיומא דפרשת נגעים כתיב זאת התורה לכל נגע הצרעת וגו' זאת תורת הצרעת. וקשה שהרי אף מה שאמה\"כ בתחלת הפרשה זאת תהיה תורת המצורע יתיר נפיש הוא לכאורה, ותגדל מדורת הקושיא מדוע שנה הכתוב ושלש לכתוב זאת תורת בפרשה זו עצמה, וכולהו יתירי לכאורה."},{"passage_id":"vayikru1_23dbd99d_p6","passage_content":"ו) להורות את בני ישראל ביום הטהור וביום הטמא וגו'. קשה מאי אשמעינן קרא בהכי, הלא פשיטא דכל הפרשה להורות לישראל ניתנה, ומדוע הודיענו הכתוב זאת בפרשת נגעים דייקא, ולא כתיב הכי בכל התורה. ורש\"י ז\"ל פירש להורות ביום הטהור וגו' איזה יום מטהרו ואיזה יום מטמאו. וקשה דלפי זה היה ראוי שיאמר להורות וגו' יום הטהור ויום הטמא, ומדכתיב ביום הטהור וביום הטמא משמע שאין ההוראה על היום עצמו, באיזה יום יטהר ובאיזה יום יטמא, וכן הקשה הרא\"ם והגו\"א ז\"ל."},{"passage_id":"vayikru1_23dbd99d_p7","passage_content":"ז) כי תבואו אל ארץ כנען אשר אני נותן לכם לאחוזה ונתתי נגע צרעת בבית ארץ אחוזתכם. צ\"ב אומרו ונתתי לשון מתנה, שהיה ראוי שיאמר כי יהיה כשם שנאמר בנגעי אדם. ורש\"י ז\"ל פירש בשורה היא להם שהנגעים באים עליהם לפי שהטמינו האמוריים מטמוניות בקירות בתיהם וכו' וע\"י הנגע נותץ הבית ומוצאן, ולפי זה א\"ש דנקט קרא לשון מתנה. אמנם בדברי המד\"ר מבואר טעמא אחרינא לביאת נגעי בתים, וז\"ל המדרש, ר' הונא בש\"ר לוי וכו' אין בעל הרחמים פוגע בנפשות תחלה וכו' ואף הנגעים תחלה הם באים בביתו וכו' לא חזר באים על בגדיו וכו' לא חזר הם באים על גופו וכו', ע\"כ. הרי מבואר דנגעי בתים מחמת חטא הם באים, לעורר לב האדם לתשובה. והכי איתא בת\"כ, והגיד לכהן לאמר יאמר לו הכהן דברי כבושים בני אין הנגעים באים אלא על לה\"ר וכו' רשב\"א אומר אף על גסות הרוח הם באים וכו'. עכ\"פ מפורש להדיא דמחמת חטא הם באים. וכן איתא במדרש תנחומא פרשה זו א\"ל הקב\"ה לישראל ראו מה ביניכם לאוה\"ע כשהן חוטאין אני מלקה בהם תחלה ואח\"כ בבתיהם שנאמר וינגע ה' את פרעה ואת ביתו וגו' אבל אתם אם חטאתם בתיכם אני מלקה תחלה שנאמר ונתתי נגע צרעת בבית ארץ אחוזתכם וכי מה חטאו העצים והאבנים אלא כדי שיראו ויקחו מוסר וכו' אם חזר בו מוטב ואם לאו בגדיו לוקים וכו', ע\"כ."},{"passage_id":"vayikru1_23dbd99d_p8","passage_content":"ומדברי הזה\"ק פרשת תזריע למדנו טעם נוסף לביאת נגעי בתים, והוא דלפי שהכנענים היו בונים בתיהם לע\"ז והיו שורים עליהם כוחות הטומאה, חפץ ה' לטהר את הארץ ולקדשה בעבור בני ישראל, ולפיכך שלח על בתיהם נגע צרעת, כדי שיסתרו את הבתים שנבנו בטומאה, עכת\"ד הקדושים העתקנום לעיל באורך. ובסוף דברי הזה\"ק הוסיף לצרף אף טעם המטמוניות, ומייתי ראיה דליכא למימר דמשום טעמא דמטמוניות בלבד באו הנגעים, דא\"כ יחזירו למקומם את אותם האבנים ואת אותו עפר עצמו אחר החילוץ, שהרי כבר נתגלו המטמוניות. אלא ע\"כ צריך לומר גם טעמא כדי להעביר רוח הטומאה מן הארץ. ובאמת צ\"ב איך נזדמנו בכל עת שני טעמים אלו גם יחד, שנמצאו מטמוניות רק באותם בתים שנבנו לשם ע\"ז ולא זולת, וצ\"ב."},{"passage_id":"vayikru1_23dbd99d_p9","passage_content":"ח) והנה הרמב\"ם ז\"ל כתב בסוף הלכות טומאת צרעת וז\"ל, שינוי עין הבגדים או הבתים וכו' קראתו תורה צרעת, וזה השינוי אינו ממנהגו של עולם, אלא אות ופלא היה בישראל, כדי להזהירן מלשון הרע, שהמספר לה\"ר משתנין קירות ביתו, אם חזר בו יטהר הבית, ואם עמד ברשעו עד שהותץ הבית משתנין כלי העור שבביתו וכו', ואם עמד ברשעו משתנין הבגדים שעליו וכו', עכ\"ד ז\"ל. וכיוצא בזה כתב הרמב\"ן ז\"ל בס\"פ תזריע בפרשת נגעי בגדים וז\"ל, זה הענין אינו בטבע כלל, ולא הוה בעולם, וכן נגעי הבתים, אבל בהיות ישראל שלמים לה' יהי' רוח ה' עליהם תמיד להעמיד גופם ובגדיהם ובתיהם במראה טוב, וכאשר יקרה בא' מהם חטא ועון יתהוה כיעור בבשרו או בבגדו או בביתו לראות כי השם סר מעליו. והנה איננו נוהג אלא בארץ, כמאה\"כ כי תבואו אל ארץ כנען וכו', מפני שלא יבא הענין ההוא אלא בארץ הנבחרת אשר השם הנכבד שוכן בתוכה וכו', עיי\"ש בנועם דבריו."},{"passage_id":"vayikru1_23dbd99d_p10","passage_content":"ועל פי דבריהם ז\"ל שכל ענין נגעי בתים היה נס ופלא משמים, יקשה על המבואר במד\"ר כי באו עליהם נגעי בתים לגלות המטמוניות, האם בעבור כך היה צורך שיעשה נס שחוץ לדרך הטבע, והלא אמרו ז\"ל (תענית כ\"ד ע\"א) שאסור ליהנות ממעשי נסים, והבוי\"ת הוא כל יכול, ואין מעצור לפניו לגלות את המטמוניות, ולהשפיע לישראל כסף וזהב לרוב בדרכים אחרות, באופן מלובש בטבע העולם. וכמו כן יש להקשות לטעמו של הזה\"ק, שהנגעים באו על בתיהם כדי לעקור את כוחות הטומאה מא\"י, האם בעבור כך היה צורך לנס נגלה ומפורסם כ\"כ, והלא הרבה דרכים למקום לבער ע\"ז מא\"י, בניסים מלובשים בטבע, כגון שתבא רוח סערה ותתוץ את הבית או רעמים וכיו\"ב. אמנם לדעת המבואר במד\"ר שהקב\"ה שולח נגעים על בתיהם כדי להתרומם שיעשו תשובה ניחא, שיש צורך בזה שיעשה הקב\"ה נס שחוץ לדרך הטבע, כדי לעורר תשומת לבם אל התשובה. ונראה לומר כי הך טעמא הוא עיקר, וכן הרמב\"ם ז\"ל לא מייתי אלא טעם זה, שהנגעים באים בעבור התשובה. אך מ\"מ אין זה סותר אל שאר הטעמים, דאפשר דכולהו איתנייהו ביה, דמקרא א' יוצא לכמה טעמים, וכמו שכתב בספר מלא הרועים, דאע\"ג דקיי\"ל דלא דרשינן טעמא דקרא, היינו דוקא לקולא אבל לחומרא דרשינן ליה, דודאי הטעם הוא אמיתי, אלא דכיון שישנם עוד טעמים רבים ונכבדים בלי חקר, אי אפשר לנו להקל במקום דלא שייך אותו טעם הידוע לנו, דשמא יש להחמיר מכח שאר הטעמים שלא נתגלו לנו, אבל להחמיר דרשינן ליה, משום דטעם נכון ואמיתי הוא. וה\"נ אף אנו נאמר לענינינו, דודאי כל הטעמים הנאמרים בדברי חז\"ל בענין נגעי בתים אמת ויציב הם, ולא שייך להקשות עליהם בנפרד, כיון שהנגעים באו בצירוף כל הטעמים גם יחד והבן, ולהלן יתבאר עוד בענין זה בעזה\"י."},{"passage_id":"vayikru1_23dbd99d_p11","passage_content":"ט) והגיד לכהן לאמר כנגע נראה לי בבית. בתורת כהנים איתא לאמר יאמר לו הכהן דברי כבושין בני אין הנגעים באים אלא על לה\"ר וכו', וקשה דלפי דרשה זו מקומה של תיבת לאמר הוא אחרי כנגע נראה לי בבית, שהרי מתחלה צריך בעל הבית להודיע לכהן כי הנגע בקירות ביתו, ואחרי הודיעו זאת לכהן, יאמר הכהן אליו דברי כבושים, ולמה הפסיק הכתוב דברי בעל הבית במלת לאמר. וביותר יש לתמוה על דרשה זו, שהרי אמירה מורה על לשון רך, והגדה משמעותה דברים קשים כגידין, כמו שדרשו ז\"ל בדברי הכתוב כה תאמר לבית יעקב ותגיד לבני ישראל, וא\"כ מדוע אמר קרא והגיד לכהן דמשמע שבעל הבית יאמר לכהן דברים קשים, ואילו דברי תוכחתו של הכהן דרשינן מתיבת לאמר שמשמעותה אמרות רכות, אדרבה איפכא הול\"ל שהרי בעל הבית ידבר תחנונים בלב נשבר ונדכה, באמרו כנגע נראה לי בבית, ולעומת זאת הכהן יוכיחו וייסרו בדברי כבושים הקשין כגידין."},{"passage_id":"vayikru1_23dbd99d_p12","passage_content":"י) בגמרא סנהדרין (דף ע\"א ע\"א) כמאן אזלא הא דתניא בן סורר ומורה לא היה ולא עתיד להיות ולמה נכתב דרוש וקבל שכר, כמאן כר' יהודה, דס\"ל אם לא היתה אמו שוה לאביו בקול ובמראה ובקומה אינו נעשה בן סורר ומורה, פירוש וכיון שאין במציאות בעולם שיהיו אביו ואמו שוים בקול ובמראה ובקומה, ע\"כ דבן סורר ומורה לא היה ולא עתיד להיות, ולא נכתב אלא כדי לדרוש ולקבל שכר. עוד איתא שם בגמרא כמאן אזלא הא דתניא עיר הנדחת לא היתה ולא עתידה להיות כמאן כר' אליעזר, דתניא ר\"א אומר עיר שיש בה אפילו מזוזה אחת אינה נעשית עיר הנידחת ולא נכתבה אלא לדרוש ולקבל שכר, והגם שעתה אין זה נמנע המציאות, שתזדמן עיר שלא תהיה בה אף מזוזה אחת, ובעוה\"ר בימינו ישנם עיירות כאלה, מ\"מ בזמן שהיו סנהדרין בישראל, שאז דנו דין עיר הנידחת, לא היתה בנמצא עיר כזאת, וע\"כ החליטו חכמי הש\"ס דלפי דברי ר\"א לא היתה ולא תהיה עיר הנידחת. עוד שם בגמרא כמאן אזלא הא דתניא בית המנוגע לא היה ולא עתיד להיות ולמה נכתב דרוש וקבל שכר כמאן כראבר\"ש, דתנן ר\"א בר\"ש אומר לעולם אין הבית טמא עד שיראה כב' גריסין על ב' אבנים בב' כתלים בקרן זוית וכו'. ובאמת יפלא על מה שהכריחו חכמי הש\"ס דלדברי ר\"א בר\"ש צ\"ל בית המנוגע לא היה ולא עתיד להיות, מנא להו הא, דילמא נזדמנו יחד כל התנאים הללו בבית המנוגע שנראה כב' גריסין על ב' אבנים וכו', ואף שלא יתכן שיזדמנו כל זה בדרך הטבע, מ\"מ כיון דבלא\"ה כל ענין התהוות נגעי בתים הוא נס ופלא שחוץ לדרך הטבע, א\"כ מדוע לא יתכן שיבא הנס בדרך זו, שישלמו כל פרטי ההלכה הנצרכים לטמא את הבית היפלא מה' דבר. עכ\"פ חזינן שכך הכריחו חז\"ל דר\"א בר' שמעון דאמר שאין הבית טמא עד שיראה כב' גריסין על ב' אבנים וכו', סבר דבית המנוגע לא היה ולא עתיד להיות, משום שלא נזדמנו מעולם כל אותם התנאים הנצרכים לטמא את הבית."},{"passage_id":"vayikru1_23dbd99d_p13","passage_content":"ולכאורה קשה כיצד יחלוק ר\"א בר\"ש על כל הטעמים שנאמרו בדברי חז\"ל בענין נגעי בתים, דלדידיה כיון דכל פרשת נגעי בתים לא היתה במציאות ולא אתיא אלא לדרשה, א\"כ כיצד נתגלו המטמוניות שגנזו הכנעניים, וגם לטעם שאמרו ז\"ל במדרש שנגעי בתים באו לעורר את האדם לתשובה, כאמרם ז\"ל אין בעל הרחמים פוגע בנפשות תחלה, הלא כיון שמעולם לא נזדמן שיהי' בנגעים שיעור הראוי לטמא, באותם התנאים המתחייבים, א\"כ לא תבא התעוררות תשובה בלב בעל הבית. והוא תימה שתהיה דעתו של ר\"א בר\"ש מנוגדת לכל הטעמים שנאמרו בש\"ס ובזה\"ק ובמדרשים בענין זה, והלא כללא אית לן דאלו ואלו דברי אלקים חיים. וביותר יפלא שיחלוק ר\"א על דעת אביו הרשב\"י, דסבר במד\"ר טעמא דמטמוניות, ובזה\"ק איתא הטעם כדי לבער ע\"ז וגם טעם המטמוניות, והרשב\"י ז\"ל הוא מאריה דספר הזה\"ק."},{"passage_id":"vayikru1_23dbd99d_p14","passage_content":"יא) ובר מן דין עצם הדברים קשים להלמן, כי איך יתכן כזאת שהתה\"ק תכתוב פרשה שלימה שאין בה נפק\"מ לדינא, ולא נאמרה אלא לדרשה, והלא התה\"ק ארוכה מארץ מדה, ובכל קוץ וקוץ תלויים תלי תלים של הלכות, ובכל מקום שנראה כאילו נאמרה תיבה יתירא או אפילו אות יתר, דרך הש\"ס להקשות למאי אתי, ומאי ילפינן מיניה, ואילו הכא לדברי התנאים הנ\"ל בגמרא סנהדרין נאמרו בתורה שלשה פרשיות שלימות שאין בהם נפק\"מ להלכה כלל, אתמהה."},{"passage_id":"vayikru1_23dbd99d_p15","passage_content":"יב) עוד קשה דלעומת הני תלתא מימרי דאיתא שם שלא היו ואינם עתידים להיות, איכא תנאי שהעידו אשר עיניהם ראו ולא זר, שפרשיות אלו נתקיימו והיו במציאות, בבן סורר ומורה העיד ר' יונתן אני ראיתיו וישבתי על קברו, וכן בעיר הנדחת א\"ר יונתן אני ראיתיה וישבתי על תילה, ובבית המנוגע תניא א\"ר אליעזר ב\"ר צדוק מקום היה בתחום עזה והיו קורין אותו חורבתא סגירתא (ופי' רש\"י מצורע, מתרגמינן סגירו שניתץ משם בית המנוגע) וא\"ר שמעון איש כפר עכו פ\"א הלכתי לגליל וראיתי מקום שמציינין אותו ואמרו אבנים מנוגעות פינו לשם, ע\"כ. ולכאורה תמוה כיצד יתכן דפליגי במציאות, והלא ר\"א בזמן הבית היה, ואיך יתכן שלא שמע ולא ידע מעיר הנדחת שנעשתה בפירסום רב, ור' יונתן עדיין ראה אותה וישב על תלה. גם משפט בן סורר ומורה היה נעשה בהכרזה ובפירסום גדול, כמאה\"כ וכל ישראל ישמעו ויראו, ואיך יתכן שיאמר ר\"י דלא היה ולא עתיד להיות, ור' יונתן העיד שראה את קברו. גם בבית המנוגע מוכח בגמרא שהיה מקום נודע ומפורסם בגליל, וכיצד יחלוק ר\"א על המפורסמות."},{"passage_id":"vayikru1_23dbd99d_p16","passage_content":"יג) הרמב\"ן ז\"ל כתב בפרשת נגעי בגדים וז\"ל אמר הכתוב ונתתי נגע צרעת בבית ארץ אחוזתכם וכו', והנה איננו נוהג אלא בארץ שהיא נחלת ה' וכו', ובת\"כ דרשו עוד שאין הבית מטמא אלא אחר כיבוש וחילוק וכו', וכן אני חושב בנגעי הבגדים שלא ינהגו אלא בארץ, ולא הוצרך למעט מהם חו\"ל כי לא יארעו שם לעולם וכו', עכ\"ד ז\"ל. ולכאורה לפי דבריו שלא הוצרך הכתוב למעט נגעי בגדים שאינם נוהגים בחו\"ל, משום שאין הדבר במציאות שיבואו נגעים על הבגד בחוץ לארץ, א\"כ מדוע איצטריך כל הני מיעוטי שאין נגעי בתים נוהגים בחוץ לארץ, וגם בא\"י אינם נוהגים אלא אחר י\"ד שכבשו וחלקו, כדדריש בתורת כהנים, הלא אין הדבר במציאות כלל שיבואו נגעים על הבית בחוץ לארץ, וכן בא\"י לא יבואו כ\"א אחרי כיבוש וחילוק, כמו שביאר הרמב\"ן ז\"ל שאז היו ישראל שלמים לה', ורוח ה' חופפת עליהם בכל עת תמיד, על כן יעשה ה' עמהם נס ופלא, להודיע כי סרו מאחריו, ועליהם לתקן מעשיהם ולשוב על חטאתם."},{"passage_id":"vayikru1_23dbd99d_p17","passage_content":"וכן איכא לאקשויי לאידך גיסא דלפי דעת ר\"א בר\"ש דבית המנוגע לא היה ולא עתיד להיות ולא נכתב אלא משום דרוש וקבל שכר, א\"כ מדוע לא כתבה תורה מיעוטא בפ' נגעי בגדים, שאינם נוהגות בחו\"ל, אף שלא יתכן הדבר לעולם, הרי לדידיה כל הפרשה לא היתה במציאות לעולם, ואפ\"ה נכתבה בתורה למען דרוש וקבל שכר."},{"passage_id":"vayikru1_23dbd99d_p18","passage_content":"יד) במד\"ר (פט\"ו ד') איתא כיון ששמעו ישראל פ' נגעים נתייראו א\"ל משה אל תתייראו אלו לאומות העולם אבל אתם לאכול ולשתות ולשמוח, וצ\"ב."},{"passage_id":"vayikru1_23dbd99d_p19","passage_content":"טו) בגמרא (נדרים ס\"ד ע\"ב) איתא כי מתו כל האנשים המבקשים את נפשך (האמור בדתן ואבירם) וכו' והנהו מי מייתי והא אמר ר' יוחנן משום רשב\"י כל מקום שנאמר נצים ונצבים אינו אלא דתן ואבירם אלא אמר ר\"ל שירדו מנכסיהן. וכתב הר\"ן (בנדרים דף ז' ע\"ב ד\"ה שנאמר) דליכא למימר דהאי מתו היינו שנצטרעו ומצורע חשוב כמת דהא כתיב בקרב כל ישראל ומצורע טעון שילוח חוץ לג' מחנות, וליכא למימר שנתרפאו במ\"ת, דהא אמרינן במדרש (רבה פ' נשא פ\"ז א') שחזרו למומן במעשה העגל, עכ\"ד הר\"ן ז\"ל. וכ\"כ התוספות במס' ע\"ז (דף ה' ע\"א ד\"ה אלא). והקשה בספר שאילת שלום (הוא פירוש הגרי\"ב על שאילתות דר' אחאי) בשם מהר\"ש סקוטי מהא דתנן במס' נגעים (רפ\"ז) אלו בהרות טהורות שהיו בו קודם למתן תורה, ויליף לה בתו\"כ מדכתיב אדם כי יהיה מן הדיבור ואילך. ולפי זה דילמא לעולם מתו היינו שנעשו מצורעים, ואפילו הכי לא היו טעונים שילוח מחוץ לג' מחנות, מכיון שהיו בהם הנגעים מזמן היותם במצרים, ונגעים שלפני מ\"ת אינם מטמאין לאחר מ\"ת, ותירץ השאילת שלום קושיא זו, דכיון שנתרפאו מכל הנגעים במתן תורה, הוו הנגעים שחזרו לפרוח בהם במעשה העגל כנגע חדש, ולא חשבינן ליה כנגעים שלפני מתן תורה, שהרי אותם הנגעים כבר אזלו להו, והני אחריני נינהו, וכיון שכן שוב ליכא למימר דמתו פירושו נצטרעו, שהרי אילו נצטרעו היו טעונים שילוח חוץ לשלש מחנות, וקרא כתיב בקרב כל ישראל, אלא ודאי דמתו פירושו הענו, עכ\"ד ז\"ל. אכן הוא עצמו חזר וסתר תירוצו דליכא למימר שאותם הנגעים שחזרו להם במעשה העגל חשיבי נגעים שאחר הדיבור ומטמאי, דאי הכי לא משכחת לעולם נגעים שלפני הדבור, שהרי כל הנגעים נתרפאו במ\"ת, ואמאי איצטריך קרא יתירא למעט נגעים שקודם הדיבור שאינם מטמאין לאחר הדיבור, כיון שלא יתכן כזאת במציאות בשום פנים. וקושיא אלימתא היא זו, ונתחבטו בה האחרונים הלא בספרתם, ונאמרו בה תירוצים שונים זה בכה וזה בכה, וק\"ז זלה\"ה בישמח משה פרשת שמות ובפ' תזריע האריך ליישב קושיא זו בכמה פנים, וכן בספר פנים יפות פרשת תזריע תירץ קושיא זו עפ\"י דרכו, עיי\"ש. ובדברינו לעיל (פרשת תזריע דף שנ\"ב) הארכנו בישוב קושיא זו."},{"passage_id":"vayikru1_23dbd99d_p20","passage_content":"ואפ\"ל עוד בישוב קושית השאילת שלום, דהנה חזינן בגמרא סנהדרין הנ\"ל דאיכא תלת תנאי דסברי שנכתבה בתורה פרשה שלא היתה מעולם, דר\"י ס\"ל הכי בפ' בן סורר ומורה, ור\"א סבר דפ' עיר הנדחת לא היתה ולא עתידה להיות, ולר\"א בר\"ש בית המנוגע לא היה ולא עתיד להיות. הרי לך שלשה תנאים דסברי שנכתבה פרשה שלימה בתורה רק בעבור דרוש וקבל שכר, ואף חכמים דפליגי עלייהו וסברי דנתקיימו פרשיות אלו בפועל, היינו משום שנחלקו עלייהו בדרשות הכתובים, דר\"י דריש מדכתיב איננו שומע בקולנו דבעינן שיהיו אביו ואמו שוים בקולם וכו', ואינהו לא סברי דרשה זו, וכן פליגי חכמים על ר\"א דסבר עיר שיש בה מזוזה אחת אינה נעשית עיר הנדחת, וה\"נ פליגי על ר\"א בר' שמעון דסבר שאין הבית מטמא בנגעים עד שיראה כב' גריסין על ב' אבנים וכו', דמשמע ליה הכי מדרשות הכתובים, כדאי' בתורת כהנים, ואינהו פליגי ודרשי הנך קראי באופן אחר. אבל בעצם הרעיון שאמרו דיתכן שתכתב בתורה פרשה שלימה בעבור דרוש וקבל שכר לא חזינן מאן דפליג עלייהו, דלא נזכר בגמרא שום דחייה על מה שאמרו ולמה נכתב דרוש וקבל שכר. ונראה דכולהו מודו לזה, דאפשר שתכתוב התה\"ק פרשה שלימה רק משום דרוש וקבל שכר, (ובדברינו להלן יתבאר ענין דרוש וקבל שכר מילתא בטעמא)."},{"passage_id":"vayikru1_23dbd99d_p21","passage_content":"ומעתה נחה וגם שקטה תמיהת השאילת שלום, דלעולם איכא למימר כמו שתירץ בתחילת דבריו, שהנגעים שחזרו לפרוח בהם אחר מעשה העגל הרי הם כנגע חדש ומטמאי, ולא תקשי דא\"כ לעולם לא משכחת במציאות נגעים שלפני הדיבור, שהרי נתרפאו במ\"ת, ואמאי איצטריך למיעוטי שהנגעים שלפני הדבור אינם מטמאים, דאין הכי נמי דאין נפק\"מ להלכה בדרשות אלו, ואפילו הכי כתבה תורה כי יהי' למעט נגעים שלפני הדיבור דלא מטמאי, משום דרוש וקבל שכר, פירוש שתהיה הלכה זו נלמדת ונדרשת לאמיתה של תורה, דאילו לא היה כתוב מיעוט זה, היה מקום ללמוד הלכה מוטעית, שהנגעים שלפני הדיבור מטמאין לאחר הדיבור, ע\"כ איצטריך מיעוט זה כדי לברר אמיתות ההלכה."},{"passage_id":"vayikru1_23dbd99d_p22","passage_content":"ואין בזה מן התימה שנכתבה תיבה יתירא בעבור דרוש וקבל שכר, שהרי חזינן דהני תנאי סברי שנכתבה פרשה שלימה בתורה רק כדי לדרוש, ולית מאן דפליג עלייהו בהא, אלא מחמת טעמי אחריני כדאמרן, וכ\"ש הכא דאין כאן אלא יתור כי יהיה למעט נגעים שלפני הדיבור, ודאי דאף חכמים יודו דאיכא למימר דנכתב בעבור דרוש וקבל שכר. ושוב אין כאן אף ריח קושיא כלל, דשפיר איכא למימר שהנגעים שחזרו להם אחרי מעשה העגל דינם כנגע חדש, ומה שכתבה תורה כי יהי', היינו שתהי' ההלכה נלמדת בשלימות ע\"ד האמת, אף שאין בה נפק\"מ למעשה."},{"passage_id":"vayikru1_23dbd99d_p23","passage_content":"ובאופן אחר נראה לתרץ קושיית השאילת שלום, דשפיר איצטריך מיעוטא דאדם כי יהי' פרט לנגעים שלפני הדיבור שאינם מטמאין, דאית בה נפק\"מ להלכה לענין מתן תורה גופיה. דהנה כבר הבאנו לעיל הא דאיתא במד\"ר פרשת נשא, בשעה שיצאו ישראל ממצרים היו כל רובן בעלי מומין וכו', כיון שבאו למדבר סיני אמר הקב\"ה כך הוא כבודה של תורה שאתן אותה לדור בעלי מומין וכו', מה עשה השי\"ת אמר למלאכים שירדו אצל ישראל וירפאו אותן וכו', עכ\"ד המדרש. הרי להדיא דאחר ביאתן למדבר סיני נתרפאו ממומיהן ומצרעתן, כדקאמר כיון שבאו למדבר סיני וכו'. והנה ביאתן למדבר סיני היתה בראש חדש סיון, כדאיתא במסכת שבת (דף פ\"ו ע\"ב) דכולי עלמא בר\"ח אתו למדבר סיני כתיב הכא ביום הזה באו מדבר סיני וכתיב התם החדש הזה לכם ראש חדשים. ואפשר לומר בטעם הדבר שנתרפאו דוקא בבואם למדבר סיני ולא קודם לכן, משום שביאתן למדבר סיני היתה בתשובה, כדאיתא במכילתא (הביאו רש\"י ז\"ל) ויחן שם ישראל נגד ההר (שמות י\"ט) כאיש אחד בלב אחד. ולפיכך היתה עת ביאתן למדבר סיני שעת רחמים ועת רצון לרפאותן מכל מומיהן ותחלואיהם, וכמבואר בדברי חז\"ל דכל ישועה ורפואה צריכה עת רצון, וכמו שדרשו (ע\"ז נ\"ה ע\"א) עה\"כ חלאים רעים ונאמנים. והנה מכיון שלא נתרפאו מצרעתן עד ראש חדש סיון, ואחרי שנרפא הנגע חייב המצורע להמתין שבעת ימים, ואינו טהור עד הערב שמש של יום השביעי, ובשמיני מביא קרבנותיו, א\"כ נמצא דבשעת מ\"ת עדיין לא נשלמו שבעת ימים מעת שנתרפאו מצרעתן. והשתא שפיר איצטריך קרא למיעוטי נגעים שלפני הדיבור דלא מטמאי, דאילו לא נאמר קרא, הוה אמינא דאף נגעים שלפני מ\"ת מטמאים, ומעתה לא היו ישראל טהורים בעת שניתנה תורה, דעדיין לא שלמו ז' ימים מעת נרפא הנגע."},{"passage_id":"vayikru1_23dbd99d_p24","passage_content":"והנה במסכת שבת (דף פ\"ו ע\"א) תנן מנין לפולטת ש\"ז ביום השלישי שהיא טמאה שנאמר (שמות י\"ט) היו נכונים לשלשת ימים, ופירש\"י דהקפיד הכתוב על טומאת קרי במתן תורה, וכתבו התוספות (בד\"ה מנין) דאע\"פ שבאותה שעה עדיין לא ניתנה תורה, מ\"מ מסתמא הקפידה תורה על דבר שעתיד להיות טומאה אחר מתן תורה, ואעפ\"י שלא הקפידה תורה על זבין ומצורעין וכו', עיי\"ש שכתבו טעם לחלק בינייהו, דדוקא בבעל קרי הקפידו משום דמחמת קלות ראש הוא בא, עכת\"ד התוס'. ולכאורה מנא להו לתוספות שלא הקפידה תורה על זבין ומצורעין בשעת מתן תורה, הרי לא היו בקרב ישראל זבין ומצורעין באותה שעה, שהרי נתרפאו כולן. ולדרכנו אפ\"ל דאף שנתרפאו, מ\"מ כיון שלא עברו שבעה ימים משעה שנתרפאו, עדיין תורת זבין ומצורעים עליהם, וע\"כ לומר שלא הקפידה תורה על זבים ומצורעים במ\"ת."},{"passage_id":"vayikru1_23dbd99d_p25","passage_content":"אמנם בעיקר מה שנתקשו התוספות מדוע הקפידה תורה על בעלי קריין במתן תורה, ולא הקפידה על זבין ומצורעים, נראה ליישב באופן אחר, דודאי הסברא נותנת דכשם שהקפיד הכתוב בטומאת קרי במ\"ת משום דגנאי היא שתנתן תורה לטמאים בדבר שעתידה התורה לאסור, ה\"נ ראוי שתקפיד בזבים ומצורעין, משום שעתידה תורה לטמאן, אך מאחר שכתבה תורה בין במצורע בין בזב כי יהי', למעט זבים ומצורעים שמלפני הדיבור שאין מטמאין לאחר הדיבור, א\"כ אף אם היה אותו המצורע שנולד בו הנגע לפני מ\"ת עומד בנגעו אחרי מ\"ת ולא נתרפא לא היה אותו נגע מטמא, דמיעטיה קרא להדיא. ועל כן אף שעדיין לא עברו שבעת ימים מעת שנתרפאו ישראל מנגעיהן ומזיבתן עד מתן תורה, לא הקפיד הכתוב על זבין ומצורעין שהרי אף לאחר מתן תורה אינם עתידין להיות טמאים מחמת נגע זה או זיבה זו, שנולדו בהם לפני מתן תורה, משא\"כ בעלי קרי דלא כתיב בהו קרא למעט טומאת ש\"ז שלפני הדיבור שלא תטמא אחר הדיבור, א\"כ נמצא דטומאת ש\"ז שלפני מ\"ת מטמאה לאחר מ\"ת, ומשו\"ה הקפידה תורה בבעלי קריין דוקא, משום שדבר זה עצמו עתיד להיות טמא לאחר מ\"ת."},{"passage_id":"vayikru1_23dbd99d_p26","passage_content":"ועל פי מה שנתבאר נסתלקה קושיית השאילת שלום, דלעולם אמרינן דאותם הנגעים שחזרו להם במעשה העגל חשיבי כנגע חדש ומטמאי, ואפילו הכי איצטריך קרא למכתב אדם כי יהי', דשפיר משכחת לה נגעים שלפני הדבור, דאף שנתרפאו מנגעיהם במ\"ת, מ\"מ עדיין לא עברו שבעת ימים מראש חדש סיון שבו נתרפאו, עד יום מתן תורה. ואילו לא כתיב מיעוטא שאין נגעים שלפני הדיבור מטמאין, הוה אמינא דכשם שהקפידה תורה בפולטת, משום שעתיד הדבר להיות טמא אחרי מ\"ת, ה\"נ קפדינן בזבין ומצורעין, ע\"כ קמ\"ל קרא כי יהיה פרט לנגעים שלפני הדיבור, וכן בזב, וכיון שאין עתידה תורה לטמאן מחמת נגע זה וזיבה זו אפילו אחר מתן תורה, לא הקפידה תורה עליהם במ\"ת."},{"passage_id":"vayikru1_23dbd99d_p27","passage_content":"אמנם אכתי חלה עלינו חובת ביאור שאמרו ז\"ל ולמה נכתב דרוש וקבל שכר, דלכאורה יפלא מאד שתכתוב התורה פרשה שלימה שאינה שייכת במציאות כלל. ותו שבכל ג' הפרשיות שאמרו עליהם שלא היו ואינם עתידים להיות, יש עדים שהעידו אשר עיניהם חזו זאת, וכיצד יחלקו ר' יהודה ור' אליעזר ור\"א ב\"ר שמעון על המציאות. ועוד הרי כללא אית לן דאלו ואלו דא\"ח, וכיצד יתקיימו דבריהם ודברי החולקים עליהם גם יחד."},{"passage_id":"vayikru1_23dbd99d_p28","passage_content":"ונראה לומר בביאור הענין, בהקדם הא דאיתא בעירובין (דף י\"ג ע\"ב) א\"ר אבא אמר שמואל ג' שנים נחלקו ב\"ש וב\"ה הללו אומרים הלכה כמותינו, והללו אומרים הלכה כמותינו, יצאה בת קול ואמרה אלו ואלו דברי אלקים חיים הם והלכה כב\"ה וכי מאחר שאלו ואלו דא\"ח מפני מה זכו ב\"ה לקבוע הלכה כמותן מפני שנוחין ועלובין היו וכו', עכ\"ד הגמרא. וכתב הריטב\"א ז\"ל וז\"ל, שאלו רבני צרפת ז\"ל היאך אפשר שיהיו אלו ואלו דא\"ח, זה אוסר וזה מתיר, ותירצו כי כשעלה משה למרום הראו לו על כל דבר ודבר מ\"ט פנים לאיסור ומ\"ט פנים להיתר, ושאל להקב\"ה על זה, ואמר שיהא מסור לחכמי ישראל שבכל דור ודור ותהי' הכרעה כמותם, עכ\"ל. אמנם לכאורה אף בביאורם של רבני צרפת ז\"ל אכתי לא נתפרש לנו ענין זה כל צורכו, דהנה במה תלויה הכרעתם של חכמי ישראל בכל דור ודור, הלא ה' יתן חכמה מפיו דעת ותבונה, והוא הנותן חכמה בלבם להכריע כלפי היכן הדעת נוטה, ולכוון הלכה לאמיתה, וכיון שכן הלא כלפי שמיא גליא מראש מקדם בירורן של דברים, ושיטת ההלכה לאמיתה של תורה, ומה צורך היה שיתלה הקב\"ה את הכרעת ההלכות ביד החכמים, באחד ממ\"ט פנים לכאן או לכאן, הלא לכאורה מוטב אילו היה הקב\"ה מגלה למשה בעת מ\"ת, כיצד היא הכרעת ההלכה הברורה לאמיתה של תורה."},{"passage_id":"vayikru1_23dbd99d_p29","passage_content":"ובירושלמי (פ\"ד דסנהדרין ה\"ב) מבואר ענין זה יותר וז\"ל, א\"ר ינאי אילו ניתנה התורה חתוכה לא היתה לרגל עמידה, ופירש הפני משה אילו ניתנה תורה חתוכה בפסק הלכה בלא נטיית דעת לכאן ולכאן, לא היתה לרגל עמידה, לא היה קיום לעולם, דהתורה צריך שתהא נדרשת פנים לכאן ולכאן. עוד אי' התם בירושלמי אמר משה לפני הקב\"ה רבש\"ע הודיעני היאך היא ההלכה, א\"ל אחרי רבים להטות רבו המזבין זכו רבו המחייבין חייבו כדי שתהא התורה נדרשת מ\"ט פנים טמא ומ\"ט פנים טהור. ופירש הפני משה שביקש משרע\"ה שהקב\"ה יודיע הלכה מבוררת שלא יהיה בה ספק, וא\"ל הקב\"ה זה אי אפשר, אלא אחרי רבים להטות, מפני שהתורה צריך שתהיה נדרשת במ\"ט פנים לכאן ולכאן, ואם אני מגלה לך ההלכה שוב לא תהיה נדרשת בהרבה פנים, עכ\"ל."},{"passage_id":"vayikru1_23dbd99d_p30","passage_content":"אך עדיין לא נתבאר טעם הדבר, מדוע לא היתה עמידה לעולם אילו לא היתה התורה נדרשת במ\"ט פנים לכאן ולכאן. ונראה דהנה התוה\"ק היא קיומו של עולם, כמאה\"כ (ירמי' ל\"ג) אם לא בריתי יומם ולילה חקות שמים וארץ לא שמתי, ומן ההכרח הוא לקיומו של עולם שתהיה התורה הקדושה נדרשת בכל הבחינות והאופנים שבה, כדי שיתגלו כל חלקי יסודות התה\"ק בלימוד, ואלו המ\"ט פנים לכאן ומ\"ט פנים לכאן כולם חלקי התורה הם, דברי אלקים חיים בפרושי התורה, ועל כן הכרח הוא שידרשו כולה כי אילולא כן היה נחסר משלימות התה\"ק, ולא היתה עמידה לעולם. גם יבואר קצת עפי\"מ שגילו לנו חכמי הקבלה בשם האריז\"ל, וכן איתמר משמי' דהרמ\"ק ז\"ל, כי עיקרי ההלכות תלויים במדות העליונות, ומ\"ט פנים שבתורה מכוונים למספר מ\"ט אשר יסתעפו המדות העליונות, ומסקנת ההלכה תלויה ג\"כ כפי המדה אשר הנהגת הדור תלויה בה, וכמבואר בדברי האר\"י ז\"ל, כי בזה\"ז הלכה כב\"ה משום שמדתם חסד, ועתה הנהגת העולם היא במדת החסד, כי א\"א שיתנהג בדין, אבל לעת\"ל תהיה ההלכה כבית שמאי, עכ\"ד. עכ\"פ יובן קצת דהכרח לקיום העולם, ולהנהגת העולם עפ\"י המדות, שתהא התוה\"ק נדרשת בכל הבחינות, שהם מ\"ט פנים לכאן ולכאן."},{"passage_id":"vayikru1_23dbd99d_p31","passage_content":"והשתא שוב לא קשה על הא דקאמר ר' אלעזר בר' שמעון בית המנוגע לא היה ולא עתיד להיות, ורבנן פליגי עליה, ומהם שהעידו אשר ראו במו עיניהם מקום שהיו מציינין ואומרים אבנים מנוגעות פינו לשם וכו'. דטעמיה דר\"א בר\"ש משום שהוציא כן מדרשת המקראות, שאין הבית טמא עד שיראה כב' גריסין על ב' אבנים בקרן זוית, וכיון שדבר זה הוא נמנע המציאות, לכן אמר דבית המנוגע לא היה ולא עתיד להיות, לפי שיטה זו במשמעות הכתובים. אמנם אף הוא ידע שחביריו חלוקין עליו, וכדתנן במסכת נגעים (פי\"ב מ\"ג) דר' ישמעאל ור' עקיבא פליגי על ר\"א בר\"ש וסברי דלא בעינן שיהא הנגע על ב' כתלים ובקרן זוית, דאינהו דרשי קראי באופן אחר כדאיתא בתורת כהנים, ולדידהו נאמרה פרשת בית המנוגע להלכה ולמעשה, שהרי יתכן כזאת במציאות. והכי נמי ר\"א דסבר עיר הנדחת לא היתה ולא עתידה להיות, אזיל לשיטתיה דבעינן שלא יהא בה מזוזה אחת, אמנם דעת יחידאה היא, וסתם מתני' פליגא עליה בהא, וסבירא לה שהיא נעשית עיר הנדחת אף אם יש בה מזוזה. וכן ר' יהודה הסובר בן סורר ומורה לא היה ולא עתיד להיות, היינו משום דדריש מקרא דבעינן שיהיו אביו ואמו שוין בקול ובמראה וכו', וחכמים לא דרשי הכי. ומעתה כיון שבג' פרשיות אלו יש פנים לכאן ולכאן, ולכל צד וצד יש שיטה בשמים, מאחת ממ\"ט פנים שבתורה, על כן אף שלפי שיטת הני תנאי אין הלכה זו שייכת במציאות ואין בה נפק\"מ למעשה, מ\"מ מן ההכרח הוא למען קיום העולם שיהיו נלמדים כל חלקי התורה וכל ההלכות, במ\"ט פנים שבתורה לכאן ולכאן, ובתוכם גם הלכות אלו. ואתי שפיר מה שאמרו דהלכה זו לא היתה ולא עתידה להיות אלא נכתבה לדרוש וקבל שכר, פירוש כדי שתהיה התורה נדרשת במ\"ט פנים, דאילו לא נכתבה פרשה זו היה נחסר משלימות לימוד התורה, שהרי לא היו נשנים שיטות החולקין בהלכה זו בסברותיהם וטעמיהם, וכ\"ז שייך לחלקי התורה הצריכים לקיום העולם, וע\"כ אף שלא היתה הלכה זו נוהגת למעשה לפי שיטתם, מן ההכרח הוא שתהא נלמדת פלוגתא זו בין חכמי התורה, וזהו שתירצו דנאמרו בעבור דרוש וקבל שכר."},{"passage_id":"vayikru1_23dbd99d_p32","passage_content":"ואפ\"ל עוד הערה לביאור הענין עפי\"מ דאיתא במסכת נדה (דף י\"ט ע\"א) דפריך מנלן דאיכא דם טהור באשה דלמא כל דם דאתי מינה טמא, ומשני א\"ר חמא ב\"ר יוסף א\"ר אושעיא אמר קרא (דברים י\"ז) כי יפלא ממך דבר למשפט בין דם לדם בין דם טהור לדם טמא, ופריך אלא מעתה בין נגע לנגע הכי נמי בין נגע טמא לנגע טהור, נגע טהור מי איכא, וכי תימא כולו הפך לבן טהור הוא, האי בוהק מקרי, ומשני דנגעי אדם משכחת לה בפלוגתא דר' יהושע ורבנן, דפליגי בספק בהרת קדמה לשער לבן או שער לבן קדמה לבהרת, רבנן ס\"ל טמא ור\"י מטהר, ופירש\"י דקאמר זמן ממרא כחד מינייהו, וסנהדרין כחד מינייהו. בנגעי בתים משכחת לה דאפליגו בפלוגתא דראבר\"ש ורבנן, דתנן ראבר\"ש אומר לעולם אין הבית מטמא עד שיראה כשני גריסים על שתי כתלים בקרן זוית וכו', ע\"כ. היוצא מזה דלא אשכחו חכמי הש\"ס אופן אחר בנגעי בתים שיהא שייך לחלוק בין נגע טהור לנגע טמא, אלא הך פלוגתא דר\"א בר\"ש ורבנן, ומפרש בגמרא הך קרא דכי יפלא וגו' בין נגע לנגע, בפלוגתא זו. ולפי זה הרי רמזה לנו התה\"ק במאמר בין נגע לנגע, שיהיו חכמי ישראל נחלקים בפלוגתא זו דפליגי ר\"א בר\"ש ורבנן בבית המנוגע."},{"passage_id":"vayikru1_23dbd99d_p33","passage_content":"והנה כתב הרמב\"ם ז\"ל (בפ\"ב מהלכות ממרים ה\"א) וז\"ל בית דין שגזרו גזירה או תיקנו תקנה והנהיגו מנהג, ופשט הדבר בכל ישראל, ועמד בית דין אחר וביקש לבטל ולעקור אותה התקנה ואותה הגזירה או המנהג, אינו יכול עד שיהי' גדול מן הראשונים בחכמה ובמנין, אבל ב\"ד שדרשו בא' מן המדות כפי מה שנראה בעיניהם שהדין כך, ועמד ב\"ד אחר ונראה לו טעם אחר לסתור אותו, ה\"ז סותר ודן כפי מה שנראה בעיניו, שנאמר אל השופט אשר יהיה בימים ההם אינך חייב ללכת אלא אחר ב\"ד שבדורך, עכ\"ל. וכתב הכ\"מ למד כן רבינו ממאי דאשכחן תנאי בתראי דפליגי אקמאי, וכן אמוראי בתראי דפליגי אקמאי, והא דתנן אין ב\"ד יכול לבטל דברי ב\"ד חבירו וכו', מוקי לה רבינו כשנחלקו בגזירה או תקנה כנ\"ל. ואם תאמר אמאי לא פליגי אמוראי אתנאי, דבכל דוכתא מקשינן לאמוראי ממתניתין או מברייתא וכו', ואפ\"ל דמיום חתימת המשנה קיימו וקבלו שדורות האחרונים לא יחלקו על הראשונים, וכן עשו גם בחתימת הגמרא, שמיום שנחתמה לא ניתן רשות לשום אדם לחלוק עליה, עכ\"ל. והנה אם בדורות הראשונים כך, עאכו\"כ בדורינו זה שאנו נגד הראשונים כקליפת השום, וכאין וכאפס נחשבנו, ודאי שאין בידינו כח להכריע כנגדם, ועלינו לקבל דבריהם כנתינתן. ורגיל אני לפרש מה שאמרו ז\"ל במס' שבת (דף קי\"ב ע\"ב) אם הראשונים כמלאכים אנו כבני אדם, ואם הראשונים כבני אדם אנו כחמורים. דה\"פ אם יש בנו דעת לחשוב את הראשונים כמלאכים, לבלי לחלוק עליהם, כי אם לקבל את דבריהם הקדושים באימה וביראה, אזי אנו נחשבים בני אדם, אך אם יעלה על דעתינו לומר הלא אף הראשונים בני אדם היו, ויש בכוחינו לחלוק עליהם ולסתור דבריהם ח\"ו, אזי אין אנו נחשבים בגדר בני אדם כלל, אלא אנו כחמורים."},{"passage_id":"vayikru1_23dbd99d_p34","passage_content":"תוכן הדברים כי בדבר הלמד מדרשת המקראות בא' מן המדות שהתורה נדרשת, אפשר שיחלוקו תנאי בתראי על קמאי, ואין בזה משום אין ב\"ד יכול לבטל דברי ב\"ד חבירו, והנה פלוגתא זו דר\"א בר\"ש ורבנן כבר היתה פלוגתא קדומה, כדמוכח בגמרא נדה הנ\"ל דמוקי לקרא דכי יפלא בפלוגתא זו. ועתה יתבארו בתוספת ביאור דברי ר\"א בר\"ש דאמר בית המנוגע לא היה וכו' ולמה נכתב משום דרוש וקבל שכר. דאף דלדידיה לא שייכא הלכה זו משום שלא יתכן במציאות שיזדמנו יחד כל התנאים המתחייבים לטמא את הבית, מ\"מ הרי החכמים דסברי דאין צורך שיהי' הנגע בב' אבנים בב' כתלים בקרן זוית, דנו דין בית המנוגע, ולכל אחד מדיעות אלו יש מקום באחד ממ\"ט פנים שהתורה נדרשת בהן, והכרעת ההלכה מסורה בידי חכמי הדורות, אם ידרשו הכתובים כדעת ר\"א בר\"ש דבעינן בשני כתלים בקרן זוית דייקא, או כדעת ר\"י ור\"ע החולקין עליו, ואלו ואלו דברי אלקים חיים. ועל כן היה צורך שתכתב פרשה זו בתורה, אף לדעת ר\"א בר\"ש, כדי שיהא הדבר מסור ביד חכמים להכריע עפ\"י דעתם הרחבה כאחת מן הדיעות."},{"passage_id":"vayikru1_23dbd99d_p35","passage_content":"והשתא דאתאן להכי שוב ליכא לאקשויי על הא דסבר ר' יהודה בן סורר ומורה לא היה ולא עתיד להיות, ור' אליעזר סבר עיר הנידחת לא היתה ולא עתידה להיות, מה יענו לעדותו של ר' יונתן שאמר בבן סו\"מ אני ראיתיו וישבתי על קברו, וכן בעיר הנדחת אני ראיתיה וישבתי על תילה, ומה יענה ר\"א בר\"ש דסבר בית המנוגע לא היה ולא עתיד להיות, לדברי ר\"א בר' צדוק שהעיד על מקום שהיו קורין אותו חורבתא סגירתא, ור\"ש איש כפר עכו העיד שראה מקום שמציינין אותו ואומרים אבנים המנוגעות פינו לשם. ולדרכינו אתי שפיר, שהרי הכרעת ההלכה בפלוגתות אלו היתה מסורה בידי בית דין שבכל דור, והדבר תלוי בדרשות הפסוקים כמבואר, ובזה הרשות נתונה לחכמים שבדור לחלוק על הקודמין להם. והנה היה זמן שהסנהדרין שבדור הכריעו להלכה דלא כר\"א בר\"ש, ופסקו דנגעי בתים מטמאים אף אם נראה הנגע בכותל אחד בלבד, ועשו מעשה עפ\"י הוראתם לנתוץ בית המנוגע, וכן היה זמן שהסנהדרין הכריעו בבן סורר ומורה דלא כר\"י, ופסקו דלא בעינן שיהיו אביו ואמו שוים בקול מראה וקומה, וכן בעיר הנדחת פסקו הסנהדרין בזמן מן הזמנים דלא כר\"א, ודנו דין עיר הנדחת אף אם יש בה מזוזה, ואפ\"ה חלקו ר\"י ור\"א ור\"א בר\"ש על הסנהדרין שבדורות הקודמין להם, והכריעו להלכה שלא כמותם, כפי מה שהוכיחו המה מדרשות הפסוקים וממשמעותם, כמו שנתבאר דבדרשות הכתובים יש כח ביד ב\"ד מאוחר לחלוק על הקודמין, לו, ואפילו הם גדולים ממנו בחכמה ובמנין."},{"passage_id":"vayikru1_23dbd99d_p36","passage_content":"ומעתה אין כאן פלוגתא במציאות, דאף הם ידעו שיש החולקים עליהם, וכבר נעשה מעשה בדורות הקודמים כפי שיטת החולקים עליהם, ודנו דין בן סורר ומורה ודין עיר הנדחת ודין בית המנוגע, כעדותם של החכמים הנ\"ל שהמה ראו כל אלה בעיניהם, ואפילו הכי הכריעו ר\"י ור\"א וראבר\"ש בג' פרשיות אלו דלא כשיטות הללו. כי לפי מה שדרשו הם מן הפסוקים, לא עשו הסנהדרין הקודמין להם כשיטת ההלכה, ולפי דבריהם לא היה לאותה עיר דין עיר הנידחת, ולא דין בן סורר ומורה, ולא דין בית המנוגע. ואף שבזמן שהורו אותם הסנהדרין נעשה מעשה כהוראתם, מ\"מ אינהו סברי דאין שיטת ההלכה כן. וכמו שמצינו בגמרא (ביצה כ' ע\"א) אותו היום גברה יד בית שמאי וביקשו לקבוע הלכה כמותן, אף דבאמת אין שיטת ההלכה כן. ועל כן אמרו דלא היה ולא עתיד להיות, פירוש עפ\"י שיטת ההלכה כפי מה שהכריעו הם מדרשות הכתובים, לא היו במציאות ואינם עתידים להיות, ומה שהיו היינו שלא עפ\"י הלכה לפי דעתם."},{"passage_id":"vayikru1_23dbd99d_p37","passage_content":"ואפשר להוסיף תבלין בישוב קושיא הנ\"ל עפ\"י מה שכתב הרמב\"ן ז\"ל בפרשת שופטים בדין עדים זוממין שאמרו ז\"ל (מכות ה' ע\"ב) הרגו אין נהרגין וז\"ל, וטעם הדבר דאם נסתייע מילתא ונהרג הנדון נחשוב שהיה אמת כל אשר העידו עליו הראשונים כי הוא בעוונו מת, ואילו היה צדיק לא יעזבנו ה' בידם, ועוד שלא יתן ה' השופטים הצדיקים העומדים לפניו לשפוך דם נקי, כי המשפט לאלקים הוא וכו', והנה זה מעלה גדולה בשופטי ישראל, והבטחה שהקב\"ה מסכים עמהם ועל ידם בדבר המשפט עכ\"ל הרמב\"ן ז\"ל. וכבחינה זו כתב בסה\"ק דגל מחנה אפרים עה\"פ ואלה המשפטים אשר תשים לפניהם, דאיתא בזה\"ק (משפטים צ\"ד ע\"א) ואילין אינון סדורין דגלגולא וכו', שמעתי לפרש דבענין הדין יזדמן אשר יתייצבו ב' בעלי הדינים לפני הב\"ד, ויצא אחד מהם חייב, והוא יודע בנפשו כי הוא זכאי בדין, לא יהרהר בלבו הלא תורתינו הקדושה אמת ודרכיה דרכי נועם, ומדוע נתחייב הוא בדין, כי בודאי היה חייב ממון בגלגול העבר לאיש ריבו ולא שילם, ומאת ה' היתה זאת שיעמדו שניהם לדין בגלגול זה ויצא הוא חייב, כדי שיפרע חובו. וז\"ש הזה\"ק אלין אינון סידורין דגלגולא, שהדינים שבתורה נפסקים עפ\"י הגלגולים הקודמים, כי הבוי\"ת הוא היודע תעלומות סתרי כל חי, וככה ינהיג עולמו עפ\"י התורה, לשפוט צדק בין איש לרעהו."},{"passage_id":"vayikru1_23dbd99d_p38","passage_content":"וכמו כן אפ\"ל גם לענינינו, כי מה שדנו הסנהדרין דין עיר הנידחת בזמן מן הזמנים מאת ה' היתה זאת, לתת בלבב דייני ישראל שבאותו זמן לדון ולהכריע כאותו פן ממ\"ט פנים החולק על שיטת ר\"א, כי ראתה חכמתו יתברך, שאם תהיה הכרעת הסנהדרין בו בפרק כשיטה הסוברת דאין לדון דין עיר הנדחת, תצא מכך תקלה גדולה לישראל, ורבים אשר ילכדו בפח מוקשם. וכן בבן סורר ומורה שדנוהו וחייבוהו, אפשר שהיה מושחת עד מאד, וכוחות טומאה גדולים דבקו בו, וראתה חכמתו יתברך שרבים יכשלו על ידו, אם יהיה חלקו בחיים. והכי נמי בבית המנוגע שטמאוהו חכמים ונתצו את אבניו ועציו, יתכן שגרם החטא, ונקהלו כוחות הסט\"א גדולים לאותו בית, וראתה חכמתו יתברך לנתוץ אותו הבית ולהאביד כוחות הטומאה אשר בו."},{"passage_id":"vayikru1_23dbd99d_p39","passage_content":"ולזאת בעת שישבו הסנהדרין לדון בדברים הללו, נתן ה' חכמה ותבונה בלבם, להכריע ולדון באותה שעה דין עיר הנדחת, וכן בבן סורר ומורה ובבית המנוגע במקומן ובשעתן, בעת שהי' צורך בכך למען קיום העולם. ודינם ודאי היה דין אמת לאמתה של תורה, שהרי הם הכריעו כשיטות התנאים החולקים על ר\"י ור\"א ור\"א בר\"ש בג' הלכות הללו, וכל חד מינייהו שיטתו שרשה באחד ממ\"ט פנים שבתורה. ומכיון שהשי\"ת הטה את לב החכמים לדון ולהורות כן, הרי הסכים עמהם, וכדכתיב ועמהם בדבר המשפט, ואפילו הכי הרשות נתונה לחכמים בדורות שאחריהם לסתור הוראתם ולהכריע להיפך, כפי נטיית דעתם עפ\"י משמעות הכתובים, וכמו שכתב רש\"י ז\"ל בכתובות (דף רז ע\"א) ד\"ה הא קמ\"ל, דכי פליגי תרי אמוראי בדין או באיסור והיתר, כל חד אמר הכי מסתבר טעמא, אין כאן שקר, דכל חד סברא דידיה קאמר, מר יהיב טעמא להיתירא, ומר יהיב טעמא לאיסורא, מר מדמי למילתא הכי, ומר מדמי ליה בענינא אחרינא ואיכא למימר אלו ואלו דא\"ח הם, דזמנין דשייך האי טעמא וזמנין דשייך האי טעמא וכו'. והגם שכוונת רש\"י ז\"ל בפשטות היא שהטעם משתנה עפ\"י הענין, מ\"מ משם ראיה דאפשר שישתנה הטעם, ושניהם אמת הם, ומכ\"ש דאפשר שישתנה הדין בגזירת הבוי\"ת, עפ\"י מה שראתה חכמתו שיש צורך בדבר להכריע לכאן או לכאן, וכמו שהובא לעיל מה שפירש הדגמ\"א בדברי הזה\"ק פרשת משפטים."},{"passage_id":"vayikru1_23dbd99d_p40","passage_content":"ומעתה אין כאן סתירה ממה שהעידו חכמים שראו בעיניהם עיר הנדחת, וקברו של בן סו\"מ ומקום שהיה בו בית המנוגע וניתץ משם, דאף הנך תנאי דפליגי ואמרי לא היה ולא נברא בג' דברים אלו, אינם חולקים על מציאות, שכך דנו והכריעו בית דין בדורות שלפניהם, אלא דאינהו סברי שאין שיטת ההלכה כן, שהרי הם רשאים לחלוק על הקודמין להם ולבטל דבריהם, עפ\"י מה שיראה להם בדרשות הכתובים, כמ\"ש הרמב\"ם ז\"ל, ובזה נתבאר הענין קצת."},{"passage_id":"vayikru1_23dbd99d_p41","passage_content":"ובדרך זה יש לבאר גם דברי הירושלמי סנהדרין, אלמלא ניתנה תורה חתוכה לא היתה לרגל עמידה, דהכי פירושו, שראתה חכמתו יתברך אשר לפעמים יהי' צורך למען תיקון העולם שיכריעו הבית דין שלא כשיטת ההלכה הקבועה, וכמו שנתבאר שנתן ה' בלבות החכמים באותן הדורות שהיה צורך לדון ג' הלכות הנ\"ל, להכריע כאותם שיטות הדנים לחיובא. וע\"ד שהבאנו לעיל מ\"ש הרמב\"ן ז\"ל בדין עדים זוממין דאם הרגו אין נהרגין, דודאי היה חייב דאילולא כן ה' לא יעזבנו בידם. והנה אילו היתה התורה ניתנת חתוכה, בפסק הלכה ברור וקבוע, אשר אין מקום לנטות ימין ושמאל, לא הי' שייך לדון כ\"א כשי' ההלכה הקבועה, וא\"כ לא היתה לעולם עמידה, כי פעמים יש צורך להכריע באופן אחר למען קיום העולם, על כן ניתנה התורה במ\"ט פנים לכאן ולכאן, ונמסר בידי חכמי הדור להכריע כאחד מפנים אלו. אמנם ברור שכל זה היה שייך רק בדורות התנאים והאמוראים הקדושים, ועליהם אמרו אלו ואלו דברי אלוקים חיים הם, אבל הדורות האחרונים אין בכוחם להכריע ולשנות אף כל שהוא, מן הדרך שגבלו הראשונים."},{"passage_id":"vayikru1_23dbd99d_p42","passage_content":"ובפנימיות הענין אפ\"ל מה שאמרו ז\"ל ולמה נכתב דרוש וקבל שכר, עפ\"י מה שכתב הזה\"ק פ' בלק (דף קצ\"ז ע\"ב) תנינן בהאי שעתא אמר קוב\"ה למשה כתוב (פרשתא דבן סורר ומורה) א\"ל משה מרי דעלמא שבוק דא אית אבא דעביד כדין לבריה וכו' א\"ל קוב\"ה למשה כתוב וקבל אגרא וכו' בההוא שעתא רמז למלאך רבנא דאורייתא אמר למשה אנא דרישנא לההוא קרא כי יהיה לאיש דא קוב\"ה דכתיב (שמות ט\"ו) ה' איש מלחמה בן דא ישראל סורר ומורה דכתיב (הושע ד') כי כפרה סוררה סרר ישראל וכו', עיי\"ש שדורש כל הפרשה על כנסת ישראל. ובדבריו הקדושים מלמד זכות עלייהו וז\"ל, מאי שנא דבקדמיתא לא כתיב זולל וסובא ולבתר כתיב זולל וסובא אלא מאן גרים להו לישראל למהוי סורר ומורה לגבי אבוהון דבשמיא בגין דאיהו זולל וסובא בשאר עמין דכתיב (תהלים ס\"ח) ויתערבו בגוים וילמדו מעשיהם וכו', כיון דשמע משה כדין כתב פרשתא דא, עכ\"ל. דכיון ששמע משה שפרשה זו נדרשת לזכותן של ישראל הסכים לכתבה."},{"passage_id":"vayikru1_23dbd99d_p43","passage_content":"ומדברי הזה\"ק הללו מבוארת כוונת חז\"ל באמרם דרוש וקבל שכר, דאף שאין פרשה זו שייכת במציאות כאשר תמה משרע\"ה היש אב אשר יעשה כזאת לבנו, אפילו הכי צווהו הקב\"ה דרוש וקבל אגרא, כי פרשה זו יפה נדרשת לזכותם של ישראל, וממנה יש לימוד זכות והצלה לישראל לדורות. וכמו כן מצינו שפרשת נגעי בתים נדרשת לזכות ישראל דאיתא במד\"ר (פי\"ז ז') ונתתי נגע צרעת בבית ארץ אחוזתכם זה ביהמ\"ק וכו' ובא אשר לו הבית זה הקב\"ה וכו' והגיד לכהן זה ירמיה וכו' כנגע נראה לי בבית זה טינופת ע\"ז וכו' ונתץ את הבית זה חורבן ביהמ\"ק וכו' יכול לעולם ת\"ל ולקחו אבנים אחרות וכו'. הרי שכלולה בפרשה זו בשורה טובה על הבית השלישי שיבנה במהרה, ואפשר שזאת כוונת ר\"א בר\"ש דקאמר שפרשת נגעי בתים נאמרה לדרוש וקבל שכר, היינו דבדרוש פרשה זו נרמז שכר טוב לישראל שיזכו לגאולה העתידה ולבנין המקווה שיעמוד לעד, וזהו כעין מה שכתב הזה\"ק בפרשת בן סורר ומורה."},{"passage_id":"vayikru1_23dbd99d_p44","passage_content":"ובזה מיושב מה שהקשינו לעיל (בקושי' י\"ג) למה הוצרכה תורה לכתוב אחוזתכם למיעוטי שאין נגעי בתים נוהגין בחו\"ל, והלא דבר זה לא יתכן במציאות שיבואו נגעי בתים בחו\"ל, כמ\"ש הרמב\"ן ז\"ל שלא יעשה ה' נס זה כ\"א בארץ הנבחרת שכבודו שוכן בתוכה, ומהאי טעמא לא כתיב מיעוטא בפרשת נגעי בגדים שאינם נוהגים בחו\"ל, משום שלא יתכן שיוולדו נגעי בגדים בחוץ לארץ. אמנם על פי מה שנתבאר אמרם ז\"ל בנגעי בתים שנכתבה בעבור דרוש וקבל שכר, שהכוונה דדרשת פרשה זו רומזת לחורבן הבית וגלות ישראל, ושעתידין הן להגאל, ויבנה הבית המקוה שיעמוד לעד, אתי שפיר מה שכתבה תורה בבית ארץ אחוזתכם בנגעי בתים, וממעטינן מיניה שאין נגעי בתים מטמאין בחו\"ל, אף דלהכי בלבד לא איצטריך קרא כדאמרן, מ\"מ בלא\"ה הוצרך הכתוב לומר בבית ארץ אחוזתכם, בעבור חלק הדרוש, דקאי על ארץ ישראל ובית המקדש, וא\"כ לאו קרא יתורא הוא. משא\"כ בנגעי בגדים דלא שייכא דרשה זו, ואין בה כ\"א חלק ההלכה, לפיכך לא כתיב מיעוטא שאין נגעי בגדים נוהגים בחו\"ל, דבלאו הכי לא יתכן שיבואו נגעים על הבגדים בחוץ לארץ."},{"passage_id":"vayikru1_23dbd99d_p45","passage_content":"ועל פי מה שביארנו אמרם ז\"ל בפ' בן סורר ומורה וכן בנגעי בתים למה נכתב משום דרוש וקבל שכר, יתבאר גם מה דקאמר ר\"א בעיר הנדחת לא היה ולא עתיד להיות ולמה נכתב דרוש וקבל שכר. דהנה ק\"ז זלה\"ה בישמח משה פרשת דברים האריך בפירוש הכתוב (ירמי' ל') כי נדחה קראו לך ציון היא דורש אין לה. ותו\"ד עפ\"י מה דאיתא דלכך חרבה ירושלים משום שעבדו בה עבודה זרה ונידונה כעיר הנדחת, אמנם לדברי ר\"א דס\"ל עיר שיש בה מזוזה אחת אינה נעשית עיר הנדחת, א\"כ לא נאמרה פרשת עיר הנדחת אלא למען דרוש וקבל שכר, אלא לפי שדורש אין לה, ר\"ל שאין דורשין בתורה ומאסו בה, א\"כ עפ\"י שיטת מעשיהם אין לומר דרוש וקבל שכר, דבמדה שאדם מודד מודדין לו, כדאיתא במדרש עה\"כ ה' צלך וכו', ולפיכך נדחה קראו לך, שנעשתה ירושלים כעיר הנדחת, משום שדורש אין לה."},{"passage_id":"vayikru1_23dbd99d_p46","passage_content":"מבואר מזה דגם בפרשת עיר הנדחת נאמר ענין דרוש וקבל שכר לטובתן ולהצלתן של ישראל, דע\"י כן לא יהיה לירושלים דין עיר הנדחת, ורק משום שאין דורשין בתורה, מדה כנגד מדה אין דורש לציון, וכאשר יחזרו לדרוש בתורה ולהחזיק בה, ימדוד להם כמדתן, והוא ידרוש לציון לפסוק כר\"א, דכיון דעיר הנדחת לא היה ולא עתיד להיות, תבנה ותכונן ציון וירושלים על תלה ומקדש והיכל על מכונו. וזהו שאמרו ז\"ל (מד\"ר פ' צו) אין הגליות מתכנסות אלא בזכות תנוי, דע\"י שילמדו בתורה ויחזרו לתור ולדרוש בה, יתקבצו הגליות מארבע כנפות הארץ, ויגאלו גאולת עולמים. וזהו ביאור אמרם בפרשת עיר הנדחת שנכתבה בעבור דרוש וקבל שכר, דאף שאין נפק\"מ בפרשה זו הלכה למעשה כדברי ר\"א, מ\"מ נכתבה בעבור שתצמח ממנה תועלת ושכר טוב לישראל, שהרי מדרשת פרשה זו למדנו שאין ירושלים נעשית עיר הנידחת."}]},{"dvar_torah_id":"vayikru1_d26bfa1f","title":"דרוש וקבל שכר בפרשת נגעים","summary":"בפרשת נגעים נכתבו טעמים רבים, כדי לעורר את ישראל לתשובה. על ידי לימוד התורה והדרשה, יזכו לגלות את המטמוניות ולהתרחק מטומאת ע''ז. הנגעים רומזים לגלות ולגאולה, והדרשה מביאה לתיקון הנפש.","contents":[{"passage_id":"vayikru1_d26bfa1f_p1","passage_content":"עוד אפ\"ל באופן אחר מה דאיתא בברייתא פרשת נגעי בתים לא היתה וכו' ולמה נכתב דרוש וקבל שכר, דהנה נתבאר בתחלת הדרוש כי תלתא טעמי נאמרו בדברי חז\"ל בפרשת נגעי בתים, ולכאורה טעמים אלו סותרים זא\"ז, אמנם באמת כל הטעמים נכונים ואמיתיים הם, וכדאיתא בגמרא מגילה (דף ט\"ו ע\"ב) דאיפלגו אמוראי בטעם הדבר שהזמינה אסתר את המן אל המשתה, ונאמרו שם טעמים הרבה לכך, ובתר הכי איתא אשכחיה רבה בר אבוה לאליהו וא\"ל כמאן חזייא אסתר ועבדא הכי (לאיזה מן הטעמים שאמרו חז\"ל כוונה אסתר בעשיית המשתה), א\"ל ככולהו תנאי וככולהו אמוראי, ע\"כ. וכמו כן לענינינו התורה הקדושה כיוונה לכל הטעמים שנאמרו בענין, אלא דאפשר שלא הוצרכו לכך בפועל שיעשה להם נס דנגעי בתים, בעבור טעמים אלו, דהנה לטעמו של הזה\"ק שהנגעים באו כדי לבער טומאת ע\"ז מן הארץ, יתכן שישראל הרגישו מיד בקדושתם כי בתי הכנעניים נבנו לשם ע\"ז, וכמבואר בזה\"ק פ' תזריע שם, כי הצדיקים מבחינים אם כוחות הטומאה שורים על הבית, ומיד שהרגישו זאת ישראל נתצו והרסו אותם הבתים, כדי שלא להשאיר זכר לטומאת הע\"ז, ובנו להם בתים אחרים כמאה\"כ (דברים ח') ובתים טובים תבנה וישבת, או יתכן שנהרסו הבתים באופן אחר ע\"י נס המלובש בטבע כגון רוח סערה וכיו\"ב. ובאופן זה נתגלו להם אף המטמוניות שהטמינו הכנענים, וכדברי הזה\"ק דטעמא דביעור ע\"ז וטעמא דמטמוניות הא בהא תליין, אלא שהיה צורך בדרשת הפרשה כדי שיתעוררו לנתוץ הבתים, ובשכר זה מצאו את המטמוניות."},{"passage_id":"vayikru1_d26bfa1f_p2","passage_content":"וזהו שאמרו דרוש וקבל שכר. פירוש על ידי הדרשה קבלו שכרן הם המטמוניות שנתגלו. אלא דאעפ\"כ כיוונה תורה בפרשת נגעי בתים אף לטעם הזה\"ק, כדי להורות עד כמה חמורה טומאת הע\"ז, ומכך ילמדו להזהר ולהתרחק מבית שיש בו בחינת ע\"ז. וכמו כן לטעם המבואר במד\"ר ובגמרא ערכין והובא ברמב\"ם ז\"ל, כי נגעי בתים באו לעוררם בתשובה, אפשר שמעולם לא נתקיימה הפרשה בפועל, אלא שבקריאת הפרשה ולימוד הדרשות שבה נתעוררו ישראל לחזור בתשובה. וזהו שאמרו ז\"ל ולמה נכתבה דרוש וקבל שכר, היינו שיתעוררו על ידי דרשת הפרשה, ונחשב להם כאילו נתקיימו בהם בפועל ויהיו ראוים לקבלת שכר."},{"passage_id":"vayikru1_d26bfa1f_p3","passage_content":"ובזה יתבאר מה שאמר הכתוב בסיומא דפרשת נגעים, להורות ביום הטמא וביום הטהור, פי' שלא נתנה פרשה זו שתתקיים בפועל ח\"ו, אלא כדי להורות את בני ישראל כלומר לדרוש וקבל שכר, כמו שנתבאר בכמה אנפי, וגם להורות תשובה, שע\"י קריאת הפרשה יתעורר האדם לתשובה, ושוב לא יבואו על ביתו הנגעים בפועל. ולדרכנו יתבאר מה שפתח הכתוב לומר זאת תהיה תורת המצורע, כי רצון השי\"ת הוא שכל ענין הנגעים יתהווה ויושלם ע\"י עסק התורה בפרשה זו, ולא יבואו ישראל לידי כך שתתקיים בהם הפרשה בפועל, וכמו שאמה\"כ (תהלים ע\"ז) משמים השמעת דין ארץ יראה ושקטה, כי ע\"י השמעת הדין משמים, באו יושבי ארץ ליראה, ומיד שקטו, דביראה בלבד סגי להו, ולא צריך שוב שיתקיים בהם הדין בפועל, ובזה פירשנו מאה\"כ אשרי הגבר אשר תיסרנו י-ה ומתורתך תלמדנו, פירוש אימתי אשרי לו לאיש שהקב\"ה מביא עליו יסורין, בזמן שמתורתך תלמדנו, שלא יבואו עליו היסורים בפועל, כי אם יתעורר לתשובה ע\"י לימודו בתורה בפרשת היסורין, ובזה יתכפר לו. וזהו שאמה\"כ זאת תהיה תורת המצורע שע\"י לימודו בתורה בפרשת המצורע וידרוש בטעמים הנאמרים בענין, כי הנגעים מחמת החטא הם באים, יספיק לו לעוררו בתשובה, ובזה תהיה הוייתו ותיקונו של מצורע, ושב ורפא לו."},{"passage_id":"vayikru1_d26bfa1f_p4","passage_content":"ובבחינה זו יתבאר גם מה שאמה\"כ להלן בפרשת נגעי בתים והגיד לכהן לאמר כנגע נראה לי בבית, דהנה האיש אשר לו הבית, בראותו כי פרח הנגע בקירות הבית, לבו נשבר בקרבו ורוחו נכאה, כי ישכיל אשר עוונו גרם לכך, ובשברון לבבו הוא בא אל הכהן להגיד לו את דבר הנגע, ודברים אלו קשים כגידין אל הכהן בשמעו כי חטא ונלכד, ויענה ויאמר לו דברי תוכחה הכובשים לבו לתשובה, כדדרשינן בתורת כהנים מלאמר, שיאמר לו הכהן דברי כבושין בני אין הנגעים באים אלא על לה\"ר, ואף שהדברים קשים לאוזני בעל הבית, שהכהן מוכיחו ומייסרו על חטאיו, אפ\"ה כתיב ביה לאמר, כי דברי תוכחה אלו יהיו לו לאמירה רכה, דע\"י שיעוררהו לתשובה, ישתנה הנגע לטהור, ובביאת הכהן לראותו והנה נרפא נגעו."},{"passage_id":"vayikru1_d26bfa1f_p5","passage_content":"ואפ\"ל בטעם שהקדים הכתוב תיבת לאמר, בטרם סיום דברי בעה\"ב כנגע נראה לי בבית, ולפי דברי הת\"כ דלאמר קאי על הכהן שיאמר לו דברי כבושין, הול\"ל תחלה כנגע נראה לי בבית. אמנם רמז הכתוב כי מיד בביאת בעה\"ב אל הכהן בלב נשבר מחמת חטאו, ימשיך לו הכהן התעוררות תשובה, עוד בטרם יפתח פיהו לומר כנגע נראה לי בבית, ואף להשפעה בלב שייך לקרוא אמירה, וכמו שכתב היפה תואר (פ' בראשית פ\"כ ה') בשם הרמב\"ם ז\"ל בספר המורה, דמה שאמה\"כ (יונה ב') ויאמר ה' לדג אין הדיבור אליו דיבור ממש, אלא שילוח הרצון, ואפ\"ה קרי ליה אמירה (ועי' בזה\"ק ח\"א קי\"ז ע\"ב). וזהו שרמז הכתוב במה שהקדים תיבת לאמר, כי הכהן ישפיע בלבו הרהורי תשובה, עוד בטרם אמר אליו בפה דברי כבושים, ופעמים דהוה סגי בהכי, שכבר נתעורר לבו לתשובה שלימה, ולא הוצרך הכהן לאמר לו דברי כבושים, כי נרפא הנגע."},{"passage_id":"vayikru1_d26bfa1f_p6","passage_content":"ועפ\"י זה יובן מה שאמה\"כ והובא אל הכהן, דמשמע שהוא מובא ע\"י אחרים, שהרי ברישא אמר קרא שבלימוד תורת המצורע לחוד נתעורר לבו לשוב, והרהורי תשובה אלו אשר נכנסו בקרב לבו עוררוהו והפעילוהו לבא ולהתקרב אל הכהן, שיורה לו דרך תשובה, לבל ישוב לכסלה עוד. והדר אמר קרא ויצא הכהן אל מחוץ למחנה וראה והנה נרפא נגע הצרעת מן הצרוע, ויתבאר עפ\"י מה שכתב בסה\"ק דגל מחנה אפרים פרשת אמור, שיש בכוחו של הצדיק להפך הצירופים מרעה לטובה, ע\"י חכמתו ותפלתו, כגון שיתהפך מנגע לענג. וז\"ש ויצא הכהן אל מחוץ למחנה, ויעוררו לתשובה, וע\"י כך והנה נרפא נגע הצרעת מן הצרוע, דמן הצרעת עצמה תמשך טובה וברכה, ע\"י שיתהפך בשרשו לטוב, כמ\"ש וממכה עצמה מתקן רטיה."},{"passage_id":"vayikru1_d26bfa1f_p7","passage_content":"ובזה יבואר המדרש בשעה ששמעו ישראל פרשת נגעים נתייראו וכו', כי בראותם סדר פרשיות הנגעים נתייראו ממה הקדים הכתוב תחלה פרשת נגעי הגוף, וזה מורה שהנגעים יבואו במדת הדין הקשה, דאין בעל הרחמים פוגע בנפשות תחלה. ועל כך השיבם משה אלו לאומות העולם, פירוש לאומות יבואו הנגעים בבחינה זו, באף ובחימה ובקצף גדול, אבל אתם לא כן עמכם אלא תתעוררו לתשובה בקריאת ולימוד הפרשה, ולא יבואו עליכם הנגעים בפועל. ואתי שפיר מה שהקדימה תורה פרשת נגעי הגוף, דמכיון שפרשיות אלו נאמרו לישראל בעבור שיתעוררו לתשובה בקריאתן, ולא שיבואו עליהם בפועל, על כן ראוי להקדים בהם נגעי הגוף, כדי שישימו אל לב את תוקף הדין הקשה הבא בשעה שנגעי הגוף קודמים ויחתו ויחרדו מאימת הדין, וע\"י זה תהיה תשובתם שלימה ממעמקי הלב, ויצאו ידי חובתם בקריאת הפרשיות בלבד. ואפ\"ל טעם אומרו אבל אתם לאכול ולשתות ולשמוח, דהנה משרע\"ה תיקן להם לישראל שיהיו קורין בתורה בשבתות וביו\"ט, שאז הוא זמן לאכול ולשתות ולשמוח, וע\"י השמחה והתענוג והמנוחה מיושבת דעתו של אדם עליו, וישים אל לבו ענין הקריאה בתורה, ויתעורר על ידה, ובזה יתוקנו חטאיו, ותבטל גזירת העונש מעליו, ולא יבואו עליו הנגעים בפועל. וז\"ש אבל אתם לאכול ולשתות ולשמוח, ומתוך כך תשימו אל לבכם בשעה שתקראו בתורה פרשיות אלו להתעורר בתשובה, ולא יבואו עליכם הנגעים בפועל."},{"passage_id":"vayikru1_d26bfa1f_p8","passage_content":"ואפ\"ל עוד בביאור המדרש הנ\"ל, עפ\"י מה דאיתא במד\"ר עה\"כ ולקחו אבנים אחרות וגו', דקאי על הבית השלישי שקדושתו נצחית. והנה איתא בגמרא (מו\"ק ט' ע\"א) א\"ר פרנך א\"ר יוחנן אותה שנה שחינכו ישראל את ביהמ\"ק בימי שלמה לא עשו ישראל את יוהכ\"פ (פירש\"י לפי שז' ימים לפני סוכות כל יום עשו שמחה ומשתה וכו') והיו דואגים ואומרים שמא נתחייבו שונאיהן של ישראל כלייה, יצתה בת קול ואמרה להם כולכם מזומנים לחיי העוה\"ב. מאי דרוש אמרו ק\"ו ומה משכן שאין קדושתו קדושת עולם קרבן יחיד דוחה שבת דאיסור סקילה (קרבנם של נשיאים בחנוכת המשכן) מקדש שקדושתו קדושת עולם וקרבן ציבור ויוהכ\"פ איסור כרת הוא דאיכא לא כ\"ש שתדחה, ופריך ה\"נ מיעבד ליעבדו קרבן, אבל מיכל לא ניכלו ולא לישתו, ומשני אין שמחה בלא אכילה ושתיה, עכ\"ד הגמרא. הרי שהתירו אכילה ושתיה ביוהכ\"פ בעבור חינוך בית עולמים, אף שלא נתקיים לעד כי נחרב בעוונות ישראל, אפ\"ה מקום בית המקדש עדיין בקדושתו עומד והוא קרוי בית עולמים לעומת המשכן שאין קדושתו קדושת עולם, ואם כן עאכו\"כ שבבנין בית המקדש העתיד שיהיה קיים לעד ולעולמי עולמים, ודאי יהיה חיוב לאכול ולשתות ולשמוח. וזה אפ\"ל בדברי המדרש בשעה ששמעו ישראל פרשת נגעים נתייראו מתוקף הדין כמבואר, השיב להם משה אלו לאומות העולם כנ\"ל, אבל אתם לאכול ולשתות ולשמוח, פירוש שלא יתקיימו פרשיות אלו בכם בפועל, אלא כלפיכם תרמוז פרשה זו על בנין הבית העתיד, כמו שדרשו מדכתיב ולקחו אבנים אחרות, ואז תהיו אוכלים ושותים ושמחים בבנין הבית, מכון לשבתו יתברך עולמים."},{"passage_id":"vayikru1_d26bfa1f_p9","passage_content":"ואפ\"ל רמז נוסף בפרשה זו עפ\"י דברי התיקו\"ז במאמר קם ר' שמעון (תיקון כ\"ז דף קמ\"ג ע\"ב) וז\"ל, ובין נגע לנגע כמה דאוקמוהו איכה ישבה בדד דאיהי חשיבא שכינתא בגלותא במצורע, דאיתמר ביה בדד ישב מחוץ למחנה וגו', מחוץ ודאי דא גלותא דאיהי לבר מארעא דישראל דאיהי מותבא וכו'. עכ\"פ מבואר מדברי התיזה\"ק דאף פ' נגעי אדם רומזת על גלות ישראל, כשם שהמדרש מוקי פרשת נגעי בתים על הגלות והגאולה. והנה רגיל אני לפרש מאה\"כ (דברים י\"ז) והאיש אשר יעשה בזדון לבלתי שמוע אל הכהן העומד לשרת שם לפני ה' אלקיך, דלכאורה צ\"ב אריכות לשון הפסוק, דהו\"ל בקצרה והאיש אשר יעשה בזדון, ואנחנו כבר נדע שאינו שומע אל הכהן, מכיון שעבר עבירה במזיד. אמנם רמז הכתוב באומרו והאיש אשר יעשה בזדון, דע\"י שזדון לבו השיאו למרוד ולפשוע, נשתקע כ\"כ בעמקי מצולות הטומאה, עד שאינו מרגיש באבדן נפשו, ובהיזק אשר הוא גורם בכך לכללות ישראל. וזהו שאמר לבלתי שמוע אל הכהן, כי בעוונותיו גרם שאין בני ישראל זוכים עדיין לשמוע אל הכהן העומד לשרת זה אליהו כהנא רבא, העומד לשרת לפני השי\"ת, כדאיתא בעשרה מאמרות שעודנו עומד ומשמש ומקריב תמידין כסדרן אף בזה\"ז."},{"passage_id":"vayikru1_d26bfa1f_p10","passage_content":"ועפ\"י זה אפשר לפרש מאה\"כ זאת תהיה תורת המצורע וגו', שהוא רומז על העתידות, דאומרו זאת תהיה תורת המצורע רומז על הגלות, כדאי' בזה\"ק הנ\"ל בדד ישב וכו', ואמר הכתוב כי ביום טהרתו כשיערה הקב\"ה רוח טהרה ממרום, ויטהר את לבות בני ישראל, מיד והובא אל הכהן שתבא השפעה מן השמים אל אליהו הנביא הכהן הגדול, לבוא ולבשר את בשורת הגאולה לישראל. ואמה\"כ ויצא הכהן אל מחוץ למחנה, שיבא אליהו הנביא מגבהי מרומים, אל מחוץ למחנה הוא חוצה לארץ כדאיתא בזה\"ק הנ\"ל, דאיהי לבר מארעא דישראל, וראה הכהן והנה נרפא נגע הצרעת מן הצרוע, שכבר נתרפאו ישראל מן הגלות שהוא בחינת מצורע, והגיע זמן גאולתן, ובזה יבואר מה שאמה\"כ להורות ביום הטהור וביום הטמא, כי הנה כל פרשיות הנגעים נאמרו לישראל בעבור דרוש וקבל שכר, והם רומזים על החורבן ועל הגלות, וגם על הגאולה העתידה, בעת יערה ה' רוח טהרה ממרום, ויבטלו כוחות הטומאה. וזש\"ה להורות ביום הטהור וביום הטמא, לומר שהפרשה רומזת על ב' בחינות אלו, זמן הגלות שבו ישראל בבחינת מצורע בדד ישב מחוץ למחנה, וזמן הגאולה שבו יטהרו ישראל."},{"passage_id":"vayikru1_d26bfa1f_p11","passage_content":"ובדרך זו אפ\"ל ביאור המד\"ר זאת תהיה תורת המצורע הה\"ד ולרשע אמר אלקים מה לך לספר חוקי ותשא בריתי עלי פיך. עפ\"י מה שנתבאר כי ענין הפרשה רומז על הגלות והגאולה, והנה בעוה\"ר ישנם רשעים האומרים כי הם מביאים את הגאולה לפני הזמן, ועל ידם תתקיים הבטחת ברית אבות, ולזאת כיון שמקרא זה רומז על הגאולה האמיתית, שיטהרו בנ\"י מפשעיהם, ויבא תשבי לבשר גאולתינו, ע\"כ הסמיך המד\"ר להכא את דברי הכתוב ולרשע אמר אלקים וגו' ותשא בריתי עלי פיך, ר\"ל ברית אבות שכרת הקב\"ה עמהם על הגאולה, אתה נושא עלי פיך, ומתגאה לאמר שעל ידך יהיה קיום הבטחה זו, ואתה שנאת מוסר ותשלך דברי אחריך, שבדברי השי\"ת ובהבטחתו אתה נותן חיזוק ותוקף לסט\"א, והם המעכבים את הגאולה, השם ירחם. והשי\"ת יעזור שיקויים מיד והובא אל הכהן, שתבא השפעה אל אליהו הנביא הכהן הגדול, ויחוש לבשר לנו בשורת הגאולה, ונזכה ונחיה ונראה ונשמע במהרה קול מבשר, במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru1_69c1c467","title":"","summary":"","contents":[{"passage_id":"vayikru1_69c1c467_p1","passage_content":"לשבת הגדול"}]},{"dvar_torah_id":"vayikru1_8fac4de9","title":"תורת המצורע וקדושת שבת הגדול","summary":"דבר תורה זה עוסק בפרשת המצורע, הקושיות על לשון הכתוב, והקשר בין טהרתו של המצורע לשבת הגדול. נדונה חשיבות המילה והנס בלקיחת הפסח, כבסיס לגאולה, והקשר בין תשובה מאהבה להיפוך עוונות לזכויות.","contents":[{"passage_id":"vayikru1_8fac4de9_p1","passage_content":"וידבר ה' אל משה לאמר זאת תהיה תורת המצורע ביום טהרתו והובא אל הכהן, ויצא הכהן אל מחוץ למחנה וגו'. הקשו המפרשים דאומרו זאת תהי' תורת המצורע ביום טהרתו יתירא לכאורה, דכלום היה המקרא חסר אילו הוה כתיב וכי יטהר המצורע והובא אל הכהן."},{"passage_id":"vayikru1_8fac4de9_p2","passage_content":"ב) ומלבד זאת יש לדקדק במה שאמר הכתוב תהיה לשון עתיד. גם אומרו תורת המצורע צ\"ב, דכל היכא דכתיב \"תורת\" אתי לדרשת וכדאיתא במנחות (דף ק\"י) אמר ר' יצחק מאי דכתיב זאת תורת החטאת וזאת תורת האשם כל העוסק בתורת חטאת וכו'. והכא מאי נדרוש באומרו תורת המצורע."},{"passage_id":"vayikru1_8fac4de9_p3","passage_content":"ג) גם מה שאמר הכתוב והובא אל הכהן צ\"ב, דמשמעות והובא הוא שאחרים מביאין אותו בע\"כ, ולכאורה אין צורך בכך שאחרים יביאו אותו, אלא מעצמו בא יבא ברנה להטהר מטומאתו, כדי שיוכל לשוב אל המחנה ולהיות בחברת בני אדם. ורבותינו בעלי התוספות פירשו והובא כאילו הוה כתיב והוא בא וכו' עיי\"ש. אך פשטות המקרא לא מתפרש כן וצ\"ב."},{"passage_id":"vayikru1_8fac4de9_p4","passage_content":"ד) עוד קשה שהכתוב סותר עצמו מיניה וביה, דפתח לומר והובא אל הכהן, הרי שהמצורע בא אל מקום הכהן, והדר אמר ויצא הכהן אל מחוץ למחנה."},{"passage_id":"vayikru1_8fac4de9_p5","passage_content":"ה) במד\"ר (פ' ט\"ז ד') איתא זאת תהיה תורת המצורע הה\"ד ולרשע אמר אלקים מה לך לספר חוקי ותשא בריתי עלי פיך וכו', ומאריך במדרש להביא ראיות שאין הקב\"ה חפץ בקילוסו של אדם רשע עיי\"ש, וצ\"ב שייכות מדרש זה לענינא דמצורע."},{"passage_id":"vayikru1_8fac4de9_p6","passage_content":"ו) הטור כתב בריש הלכות פסח (סימן ת\"ל) וז\"ל, שבת שלפני הפסח קורין אותו שבת הגדול, והטעם לפי שנעשה בו נס גדול שפסח מצרים מקחו מבעשור וכו', ונמצא שעשירי בחדש היה שבת, ולקחו להם כ\"א שה לפסחו וקשר אותו בכרעי מטתו וכו', והיו שיניהם קהות על ששוחטין את אלהיהן, ולא היו רשאין לומר להם דבר, וע\"ש אותו הנס קורין אותו שבת הגדול, ע\"כ. והקושיא מפורסמת דלפי זה היה ראוי לקבוע זכר לאותו הנס ביום העשירי בניסן בכל שנה ושנה, כאשר כל המועדים והרגלים קבועים לימי החדש, ומדוע קבעוהו ליום השבת בין אם חל ביו\"ד בניסן בין אם לא. ובפשטות כבר נתבאר בדברינו טעם הדבר שקבעו לעשות את יום השבת שלפני הפסח זכר לנס שנעשה בו, עפ\"י דברי הזה\"ק (ח\"ב דף פ\"ח ע\"א) דכל ברכאן דלעילא ותתא ביומא שביעאה תליין וההוא יומא מתברכאן מיניה כל שיתא יומין עילאין וכל חד וחד יהיב מזונא לתתא כל חד ביומוי מההוא ברכה דמתברכאן ביומא שביעאה וכו', עכתדה\"ק. ועפ\"י זה נמצא כי התנוצצות אורות הגאולה לליל ט\"ו בניסן שבו נגאלו ישראל מארץ מצרים מבית עבדים, כבר התחילה בשבת שלפניו, כי בו תלויים כל ההשפעות וההארות העתידות לבא במשך השבוע שלאחריו, ע\"י שמתברכין בו שתין יומין עלאין המשפיעין למטה כל אחד ביומו, וא\"כ בגבהי מרומים כבר נגמרה השפעת הגאולה בשבת שלפני הפסח, ולפיכך קראו שמו שבת הגדול. ולהלן יתבאר טעם קריאתו שבת הגדול עפ\"י דברי הזה\"ק הללו, אך בדרך אחר."},{"passage_id":"vayikru1_8fac4de9_p7","passage_content":"ולבא לביאור הענין נראה דהנה הכתוב ציוה בפסח מצרים דברו אל כל עדת בני ישראל לאמר בעשור לחדש הזה ויקחו להם איש שה לבית אבות וגו' ודרשו ז\"ל (פסחים צ\"ו ע\"א) פסח מצרים מקחו מבעשור ולא פסח דורות, ורש\"י ז\"ל הביא דברי המכילתא שנתן טעם לדבר שנצטוו בפסח מצרים בלבד להקדים לקיחתו ד' ימים לפני שחיטתו וז\"ל, היה ר' מתיא בן חרש אומר וכו' הגיעה שבועה שנשבעתי לאברהם שאגאל את בניו ולא היו בידם מצוות להתעסק בהם כדי שיגאלו שנאמר ואת עירום ועריה ונתן להם שתי מצוות דם פסח ודם מילה שמלו באותו הלילה וכו', עכ\"ד רש\"י ז\"ל. ובדעת זקינים מבעלי התוספות כתבו וז\"ל, ומיהו צריך לתת טעם למה מקחו מבעשור ואומר רש\"י שיתעסקו בברית מילה ובדם פסח ד' ימים ומקשים ד' ימים למה ואומר הרב יצחק מאיברא כדי שימולו וישהו ג' ימים לאחר המילה קודם שיצאו לדרך, עכ\"ד ז\"ל. והנה לטעם זה אכתי לא נתיישבה הקושיא ד' ימים למה, שהרי סגי להמתין ג' ימים אחר המילה, ומן העשירי בניסן שבו מלו יש חמשה ימים עד יום חמשה עשר בניסן מועד צאתם ממצרים, וקשה שהיו יכולים למול ביום י\"ב בניסן, ואכתי היו נשארים להם שלשה ימים עד יציאתם. וגדולה מזו יפלא דכיון שהיו יכולים למול גם בי\"ב בניסן ועדיין היו מתרפאים עד זמן היציאה, א\"כ למה הקדימו למול בעשירי לחדש שחל בשבת, והלא מילה שלא בזמנה אינה דוחה שבת, והם היו משמרין שבת במצרים, וכיון שהיה אפשר לזכותם במצוה זו מבלי שיחללו את השבת על ידה, מדוע נצטוו למול ביום השבת דוקא."},{"passage_id":"vayikru1_8fac4de9_p8","passage_content":"ותו יש להקשות דלטעמו של הר\"מ מאיברא שכל מה שהיה צורך בד' ימים היינו בשביל שישהו ג' ימים קודם שיצאו לדרך, אכתי לא נתבאר טעם שנצטוו לקחת שה לפסחם מבעשור דוקא, דמה תליין הפרשת הפסח ומצות מילה זה בזה. ואם משום שלא יקחו את הפסח בעודם ערלים, קשה והרי גם בפסח דורות אמר הכתוב כל ערל לא יאכל בו, ואפילו הכי לא הקפידה תורה אלא בהקרבתו ובאכילתו, אבל בלקיחת הקרבן מותר גם ערל, וה\"נ בפסח מצרים לא שייכא המילה אל לקיחת הפסח, ומדוע היו שניהם בעשור לחדש דוקא."},{"passage_id":"vayikru1_8fac4de9_p9","passage_content":"והנה עוד יש להתבונן בענין, שהרי במד\"ר נראה לכאורה היפך שיטת רש\"י ז\"ל דסבר שמלו בי' בניסן, דז\"ל המדרש עה\"פ זאת חקת הפסח, רבותינו אמרו לא ביקשו ישראל למול במצרים, אלא כולם בטלו המילה במצרים חוץ משבטו של לוי וכו', והיה הקב\"ה מבקש לגאלן, ולא היה להם זכות, מה עשה הקב\"ה קרא למשה וא\"ל לך ומהול אותם, והרבה מהן לא היו מקבלין עליהן למול אמר הקב\"ה שיעשו הפסח, וכיון שעשה משה את הפסח גזר הקב\"ה לד' רוחות העולם ונושבות בג\"ע, ומן הרוחות שבג\"ע הלכו ונדבקו באותו הפסח, נתכנסו כל ישראל אצל משה אמרו לו בבקשה ממך האכילנו מפסחך, מפני שהיו עייפין מן הריח, היה אומר הקב\"ה אם אין אתם נימולים אין אתם אוכלים, מיד נתנו עצמם ומלו ונתערב דם הפסח עם דם המילה וכו', ע\"כ. וכתב היפה תואר על דברי המדרש וז\"ל, יתכן שהיה זה קודם חשיכה, דמשחשיכה שהוא יו\"ט אין מילה שלא בזמנה דוחה אותה, ועוד דאין זמן מילה בלילה, ומיהו קשה דע\"כ פסח זה לאחר שחיטה וצליה היה, והיאך יכול להאכילן ממנו כשנימולו, מאחר שלא נמנו עליו קודם שחיטה, ויש לומר דהוראת שעה היתה, עכ\"ל היפ\"ת ז\"ל."},{"passage_id":"vayikru1_8fac4de9_p10","passage_content":"ובעיקר תמיהת היפה תואר שבעבורה הוצרך לומר דהוראת שעה היתה, נראה דלא קשה, שהרי הפסח שעשו משה ואהרן היתה שחיטתו וצלייתו בעוד יום, כבפסח דורות, ומיד בשעת צליה נכנסו ריחות ג\"ע בפסחיהם, והיה עוד פנאי שימנו ישראל על פסחים ויקריבום, ונכנס ריח ג\"ע גם בפסחיהם, ושוב אין הכרח לומר דהוראת שעה היתה, דשפיר אכלו מן הפסח שנמנו עליו."},{"passage_id":"vayikru1_8fac4de9_p11","passage_content":"והנה היפ\"ת הביא בשם החכם ן' קרשקש בפירושו לספר המורה שהזיד לדבר נגד דברי רבותינו במדרש הזה, ואמר כי המון ישראל היו נימולים במצרים כמו שהחזיקו בימי אברהם וכו', ואיך אפשר שימולו ת\"ר אלף רגלי וכפלי כפלים בנים ובני בנים בליל הפסח, ואח\"כ יאכלו פסחיהם מוכנים ללכת, ולא יהיו כואבים בכאב המילה. ועוד שה' אינו עושה הפליאות רק לצורך גדול, והיה איפוא לו לצוות על המילה בר\"ח ניסן או קודם לזה, אם לא יספיקו, וכתב עליו היפ\"ת דהבל יפצה פיהו ודברי חז\"ל נאמנו מאד, ומתרץ כל הקושיות שהקשה על דבריהם ז\"ל. ומה שתמה על שלא יהיו כואבים בכאב המילה, אינו קושיא כי הגדיל ה' לעשות להם רפואה בשעה קלה ע\"י המלאכים ששלח לנשקם וכו', ומה שהקשה למה לא ציוה במילה מר\"ח שאלה של הבל היא, כי יודע אלקים העת הראוי לכל מצוה, ומי עמד בסוד ה', עיי\"ש באריכות."},{"passage_id":"vayikru1_8fac4de9_p12","passage_content":"ולי נראה לישב תמיהותיו באופן אחר, דמה שהקשה איך אפשר שימולו ת\"ר אלף בלילה אחת אינו קשה כלל, כי הנה יש לדייק מדברי המדרש והרבה מהן לא היו מקבלין עליהם למול, מדנקט \"מהן\" משמע דרק מקצתן לא קבלו עליהם למול, אבל רובן של כלל ישראל מלו עצמן מיד אחר שנצטוו, וממה דקאמר \"הרבה\" אין הכרח שכוונתו שהיו רבים במספרם, שהרי מצינו בדברי חז\"ל דגם שנים יקראו רבים, כאמרם ז\"ל מיעוט רבים שנים. ויותר מזה מצינו שאפילו אחד מישראל קרוי הרבה, דכתיב במעמד הר סיני לך רד העד בעם פן יהרסו אל ה' לראות ונפל ממנו רב, ואיתא במדרש רבה פ' יתרו אפילו רב אחד מהם שיפול הרי הוא ככולן מלמד שאף אחד מעכב ע\"י כולם (ופירש בזית רענן כדלעיל אילו חסר א' לא היו יכולין לקבל התורה), הרי שאף אחד מישראל כהרבה יחשב, וה\"נ איכא למימר שנשארו בהם מועטין שלא מלו, אך רוב המון ישראל מלו מיד כשנצטוו כדי שתהיה להם שהות ג' ימים קודם שיצאו לדרך, אלא שאותם מעטים שלא מלו עד ערב פסח נתרפאו מיד לאלתר, כמו שביאר היפ\"ת ששלח ה' מלאכיו לרפאותם."},{"passage_id":"vayikru1_8fac4de9_p13","passage_content":"ולבאר הטעם שלא חששו אותם המועטין שמלו בע\"פ לסכנת היציאה לדרך כאשר הקדימו כלל ישראל את המילה בג' ימים מטעם זה עצמו, נראה עפ\"י מה דאיתא בגמרא (זבחים מ\"א ע\"ב) תנא דבי ר\"י מפני מה נאמר פרוכת הקדש בפר כהן משיח ולא נאמר בפר העלם דבר של ציבור משל למלך בו\"ד שסרחה עליו מדינה אם מיעוטן סרחו פמליא שלו קיימת ואם רובן סרחו אין פמליא שלו קיימת, ע\"כ. ובזה פירש ק\"ז זלה\"ה בישמח משה פרשת שמיני דברי המד\"ר שאמר אהרן בעשיית העגל מוטב יתלה הסרחון בי ולא בהן, עיי\"ש. ובדרך זה יתבאר גם לענינינו, כי לפי שרובן של ישראל קיימו מצות השי\"ת, ומלו מיד כשנצטוו, היתה פמליא שלו כביכול קיימת בקרב ישראל, דאף שמיעוטן סרחו עליו ולא רצו למול, היתה השראת שכינתו יתברך בתוך בני ישראל בעבור המרובין שלא חטאו לו, וכיון שהיתה שכינת כבודו ית' בתוך בני ישראל, היו המועטין יכולין למול בערב פסח, ולא היה להם לחוש משום סכנת הדרך, דכיון שהשכינה שרויה בתוך בני ישראל כל הנהגתם הוא בדרך נסיי מחוץ לטבע העולם, והקב\"ה הוא כל יכול ובידו לרפאותם כרגע. אמנם אילו ח\"ו לא היו רובן של ישראל מלין בעת שנצטוו, והיו ממתינין עד ערב פסח, אזי לא היו יכולין לצאת בט\"ו, דכיון דרובן סרחו כביכול אין פמליא שלו מתקיימת, ואין השכינה שורה בקרב ישראל, והם מתנהגים בטבע העולם, והיה עליהם להמתין ג' ימים בטרם יצאו לדרך כדי שיתרפא כאב המילה."},{"passage_id":"vayikru1_8fac4de9_p14","passage_content":"וליישב מה שהקשינו על תירוצו של הר\"ש מאיברא, דאיך תלויה לקיחת הפסח במצות המילה, שצוה על שניהם בעשירי, נראה דהנה לכאורה היה לישראל מקום למנוע מלמול מחשש סכנה, וכמו שמצינו גבי אברהם אבינו שאמרו לו ענר ואשכול שלא ימול מחשש שמא יהרגוהו קרוביהן של המלכים שהרג, כדאיתא בתנחומא ר'פ וירא, וה\"נ היה מקום לחשש זה במצרים, שמכאב המילה יהיו ישראל חלשים, וח\"ו יהרגו אותם המצרים. אמנם הנה איתא במכילתא עה\"פ והיה לכם למשמרת לפי שנאמר משכו וקחו לכם צאן וגו', אמרו לו ישראל למשה רבינו הן נזבח את תועבת מצרים וגו', אמר להם מן הנס שעושה לכם במשיכתו אתם יודעים בשחיטתו. הרי שלקיחת הפסח היתה להם הוכחה חותכת שאין להם עוד להתירא מפני המצרים, ולפי זה שפיר מקושרת מצות מילה עם מצות ויקחו להם איש שה וגו', דע\"י הנס שנעשה להם בלקיחת הפסח, ידעו שאין להם עוד להתיירא מלמול, כי נפל פחדם על המצריים, וכל רעה אליהם לא תאונה."},{"passage_id":"vayikru1_8fac4de9_p15","passage_content":"וארווחנא בזה ליישב מדוע לא נצטוו להמול מיד בר\"ח ניסן, והשתא מובן שפיר, כי הוצרכו להמתין עד שיעשה להם הנס בלקיחת השה לקרבן פסח, והנס לא נעשה עד העשירי בחדש שחל להיות בשבת, כאשר הקדמנו דבאותו שבת החלה התעוררות הגאולה, דכל ברכאן דלעילא ותתא ביומא שביעאה תליין. ואחר שנעשה להם הנס לקיחת הפסח מלו מיד, כי שוב לא נתייראו מפני המצרים פן יהרגום שהרי ראו שלא העיזו המצרים לעשות להם כל מאומה, בעת שלקחו את אלהיהם לשחטו. ולדרכינו יתיישב גם טעם שהוצרכו ישראל למול מיד בעשירי, הלא לטעם שיתרפא כאב המילה בג' ימים, היתה להם שהות להמתין עד י\"ב לחדש. אמנם הנה לכאורה גם זה היה נס נפלא שנימולו בב' וג' ימים ת\"ר אלף בני אדם, הם ובניהם ועבדיהם, שגם הם עלו למספר כמה רבבות, וכללא היא דלמיעוטא בניסא עדיף, וכאשר כתב הרמב\"ן ז\"ל ר\"פ נח שמה שהחזיקה התיבה כל מיני בע\"ח מכל העולם, וגם מכל מאכל אשר יאכל לשנה תמימה, בדרך הטבע לא תכיל אותם התיבה הזאת ולא עשר כיוצא בה, אבל היה נס שהחזיק מועט את המרובה, וא\"ת יעשנה קטנה ויסמוך על הנס הזה, ראה השי\"ת לעשותה גדולה וכו' למעט בנס, כי כן הדרך בכל הנסים שבתורה, לעשות כל אשר ביד אדם לעשות והשאר יהיה בידי שמים, עכ\"ד ז\"ל. וכמו כן בזה שהי' נס נפלא למול עם רב כזה בב' וג' ימים, ולמעט בניסא עדיף, היה הכרח להתחיל למול מיד בעשירי לחדש, כדי שתהי' שהות למול כולם עד י\"ב לחדש, ותהיה להם עוד שהות להתרפאות קודם צאתם לדרך, ולהתחיל קודם העשירי לחדש לא היה באפשר כדאמרן, שעדיין לא היתה השפעת הנס."},{"passage_id":"vayikru1_8fac4de9_p16","passage_content":"והיינו טעמא שנקרא שבת זה בשם שבת הגדול, דאין הנס תלוי ביום החדש, אלא העיקר תלוי ביום השבת, שבו תלויים כל ההשפעות והברכות של כל ימות השבוע. ומשום כך נעשה להם אותו הנס בלקיחת הפסח ביום השבת דייקא, ומאהבת אותו הנס שוב לא נתייראו מפני מצרים, ומלו את עצמם מיד."},{"passage_id":"vayikru1_8fac4de9_p17","passage_content":"ועפ\"י מה שהבאנו לעיל מדברי המדרש, שהיו אנשים מישראל שעדיין לא מלו עד ערב פסח, וע\"י שעשו משה ואהרן את פסחם ונכנס בו ריח ג\"ע ובקשו גם הם לאכול ממנו, נתעוררו גם הם להמול מיד כדי שיעשו את הפסח, נראה לבאר מאה\"כ וילכו ויעשו בני ישראל כאשר צוה ה' את משה ואהרן כן עשו, ופירש\"י אף משה ואהרן כן עשו, וידועה הקושיא וכי מאי רבותא היא דאף משה ואהרן קיימו מצות השי\"ת. אמנם עפ\"י המדרש הנ\"ל תהיה כוונת הכתוב באופן זה, וילכו ויעשו בני ישראל, כלומר כל מה שעשו בני ישראל את הפסח במועדו, היה רק משום כאשר צוה ה' את משה ואהרן כן עשו, וכפי' רש\"י אף משה ואהרן כן עשו, כלומר שהקדימו להקריב פסחיהם, ונכנס בהם ריח גן עדן, וזה גרם שכל ישראל הקריבו את פסחיהם. ולפי זה א\"ש דאין הרבותא שמשה ואהרן עשו כמצות השי\"ת, אלא שהכתוב משמיענו שעשייתם של משה ואהרן, היא שגרמה שכן עשו בני ישראל."},{"passage_id":"vayikru1_8fac4de9_p18","passage_content":"או אפ\"ל בביאור דברי רש\"י ז\"ל אף משה ואהרן כן עשו, ע\"ד מה שביארנו דברי הכתוב גבי אברהם אבינו ע\"ה בעצם היום הזה נמול אברהם וישמעאל בנו, וכל אנשי ביתו יליד בית ומקנת כסף מאת כל בן נכר נמולו אתו, דלכאורה תיבת אתו יתירא היא, דמדקאמר בעצם היום הזה נמול אברהם וגו' וכל אנשי ביתו יליד בית וגו' נמולו, כבר ידענו שנמולו באותו יום. אמנם יתבאר עפ\"י דברי הספה\"ק נועם אלימלך פרשת מצורע, לפרש מאמר הגמרא (קידושין מ' ע\"ב) מחשבה טובה הקב\"ה מצרפה למעשה וזלה\"ק, יראה לפרש לשון צירוף שהול\"ל מחשבה למעשה, דהנה המחשבה שאדם מחשב באיזה דבר, בודאי אין בה שום פניה, כי מי יודע בו, ואם אדם מחשב לעשות מצוה או עסק התורה, ולא עשה מחמת איזה אונס, ואדם אחר עוסק בתורה או במצוה רק שמכוון בה איזה פניה, הקב\"ה מצרף את העובדא הזאת למחשבתו של הצדיק, והוי כאילו הוא עושה המעשה ההוא. ולכך זכה נוטל חלקו וחלק חבירו, פי' כנ\"ל אם זכה לטהר את מחשבתו תמיד, ומחשב לעשות מצוה ונתבטל ממנה מכח איזה סיבה, נוטל המצוה של חבירו שעשה במעשה אבל לא במחשבה, ונשלם אח\"כ עי\"ז מצוה שלימה וכו', עכ\"ל."},{"passage_id":"vayikru1_8fac4de9_p19","passage_content":"והנה אברהם אבינו ע\"ה אחרי שקיים מצות מילה בכל פרטיה וכוונותיה, היה מתאווה ומשתוקק לזכות עוד במצוה יקרה ונכבדה זו, אלא שלא היה באפשרותו לקיימה בפועל, אמנם בעת נמולו אנשי ביתו, ופשיטא שלא נימולו בכוונה השלימה והראויה שהיתה לאאע\"ה בעת שנימול הוא עצמו, אלא שנצטרפו למעשה המצוה שלהם כל המחשבות הזכות והטהורות של אאע\"ה שהשתוקק לזכות במצוה זו, וזהו שאמר הכתוב וכל אנשי ביתו וגו' נמולו אתו, כלומר שמעשה המילה שלהם נצטרף יחד עם מחשבתו הטהורה של אאע\"ה, ונעשה מהם מצוה שלימה."},{"passage_id":"vayikru1_8fac4de9_p20","passage_content":"ובדרך זו ביארנו גם דברי רש\"י ז\"ל עה\"פ וילכו ויעשו וגו' כאשר צוה ה' את משה ואהרן כן עשו, אף משה ואהרן כן עשו. דהנה בקרב בני ישראל היו רבים שלא היתה מחשבתם וכוונתם שלימה בהקרבת הפסח, ומאידך גיסא אחר שהקריבו משה ואהרן את פסחם בפועל בכל הכוונות הראויות, עדיין היו מתאווים ומשתוקקים לחזור ולקיים מצוה זו, אך לא יכלו לקיימה בפועל פעם נוספת. אמנם מחשבתם הקדושה והשתוקקותם העזה לקיום מצוה זו, נצטרפו למעשה בני ישראל, ונעשה מזה מצוה שלימה בכוונות הראויות, ובכל קרבן שהקריבו ישראל, נחשב להם כאילו הקריבוהו אף משה ואהרן. וזאת אפ\"ל בכוונת רש\"י ז\"ל וילכו ויעשו בני ישראל וגו' כן עשו, אף משה ואהרן כן עשו. כלומר דבעשיית בני ישראל את פסחם, נצטרפו להם המחשבות הקדושות של משה ואהרן, ונחשב להם כאילו גם הם עשו את הפסח, בעת שעשאוהו בני ישראל."},{"passage_id":"vayikru1_8fac4de9_p21","passage_content":"ועפ\"י זה נבא לביאור הכתוב זאת תהיה תורת המצורע וגו', והובא אל הכהן. דהנה נגעים באים על ידי חטא, כאמרם ז\"ל, וא\"כ נמצא כי כל התורה שלמד בעודו חוטא אין חפץ בה, ועליו הכתוב אומר ולרשע אמר אלקים מה לך לספר חקי, ולכאורה מה תקנה תהא לתורה זו, ולא עוד אלא שאף התורה שהוא לומד אחרי שעשה תשובה עדיין אינה בשלימות הראוי, כי אם תשובתו היא מיראת העונש מחמת שבאו עליו יסורים, אין תשובתו זו בשלימות הראוי, דהיא רק תשובה מיראה. ועל כן העצה היעוצה שתהי' עליה ותיקון לתורתו, שיתדבק אל הכהן, הוא הצדיק עובד ה', ובאמצעות כן יצטרפו תורתו ומצוותיו אל מחשבותיו הקדושות של הכהן, המתאווה ומשתוקק לעבוד את השי\"ת עבודה תמה וברה בכל עת, ובמצוותיו יתברך חפץ מאד, וכנ\"ל בנוע\"א שפירש בזה דברי הגמרא פסחים לעולם ילמוד אדם שלא לשמה שמתוך שלא לשמה בא לשמה, דהיינו מתוך זה שלמד שלא לשמה בא לזה שחישב ללמוד אותה מסכת לשמה ונאנס ולא למד כנ\"ל, עכ\"ל. ובזה יתבאר הכתוב זאת תהי' \"תורת\" המצורע, כלומר כדי שתהי' הויה וקיום לתורתו של המצורע, דהיינו שתהי' לה עליה ותיקון, עצתו אמונה ביום טהרתו כשהוא חוזר בתשובה ורוצה להטהר מעוונותיו והובא אל הכהן, היינו שיתדבק אל הצדיק, ויצטרפו תורתו ומצוותיו ותשובתו אל מחשבותיו הקדושות של הצדיק, וע\"י כן תהי' להם הויה וקיום, ויתעלו למקומם ושורשה ואח\"כ מפרש הכתוב דיני טהרתו ויצא הכהן אל מחוץ למחנה וגו'."},{"passage_id":"vayikru1_8fac4de9_p22","passage_content":"ובזה נתיישבו כל הדקדוקים בפרשה (קושיא א' ב' ג' ד'), וגם יבואר סמיכות המדרש ולרשע אמר אלקים מה לך לספר חוקי וגו' לפרשה זו, שהרי מדברי המדרש הלזה נמצינו למדים שאין חפץ לה' בקילוסו של אדם רשע, וטורפין לו מצוותיו בפניו, ושפיר שייך להכא שהכתוב עצה טובה קמ\"ל, איזה הדרך יתנהג בה הבא להטהר מחלאת עוונותיו, שתהי' הויה וקיום לתורתו ולמצוותיו שלא עשה כראוי, ע\"י שיתדבק אל הצדיק כנ\"ל."},{"passage_id":"vayikru1_8fac4de9_p23","passage_content":"עוד יש לתת טעם למה שנקרא בשם שבת הגדול, עפ\"י מה דאיתא במד\"ר פרשת תזריע עה\"פ אדם כי יהיה בעור בשרו שאת או ספחת וגו' משל למטרונה שנכנסת לתוך פלטרין של מלך וכו' כך כיון ששמעו ישראל פרשת נגעים נתייראו אמר להם משה אל תתייראו אלו לאוה\"ע אבל אתם לאכול ולשתות ולשמוח. וקשה שהרי בפירוש נתמעטו עכו\"ם מטומאת נגעים, ומאי קאמר להו אלו לאומות העולם. גם אין מובן מה שסיים אבל אתם לאכול ולשתות ולשמוח, דמאי ענין הבטחה זו לפרשת נגעים. ונראה לפרש בהקדם הא דאיתא בגמרא (פסחים קי\"ט ע\"ב) דרש ר' עוירא וכו' מאי דכתיב (בראשית כ\"א) ויגדל הילד ויגמל עתיד הקב\"ה לעשות סעודה לצדיקים ביום שיגמל חסדו לזרעו של יצחק לאחר שאוכלין ושותין נותנין לו לאברהם אבינו כוס של ברכה לברך ואומר להם איני מברך שיצא ממני ישמעאל אומר לו ליצחק וכו' ליעקב וכו' טול וברך וכו', אומר להם איני מברך וכו' אומר להם איני מברך וכו' וכו' אומר לו לדוד טול ברך אומר להם אני אברך ולי נאה לברך שנאמר כוס ישועות אשא ובשם ה' אקרא, ע\"כ. ולכאורה צריך להבין שייכות ענין הסעודה שעתיד הקב\"ה לעשות לצדיקים לעת\"ל עם המשתה שעשה אברהם אבינו ביום הגמל את יצחק בנו, וביאר היפ\"ת ז\"ל כי להיות שמעשה אבות סימן לבנים, על כן עשה אברהם אבינו משתה גדול ביום הגמל את יצחק, להיות הכנה לאותו משתה שעתיד הקב\"ה לעשות לעתיד לבא ביום שיגמול חסד לזרעו של יצחק אע\"ה."},{"passage_id":"vayikru1_8fac4de9_p24","passage_content":"והנה בענין המשתה שעתיד הקב\"ה לעשות לצדיקים לעתיד לבא נחלקו הראשונים ז\"ל, יש מהם שכתבו כי הוא רק דרך משל, (וכ\"כ בזה\"ק פרשת תולדות הובא לעיל בדברינו פרשת שמיני באורך), אמנם הרשב\"א ז\"ל בחידושי אגדות שלו בבבא בתרא פרק הספינה, בענין קניגיא שעתיד גבריאל לעשות עם לויתן לעת\"ל, האריך בפירוש אגדה זו, וכתב אל תרחיק להיות לצדיקים לעוה\"ב סעודה כפשטי הדברים, אלא שאין תכלית אותם סעודות למילוי הכרס כ\"א לחזק כוחות הנפש. והיפה תואר ז\"ל הביא דברי הרשב\"א (בשמות רבה פכ\"ה ט') וכתב וז\"ל, וכל מאמין אמונה שלימה יאמין הדברים כמשמעם, כי עשה יעשה ה' בזמן התחיה שהצדיקים עומדים בגוף ונפש סעודה גופנית מבשר בהמות ולויתן ופירות ג\"ע, ויתענגו על רוב שלום, עכ\"ד ז\"ל. אך זה ודאי אשר בסעודה זו יהי' איזה ענין רוחני, וכמו שפירש השלה\"ק דכל הדברים הנאמרים בתורה מורים על ענין רוחני. עכ\"פ זה ברור ומפורש שתהי' סעודה שיהי' בה איזה ענין אכילה ושתיה, כדקאמר לאחר שאוכלין ושותין וכו', וכן איתא במד\"ר פרשת שמיני (פי\"ג ג') עה\"כ זאת החיה א\"ר אבהו אריסטון עתיד הקב\"ה לעשות לעבדיו הצדיקים לעת\"ל וכל מי שלא אכל נבלות בעה\"ז זוכה לראותו לעוה\"ב הה\"ד וחלב נבלה וחלב טרפה יעשה לכל מלאכה ואכול לא תאכלוהו בשביל שתאכלו ממנה לע\"ל לפיכך משה מזהיר לישראל ואומר להם זאת החיה אשר תאכלו. הרי דסעודה זו יש בה מענין אכילה. וכן נוסד בפייט אקדמות שאומרים בעצרת, אריסטון לצדיקיא יתקן ושירותא מסחרין עלי תכי דכדכוד וגומרתא."},{"passage_id":"vayikru1_8fac4de9_p25","passage_content":"ועפ\"י זה נבא אל הביאור בדברי המד\"ר הנ\"ל אלו לאוה\"ע אבל אתם לאכול ולשתות ולשמוח. דהנה רבינו בחיי ז\"ל בס\"פ מקץ הביא בשם פרקי היכלות לר\"י כה\"ג, בענין עשרה הרוגי מלכות שנכתבו בב\"ד של מעלה, ונתנו לו לס\"מ שרו של עשיו וכו', אמר ר' ישמעאל כל ההתראות הללו וכל התנאים הללו התרו בו והתנו עם ס\"ם הרשע והוא אמר קבלתי עלי ויבחר עשרה מאבירי ישראל וכו' באותה שעה לא הספיק לומר לסופר כתוב גזירות ומכות גדולות קשות ועזות ומבוהלות ונוראות וכבדות על רומי מפני חימה שנתמלא על ס\"מ הרשע שקבל עליו כל התנאים הללו אלא מיד נטל נייר וכתב עליו נקמה זו עתידה ושמורה לרומי הרשעה תעלה ענן אחד ותעמוד למעלה מרומי ו' חדשים וירד שחין לח על האדם וכו' ואח\"כ תעלה ענן וכו' וירד נגע צרעת וספחת ובהרת וכל מיני נגעים על רומי הרשעה עד שתבא שעה שאומר אדם לחבירו הילך רומי הרשעה בפרוטה היא וכל אשר בה ויאמר לו אינה מתבקשת לי, ע\"כ. ובזה יתבארו לנו היטב דברי המד\"ר ס\"פ תזריע שדורש פרשת נגעים על אומות העולם וז\"ל, שאת זו בבל וכו' ספחת זו מדי וכו' בהרת זו יון וכו' נגע צרעת זו אדום וכו', ע\"כ. ולכאורה כיצד הוציא דברי הכתוב ממשמעותן ודרשן על ענין אחר לגמרי. אמנם לפי הפרקי היכלות הנ\"ל מבואר היטב, כי עיקרן של נגעים הללו שיש להם שרש בגבהי מרומים, עתידין לבא על האומות לעת\"ל ולעשות בהם כלה ואבדון, לבלתי השאיר להם שריד, עד שאדם אומר לחבירו הילך רומי הרשעה בפרוטה ויאמר לו איני מתבקשת לי."},{"passage_id":"vayikru1_8fac4de9_p26","passage_content":"וזה יהיה ביאור המדרש בשעה ששמעו ישראל פרשת נגעים נתייראו, כי הן בראותם פרשה זו והשיגו בשרשם של דברים, כי הנגעים עתידים לבא באף ובחימה ובקצף גדול מצד מדת הדין הקשה, נתייראו מאד כי עליהם יהיה חרון האף הקשה הלזה. אמנם בדברי חז\"ל מבואר כי יתכן שבישראל יבואו הנגעים מצד מדת הרחמים, וכדאיתא בגמרא (ברכות ה' ע\"א) אר\"י נגעים אינן יסורין של אהבה והתניא כל מי שיש בו אחד מד' מראות נגעים הללו אינן אלא מזבח כפרה ומשני הא לן והא להו, ופירש\"י בא\"י שערי חומה מקודשות בה ומצורע טעון שילוח חוצה להן אינן יסורין של אהבה, בבל שאין טעון שילוח הוי יסורין של אהבה, ע\"כ. הרי שיתכן הדבר שיבואו הנגעים על ישראל להוכיחם ביסורין של אהבה, אלא שבא\"י לא יבואו באופן זה מחמת שהוא טעון שלוח מחוץ למחנה, אבל זה ודאי שתתכן ביאתם במדת הרחמים. וזהו שהשיב להם משה לישראל אל תתייראו אלו לאומות העולם, כלומר מה שאתם צופים בפנימיות פרשת נגעים, שתהיה ביאתם במדת הדין הקשה הוא לאומות העולם, שעתידין הנגעים להביא עליהם כליה ואבדון, אבל אתם לא יבואו עליכם הנגעים בבחינה זו כלל, אלא באותה עת שיעשה הדין הקשה באומות העולם, אז תזכו לאכול ולשתות ולשמוח בסעודת לויתן ושור הבר שעתיד הקב\"ה לעשות לכם, ואז תהיה השמחה גדולה עד מאד, לא היתה שמחה כזו לפניו יתברך מיום בריאת שמים וארץ, כדאיתא בזה\"ק (מדרש הנעלם פ' וירא קי\"ד ע\"א) אר\"א היום שישמח הקב\"ה עם בריותיו לא היתה שמחה כמותה משום שנברא העולם."},{"passage_id":"vayikru1_8fac4de9_p27","passage_content":"ועפ\"י האמור נבא לתת טעם למה שנקרא שבת זה בשם שבת הגדול. כי הנה בשבת זו החלה התעוררות הגאולה, כמבואר לעיל באורך, וידוע שגאולת מצרים היא שורש כל הגאולות כמאה\"כ (מיכה ז') כימי צאתך מארץ מצרים אראנו נפלאות, ועל כן בהתעוררות הגאולה באותו שבת, נעשתה הכנה להתעוררות הגאולה העתידה, ואז עתיד הקב\"ה לשמוח עם בריותיו באותו משתה גדול שעתיד לעשות ביום שיגמול חסד לזרעו של יצחק. והיינו טעמא שנקרא בשם שבה\"ג, כי בשבת זו נעשתה התעוררות והכנה לאותו משתה שעתיד הקב\"ה לעשות לעתיד לבא. ואם אותו משתה שעשה אברהם קרא הכתוב משתה גדול, משום שהיה מכוון בו לעשות הכנה לאותה סעודה. העתידה, עאכו\"כ שאותה סעודה העתידה תהיה סעודה גדולה, ולפיכך זה שמו אשר יקראו לו שבת הגדול, בעבור אותה הסעודה שיעשה הקב\"ה לעת\"ל."},{"passage_id":"vayikru1_8fac4de9_p28","passage_content":"עוד יש לתת טעם למה שנקרא שבת הגדול, עפ\"י מה שאמרו ז\"ל (ערכין ט\"ו ע\"ב) תנא דבי ר' ישמעאל כל המספר לה\"ר מגדיל עוונות כנגד ג' עבירות ע\"ז ג\"ע ושפ\"ד כתיב הכא לשון מדברת גדולות (תהלים י\"ב) וכתיב בע\"ז (שמות ל\"ב) אנא חטא העם חטאה גדולה בג\"ע כתיב (בראשית ל\"ט) גדול עווני מנשוא, ע\"כ. מבואר מזה כי חטא עבודה זרה נמי קרוי חטא גדול. והנה כשנצטוו ישראל לקחת להם שה לקרבן פסח הזהירן משה תחלה לפרוש מן הע\"ז שהיו טועים אחריה במצרים, וכמו שדרשו ז\"ל במכילתא משכו ידיכם מע\"ז וקחו לכם צאן למצוה. וכבר נתבאר בדברינו לעיל כי מאהבת הנס שנעשה להם באותו שבת בלקיחת הקרבן פסח ששו לקיים מצות מילה מיד, וע\"ד שאמרו ז\"ל במגילה הדר קבלוהו בימי אחשורוש, ופירש\"י מאהבת הנס. וא\"כ גם אותה תשובה שעשו במה שפרשו מעבודה זרה היתה תשובה מאהבה, וע\"י כן נתהפך להם עון הע\"ז לזכות, כאמרם ז\"ל (יומא פ\"ו ע\"ב) שבתשובה מאהבה מתהפכין הזדונות לזכיות. ומסתברא דכשם שחטא עבודה זרה קרוי גדול, כדיליף בגמרא מדכתיב ביה חטאה גדולה, ה\"נ כשעושים תשובה מאהבה על חטא זה והוא נהפך לזכות, בדין הוא שיקרא זכות גדול. ובזה מצאנו טעם נכון על שקורין שבת זה בשם שבת הגדול, לפי שבשבת זה משכו ישראל ידיהם מעבודה זרה, ועשו תשובה מאהבה, ובזה ניתוספה להם זכות גדולה."}]},{"dvar_torah_id":"vayikru1_5b799589","title":"טעם שבת הגדול והנס שבא","summary":"נידונה משמעות השבת הגדול, בה פסקה מכת החשך, והנס שקרה לישראל. השבת רומזת לחסד בלבד, בניגוד לימים שלפניה ואחריה. זכרון הנס נקבע לשבת, משום שבזכותה פסק החשך, והגאולה תבוא ברחמים.","contents":[{"passage_id":"vayikru1_5b799589_p1","passage_content":"עוד יאמר לתת טעם על שנקרא שבת הגדול ויתיישב גם טעם שקבעו את זכרון הנס ליום השבת דייקא ולא ליום העשירי בניסן שבו אירע. בהקדם מה שכתב ק\"ז זלה\"ה בישמח משה (פ' צו בהפטורה לשבה\"ג) על הכתוב הנה אנכי שולח לכם את אליהו הנביא לפני בא יום ה' הגדול והנורא, יתבאר עפ\"י מה שכתב בפליתי (סימן ק\"י) דבאם יהיו ישראל בבחינת זכו אחישנה אז אין צריך לביאת אליהו טרם ביאת המשיח. והנה הגדול רומז על חסד גדול כנודע (תיקוני זוהר תכ\"ב ס\"ז ע\"ב) ונורא על פחד, וידוע דבעתה בלא זכו והשארתי אחד מעיר, ואז חסד לצדיקים ופחד לרשעים, מה שאין כן בזכו דאז כולם נקבצו והוי חסד לכל, א\"כ הוי גדול בלא נורא. והיינו הנה אנכי שולח לכם וגו' לפני בא יום ה' הגדול והנורא דייקא, משא\"כ בגדול לבד א\"צ לביאתו של אליהו לפני ביאת המשיח והבן, עכת\"ד הקדושים. אמנם הנה אף שכבר הגענו לזמן של בעתה, עינינו תלויות לרחמי שמים שתהיה הגאולה בבחינת גדול בלבד בלא נורא, כי כבר סבלנו חבלי משיח קשים די והותר, והבוי\"ת יערה עלינו רוח טהרה ממרום, שנזכה לשוב אליו באמת ובלב שלם, ואז ודאי תהיה הגאולה ברחמים וחסדים בלי חבלי משיח."},{"passage_id":"vayikru1_5b799589_p2","passage_content":"והנה כבר נתבאר בדברינו (פרשת בא רע\"ג) דלדעת הרמב\"ן ז\"ל בפרשת בא התחילה מכת החשך בז' בניסן, ולפי זה נמצא כי העשירי בחדש ניסן היה באמצע ימי החשך. אכן הנה בספר חוט המשולש כתב דבשבת לא היתה מכת החשך משמשת, ונתן שם טעם לדבר. ואף אני אמרתי טעם שלא היתה מכת החשך משמשת בשבת, משום שבעשירי לחדש שחל בשבת נעשה נס גדול שלקחו ישראל שה לקרבן פסח וקשרוהו בכרעי מטתן, והיו המצרים רואים ושיניהן קהות ולא אמרו להם דבר, עוד איתא במדרש שבאותה שעה עשו בכורי מצרים מלחמה עם אבותיהן כדי שישלחו את ישראל, והרגו מהם הרבה וזהו שאמר הכתוב (תהלים קל\"ה) למכה מצרים בבכוריהם. והנה אילו היתה מכת החשך משמשת גם באותו שבת, א\"כ לא היו המצרים רואים שישראל לוקחים את הע\"ז שלהם לשחוט, וא\"כ לא היה ניכר ונודע נס זה, וגם לא היו הבכורות עושים מלחמה עם אבותיהם. על כן מאת ה' היתה זאת, שלא תהי' מכת חשך בשבת, למען יוודע ויתפרסם גודל הנס. והנה מכת החשך היתה משמשת ששה ימים, כדאיתא במד\"ר פרשת בא (פ' י\"ד ג') רבותינו אמרו ז' ימים של חשך היו כיצד ג' ימים הראשונים מי שהי' יושב וביקש לעמוד עומד וכו' ועל אלו הימים נאמר לא ראו איש את אחיו וגו', ג' ימים אחרים מי שהיה יושב לא היה יכול לעמוד וכו', הרי ו' ימים של חשך שהי' במצרים, והז' של חשך זה חשך של ים שנאמר ויהי הענן והחשך ויאר את הלילה, ע\"כ. ולפי זה נמצא כי מכת החשך שהחלה בז' בניסן נפסקה בשבת, וחזרה לשמש עוד שלשה ימים אחר השבת. והנה אף במצרים היו ב' בחינות אלו גדול ונורא, חסד לצדיקים ופחד לרשעים ששלטה בהם מדת הדין ומתו בימי האפילה. אמנם באותו שבת שבו לא היתה מכת החשך משמשת, א\"כ הי' חסד בלבד שהרי לא מתו בו הרשעים, וע\"כ נקרא שמו שבת הגדול, כי בו היתה בחינת הגדול, היא מדת החסד בלבד, ולא בחינת הנורא, משא\"כ בימים שלפני השבת ולאחריו היתה גם בחינת הנורא. ובזה מיושב מה שהקשה מרן הבית יוסף ז\"ל שהיה ראוי לקרוא כל הימים שמן העשירי לחדש עד פסח בשם ימים גדולים שהרי בכולן היה אותו הנס שטיפלו ישראל בקרבנם, ולא אמרו להם המצרים דבר. ולפי הך טעמא דאמרן אתי שפיר, כי שאר הימים אין לקרותן בשם גדול בלבד, כיון שהיה החשך משמש בהם, והיו בבחינת הגדול והנורא גם יחד, משא\"כ יום השבת שבו פסק החשך שפיר קראוהו הגדול, שנהגה בו אך מדת הרחמים."},{"passage_id":"vayikru1_5b799589_p3","passage_content":"ובזה יתיישב גם מה שהקשו המפרשים שהיה ראוי לקבוע זכרון הנס ליום החדש, הוא העשירי בניסן ולא ליום השבת. אמנם הנה לפי שמכת החשך פסקה מלשמש כדי שיתגלה הנס שנעשה לישראל, ואותו הנס נעשה להם בזכות השבת, כאשר נתבאר באורך בכמה אנפי, על כן בדין הוא שיקבע זכרון הנס ליום השבת, משום שבזכותו פסק החשך. ולפיכך הוא קרוי בשם הגדול, משום שלא נהגה בו מדת הדין, והבן."}]},{"dvar_torah_id":"vayikru1_ec232782","title":"תורת המצורע ותיקון מעשיו","summary":"במאמר זה נדונה תורת המצורע ביום טהרתו, והקשר בין לימוד תורה לשמה וללא לשמה. רבי אבא מבקש שיתקבלו דבריו, כדי שיתקן את חלקו, וההבנה היא שבסופו של דבר, גם אם הלימוד לא היה לשמה, ייתכן שיתוקן על ידי אחרים.","contents":[{"passage_id":"vayikru1_ec232782_p1","passage_content":"זאת תהי' תורת המצורע ביום טהרתו והובא אל הכהן ויצא הכהן אל מחוץ למחנה וראה הכהן והנה נרפא נגע הצרעת מן הצרוע. והדקדוקים במקראי קודש אלו רבו, ונזכיר קצת מהם, חדא אומרו זאת תהיה תורת המצורע יתירא היא לכאורה, וסגי למיכתב כי יטהר המצורע וכו'. גם צ\"ב אומרו והובא אל הכהן, משמע שבעל כרחו יביאוהו אל הכהן, והיה ראוי לכתוב ובא אל הכהן. גם יל\"ד במאה\"כ והנה נרפא נגע הצרעת מן הצרוע, דתיבות מן הצרוע יתירות נינהו, דודאי בצרוע קא מיירי. בהפטרת השבוע (הפטרת שבת ר\"ח) המסיימת (ישעי' ס\"ו) והי' מדי חודש בחדשו ומדי שבת בשבתו יבא כל בשר להשתחוות לפני ה'. יל\"ד בכפל לשון הכתוב מדי חדש בחדשו ומדי שבת בשבתו. גם מדוע נקט קרא יבא כל בשר ולא אמר יבא כל איש."},{"passage_id":"vayikru1_ec232782_p2","passage_content":"ולבאר הענין נקדים דברי הגמרא בביצה (דף ל\"ח ע\"א) הנפלאים לכאורה, וז\"ל, כי סליק רבי אבא (לא\"י) אמר יהא רעוא דאימא מילתא דתתקבל כי סליק אשכחיה לר' יוחנן ור' חנינא בר פפא ורבי זירא וכו' יתבי וקאמרי (על הא דתנן במתניתין התם האשה ששאלה מחברתה תבלין ומים ומלח לעיסתה הרי אלו כרגלי שתיהן) אמאי ולבטיל מים ומלח לגבי עיסה (פירש\"י אמאי כרגלי שתיהן, לבטיל איסור תחומין דמים ומלח דזוטרי לגבי עיסה דנפישא) אמר להו רבי אבא הרי שנתערב לו קב חטין בעשרה קבין חטין של חבירו יאכל הלה וחדי אחיכו עליה אמר להו גולתייכו שקלי (פירוש מלבושכם לקחתי שאתם משחקים עלי). הדר אחיכו עליה א\"ר אושעיא שפיר עבוד דאחיכו עליה וכו' אמר ליה ר' ספרא משה שפיר קאמרת (פירש\"י משה, ביקרא דמשה קא משתבע שפיר קאמרת בתמיה כלומר אמאי קא מודית להו בחוכא ולאקשויי אמתניתין) ולא שמיע להו הא דאמר ר' חייא וכו' הבורר צרורות מגרנו של חבירו חייב לשלם לו דמי חטים אלמא כילא חסריה ה\"נ כילא חסריה, ע\"כ."},{"passage_id":"vayikru1_ec232782_p3","passage_content":"ובמאמר זה נתקשו רבים וכן שלמים, להבין דברי חכמים וחידותם, וענין השחוק דאחיכו על ר' אבא. והחתם סופר זלה\"ה בחידושיו על מסכת ביצה (ועיין בתשובות חתם סופר חלק או\"ח סימן ר\"ח) ביאר כי כוונת ר' אבא היתה שלא לשמה, במה שביקש שיאמר דבר המתקבל על הבריות, כי רצה להתפאר בתורתו, ולפיכך אחיכו עליה, אך קשה מאד לומר כן על האמוראים הקדושים, שהיתה בלבם מחשבת שלא לשמה."},{"passage_id":"vayikru1_ec232782_p4","passage_content":"ולכן נראה לבאר דברי הגמרא דהנה אמרו ז\"ל פסחים (נ' ע\"ב) אר\"י א\"ר לעולם יעסוק אדם בתורה ובמצוות אפילו שלא לשמה שמתוך שלא לשמה בא לשמה, וכתבו התוספות ז\"ל דשלא לשמה היינו להתגדל ולהתפאר, דאילו בלומד לקנטר אמרו ז\"ל נוח לו שלא נברא. ונראה לבאר ענין אומרם לעולם יעסוק אדם וכו' אפילו שלא לשמה, עפ\"י מאמרם ז\"ל (בבא בתרא ט' ע\"א) גדול המעשה יותר מן העושה, ולכאורה צ\"ב דאם המעשה את אחרים לתת, קיבץ סכום שוה למי שנודב אותו סכום מכיסו, למה יהי' שכרו גדול יותר. אך הכוונה דהנה פעמים שהאדם עושה מצוה או לומד תורה, ואינו במדרגה שיוכל לעשותה בדחילו ורחימו בלתי לה' לבדו, וא\"כ מה תקנה יש לתורתו, והרי אי' בתיקונים (תיקונא עשיראה) כל אורייתא דאיהי בלא דחילו ורחימו לא פרחית לעילא. אך אם הוא גורם לרבים שיעשו את המצוה, א\"כ אף אם הוא בעצמו לא עשה את המצוה בכוונה הרצויה, מ\"מ כיון שבתוך הרבים ודאי נמצא אחד המכוון בעשיית המצוה לשמת זה האחד יעלה ויתקן גם כל אותם שלא זכו לעשותה לשמה."},{"passage_id":"vayikru1_ec232782_p5","passage_content":"וזה כוונת אמרם גדול המעשה, פירוש שהוא מעשה את הרבים למצוה, יותר מן העושה לבדו, כי המעשה מובטח לו שתתקבל המצוה לרצון לפני השי\"ת. וכמו כן הדבר בלימוד התורה, דהא דאמרו ז\"ל לעולם ילמוד אדם תורה שלא לשמה שמתוך שלא לשמה יבא לשמה, היינו כיון שהוא לומד להתגדל ולהתפאר א\"כ ודאי שמעתתיה מבדרן בעלמא, ובודאי המצא ימצא בין הרבים אחד שיאמר וילמוד דבר תורה הנאמר משמו בכוונה רצויה ומעולה בלתי לה' לבדו, וע\"י כך יעלה ויתקן גם את חלקו של המחדש את החידוש בתורת כי הרי יש לו חלק בכך שחבירו למד חידוש זה לשמה. וזה אפ\"ל כוונת אומרם מתוך שלא לשמה יבא לשמה, כי בסופו של דבר יחזור ויתתקן החידוש הזה להיות בחינת לשמה."},{"passage_id":"vayikru1_ec232782_p6","passage_content":"וע\"ד זה נבא לביאור דברי הגמרא, כי הנה ר' אבא לגודל ענוותנותו ושפלות רוחו, לא היה מחזיק את עצמו כי הוא במדרגה הראויה, לחדש חידושים בתורה בכוונה הרצויה בלתי לה' לבדו, ולפיכך התפלל יהא רעוא דאימא מילתא דתתקבל, כי אם יתקבלו דבריו באזני השומעים, אזי אף אם יהי' לימודו שלא לשמה, לא יתכן שלא יהי' בין השומעים אחד שיכוון בה לשמה, ואז גם חלקו יחזור להיות בבחינת לשמה, ויהי' לו עליה ותיקון. אכן כד סליק לארץ ישראל ואשכחינהו וכו' דיתבי וקאמרי אמאי ולבטיל מים ומלח לגבי עיסה, כלומר שאם השאילה אשה לחברתה מים ומלח לא תקרא העיסה ע\"ש בעלים הראשונים, כי נתבטל שמם בתוך העיסה שהיא עיקר, וקושיא זו היתה נגד כוונתו של ר' אבא, שהרי אם שם בעלים הראשונים נתבטל לגבי בעלים האחרונים שהם עיקר, אם כן אפילו אם יתקבלו הדברים ויתבדרו בעלמא, עדיין לא תצא לו תועלת לתקן חלק תורתו, שהרי גם אם ימצא אחד שילמד דבר הנשמע מפיו בכוונה הרצויה לא יחשב לו לרבי אבא, כי שם בעלים הראשונים בטל. ועל כוונה זו א\"ל ר' אבא מי שנתערב לו קב חטין בעשרה קבין חטין יאכל הלא וחדי בתמיה, כלומר האם משום שחלק השני מרובה מן הראשון, שהוא למד חידוש זה לשמה, יבטל חלק הראשון לגמרי, הרי גם לו יש חלק בה, כי הוא עמל בו והוא גידלו."},{"passage_id":"vayikru1_ec232782_p7","passage_content":"אמנם הם ידעו והרגישו כוונתו, כי הוא מחזיק עצמו בשפלות יתירה, שאין לימוד תורתו בכוונה הרצויה לשמה, ולפיכך הדר אחיכו עלית אמר להו גולתייכו שקלי, פירוש גולתייכו היינו לבוש העליון, ונתכוון בזה על התורה והמצוות שהם לבושים על האדם כמאמר הנביא (זכריה ג') הסירו הבגדים הצואים מעליו והלבש אותו מחלצות. וזאת היתה תמיהתו של רבי אבא האם אני לקחתי ממכם את לבוש התורה והמצוות שלכם, עד שאתם רוצים לקחת ממני את לבוש התורה והמצוות שלי, במה שאתם אומרים כי חלק הבעלים הראשונים מתבטל ברוב. ועל כך א\"ר אושעיא שפיר עבוד דאחיכו עליה, כי ראו שעדיין רבי אבא בתומתו הולך, להחזיק עצמו במדרגה פחותה, שלימוד תורתו הוא שלא לשמה, ויש צורך בדבר שיעלו אחרים את לימוד תורתו."},{"passage_id":"vayikru1_ec232782_p8","passage_content":"ולעומתו השיב ר' ספרא להצדיק דברי ר' אבא, משה שפיר קאמרת, ופירש\"י ביקרא דמשה קמשתבע, דהנה אי' במג\"ע (אופן י\"ט) עה\"פ ויתא ראשי עם כי אילו לא נקבר משרע\"ה במדבר היו ישראל אבודים ח\"ו וז\"ש הכתוב כי שם חלקת מחוקק ספון שנקבר משה במדבר בשביל ויתא ראשי עם שיהי' הוא המנהיג לעת\"ל כמו שהי' בתחלה, עכ\"ד. והנה אם נאמר כר' אושעיא דשם בעלים הראשונים בטיל, א\"כ מה תועלת בכך שמשה נקבר עמהם, הרי שוב לא נקרא שמו עליהם, וא\"כ זה הוא גנאי למשה שנקבר במדבר, ולא זכה לעלות לארץ ישראל. וז\"ש רש\"י ז\"ל ביקרא דמשה קא משתבע, שנשבע בכבודו של משה, כי אכתי שמו נקרא על דור המדבר, דשם בעלים הראשונים לא בטיל, ועתיד הוא להעלותם עמו. ואח\"כ מייתי ראי' לדברי ר' אבא מהא דתני ר' חייא וכו' הבורר צרורות מתוך גרנו של חבירו חייב לשלם לו דמי חטים, אע\"פ שהצרורות אין להם שום שוייות, וה\"נ אף שתורתו לבד לא היתה בדחילו ורחימו, שם בעלים הראשונים עלה, ויש לה עליה ותיקון."},{"passage_id":"vayikru1_ec232782_p9","passage_content":"והנה באמת בחינה זו היא טובה וודאי רק לשיטת וכוונת ר' אבא שהיה ענוותן ושפל ברך ביותר, והיה מחזיק עצמו כי הוא צריך תיקון והתעלות ע\"י אחרים, אבל ודאי הוא טוב ומשובח יותר שהאדם עצמו יבא למדרגה שיוכל לעלות ולתקן תורתו ותפלתו ומצוותיו. וזה אפ\"ל בכוונת הכתוב זאת תהי' תורת המצורע, כלומר איך יהי' תיקון והתעלות לתורתו ומצוותיו של המצורע, שדרשו ז\"ל דקאי על המוציא רע, דכיון שהוא בבחינה שפלה ופחותה, כיצד תהיה עליה לתורתו, על זאת העצה היעוצה והובא אל הכהן ושפתי כהן הוא צדיק הדור ישמרו דעת, כי הוא מכוון כראוי לשמת וע\"י זה יעלה את התורה והמצוות והתפלה של אותם שאינם ראויים אתו עמו. אך אמר הכתוב כי טוב מזה הוא באם יוכל הוא בעצמו לתקן ולהעלות תורתו ותפלותיו, וזה אומרו וראה הכהן והנה נרפא נגע הצרעת \"מן הצרוע\", כלומר שמן הצרוע בעצמו עלתה ארוכה ומרפא לתורתו ומצוותיו."},{"passage_id":"vayikru1_ec232782_p10","passage_content":"ועל פי מה שנתבאר כי יש אשר התורה והמצוות אינם בשלימות הראוי, ואח\"כ הם באים לתיקונם ופורחים לעילא. יתבאר הכתוב והיה מדי חדש בחדשו וגו', דהנה ידוע כי ראשי חדשים המה תיקון גדול לכל החדש, וכמו כן השבת הוא תיקון לכל ימות השבוע, אך אם לפעמים אין האדם במדרגה הראויה שיוכל לתקן ולהעלות את הכל בר\"ח כראוי, אזי באם בפעם אחרת יעלה בידו לעשותו כהוגן הוא מעלה למפרע את כל החדשים שלא נתקנו. וכמו כן באם לא היה בכוחו בשבת אחת להעלות מעשי אותו שבוע, אזי אם בפעם אחרת יתנהג בשבת כראוי תהיה עליה למפרע לכל השבתות הקודמים, נמצא כי פעמים יש אשר אותו חדש ואותו שבת אין לו עליה ותיקון בחדשו ובשבתו. אמנם אין זה אלא בזמן הגלות, שיש בנו לב אבן הוא יצה\"ר המעכב, אבל לעת\"ל שיוסר לב האבן מקרבנו, וינתן לנו לב בשר, אזי יהיה מדי חדש בחדשו, דהיינו דהחדש יהי' לו תיקון בראש חדשו, והשבוע יהי' לו תיקון בשבתו. וזהו שאמר הכתוב והיה מדי חדש בחדשו, כלומר שלעתיד לבא יהי' עליה ותיקון לחדש באותו ראש חודש עצמו, ולא יצטרכו להעלותו בר\"ח אחר. וכן מדי שבת תהי' לו עליה ותיקון בשבתו, פירוש באותו שבת עצמו, ונתן טעם לדבר יבא כל \"בשר\" להשתחוות לפני אמר ה', פירוש שיסיר הקב\"ה לב האבן מבשרינו, ויהיה לנו לב בשר על כן תהיה עליה ותיקון דבר יום ביומו."}]},{"dvar_torah_id":"vayikru1_2a32f0ae","title":"תורת המצורע ביום טהרתו","summary":"בפרשת המצורע נדונה חשיבות הטהרה והקשר בין מעשה הרשע לתורה. המדרש מלמד על איסור לשמוע מפי רשע, וההבנה כי התורה יכולה להיות סם חיים או סם מוות, בהתאם למעשיו של הלומד. ביום טהרתו, חוזרים למצורע מצוותיו שנלקחו ממנו.","contents":[{"passage_id":"vayikru1_2a32f0ae_p1","passage_content":"זאת תהיה תורת המצורע ביום טהרתו והובא אל הכהן. יל\"ד דתיבת תהיה יתירא היא, שאין זה דרך הכתוב בשאר מקומות, כדכתיב זאת תורת החטאת וזאת תורת העולה וכיוצא, וה\"נ הול\"ל זאת תורת המצורע. ורבותינו ז\"ל (מנחות דף ה' ע\"א) דרשו מדכתיב זאת תהיה תורת המצורע בהוייתה תהא, וצ\"ב."},{"passage_id":"vayikru1_2a32f0ae_p2","passage_content":"ב) גם אומרו זאת תהי' תורת וגו' צ\"ב, דכל היכא דכתיב זאת תורת אתיא לדרשה, כמו שדרשו במנחות (דף ק\"י) מ\"ד זאת תורת החטאת וזאת תורת האשם כל העוסק בתורת חטאת כאילו הקריב חטאת וכו', ומאי נדרוש הכא באומרו זאת תורת המצורע."},{"passage_id":"vayikru1_2a32f0ae_p3","passage_content":"ג) עוד קשה דאומרו והובא אל הכהן אין לו ביאור לכאורה, שהרי המצורע היה משולח חוץ לשלש מחנות, והכהן היה צריך לצאת אליו, כדכתיב להלן ויצא הכהן אל מחוץ למחנה וגו', וא\"כ מאי האי דקאמר והובא אל הכהן. עוד צ\"ב דהול\"ל ובא, דמאומרו והובא משמע שאחרים מביאים אותו."},{"passage_id":"vayikru1_2a32f0ae_p4","passage_content":"ד) במד\"ר איתא זאת תהיה תורת המצורע הה\"ד ולרשע אמר אלקים מה לך לספר חקי ותשא בריתי עלי פיך א\"ר לוי בתורה בנביאים ובכתובים מצינו שאין הקב\"ה חפץ בקילוסו של אדם רשע, מן התורה ועל שפם יעטה וגו', מן הנביאים ויהי הוא (גיחזי) מספר למלך את אשר החיה את המת וגו' זאת האשה וזה בנה אשר החיה אלישע ודילמא לאחורי תרעא הוה קאים (וכי לאחורי הדלת היתה עומדת האשה עם בנה שמיד שהתחיל לספר המאורע באו שניהם לפניו) רבנן אמרי אפילו בסוף העולם הטיסה הקב\"ה והביאה כדי שלא יספר אותו רשע בשבחו של הקב\"ה, בכתובים מנין שנאמר ולרשע אמר אלקים מה לך לספר חקי, עכ\"ד המדרש. וצ\"ב שייכות כל המדרש הזה לפרשתא דמצורע. ואם להשמיענו ענין זה שמצורע אסור בת\"ת, יותר היה ראוי שישמיענו זאת בפרשה הקודמת, ששם נאמר הך קרא ועל שפם יעטה, שממנו למדו ז\"ל שמצורע אסור בת\"ת, ומדוע הביאו המד\"ר בפרשה זו דמיירי בטהרתו של מצורע."},{"passage_id":"vayikru1_2a32f0ae_p5","passage_content":"ה) יל\"ד בדברי הכתוב שמביא המדרש ולרשע אמר אלוקים מה לך לספר חקי ותשא בריתי עלי פיך, שהוא כפל הענין במלות שונות דפתח לומר מה לך לספר חקי, דקאי על התה\"ק, וחזר ואמר ותשא בריתי וגו', ופירש\"י ז\"ל בריתי תורתי."},{"passage_id":"vayikru1_2a32f0ae_p6","passage_content":"ו) גם צ\"ב להלן באותו ענין, שאמר הכ' ואתה שנאת מוסר ותשלך דברי אחריך אם ראית גנב ותרץ עמו ועם מנאפים חלקך וגו'. ופירש במצודות ותשלך דברי אחריך השלכת דברי אחרי גויך כדרך שמשליך האדם דבר שלא יחפוץ לראותו, ולכאורה הרי הכתוב מפרט והולך את מעשיו המקולקלים, אם ראית גנב ותרץ עמו וגו', וכל מעשים אלה הרי הם השלכת דברי השי\"ת שאין לו חפץ בהם, וא\"כ מדוע הוצרך להקדים ולומר ותשלך דברי אחריך."},{"passage_id":"vayikru1_2a32f0ae_p7","passage_content":"ובטרם נבא לביאור הענין נקדים, דהנה דבר גדול ונפלא למדנו מן המדרש הזה, עד היכן הדברים מגיעים, ועד כמה צריך להזהר שלא לשמוע סיפורי נסים מפי אדם רשע, ממה שמצינו שבעת שאמר המלך אל גיחזי נער איש האלקים ספרה נא לי את כל הגדולות אשר עשה אלישע, וגיחזי רצה להתחיל בסיפור הנס שהחיה אלישע את האשה ואת בנה, מיד עשה הקב\"ה נס גדול להביא את האשה ואת בנה להתם, כדי שלא יספר אותו רשע בשבחו של הקב\"ה, ואף אם היתה עומדת בסוף העולם, היה הקב\"ה מסיטה ומביאה בדרך נס לשם. ומכאן נשמע חומר הדברים, שהרי גחזי בעצמו ראה בעיניו את הנס הגדול הזה שעשה אלישע, שהחיה את בן השונמית, וברור שנס זה היה מצד הקדושה, ואפ\"ה לא חפץ ה' שיספר רשע זה אפילו נס אמיתי שנעשה מצד הקדושה, ולפיכך עשה נס גדול להביא את האשה ובנה שמה. ומכאן שאסור לשמוע מפי אדם רשע אפילו סיפורי מעשיות מצדיקים אמתיים, כי יש לחוש פן ימשכו אחריו ע\"י כן, וא\"כ ק\"ו בן בנו של ק\"ו עד כמה גדול הוא הפגם והחטא, אם שומעים סיפורי נסים ונפלאות על אנשים רשעים חוטאים ומחטיאים את הרבים מינים וכופרים, המפיצים ומכניסים מינות וכפירה בלבות בני ישראל בכל העולם כולו, והן המה היו לנו בעוכרינו, לעכב גאולתם של ישראל, והם הגורמים לכל פירצות הדור, ומיום שנברא העולם עדיין לא היתה סט\"א כזו בעולם. ואם לא רצה השי\"ת שרשע יספר נסים אמיתיים שעשה אלישע הנביא קדוש ה', עאכו\"כ שאין לשמוע סיפורי נסים מן הסט\"א מקור הטומאה, ה' ישמרנו מהם ומהמונם."},{"passage_id":"vayikru1_2a32f0ae_p8","passage_content":"ולבא לביאור הענין נראה, דהנה לכאורה יש להתבונן בדברי הכתוב ולרשע אמר אלקים מה לך לספר חקי וגו', אם נאמר שהדברים כפשטן, שכל הנקרא רשע אסור לו לספר בשבחו של הקב\"ה, ואסור בתלמוד תורה, א\"כ ח\"ו תפוג תורה מישראל לגמרי, דמי יאמר זכיתי לבי טהרתי מחטאי, וידוע מה שכתב הרב התניא זלה\"ה (לקוטי אמרים פ\"א) שאף העובר על איסור קל מדברי סופרים נקרא רשע, כדאיתא בפ\"ב דיבמות ובפ\"ק דנדה. וכל הספרים הקדושים נלאו למצוא פשר דבר זה, דהנה מבואר בדברי חכמי האמת והובא בבאר היטב (או\"ח סימן תקע\"א ס\"ק ב') שכל המעשים או תורה שאדם לומד בעודו רשע אצ\"ל שאינו נותן כח בקדושה, אלא אדרבה מוסיף כח בקליפה, וכשחוזר בתשובה מוציא אותו כח מן הקליפה ומכניסו אל הקדושה. וכיוצא בזה כתב הרמב\"ם ז\"ל (הלכות תשובה פ\"ז ה\"ז) כמה מעולה מעלת התשובה אמש היה זה מובדל מה' אלקי ישראל וכו' ועושה מצוות וטורפין אותם בפניו והיום הוא מודבק בשכינה וכו'. וכבר נתעורר בזה בספה\"ק דרך פקודיך בהקדמתו, דלפי זה יאמר האדם אפטור נפשי מעסק תורה ומצוות ח\"ו, עד אשר אתקן את אשר עויתי, וח\"ו לומר כן, דכי ס\"ד שלא יתפלל אדם ולא יקרא ק\"ש וכו' עד אשר יתענה כל הימים הנקצבים לכל חטא ועון, הלא אם לא יניח תפילין באיזה יום נקרא קרקפתא דלא מנח תפילין, וכן הוא בכל התורה ומצוות שאין לו רשות לבטל אף רגע וכו', עיי\"ש מה שכתב בזה. והנה לפי זה ישנם ב' סוגי בני אדם, הסוג האחד אותם החייבים לעסוק בתורה ומצוות ואסור להם לבטל מהם אפילו רגע, והסוג הב' אנשים שהם בגדר רשעים, ואסור להם לעסוק בתורה ובמצות כי הכל הולך אל הסט\"א והקליפות, ועליהם אמה\"כ ולרשע וגו' מה לך לספר חקי. ולכאורה יש להתבונן איך ידע האדם לשית עצות בנפשו, לדעת להבחין באיזה מב' סוגי בני אדם נכלל הוא, אם הוא חייב לעסוק בתורה ובמצוות ולא יבטל מהם אף רגע כמימריה, או להיפך כי אסור לו לעסוק בתו\"מ, כי אין להקב\"ה חפץ בקילוסו של רשע, הרי לא נתפרש לנו איפה הגדר והגבול בזה, ובמה יוודע לו איפה מה דיניה דהאי גברא, אם עליו לעסוק בתורה ובמצות או חייב הוא להבדל מהם."},{"passage_id":"vayikru1_2a32f0ae_p9","passage_content":"אמנם נראה דבקצת התבוננות בענין זה ניתן לדעת ולהבחין הגדר והגבול בזה, ומזה ישפוט האדם מה מעשיהו ומה משפטו. דהנה מי שהוא רוצה ומשתוקק ללכת בדרך האמת, אף ע\"פ שפעמים הרבה הוא נלכד ברשת היצה\"ר, ומרבה חטאים שעל ידיהם נקרא ח\"ו בשם רשע, מ\"מ אינו יכול לפטור עצמו מעסק התורה והמצוות בעבור כן, אדרבה חייב הוא להרבות בתורה ומצוות ובתפלה להקב\"ה, וכדי שלא יחטפו הסט\"א מצוותיו כבר הודיעו לנו הספה\"ק העצה היעוצה לזה, וכידוע מה שכתב בספר אור לישרים, לומר לשם יחוד טרם עשיית המצוה, וזוהי תקנה שלא יחטפו החיצונים מצוותיו. וק\"ז זלה\"ה הביא דבריו הקדושים כמ\"פ (עי' תפלה למשה פרק מ\"ה על הפסוק אומר אני מעשי למלך), וכעין זה כתב גם הרחיד\"א ז\"ל בספרו שמחת הרגל על רות (ועיין בספרי ויואל משה מאמר ב' סימן מ\"ז). אכן אותם אנשים המגלים פנים בתורה שלא כהלכה, ומוצאים בתוה\"ק ראיות ברורות לשיטתם הרעה, כדרך הרשעים בכל הזמנים. ואף גם אותם שאינם עדיין בסוג אחד עם הרשעים עצמם, אלא שמחזיקין את ידי הרשעים בהבאת ראיות למעשיהם מן התוה\"ק, מחמת הנגיעות שיש להם מן הרשעים, כגון כבוד וממון או שאר טובת הנאה, וכידוע מה שפירש בנועם מגדים פרשת מטות מאמרם ז\"ל (ב\"מ דף ל' ע\"ב) לא חרבה ירושלים אלא על שהעמידו דבריהם על דין תורה, שעל כל דבריהם, הם העבירות שהיו עושים, היו אומרים שכך ציוותה תורה, וזה קשה יותר מעצם החטא, ע\"כ. עליהם ודאי אמר הכתוב ולרשע אמר אלקים מה לך לספר חקי דודאי מוטב להם אילו לא למדו תורה כלל, וכמו שדרשו ז\"ל (יומא ע\"ב ע\"ב) זאת התורה אשר שם משה זכה נעשית לו סם חיים לא זכה נעשית לו סם מיתה. וכיון שהתורה נעשית אצלם סם המוות, שגורמים על ידה את חורבן העולם, מוטב להם שלא יעסקו בתורה כלל."},{"passage_id":"vayikru1_2a32f0ae_p10","passage_content":"ועפ\"י האמור יתבאר לנו לשון הכתוב להלן באותה פרשה אם ראית גנב ותרץ עמו ועם מנאפים חלקך, דלכאורה אם הכתוב מיירי ממי שהוא עצמו גנב או מנאף, לא הול\"ל אם ראית גנב ותרץ עמו ועם חלקך, כיון שהוא עצמו גנב ומנאף, ולא רק שהוא מתרצה עמהם ומתחבר להם, ומדקאמר קרא הכי, משמע דמיירי מאנשים שאינם בעצמם גנבים ומנאפים, אלא שהולכים עמהם יחד שלובי זרוע, ומחזיקין ידיהם, ומחפים על כל תועבותיהם, ע\"י קצת נגיעה ושוחד, שמקבלין מהם איזה גדולה וכבוד או פרנסה וכדומה, באיזה אופן שהוא, וזה שמחפים על מעשי הרשעים קשה יותר מן החטא עצמו. וזש\"ה אם ראית גנב ותרץ עמו ועם מנאפים חלקך, שיש לך חלק עמהם, לא בחטא הגניבה והניאוף עצמו, כי אם בתועלת הנמשך להם ע\"י העבירות, והוא השפעת הגדולה והכבוד שהסט\"א משפיע להם בעוה\"ז, ע\"י החטאים שהם עושים. וכיון שאתה נוטל חלק בהשפעה זו ונגיעה זו משחדת אותך, זה יגרום לידי כך \"ותשלך דברי אחריך\"."},{"passage_id":"vayikru1_2a32f0ae_p11","passage_content":"ויובן על פי מה שפירש כ\"ק אבא מארי זלה\"ה בקדושת יו\"ט (בדרוש לסוכות) על הפסוק כי ידעתיו למען אשר יצוה את בניו ואת ביתו אחריו ושמרו דרך ה' וגו', דלכאורה תיבת אחריו יתירא, ופירש דהנה עינינו הרואות בעוה\"ר בזה\"ז, אלה הרשעים אשר עזבו דרך אבותינו הקדושים, וימאנו ללכת בעקבותם, אולם יבחרו להם דרך חדש לא שערום אבותינו, וחכמים הם בעיניהם, ומענה בפיהם כי הם צריכים ללכם לפנים ולא לאחור, ויצעדו קדימה לרוח העת והזמן החדש, עפרא לפומייהו ורוח תשאם. כי באמת דרך האמת היא שנלך בעקבות אבותינו הקדושים, כאשר הורו לנו במעשיהם הטובים ובמנהגים קדושים, ואנחנו צריכים ללכת אחריהם בכל הענינים, ולא לשנות אפילו זיז כל שהוא, ואז יהיה טוב לנו ולבנינו אחרינו עד עולם. וזהו שאמר הכתוב כי ידעתיו למען אשר יצוה את בניו ואת ביתו \"אחריו\" דייקא, שיצוה להם ללכת אחר אבותיהם הקדושים, ולא לפנים כמעשה הדור הזה, אשר יקלקלו אורחותם, אך יאחזו בדרך אבותיהם ללכת אחריהם ואז טוב להם, עכתדה\"ק. והנה אותם האנשים המגלים פנים בתורה שלא כהלכה, ומהפכים דברי אלקים חיים לכל הדברים אשר הם נגד התוה\"ק, מחמת הנגיעות שיש להם, הרי אינם הולכים בדרך הזה שיהיו אחריו דייקא, דהיינו שיהיו נכנעים לדרך התוה\"ק כפי המסור לנו מאבותינו הקדושים, אלא אדרבה הם רוצים שהתורה תלך אחריהם, ותתאים לדרכם הרעה, באמרם בה פשטים של דופי כפי רוע מעלליהם, וא\"כ נמצא כי הם משליכים את התה\"ק אחריהם, ולא שהם הולכים אחרי התורה. וזהו שהקדים הכתוב לומר ותשלך דברי אחריך, פירוש אם תלך בדרך זה לרוץ להתחבר עם גנבים ומנאפים עצרת בוגדים, כלומר שתהיה מחפה עליהם ותלמד זכות למעשיהם מן התורה, כי עיניך ולבך אל הנגיעות וההנאה שישפיעו אליך, בזה תגרום שתשליך דברי אחריך, היינו שתרצה לסלף את התוה\"ק ולהתאימה לדרכך הרעה, היפך צוואתו של אאע\"ה לבני ביתו, שילכו אחריו דייקא."},{"passage_id":"vayikru1_2a32f0ae_p12","passage_content":"ועלייהו אמר קרא ולרשע אמר אלקים מה לך לספר חוקי, כי מכיון שהם מביאים ראיות של שקר מן התה\"ק לייפות מעשיהם של רשעים, ודאי מוטב להם שלא יעסקו בתורה ובתפלה כלל, כי הן הנה המחבלים כרם ה' צבאות, ואסור ללמוד עם כאלו תורה כמו שאמרו ז\"ל (חולין קל\"ג ע\"א) א\"ר זירא כל הלומד תורה לתלמיד שאינו הגון כאילו זורק אבן למרקוליס, וכן נפסק להלכה ברמב\"ם ז\"ל (הל' ת\"ת פ\"ד הל' א') ובטור יורה דעה (סימן רמ\"ו), ואעפ\"י שאין הלכה כרבן גמליאל (ברכות כ\"א ע\"א) שהיה מכריז ואומר כל תלמיד שאין תוכו כברו אל יכנס לביהמ\"ד, וכדאיתא התם שנדחתה שיטתו מהלכה וסילקוהו לשומר הפתח, וניתוספו באותו היום ד' מאות ספסלים בביהמ\"ד, מ\"מ אף חכמים לא נחלקו עליו אלא במי שמעשיו סתומים, ואין ידוע אם הוא טוב או רע, ע\"כ ס\"ל דמותר להם להכנס לביהמ\"ד, כי נמצאים הרבה שאף שאין תוכם כברם, מ\"מ רצונם ללכת בדרך האמת, ומהם אסור למנוע ללמוד תורה. משא\"כ מי שיודעין בו שאינו הגון, כ\"ע מודו שאסור ללמדו תורה, והמלמדו הרי הוא כזורק אבן למרקוליס, כדקאמר ר\"ז. ודבר זה הרי הוא מפורש בתורה בנביאים ובכתובים שאין הקב\"ה חפץ בקילוסו של אדם רשע (ועיין בספרי ויואל משה מאמר לה\"ק סי' ל\"ח מ\"ש בזה ועי' להלן פרשת בהר בפתיחה לתלמידי הישיבה)."},{"passage_id":"vayikru1_2a32f0ae_p13","passage_content":"ומה שאמר הכתוב מה לך לספר חקי וחזר ואמר ותשא בריתי עלי פיך, ולכאורה לישנא כפילא הוא, נראה לפרש עפ\"י מה דאיתא במד\"ר פרשת במדבר, עה\"פ שאו את ראש כל עדת בני ישראל, רומם את ראש גדל את ראש לא נאמר, אלא שאו את ראש, שאם יזכו יעלו לגדולה כמד\"א ישא פרעה את ראשך והשיבך על כנך, אם לא יזכו ימותו כולם, כמה דתימא ישא פרעה את ראשך מעליך ותלה אותך על עץ, ע\"כ. והנה כן הוא גם בלימוד התורה, כאמרז\"ל זכה נעשית לו סם חיים לא זכה נעשית לו סם מיתה. ולפיכך חזר הפסוק לומר ותשא בריתי עלי פיך, לרמוז כי הרשע המהפך דברי אלוקים חיים, ומגלה פנים בתורה שלא כהלכה, התורה נעשית לו סם מות, כרמוז בלשון ותשא, כמד\"א ישא פרעה וגו', וה\"נ תיבת ותשא היא מילתא דמשתמעא לתרי אנפי, דבאדם העושה רצון השי\"ת, ורוצה עכ\"פ ללכת בדרך האמת, הויא התורה אצלו סם חיים, ונושאת ראשו לגדולה, כי התה\"ק נותנת חיים וכבוד ללומדיה בעה\"ז ובעה\"ב. ולעומת זאת מי שלומד תורה לתכלית רע, כדי להביא ממנה ראיות לחזק ידי רשעים כופרים ומינים, נעשית התורה אליו לסם המות, ונושאת ראשו לרעה. ולזאת אחרי שאמר הכתוב ולרשע אמר אלקים מה לך לספר חקי, חזר לומר \"ותשא\" בריתי עלי פיך, להורות כי התורה עצמה שהוא לומד נעשית לו לסם המות, ומורידתו לבאר שחת, כרמוז בתיבת תשא שהיא לשון מיתה."},{"passage_id":"vayikru1_2a32f0ae_p14","passage_content":"ועתה נחזור ליישב כל הדקדוקים בפרשתן, דהנה מה שדרשו חז\"ל מדכתיב זאת תהיה תורת המצורע בהוייתה תהא, נראה לפרש בפשטות עפ\"י מה שאמרו ז\"ל (ערכין ט\"ו ע\"ב) כל המספר לה\"ר נגעים באים עליו, עיי\"ש. וידוע מה שכתב החובת הלבבות (שער הכניעה פ\"ז) כי בעוון לשון הרע מעבירים את המצוות של המספר לשון הרע לחשבון האיש שסיפר עליו לשון הרע, והעבירות של האיש שסופר עליו לה\"ר נזקפין לחשבון המספר. ובזה מפרשים את אמרות נעים זמירות ישראל (תהלים ס\"ט) ישיחו בי יושבי שער ונגינות שותי שכר, שהתאונן דהע\"ה שכל אותם המספרים לה\"ר עליו, הם אנשים ריקים שאין בהם לחלוחית מצות ואם כן אין הוא מרויח כלום בסיפור הלה\"ר, שהרי אין להם מצוות שיזכה בהם. אמנם אם המספר לה\"ר חוזר בתשובה, אזי שבים כל מצוותיו אליו, והכל על מקומו הראשון יבא. וכמו שפירש ק\"ז זלה\"ה בישמח משה כי תצא למלחמה על אויביך וגו' ושבית שביו כי הנה התורה ומצוות שנעשו שלא לשמה שובה הסט\"א, אלא שאח\"כ כשבא לשמה חוזר הכל אליו, וז\"ש כי תצא למלחמה תורה או תפלה ומע\"ט וכו', על אויביך כלומר עם אויביך שיש בו פניות, אעפ\"כ ונתנו ה' אלקיך בידיך לבסוף, כי מתוך שלא לשמה בא לשמה, ואף שהסט\"א שובה כעת, מ\"מ אח\"כ ושבית שביו מה ששבה כבר, כי צריך הוא להחזיר הכל, עכת\"ד ז\"ל."},{"passage_id":"vayikru1_2a32f0ae_p15","passage_content":"ובזה יבואר הכתוב זאת תהיה תורת המצורע, היינו המוציא שם רע, כמו שדרשו ז\"ל, ומשמיענו הכתוב דאף שעל ידי שסיפר לשון הרע איבד את מצוותיו, ובעבור עוונו באה עליו הצרעת, מ\"מ בעת שהוא בא להטהר ולחזור בתשובה, חוזרים אליו כל התורה והמצוות שנלקחו ממנו בעוונו. וזהו שדרשו ז\"ל מדכתיב זאת \"תהיה\" תורת המצורע בהוייתה תהא, כלומר שלא תאמר שבסבת עוונו אבדו ממנו לגמרי תורתו ומצוותיו, ושוב אינם שלו, לז\"א זאת \"תהיה\" תורת המצורע ביום טהרתו, כי הויה וקיום תהיה לתורתו ולמצוותיו בעת שהוא בא להטהר ולשוב על חטאו. וגם על פי מה שנתבארה בדברינו כוונת המד\"ר הה\"ד ולרשע אמר אלקים מה לך לספר חקי וגו', עפ\"י דברי חכמי האמת שכל המצוות והתורה שאדם לומד בעודנו רשע טורפין לו בפניו, והסט\"א נוטלים אותם בשביה, יתפרש מאה\"כ זאת תהיה תורת המצורע ביום טהרתו, בעת שהחוטא בא לטהר עצמו מעוונותיו, אזי תחזור להיות הויה לתורתו ולמצוותיו שאבדו לו בעודנו רשע ונשבו בידי החיצונים, ועתה בשובו מדרכו וחיה יחזור הכל אל הוייתו הראשון הוא צד הקדושה. ושפיר מובן בזה מה שהביא המדרש להכא את הכתוב ולרשע אמר אלקים מה לך לספר חקי, ומייתי ראיות שאין הקב\"ה חפץ בקילוסו של אדם רשע, משום שכל תורתו ומצוותיו ומע\"ט שלו הולכים אל הסט\"א סטרא דמותא, כרמוז בדברי הכתוב \"ותשא\" בריתי עלי פיך שהוא לשון מיתה כנ\"ל. אך אם ישוב על חטאיו ויטהר מכתמי נפשו, יותרו ממאסרם ביד הקליפות ויחזור הכל להוייתו ולמקומו הראשון הוא צד הקדושה."},{"passage_id":"vayikru1_2a32f0ae_p16","passage_content":"ואומרו והובא אל הכהן ולא כתיב ובא, נראה לפרש עפ\"י מה שכתב ק\"ז זלה\"ה בישמח משה פרשת בלק וז\"ל הקדוש, כי דבר מופת אימת אותו הנסיון ומשכיל על דרכיו ימצא, בעת שהאדם נכנע להשי\"ת, אז אם יביט בלבו באנשים צדיקים ימתקו מאד בעיניו, ובאנשי בליעל המה מגונים מאד בעיניו, וההיפך בהתרחקותם מהשי\"ת וגבה לבם, שאז יקוצו בצדיקים בטבע, אף אם אינו יודע אותם כלל אם הם צדיקים או רשעים וכו', עיי\"ש שהאריך בזה, ונתן טעם לדבר למה הטביע השי\"ת כן בטבע. ול\"נ לומר הטעם בפשטות, עפ\"י מה שאמרו ז\"ל (ב\"ק צ\"ב ע\"ב) מנא הא מילתא דאמרי אינשי מטייל ואזיל דיקלא בישא גבי קינא דשרכא (כלומר דרך דקל רע לגדול בצד אילן סרק) א\"ל דבר זה כתוב בתורה שנוי בנביאים ומשולש בכתובים וכו' ר\"א אומר לא לחנם הלך זרזיר אצל העורב אלא מפני שהוא מינו, ע\"כ. הרי מבואר שכך הוא טבע הבריאה שכל דבר מושך לשרשו, ומהאי טעמא הזרזיר נמשך אצל העורב, כי שורשם אחד הוא שורש הטומאה. וזהו הטעם שהרשעים ישנאו את הצדיקים שנאה עזה מבלי שהם יודעים אותם כלל, כי כך הוא הטבע (ועי' בדברינו לעיל פרשת ויקרא מ\"ש בענין זה)."},{"passage_id":"vayikru1_2a32f0ae_p17","passage_content":"ובזה יובן דהנה המצורע הזה בטרם נתרפא מצרעתו, מחמת שעוד בו טומאתו, ומצואת עוונותיו לא רוחץ, עדיין לא היה נמשך להתקרב אל הכהן הצדיק, אדרבה היה שונא אותו ומתרחק מעליו, כשנאת הרשעים את הצדיקים מבלי טעם, אבל ביום טהרתו, שעשה תשובה על חטאיו וטהר גברא, אזי מכיון ששרשו ממקור הקדושה והטהרה, הריהו נמשך מעצמו אל שורש הקדושה והטהרה שרשו של הכהן הצדיק. וזהו שאמר הכתוב והובא אל הכהן, שהוא נמשך אל הכהן, מחמת שטבעו מושכו ומנהיגו אל הכהן, ששרשם אחד הוא."}]},{"dvar_torah_id":"vayikru1_bfd36a92","title":"תורת המצורע והשפעת הכוונה","summary":"בפרשת מצורע מזהיר ה' את הרשע על חוסר כוונה בלימוד התורה. אמירת י\"ג מדות ללא כוונה אינה מועילה, והקשר לצדיקים הוא הכרחי לתיקון. הרשע מתרועע עם עושי רשעה, ולכן אין תועלת בתורתו.","contents":[{"passage_id":"vayikru1_bfd36a92_p1","passage_content":"באופן אחר יתבאר הא דאיתא במד\"ר זאת תהיה תורת המצורע הה\"ד ולרשע אמר אלקים מה לך לספר חקי ותשא בריתי עלי פיך וכו' לפיכך משה מזהיר את ישראל זאת תהיה תורת המצורע, וצ\"ב שייכות מקרא זה לפרשת מצורע."},{"passage_id":"vayikru1_bfd36a92_p2","passage_content":"ב) גם בדברי הפסוק בתהלים דמייתי במדרש יל\"ד, שכפל ענין אחד במלות שונות, דקאמר מה לך לספר חקי, והדר אמר ותשא בריתי עלי פיך, ולכאורה היינו הך, כמו שפירש\"י ז\"ל דבריתי היינו תורתי."},{"passage_id":"vayikru1_bfd36a92_p3","passage_content":"ג) עוד יש להתבונן להלן באותו ענין, שנתן הכתוב טעם לאומרו מה לך לספר חוקי וגו', משום שאתה שנאת מוסר ותשלך דברי אחריך אם ראית גנב ותרץ עמו ועם מנאפים חלקך. ולכאורה מה שאמר ואתה שנאת מוסר ותשלך דברי אחריך זהו טעם מספיק לתיעוב תורתו של הרשע. ולאיזה צורך האריך עוד בפירוט מעלליו, כי מתרועע הוא עם גנבים ואת מנאפים הוא נמנה, הלא דבר הוא."},{"passage_id":"vayikru1_bfd36a92_p4","passage_content":"ונראה לומר בביאור הענין, דהנה בספה\"ק ארץ החיים על תהלים ביאר במאה\"כ ותשא בריתי עלי פיך, דקאי על שלש עשרה מדות של רחמים, והוא עפ\"י מה דאיתא בגמרא (ר\"ה י\"ז ע\"ב) ויעבור ה' על פניו ויקרא אמר ר' יוחנן מלמד שנתעטף הקב\"ה כשליח ציבור והראה לו למשה סדר תפלה אמר לו כל זמן שישראל חוטאין יעשו לפני כסדר הזה ואני מוחל להם. ולכאורה קשה הלא בכל יום עושים כך, ואילו היה הקב\"ה מוחל עוונותיהם כבר היה בא משיח, אך אינו אומר כשישראל יאמרו כסדר הזה אלא יעשו כסדר הזה, והכוונה מה הוא רחום אף אתה היה רחום וכו', וע\"ד שאמרו ז\"ל (סוטה י\"ד ע\"א) הדבק במדותיו, וז\"ש ותשא בריתי דהיינו י\"ג מדות, עלי פיך ולא במעשה, ובזה אני איני חפץ, ואתה שנאת מוסר התורה שכולה יראת שמים, עכ\"ל הארץ החיים."},{"passage_id":"vayikru1_bfd36a92_p5","passage_content":"אמנם הנה בפירוש אומרו יעשו לפני כסדר הזה כבר נחלקו קמאי, אם הכוונה על עשייה בפועל ממש, כפירוש הארץ החיים, או סגי בקריאת י\"ג מדות של רחמים מעוטפים בטלית ומיד הקב\"ה מוחל להם. ובספה\"ק בני יששכר (מאמרי חדש אלול מאמר ב' אות ד') האריך בענין זה, והביא מה שפירש ההפלאה ז\"ל בסליחה א-ל הורית לנו לומר שלש עשרה דממדה ראשונה שבשלש עשרה מדות שהיא א-ל נשמע דסגי באמירה בעלמא, שהרי במדה זו לא שייך עשייה בפועל להדמות אליו יתברך מה הוא א-ל וכו', דלא איש א-ל, וממנו נשמע אל שאר המדות, דנמי סגי באמירה בעלמא. וז\"ש \"א-ל\" הורית לנו \"לומר\" שלש עשרה, דממדת א-ל הוראה הוצאת לשאר המדות שדיין באמירה בלבד, עכ\"ד ההפלאה ז\"ל. ומדברי רש\"י ז\"ל בר\"ה שם מבואר דאיהו נמי סבר דבאמירת הי\"ג מדות סגי, שכתב וז\"ל ברית כרותה לי\"ג מדות שאם יזכירום ישראל בתפלת תעניתם אינן חוזרות ריקם, עכ\"ל. ואח\"כ כתב הבנ\"י להקשות על דברי ההפלא\"ה ז\"ל ממדרש רבותינו (ב\"ר פע\"ט י') הביאו רש\"י ז\"ל בפרשת וישלח עה\"ת ויקרא לו א-ל אלקי ישראל אמר לו הקב\"ה ליעקב אני א-ל בעליונים ואתה א-ל בתחתונים. ולפי זה נדחתה ראית ההפלאה ז\"ל ממדת א-ל, דסגי באמירת הי\"ג מדות, דלעולם אימא לך שכוונת אומרו יעשו לפני כסדר הזה היינו עשייה בפועל ממש, ואף במדת א-ל שייך לומר מה הוא א-ל וכו', כמבואר דיש מציאות בעולם שיהיה האדם נקרא א-ל, עכת\"ד הבני יששכר ז\"ל, עיי\"ש שהאריך בזה טובא."},{"passage_id":"vayikru1_bfd36a92_p6","passage_content":"ולי נראה דלא קשה מידי מדברי רבותינו במדרש על ההפלאה ז\"ל, דהתם במדרש מבואר שהקב\"ה קראו ליעקב א-ל, אבל זה ודאי שאנו אין בכוחינו לעשות מדה זו בעצמינו, ולא שייך כלל לפרש יעשו לפני כסדר הזה על עשיה בפועל מה אתה א-ל וכו', דלא יתכן לומר כן, אלא ודאי שראיית ההפלאה ז\"ל במקומה עומדת וההכרעה כמותו, דהכוונה על אמירת שלש עשרה מדות של רחמים, ורשיז\"ל נמי סבירא ליה הכי כמו שנתבאר. אמנם זה ברור דאף לשיטתייהו דסגי באמירה בעלמא, מ\"מ ודאי שהאמירה צריכה להיות בכוונה ובפנימיות הלב, ולא די בנענוע השפתיים בלבד, ולבו בל עמו. ולפי זה אף לדעת הסוברים דסגי באמירת שלש עשרה מדות, אפ\"ל כפירוש בעל ארץ החיים הנ\"ל, דאומרו ותשא בריתי עלי פיך קאי על הי\"ג מדות, שהכתוב מתאונן על הרשע ותשא בריתי עלי פיך, כלומר שאתה אומר הי\"ג מדות עלי פיך, היינו בשפתיך בלבד, ולבך לא נכון עמך, ומה תועלת יש בכך."},{"passage_id":"vayikru1_bfd36a92_p7","passage_content":"ובדרך זו נבא אל הביאור, בהקדם מה שנתבאר בדברינו לעיל בפרשה זו בארוכה, מה שכתב בסה\"ק נועם אלימלך לפרש מאמרם ז\"ל מחשבה טובה הקב\"ה מצרפה למעשה, דהול\"ל מחשבה למעשה, אמנם הנה יש אשר יעסוק האדם בתורה או במצוה והוא מכוון בהם לאיזה פניה, ולעומת זאת יש אשר הצדיק משתוקק לעסוק בתורה או לקיים מצוה ונאנס ולא עשאה, אזי הקב\"ה מצרף עובדא זו למחשבת הצדיק, ונעשה מהם מצוה שלימה במעשה ובמחשבה, עכדה\"ק. אכן תיקון זה לא יתכן שיעשה אלא ע\"י התדבקות בצדיקים, כי אז הצדיק משפיע אליו להעלות תורתו ומצוותיו לשרשם, וכאשר נתבאר לעיל בדברינו באורך טעמא דמילתא משם תדרשנו, משא\"כ אם אין לו התדבקות אל הצדיק אין תועלת בתורתו ובמצוותיו. וזה יהיה ביאור הכתוב ולרשע אמר אלקים מה לך לספר חקי, זו תורה, ותשא בריתי עלי פיך הם הי\"ג מדות של רחמים, כמו שפירש בארץ החיים, והכוונה דכיון שאמירתך היתה בפה בלבד בלא כוונת הלב לא חפץ ה' בהם. אמנם אכתי היה אפשר שיהיה להם תיקון ע\"י ההתדבקות בצדיקים, וצירוף מחשבותיהם הטובות אל העשיה שלך שהיתה בלי כוונה, ברם דא עקא שאין לך התדבקות אל הצדיקים, אלא להיפך אתה חבר לעושי רשעה, אם ראית גנב ותרץ עמו ועם מנאפים חלקך, ובאופן זה אין להקב\"ה חפץ בתורתך ובאמירת השלש עשרה מדות. וזה מדוייק גם באומרו מה \"לך\" לספר חקי, \"לך\" דייקא בלא התחברות לצדיקים אין תועלת בלימוד התורה."}]},{"dvar_torah_id":"vayikru1_9bb08b42","title":"","summary":"","contents":[{"passage_id":"vayikru1_9bb08b42_p1","passage_content":"[שנת תרצ\"ה לפ\"ק בק\"ק סאטמאר יצ\"ו]"}]},{"dvar_torah_id":"vayikru1_bc85df64","title":"תשובה ונגעי הצרעת","summary":"הכהן רואה נגעי אחרים כדי לעורר תשובה על חטאיו. כאשר נרפא נגע הצרעת, יש בכך סימן לתשובה שלמה של הצרוע. הראיה מהכהן, שהוא צדיק, מעידה על קבלת תשובתו של הנוגע.","contents":[{"passage_id":"vayikru1_bc85df64_p1","passage_content":"ויצא הכהן אל מחוץ למחנה וראה הכהן והנה נרפא נגע הצרעת מן הצרוע. יל\"ד מה הוצרך הכתוב לומר וראה \"הכהן\" דלכאורה הוה סגי שיאמר וראה והנה נרפא וגו', ואנחנו כבר נדע שבכהן הכתוב מדבר, דכתיב ברישא ויצא הכהן אל מחוץ למחנה."},{"passage_id":"vayikru1_bc85df64_p2","passage_content":"ב) עוד דקדקו המפרשים במאה\"כ והנה נרפא נגע הצרעת מן הצרוע, דתיבות מן הצרוע יתירי נינהו, דפשיטא שמן הצרוע נרפא הנגע ולא ממקום אחר, ומאי קמ\"ל בהא."},{"passage_id":"vayikru1_bc85df64_p3","passage_content":"ואפ\"ל ביאור הכתוב בהקדם מה שפירש הבעש\"ט הקדוש זי\"ע מאמר התנא (נגעים פ\"ב מ\"ה) כל הנגעים אדם רואה חוץ מנגעי עצמו, דה\"פ כל החטאים ונגעי הנפש שהאדם רואה בחוץ אצל אחרים הם מנגעי עצמו, כלומר שגם הוא נכשל בעבירות אלו או בכיוצא בהם, על כן הראו לו מן השמים אותם העבירות אצל אחרים, כדי להעירו ולעוררו כי אף הוא אינו נקי מחטאים אלו, וזה לך האות שהוא רואה מומי אחרים וחסרונותיהם, ואילו היה הוא מנוקה מעון וכל עול לא נמצא בו, לא היה רואה חסרונותיהם של אחרים כי אם מעלותיהם. וידוע גם שפ\"א ראה הבעש\"ט הקדוש אדם אחד שנכשל בחילול שבת, והחל הוא ז\"ל לפשפש במעשיו, באמרו מדוע נזדמן לו לראות אדם מישראל כשהוא חוטא, ונזכר כי הוא שמע בזילותא דצורבא מרבנן ושתק ולא מיחה, ואמר שע\"כ הראוהו מן השמים עון חילול שבת, משום שהוא מעין אותו עון דת\"ח הוא בחי' שבת, ובזיון ת\"ח הרי הוא בחי' חילול שבת."},{"passage_id":"vayikru1_bc85df64_p4","passage_content":"והנה לפי זה הן בעת אשר יבא אל הכהן האיש אשר פרח בו הנגע, וראה הכהן והנה הנגע בעור הבשר, ישתומם הכהן למראה עיניו, ולבו יהמה בקרבו ועשתונותיו נבוכו, כי הלא מאת ה' היתה זאת לו, להראותו אדם מישראל אשר בו הנגע, הבא כעונש על עוון, אין זה כי אם שהכהן עצמו נכשל באיזה עבירה, והאלקים אנה לידו לראות את הנגע, כדי שממנו יתבונן בנגעי נפשו ויתעורר לשוב. וכאשר יתבונן הכהן בזה, יראה ורעד תבא בו ותכסהו פלצות, וחישב עם קונהו חשבון נפשו, ויפשפש במעשיו לראות בשל מה הצער הגדול הזה, להלקות אדם מישראל בנגעים בסיבת עוונותיו. וביותר תגדל מרירותו ומשנה שברון שברו, בעת העלותו על לבו, כי פן ואולי אדם זה שנלקה בנגעים נקי הוא מעוון, אלא שהוא מסובל ביסורים בסיבת חטאי הכהן, כדי לרמוז לו שיחזור בתשובה. ועל זאת ישוב הכהן ויבכה וישב בשקו ובתעניתו כל ימי אשר הנגע באותו אדם, באמרו אין זאת כי אם עוונותי גרמו לו להתייסר ביסורים. ככה יעשה הכהן כל הימים, עד אשר יתרפא הצרוע מצרעתו, או אז יוודע לכהן כי סר עוונו וחטאתו נתכפרה, וזה לך האות ששוב אין הנגע נראה בו. אכן בכגון דא ליכא הוכחה אלא שנתקבלה תשובתו של הכהן, ועל כן אינו רואה שוב את הנגע באותו אדם, אבל מנא לן שאף האיש אשר נראה בו הנגע עשה תשובה שלימה על עוונותיו, שמא עדיין לא שב, ועוד בו נגעו, ומה שאין הכהן רואה את הנגע, אין זה אלא משום שמן השמים העלימו ממנו מלראות את הנגע, לצד שכבר עשה הכהן תשובה שלימה, וסר עוונו, על כן אין עיניו רואות את הנגע, ומ\"מ עדיין הספק במקומו עומד, ולא נודע אם באמת נרפא ממנו הנגע כליל, או עוד טומאתו בו."},{"passage_id":"vayikru1_bc85df64_p5","passage_content":"אכן הנה הך כללא דמתאמר משמיה דהבעש\"ט הק' זי\"ע, דכל הנגעים אשר האדם רואה חוצה לו הם מחמת נגעי עצמו, לא שייך כי אם בבני אדם פשוטים, אבל לא כן הוא בכהנים הנגשים אל ה', הלא המה הצדיקים יחידי סגולה שבדור, שעליהם מוטל להוכיח את ישראל ולעוררם לשוב על עבירות שבידם, דלאותם צדיקים מראים מן השמים חסרונות ונגעי בתי הנפש אצל בני אדם אחרים, אף אם אין באותם הצדיקים אפילו שמץ מאותם עוונות, לא מינייהו ולא מקצתיהו. ולפיכך אם נגע צרעת נראה באדם מישראל והובא אל הכהן שהוא מיחידי סגולה שבדור, אשר אליו נגלו עוונות בני אדם, אף שהוא נקי ואין בו דופי, אזי אם יראה אותו הכהן הצדיק כי כבר נרפא הנגע, הרי זה מוכיח ועד כי אמנם חזר האיש אשר בו הנגע בתשובה, ולפיכך נרפא הנגע. דליכא למימר שבאמת עדיין לא שב, אלא שהעלם יעלימו מן הכהן צדיק הדור מלראות נגעו, שהרי לצדיק הדור מראים נגעי אחרים אף אם נקי הוא מעוון וכל עול לא נמצא בו, ואילו לא היה הצרוע חוזר בתשובה שלימה לא היה הנגע נעלם מעיני הצדיק."},{"passage_id":"vayikru1_bc85df64_p6","passage_content":"ועל פי דברים אלו יתבאר מה שכפל הכתוב לומר וראה \"הכהן\" וגו', לרמוז על הכהן שהוא צדיק הדור, שאם הוא רואה והנה נרפא נגע הצרעת וגו', אזי הדבר ברור כי אמנם נתקבלה תשובתו של המצורע, וסר ממנו הנגע לגמרי. וזהו שאמר הכתוב והנה נרפא נגע הצרעת \"מן הצרוע\", כלומר שלא יעלה על לבך לומר כי אולי עדיין לא נרפא הנגע לגמרי, אלא שלמראה עיני הכהן נדמה כאילו כבר נרפא נגעו, כדי שלא להראותו נגעי אחרים ועוונותיהם, לזאת אמר שראהו הכהן הוא הצדיק מיחידי סגולה שבדור, אשר אליו נגלו מומי אחרים, כדי שידע להוכיחם ולהחזירם למוטב, וכיון שצדיק הדור כבר אינו רואה בו את הנגע, הרי זה ודאי שכבר נרפא נגע הצרעת \"מן הצרוע\", כלומר דלא רק למראית עין נדמה כאילו נרפא הנגע, אלא אמת נכון הדבר שכבר סר הנגע מן הצרוע לגמרי, משום שעשה תשובה כהוגן, ונתקבלה תשובתו לפני ממ\"ה הקב\"ה."}]},{"dvar_torah_id":"vayikru1_9126f266","title":"חיזוק לישראל בעיקבתא דמשיחא","summary":"המדרש מדבר על הימים בהם ישראל יהיו ללא אלקי אמת, וכיצד יש לחזק את הידים הרפות. עוסק בקשר בין הזיבה לחטא אדה\"ר, ובחשיבות התפילה והתחנונים מבלי לדחוק את הקץ. יש להחזיק באמונה ובקדושה גם בזמנים קשים.","contents":[{"passage_id":"vayikru1_9126f266_p1","passage_content":"ואשה כי יזוב זוב דמה ימים רבים וגו' במד\"ר (פי\"ט ה') זש\"ה (דה\"י ב' ט\"ו) וימים רבים לישראל ללא אלקי אמת וללא כהן מורה וללא תורה, ומי נתנבא הפסוק הזה עזריה בן עידו הנביא אמר עתידין ימים לבא לישראל ללא אלקי אמת כיון ששמעו אותו הדור כן רפו ידיהם, יצתה ב\"ק ואמרה (ישעי' ל\"ה) חזקו ידים רפות וכו', ידים שהן נראות כאילו רפות, וברכים כושלות אמצו שהן נראות כאילו כושלות. אמרו לנמהרי לב (שם) וכו' ר' יהושע בן לוי אמר כגון אלו שהן דוחקין את הקץ, שנאמר (בראשית כ\"ד) ותמהר ותורד כדה, חזקו אל תיראו, לפי שהיו ישראל אומרים היתה לי דמעתי וגו' באמור אלי כל היום איה אלקיך, יצתה בת קול ואמרה להם הנה אלקיכם נקם יבא, מי שעתיד לשלם גמולן של אוה\"ע וכו' הוא יבא ויושיעכם. וימים רבים לישראל, וכי ימים רבים הם אלא ע\"י שהיו ימים של צער לפיכך הוא קורא אותן רבים וכו', והדין פסוקא ואשה כי יזוב זוב דמה ימים רבים, תני רבי חייא ימים שנים רבים שלשה וכו', ר' יוחנן בשם ר' אליעזר בנו של ריה\"ג ומה האשה הזו ע\"י שפירשה שנים שלשה ימים התורה קורא אותה נדה, אנו שפירשנו מבית חיינו ומבית קדשינו ותפארתינו כמה ימים וכמה שנים כמה קיצים וכמה עיבורים על אחת כמה וכמה, ע\"כ. והמדרש הזה אומר דרשוני וחיו, חדא דמה שיוכי כל דרשות אלו לענינא דזבה, ועוד צריך ביאור דנקט שני מקראות שנאמרו בזמנים שונים ודורשן כאחת, שהרי נבואת עזריה בן עידו וימים רבים לישראל וגו' נאמרה בימי אסא מלך יהודה, ואילו חזקו ידים רפות אמר ישעי' הנביא על לעתיד, וכיצד כוללן המדרש בחדא מחתא (ועיין ביפה תואר מה שכתב בזה)."},{"passage_id":"vayikru1_9126f266_p2","passage_content":"ב) היפה תואר הקשה על הא דדרש אמרו לנמהרי לב אלו שהן דוחקין את הקץ, וא\"ת והא אלה רשעים הם דהא אמר בשלהי כתובות ובמדרש חזית (שהש\"ר פ\"ב י\"ח) בפסוק השבעתי אתכם שישראל מושבעין ועומדין שלא ידחקו את הקץ, ותירץ דהכא מיירי שדוחקין את הקץ בתפלה ובתחנונים. ואעפ\"י שרש\"י פירש שם שלא ידחקו שלא ירבו בתחנונים על כך יותר מדאי אין נראה כן וכו', גם מסברא נראה שאין איסור בהרבות תחנונים, שהרי אנו מתפללים תמיד על הגאולה, עכת\"ד היפה תואר ז\"ל. אמנם אין נראה לדחות דברי רש\"י ז\"ל לגמרי, וכבר ביאר ק\"ז זלה\"ה (בישמח משה על שה\"ש הנדמ\"ח) שכוונת רש\"י ז\"ל שאסור לדחוק את הקץ ע\"י השבעת השמות הקדושים, וכ\"כ החתם סופר זלה\"ה, ובספרי (ויואל משה מאמר ג' שבועות סימן כ\"ז) כתבתי שקשה להעמיס פירושם בדברי רש\"י ז\"ל, שכתב שלא ירבו בתחנונים יותר מדאי ולא הזכיר כלל השבעת שמות. ופירשתי כוונת רש\"י ז\"ל ע\"ד המבואר בפרק הפועלים (ב\"מ פ\"ה ע\"ב) שר' חייא ובניו היה בכח תפלתם להכריח את ביאת המשיח שלא בזמנו, ותפלה כזו היא בגדר דחיקת הקץ ואנו מושבעים ועומדים עליה. ולפי פירושינו שאסור לדחוק את הקץ בתפלות ובתחנונים שבכוחם להכריח את הגאולה, א\"כ הדרה קושית היפ\"ת ז\"ל לדוכתא, דדרש אמרו לנמהרי לב אלו שהן דוחקין את הקץ, אטו ברשיעי עסקינן דעברי אשבועה דרחמנא, שהשביע את ישראל שלא ידחקו את הקץ."},{"passage_id":"vayikru1_9126f266_p3","passage_content":"ג) גם מה דמייתי המדרש ראיה דנמהרי לב הם הדוחקים את הקץ מדכתיב ותמהר ותורד כדה אין מובן, דמשמע מדבריו כי ממקרא זה יש ראיה לדרשתו, ולכאורה מאי ראיה היא זו, אם משום שנאמר בה לשון מהירות, הלא מקראות רבים יש שנאמר בהם לשון מהירות, ומדוע נקט מקרא זה דוקא."},{"passage_id":"vayikru1_9126f266_p4","passage_content":"ד) יל\"ד בדברי הכתוב וימים רבים לישראל ללא אלקי אמת, דהוה סגי למיכתב וימים רבים וגו' ללא אלקים, ואנחנו נדע כי אלקים הוא אמת, דחותמו של הקב\"ה אמת."},{"passage_id":"vayikru1_9126f266_p5","passage_content":"ולבא לביאור הענין נקדים ליישב מה שכלל המדרש שני הפסוקים יחד, אף שנאמרו בזמנים שונים (קושיא א'), דהנה המפרשים ביארו מה שנתנבא עזריה הנביא לפני אסא המלך וימים רבים לישראל ללא אלקי אמת, שהכוונה על זמן רחבעם ואביה שהיו ישראל עובדים ע\"ז, ובעת שמלך אסא חזרו ישראל בתשובה, וכ\"פ רש\"י ז\"ל וימים רבים וגו' עד שבאת אתה. והנה בנבואתו של עזריה שם כתיב ואתם חזקו ואל ירפו ידיכם, והוה קשיא ליה לבעל המדרש דכיון שכבר עשו ישראל תשובה בימי אסא מדוע רפו ידיהם, עד שהוצרך לעודדם ולחזקם מרפיון ידים, ומשום הכי דרש שיש כאן במקרא זה גם נבואה על הדורות האחרונים שלפני ביאת המשיח, שיהיו ישראל ללא אלקי אמת ללא כהן מורה וללא תורה, והיתה קבלה ביד בעל המדרש כי מקרא זה נאמר על הדורות הללו, וכאשר בעינינו ראינו בדור שפל זה. וכיון ששמעו ישראל מה יגיע אליהם בטרם ביאת המשיח רפו ידיהם, ולפיכך נאמר להם ואתם חזקו ואל ירפו ידיכם, ולפיכך הביא נמי הך קרא דישעי' חזקו ידים רפות שנאמר לעודד את הדורות שבעיקבתא דמשיחא, לבל יפול רוחם מגודל השפלות, ושפיר שייכי הני קראי להדדי, דתרווייהו בענין אחד נאמרו."},{"passage_id":"vayikru1_9126f266_p6","passage_content":"ובדרך זה יתבאר גם מה שנתנבא עתידין ימים לבא לישראל ללא אלקי אמת (קושיא ד'), דהנה איתא במדרש (ויקרא רבה פרשה כ\"ז י\"א) א\"ר לוי אף גוג ומגוג לעתיד לבא עתיד לומר כן שוטים היו הראשונים שהיו מתעסקים בעצות על ישראל ולא היו יודעים שיש להם פטרון בשמים אני איני עושה כן אלא בתחלה אני מזדווג לפטרון שלהם ואח\"כ להם שנאמר יתיצבו מלכי ארץ וכו'. והקשו המפרשים וכי כל כך טפשים הם שיצאו להלחם בהקב\"ה, הלא ממזרח שמש עד מבואו מהולל שם ה', והכל יודעים את כבודו ואת גדלו, ואין להעלות על הדעת שיחשבו אוולת כזאת. ואם אינם מאמינים כלל בהקב\"ה, מה שייך לומר שיזדווגו לפטרון שלהם, בעוד שהם כופרים ואין מאמינים שיש להם פטרון. ופירשו דהכוונה שיכניסו מחשבות מינות בלבות בני ישראל להפרידם מתורת ה' ומקיום המצוות, ובכך הרי הם נלחמים בהקב\"ה כביכול. וזו היא מלחמת גוג ומגוג עם מלך המשיח, להעביר את בני ישראל על אמונתם ודתם, וכבר התחילו חיילותיו להתייצב על ה' ועל משיחו, וזו היא ההכנה למלחמת גוג ומגוג, והמלך המשיח יעמוד כנגדם ויכניעם ב\"ב."},{"passage_id":"vayikru1_9126f266_p7","passage_content":"והנה איתא בגמרא (סנהדרין צ\"ז ע\"א) דור שבן דוד בא בו וכו' ונהפכה כל המלכות למינות ואין תוכחה מסייע ליה לר' יצחק דאר\"י אין בן דוד בא עד שתתהפך כל המלכות למינות אמר רבא מאי קרא (ויקרא י\"ג) כולו הפך לבן טהור הוא, ע\"כ. וצ\"ב להבין על איזה מלכות כוונתו, אם על מלכות האומות, א\"כ מאי קאמר ואין תוכחה הלא אין שייך בהו כלל ענין תוכחת כדכתיב (משלי ט') אל תוכח לץ. ובזקוקין דנורא על התנדב\"א (ח\"ב פט\"ז) פירש אומרם ואין תוכחה שאין בר ישראל יוכל להתווכח עמהם להשיב להם תשובה ניצחת כהוגן להוציא המינות מלבם, עכ\"ל. וכאשר רואים בעוה\"ר שאין בכוחינו להוציא את המינות מלב האפיקורסים. אמנם גם לפי זה אכתי א\"א לומר דקאי על אומות העולם, שהרי יהיב סימנא דכאשר תהפך המלכות למינות וכו' יבא בן דוד, ואי באוה\"ע קא מיירי מאי איכפת להו בביאת המשיח, הלא אין הם מצפים אליו ואין הוא בא אליהם, ואף שאמה\"כ אליו גוים ידרושו (ישעי' י\"א), היינו אחרי שיבא מלך המשיח, ויהיה תיקון העולם, אבל קודם לביאתו לא שייך גבייהו כלל, ואיך תתלה ביאתו במה שתתהפך מלכות העכו\"ם למינות וכו'. ותו דאם כוונת המאמר על כל האומות, הול\"ל מלכיות לשון רבים, ואם נתכוון לאומה אחת לא נתפרש על איזה אומה קאי. וע\"כ נראה לומר דהנה חכז\"ל ברוח קדשם רמזו בדרשותיהם דברים רבים על העתיד, ובטרם בוא הזמן שעליו מוסבים דבריהם לא ידעו ולא הבינו פירוש דבריהם על בוריו, עד שבא אותו הזמן שעליו רמזו ונודע למפרע עומק כוונתם. והכי נמי נ\"ל שחכז\"ל התנבאו במאמר זה על תוקף הגלות בעיקבתא דמשיחא, אשר בעוה\"ר תעמוד טרם ביאת המשיח גלות של מלכות המינות של ישראל, ועתידה כל אותה מלכות להתהפך למינות, כאשר אנחנו רואים בעינינו שכל הנטפלים אליהם נהפכו למינות, ואין תוכחה שאין בנו כח להוציא את המינות מלבם, והשתא כל המאמר מדבר בישראל."},{"passage_id":"vayikru1_9126f266_p8","passage_content":"אמנם עדיין צ\"ב להבין כיצד נרמז זאת בדברי הכתוב כולו הפך לבן טהור הוא, ורש\"י ז\"ל פירש כולו הפך לבן טהור הוא כשפשט הנגע בכל העור כך כשנהפכה כל המלכות למינות תבא גאולה. אמנם אכתי צ\"ב כיצד נרמז במקרא זה שתתהפך למינות, ונראה עפ\"י דברי ק\"ז זלה\"ה בישמח משה פרשת תזריע עה\"פ כולו הפך לבן טהור הוא, לפי מה שנתבאר בליקוטי תורה מהאר\"י ז\"ל ר\"פ בלק שבלעם גלגול לבן ועיי\"ש מה שפירש עה\"פ תמות נפשי מות ישרים שם לבן גלגול נבל ושם נבל הוא נ'בל ב'לעם ל'בן וכו'. ועיין בליקוטי ישעיה עה\"פ שאי סביב עיניך וראי כלם נ'קבצו ב'או ל'ך ר\"ת נבל וז\"ל, אמנם אחר שנתקן בנבל משם התחיל לתקן, עיי\"ש. והנה עפי\"ז יבואר כי לבן התחלת התיבה קודם הלמ\"ד ואח\"כ הבי\"ת, ובלעם הבי\"ת קודם ואח\"כ הלמ\"ד להיפך, ובגלגול הזה עדיין לא נטהר, אבל בנבל התיבה כולה מהופכת, ואז נטהר והתחיל התיקון, וז\"ס כולו הפך לבן, כולו דייקא, אז טהור הוא, עכ\"ד ק\"ז זלה\"ה."},{"passage_id":"vayikru1_9126f266_p9","passage_content":"ובדרכו אלך לפרש מאמרם ז\"ל שתתהפך כל המלכות למינות, ויליף לה מקרא דכולו הפך לבן טהור הוא. דהנה רש\"י ז\"ל פירש מאה\"כ בשירת האזינו (דברים ל\"ב) בגוי נבל אכעיסם, אלו הכופרים בהקב\"ה וכן הוא אומר (תהלים י\"ד) אמר נבל בלבו אין אלקים, ע\"כ. וכן איתא בספרי (פ' האזינו) בגוי נבל אכעיסם אלו המינים וכו'. והנה שירת האזינו כוללת כל העתידות שיעברו על ישראל עד ביאת המשיח (כמ\"ש הרמב\"ן ז\"ל שם) ולזאת רמז הכתוב באומרו בגוי נבל אכעיסם שתעמוד בעיקבתא דמשיחא מלכות המינות הכופרת בהקב\"ה. והנה בתחלה היה לבן הארמי מקור השקר, אך הוא לא היה מין אלא עובד ע\"ז, שהרי לטעם זה גנבה רחל את התרפים ממנו כדי להפרישו מע\"ז, כדאיתא במד\"ר (פע\"ד ד') ואילו היה מין וכופר לא היתה מועילה כלום בגניבת התרפים. אכן בדור האחרון הזה דור עיקבתא דמשיחא נתהפך כח השקר של לבן למינות הגרוע מן הכל, כמ\"ש הרמב\"ם ז\"ל שמינות גרוע הרבה מע\"ז (עי' ברמב\"ם פ\"ג מהל' תשו'). והנה מינות מכונה בשם נבל כמ\"ש, ונתהפך כח השקר והע\"ז של לבן לנבל, וע\"כ רמזו חז\"ל שעתידה המלכות להתהפך למינות במאה\"כ כולו הפך לבן טהור הוא, כלומר בעת שלבן נתהפך לגמרי ונעשה ממנו נבל שהוא מינות, כדכתיב בגוי נבל אכעיסם, אז טהור הוא, כלומר שמתחילים לבא ימי הטהרה, שיהיו אחר ביאת המשיח, כדכתיב וזרקתי עליכם מים טהורים וטהרתם."},{"passage_id":"vayikru1_9126f266_p10","passage_content":"ובזה נבא לפרש הכתוב וימים רבים לישראל ללא אלקי אמת, דהנה הרמב\"ם ז\"ל בפיה\"מ פ' חלק כתב שההגשמה גרועה הרבה יותר מכפירה, שהכופר כופר הכל, אבל המגשם גרוע ממנו שמגשם להשי\"ת ח\"ו (ועי' בספר הי\"ד פ\"ג מהל' תשובה ה\"ז ובלחם משנה שם), וכן הוא בעוה\"ר בדור הזה שהרבה שומרי תורה ומצוות תולים לאמר על מינות ואפיקורסות שהוא השפעה אלקית, דבר שהוא שקר גמור, וזה גרע מן הכל שמשקרים בהשי\"ת לומר שקרים אלו, והוא היפך התורה והיפוך האמת אשר שנא ה' בתכלית בלי שום ספק. וז\"ש הכתוב וימים רבים לישראל ללא אלקי \"אמת\" (קושיא ד') שתולים את השקר בהקב\"ה ולא את האמת, וכיון ששמעו אותו הדור כך נבהלו מאד ורפו ידיהם, כי אותו הדור היו דבוקים בהשי\"ת שחותמו אמת, וברחו לגמרי מנטיה של שקר, ותלו הכל בהשגחתו יתברך, ועל כן כשמעם מה יארע לישראל בדור עיקבא דמשיחא שיזייפו ויסלפו שקרים ודברי מינות בהקב\"ה רפו ידיהם ממצב מר כזה, ויצתה בת קול ואמרה חזקו ידים רפות שיתדבקו בהשי\"ת בדרך האמת, ויתחזקו לבל יפלו בדרך השקר, ואז יחזקם הקב\"ה לבל יפלו ויכשלו."},{"passage_id":"vayikru1_9126f266_p11","passage_content":"ולבאר שייכות מדרש זה לפרשת זבה, נראה דהנה ידוע אשר הזיבה באה מחמת חטא אדה\"ר, ובשעת מ\"ת פסקה מהן, ואחר מעשה העגל חזרה אליהן, ועתידה היא להבטל לעת\"ל, שאז יתבטלו כוחות הטומאה, וגם הנגעים והזיבה יפסקו ויתבטלו. וא\"כ נמצא כי הזיבה תלויה בגלות, שהרי כאשר נזכה להגאל שוב לא תהיה הזיבה, וע\"כ מייתי דרשות אלו להכא, כשם שמביא בפרשת נגעים על הד' גליות, ובעת הגאולה עתיד הקב\"ה לטהר את ישראל. וליישב מה שדרשו אמרו לנמהרי לב אלו הדוחקין את הקץ, והקשה היפ\"ת דא\"כ הוה ליה לקרותן רשעים שהם עוברין על שבועת הקב\"ה בדחיקת הקץ (קושיא ב'). נראה בהקדם לבאר מה דמייתי ראיה מדכתיב גבי רבקה ותמהר ותורד כדה (קושיא ג'), דהנה רבקה אמנו היתה במקום אנשי רשע, ובבית אנשי רשע בתואל ולבן הארמי, ועמדה בצדקה. ואיתא במדרש עה\"כ והנערה טובת מראה מאד בתולה ואיש לא ידעה, אר\"י ממשמע שנאמר בתולה אין אנו יודעין שאיש לא ידעה, אלא אפילו אדם לא תבע בה, ע\"ש לא ינוח שבט הרשע על גורל הצדיקים. ופירש היפה תואר לפי שהדומה יאהב הדומה, ועל כן לא יבחר הרשע אלא בחבורת רשעים שכמותו והצדיקים בחבורת צדיקים, ועל כן הקב\"ה אוהב את ישראל שמתדמין לו בכל יכלתם וכו', ואם כן הכתוב בשבח רבקה דבר שלהיותה צדקת לא נתקררה דעת אחד מבני עירה שהיו רשעים בה, ולכן לא תבעוה לאשה וכו', עכ\"ד ז\"ל. ובזה יל\"פ מה שאמר הכתוב ותמהר ותורד כדה, ולכאורה תיבת ותמהר יתירא לכאורה, ומאי אשמעינן ביה. אמנם כוונת הכתוב להודיע צדקתה של רבקה, דלפי שהיתה עד עתה מסובבת באנשי רשע, והיתה חפיצה ומשתוקקת להתקרב אל הקדושה, על כן מיד בראותה לפניה איש צדיק הוא אליעזר עבד אברהם, השתוקקה מאד להתקרב מיד אל הקדושה, ולעלות מעמקי הקליפות הם אנשי מקומה הטמאים. וזהו שאמר הכתוב ותמהר, שלבה דחקה למהר ולהתקרב אל הקדושה, וע\"כ הזדרזה ומהרה להוריד כדה מעל שכמה, כדי שתמשך מיד אל הקדושה. וע\"ד זה נראה נפרש דברי המד\"ר אמרו לנמהרי לב אלו שדוחקין את הקץ, שאין הכוונה על דחיקת הקץ בתפלות ובתחנונים, שהרי בקרא כתיב נמהרי \"לב\", משמע שבלבם הם ממהרים, כלומר שלבם דוחק ומשתוקק אל הקץ, אך אינם עושים שום פעולה נגד השבועות שהשביע הקב\"ה את ישראל. והשתא תו לא קשיא מידי קושית היפ\"ת ז\"ל, דלא מיירי הכא כלל בדחיקת הקץ ע\"י תפלות ותחנונים, אלא על הנקודה שבלב, הקשור ונדחק בהשתוקקות אל קץ הגאולה, וכך ראוי להיות שכל אדם בישראל יהיה לבו דוחקו אל הקץ. וזאת אחת מן השאלות ששואלין לאדם ביום הדין ציפית לישועה (ועי' בספרי ויוא\"מ ח\"א סי' ע\"ט). והשתא שפיר מייתי ראיה מדכתיב גבי רבקה ותמהר, וכדפירשנו שכוונת הכתוב להודיע שלבה דחקה בגודל השתוקקותה להתקרב אל הקדושה, וה\"נ הכי פירושו אמרו לנמהרי לב שלבם דוחקם להתקרב אל הקדושה, כי אנחנו בתוקף הגלות והלב משתוקק ודוחק אל קץ הגאולה, ולהתקרב אל הקדושה. והשי\"ת יעזור שבמהרה נזכה לראות בישועת ישראל, בנחת ובשמחה ובטהרת הלב ובקדושה אמיתית, בהתגלות כבוד שמים עלינו במהרה בימינו אמן."}]}]
