[{"dvar_torah_id":"devurim_ab30e614","title":"מצוות בכורים ומעשרות","summary":"בפרשת הבכורים והמעשרות, דנים חז\"ל על משמעות המצוות, הקשרים ביניהן, והדרישה לשמחה בעבודת ה'. יש להקפיד על כוונה לשמה, ולהבין את תפקיד הכהן בהבאת הבכורים. המדרש מדגיש שאין טוב אלא תורה, והעשירות נועדה לשם עבודת ה'.","contents":[{"passage_id":"devurim_ab30e614_p1","passage_content":"והיה כי תבוא אל הארץ אשר ד' אלקיך נתן לך נחלה וגו', דרשו רז\"ל בספרי עשה מצוה זו, שבשבילה תכנס לארץ, והקשה ההפלאה ז\"ל דהרי לא נתחייבו ישראל בבכורים, אלא לאחר ירושה וישיבה, א\"כ לא שייך לומר בשכרה תכנס לארץ, שהרי כבר נכנסו ע\"כ קושיתו, גם יל\"ד על שנוי הלשון שבפסוק נאמר תבוא אל הארץ, ולשון הספרי תכנס לארץ."},{"passage_id":"devurim_ab30e614_p2","passage_content":"ב) ולקחתם מראשית כל פרי האדמה אשר תביא מארצך וגו', הקשה מהרי\"ן חביב ז\"ל דהרי כל שבעת המינים חייבים בביכורים, ורובם פירות האילן הם, ולמה יאמר הכתוב פרי האדמה, ואע\"ג דאמרי' במס' ברכות (דף מ' ע\"א) בירך על פירות האילן בורא פרי האדמה יצא, ואמרי' שם דמתני' ר' יהודה הוא, דעיקר אילן ארעא היא, אבל עכ\"פ לכתחילה לד\"ה בעינן ברכה מבוררת ולברך פרי העץ, וה\"נ יאמר הכתוב לשון מבורר, והו\"ל להזכיר גם פרי העץ."},{"passage_id":"devurim_ab30e614_p3","passage_content":"ג) ושמחת בכל הטוב אשר נתן לך ד' אלקיך, במס' בכורים (פ\"ג) מכאן אמרו אין קורין מקרא בכורים אלא בזמן שמחה, מעצרת ועד החג וכו', ובמדרש ושמחת בכל הטוב, אין טוב אלא תורה, לפיכך משה מזהיר את ישראל עשר תעשר, וצ\"ב דבפשטות מיירי קרא במצות בכורים, ולהלכתא אתי' ללמוד דאין קורין אלא בזמן שמחה, ולמה אפקוהו ממשמעותי' לדרוש על תורה, גם מה ענין מעשר לבכורים."},{"passage_id":"devurim_ab30e614_p4","passage_content":"ד) אחר שגמר פרשת הבכורים, אמה\"כ כי תכלה לעשר את מעשר תבואתך וגו', ראוי להבין קישור סמיכת הפרשיות להדדי, ויותר ראוי להיות פרשת וודוי מעשר בפרשת ראה, אצל עשר תעשר שהוא מקומה של מצות מעשר, וגם נאמר שם מצות ביעור מקצה שלש שנים תוציא את כל מעשר תבואתך, והול\"ל שם גם מצות וודוי מעשר שהוא אחר הביעור."},{"passage_id":"devurim_ab30e614_p5","passage_content":"ה) עשר תעשר דרשו חז\"ל (שבת קי\"ט) עשר בשביל שתתעשר, ראוי להבין היתכן שיהי' מצות התורה, לעשות ע\"מ לקבל פרס, והגם שבמצות מעשר מותר לד\"ה עמלק\"פ, כמשה\"כ בחנוני נא בזאת וגו', אבל לא יתכן שיהי' הצווי ע\"ד כך."},{"passage_id":"devurim_ab30e614_p6","passage_content":"ו) איתא בתנחומא פ' ראה (סי' י\"ח) עשר תעשר את כל תבואת זרעך וגו', אם זכיתם סוף שהם יוצאין לזרוע השדה, ואם לאו סוף שהיוצא השדה מתגרה בכם, זה עשו דכתיב בו, וילך עשו השדה לצוד ציד להביא עכ\"ד המדרש, וצ\"ב הכוונה."},{"passage_id":"devurim_ab30e614_p7","passage_content":"ז) ואמרת לפני ד' אלקיך בערתי הקדש מן הבית וגו' לא עברתי ממצותיך וגו' עשיתי ככל אשר צויתני, ולכאורה הוא פלא דלא מצינו בשום מצוה, שתחייב התוה\"ק להתפאר ולהשתבח א\"ע לפני הבוי\"ת, שעשה וקיים ככל מצותיו אשר צוויתני, זולת במצוה זו של וודוי מעשר, וטעמא בעי, גם קראוה חז\"ל בגמ' וודוי מעשר, ולכאורה אין זו נראה כוודוי כלל, אלא התפארות ושבח, - גם הרי מצינו בגמ' ברכות (י' ע\"ב) בחזקי' על שתלה בזכות עצמו, ואמר זכר נא את אשר התהלכתי לפניך תלו לו בזכות אחרים, והיתכן שצותה התוה\"ק במצוה זו לתלות בזכות עצמו, כאמרו עשיתי ככל אשר צוויתני השקיפה ממעון קדשך, והוא פלא."},{"passage_id":"devurim_ab30e614_p8","passage_content":"ח) ובאה אל הכהן אשר יהי' בימים ההם, פרש\"י ז\"ל אין לך אלא כהן שהוא בימיך כמו שהוא, וכתב הרמב\"ן ז\"ל ולא הבינותי, כי בענין הזקן ראוי לומר אל השופט אשר יהי' בימים ההם, אע\"פ שאינו גדול וחכם כשופטים הראשונים, אשר היו לפנינו מן העולם צריך לשמוע לו, יפתח בדורו כשמואל בדורו, אבל בהקרבת בכורים, למי יביאם אם לא אל הכהן אשר יהי' בימיו עכ\"ל הרמב\"ן ז\"ל, והרא\"ם תמה על הרמב\"ן וכתב, ואני שמעתי ולא אבין דבריו, דכמו\"כ יש למי שמביא בכוריו לפני הכהן, לומר אחר שאין הכהן הזה צדיק וחסיד, כמו הכהנים הראשונים אשר היו לפניו מן העולם, איני רוצה להביא בכורים לפניו, שאינו אלא כדי להדרו, או כדי לקבל ברכתו וכו' עכ\"ל."},{"passage_id":"devurim_ab30e614_p9","passage_content":"אמנם באמת יש לחלק בין שופט לכהן, דשופט צריך שיהי' בו מעלת החכמה והיראה, ושאר מעלות המנויים בו, וע\"כ יש מקום לומר, שאין רוצה בשופט שבימיו, ולטעם זה הוצרך הכתוב ליזהר ולצוות שאין לך אלא שופט שבימיך, ושלא לנטות מדבריו ימין ושמאל אבל בכהן המקבל בכורים, לא כתבה תוה\"ק תנאי איך שיהי' מעלת הכהן הראוי לקבל בכורים, ואין שום מקום לפטור א\"ע ממצות התורה, בטעם שאינו מפורש בקרא, והדרא קושית הרמב\"ן על דברי רש\"י לדוכתי', דלמ\"ל קרא דאין לך אלא כהן שבימיך, ומה\"ת למפטרי' משום כך ממצות בכורים."},{"passage_id":"devurim_ab30e614_p10","passage_content":"ט) להלן בפ' וודוי מעשר לא עברתי ממצותיך ולא שכחתי, פרש\"י ולא שכחתי מלברכך על הפרשת מעשרות, וכתבו המזרחי והגו\"א שאין לפרש על נוסח הברכה בפה, שתקנו אנשי כנה\"ג לומר על הפרשת מעשרות, שברכת כל המצות אינן אלא מדבריהם, וא\"א שכיוון הכתוב לזה, אלא פי' הכתוב שלא שכחתי מלשבחך על הפרשת המעשרות, ר\"ל שנתתי המעשרות לשם הקב\"ה ונתתי אותם באהבה, ושבחתי עליו להקב\"ה, וכתב הרא\"ם דממה דאיתא בספרי ובמס' מע\"ש (פ\"ה מי\"א) לא שכחתי מלברכך ומלהזכיר שמך עליו, נראה כמו שפירשנו בדברי רש\"י ז\"ל, שאין הכוונה על נוסח הברכה, עכת\"ד ז\"ל."},{"passage_id":"devurim_ab30e614_p11","passage_content":"אולם התויו\"ט במשנה דמע\"ש הנ\"ל, הקשה עליהם קושיא עצומה, דאדרבה מהך משנה מבואר, דכוונת הכתוב על נוסח הברכה, דבמס' ברכות (דף מ' ע\"ב) מייתי לה להך מתני', אפלוגתא דרב ור\"י, ומייתי רב סייעתא מני' דכל ברכה שאין בה הזכרת השם אינה ברכה, דתניא ולא שכחתי מלהזכיר שמך עליו, ואילו מלכות לא קתני, ור' יוחנן דס\"ל דכל ברכה שאין בה מלכות אינה ברכה, מגיה בברייתא זו לומר, תני ולא שכחתי מלהזכיר שמך ומלכותך עליו עיי\"ש, מבואר דכוונת הכתוב ולא שכחתי מלברכך, על נוסח הברכה קאמר, וכן הוא בהדיא ברש\"י במס' ברכות הנ\"ל, ולא שכחתי מלברכך ברוך אשר קדשנו במצותיו וצונו להפריש תרומה ומעשר, אלא ודאי הנכון, דרש\"י בפי' עה\"ת נוסח הברכה קאמר, ואע\"ג דמדרבנן הוא אסמכוה אקרא, דמי גריעא ברכה לאסמוכה אקרא, משאר דברים דרבנן שהסמיכום על המקראות עכת\"ד התוי\"ט זלל\"ה."},{"passage_id":"devurim_ab30e614_p12","passage_content":"אמנם נראה להביא ראי', דדברי הרא\"ם והגו\"א צודקים, דמה דאמרי' בכ\"מ אסמכוה רבנן אקרא, היינו היכא דאין הכתוב מיותר, אז אפשר לומר דקרא לאו להכי אתא, ומדרבנן הוא ואסמכוה אקרא, אבל כאן ולא שכחתי מיותר לגמרי, דכבר מנה הכתוב כל מילתי' דמעשר, לא אכלתי באוני וכו', ועכ\"ח מה שדרשו חז\"ל ולא שכחתי מלברכך דרשא גמורה היא, דאי נימא דקרא לאו להכי אתא, ואסמכתא בעלמא היא, א\"כ הקרא מיותר, ומעתה צודקים דברי הרא\"ם והגו\"א דא\"א שכוון הכתוב על נוסח הברכה, דאיך יבוא הכתוב לחייב דבר שהוא מדרבנן, אלא כוונת הכתוב על הודי' בלב והוא מדאורייתא."},{"passage_id":"devurim_ab30e614_p13","passage_content":"עוד אפשר להביא קצת סמך ראי' לדבריהם, דסתם הכתוב ולא שכחתי, ואיני יודע שכחה זו מה היא, אבל שכחה האמורה בכ\"מ הוא בלב, כמ\"ש בזכירת עמלק לא תשכח בלב וכן בכ\"מ, וכמו\"כ כאן על שכחת הלב כיון הכתוב, שלא שכחתי להודות בלב על הפרשת המעשרות, אבל א\"כ הדרא קושית התוי\"ט לדוכתי' דהרי מבואר בגמ' דברכות הנ\"ל, דרב ור\"י למדוה להאי קרא על נוסח הברכה כנ\"ל."},{"passage_id":"devurim_ab30e614_p14","passage_content":"י) עשיתי ככל אשר צויתני צ\"ב מה בא הכתוב להוסיף, וכל אלה שנפרטו לעיל בכלל הצווי הם."},{"passage_id":"devurim_ab30e614_p15","passage_content":"יא) השקיפה ממעון קדשך מן השמים וגו', ארז\"ל והובא ברש\"י פ' וירא עה\"פ וישקיפו, כל השקפה שבמקרא לרעה, חוץ מהשקיפה ממעון קדשך, שגדול כח מתנות עניים שהופך מדת הרוגז לרחמים, ראוי להבין למה כתבה תוה\"ק לשון השקפה שהוא לרעה, ויצטרך להפכו הרי כיון שקיים מצות מתנות עניים, ואמה\"כ עשיתי ככל אשר צויתני, יאות שיאמר הכתוב לשון שהוא מבורר לטובה."},{"passage_id":"devurim_ab30e614_p16","passage_content":"יב) השקיפה ממעון קדשך מן השמים, צ\"ב דמלות מן השמים מיותר, וידוע דהשראת שכינתו ית' בשמים, והגם שמלא כל הארץ כבודו ית', אבל בעולמות העליונים השראת שכינתו ית' בבחי' גבוה יותר, וכי צריך הכתוב להגביל המקום אתמהה."},{"passage_id":"devurim_ab30e614_p17","passage_content":"יג) וברך את עמך את ישראל, צ\"ב הכפל את עמך את ישראל, ויספיק בא' מהם, גם כפל מלת את צ\"ב, וידוע דאתין וגמין רבויין הן, ומה בא לרבות, גם כל הפרשה מדבר בלשון יחיד, וסיים בלשון רבים וברך את עמך את ישראל אשר נתת לנו כאשר נשבעת לאבותינו וגו' וטעמא בעי."},{"passage_id":"devurim_ab30e614_p18","passage_content":"יד) להלן בפרשה אלה יעמדו לברך את העם על הר גריזים וגו', ואמחז\"ל במס' סוטה (דף ל\"ב ע\"ב) הפכו פניהם כלפי הר גריזים ופתחו בברכה, ברוך האיש אשר לא יעשה פסל ומסכה וכו', הפכו פניהם כלפי הר עיבל ופתחו בקללה וכו', ראוי להבין דבפסוק לא נמנו אלא י\"א ארורים, וחז\"ל למדו (שם ל\"ח ע\"ב) מהיקש דמה קללה בכלל ופרט, אף ברכה נאמרה בכלל ופרט, ומה קללה בלה\"ק אף ברכה, וכן כל ענין של ברכות נלמד מן הקללות עיי\"ש, ולכאורה מן הראוי שיאמר הכתוב הברכות בפירוש, והקללות ילמדו מכללן, והשי\"ת חפץ בברכתן של ישראל, ומ\"ט הסתירן הכתוב."},{"passage_id":"devurim_ab30e614_p19","passage_content":"טו) ק\"ז הישמח משה זלל\"ה בפ' ראה הביא קושיא בשם ס' כתנות אור עפימ\"ד בילקוט פ' תולדות ובפ' בלק, כי יצחק שהי' אוהב את ישראל פתח בקללה וסיים בברכה, אורריך ארור ומברכך ברוך, ובלעם שהי' שונא את ישראל פתח בברכה וסיים בקללה, מברכיך ברוך ואורריך ארור, ולפי\"ז יקשה דמשרע\"ה שהי' אוהב ישראל למה סיים בקללה, באמרי ראה נתתי לפניכם היום ברכה וקללה, ותירץ עפי\"ד רש\"י ז\"ל את הברכה אשר תשמעו על מנת אשר תשמעו, ועכ\"ח נאמרו על תנאי, ומשפט התנאי להיות הן קודם ללאו, ולכך פתח בברכה עיי\"ש, וכמו\"כ קשה כאן מדוע פתחו בברכה, ועוד יותר יקשה שהברכה לא נכתבה כלל, והעלימו הכתוב ונלמד מהיקש הקללות וצ\"ב."},{"passage_id":"devurim_ab30e614_p20","passage_content":"טז) גם ראוי להבין השנוי שבין פ' תוכחה שבתו\"כ, למה שנאמרה במשנה תורה, דבפ' בחקתי אחר סיום התוכחה כתיב אלה החקים והמשפטים והתורות וגו' בהר סיני, ופרש\"י והתורות תושב\"כ ושבע\"פ, מגיד שכולם נתנו למשה מסיני, ולא הוזכר כריתת ברית על התוכחה, ובתוכחות שבמשנה תורה כתיב, אלה דברי הברית אשר צוה ד' את משה לכרות את בנ\"י מלבד הברית אשר כרת אתם בחורב, ונלמד שגם על התוכחות שבתו\"כ הי' כריתת ברית עליהם, אבל מ\"ט העלימו הכתוב שם, ונזכרה רק כאן במשנה תורה."},{"passage_id":"devurim_ab30e614_p21","passage_content":"יז) בזוה\"ק דקדקו דלמה בתוכחות שבתו\"כ סיים בדברי נחומים, ואף גם זאת בהיותם בארץ איביהם לא מאסתים ולא געלתים וגו', ולא נזכרו דברי נחומים בתוכחות שבמשנה תורה וטעמא בעי, ועייש\"ד."},{"passage_id":"devurim_ab30e614_p22","passage_content":"יח) גם צ\"ב מ\"ש אלה דברי הברית, וידוע דכ\"מ שנא' אלה פוסל את הראשונים, ומה פוסל הכתוב כאן, והרי הכריתת ברית הי' על כל התורה והמצות, כפרש\"י כאן שקבלו עליהם את התורה באלה ובשבועה."},{"passage_id":"devurim_ab30e614_p23","passage_content":"יט) החתם סופר זלל\"ה דקדק במשה\"כ בסוף התוכחה ונסחתם מעל האדמה אשר אתה בא שמה לרשתה, והרי כבר הזכיר גזירת הגלות, באמרו יולך ד' אותך ואת מלכך וגו', אל גוי אשר לא ידעת וגו', ולמה הכפיל הכתוב מה שכבר נאמר, גם ראוי להבין השנוי שבכ\"מ נאמר אל הארץ אשר אתה בא לרשתה, וכאן אמר על האדמה וגו'."},{"passage_id":"devurim_ab30e614_p24","passage_content":"כ) להלן בסוף הפרשה ולא נתן ד' לכם לב לדעת וגו' עד היום הזה, פרש\"י להכיר את חסדי הקב\"ה ולהדבק בו, עד היום הזה וכו', שאותו היום שנתן משה ספר התורה לבני לוי וכו', באו כל ישראל לפני משה ואמרו לו, אף אנו עמדנו בסיני וקבלנו את התורה וכו', ושמח משה על הדבר, ועל זאת אמר להם היום הזה נהייתה לעם וגו', היום הזה הבנתי שאתם דבקים וחפצים במקום, ד\"א ולא נתן ד' לכם לב לדעת עד היום הזה, שאין אדם עומד על סוף דעתו של רבו וחכמת משנתו, עד ארבעים שנה, ולפיכך לא הקפיד עליהם המקום עד היום הזה, אבל מכאן ואילך יקפיד."},{"passage_id":"devurim_ab30e614_p25","passage_content":"וכתב הרא\"ם ז\"ל דלשני הפירושים שברש\"י, מ\"ש ותבאו אל המקום הזה וגו', אין הכוונה אל המקום, אלא פירושו אחר שבאת אל המדריגה הזאת, להשיג מחכמתו ית' וחסדי המקום, מעתה הוא מדקדק עמכם בשמירת המצות, וע\"כ סמך לי' ושמרתם את דברי הברית, אבל הקשה למה הפסיק הכתוב במאמר ויצא סיחון וגו', בין ותבאו אל המקום הזה, ובין ושמרתם את דברי הברית שהם דבקים זה לזה, גם ראוי להבין דאם לזה יתכוון הכתוב למה אמר ותבאו אל המקום הזה, ובכ\"מ שם זה מורה על מקום, ולא על מדריגה ובחי'."},{"passage_id":"devurim_ab30e614_p26","passage_content":"ונבוא אל הביאור לתרץ קושית התויו\"ט הנ\"ל (בקושיא ט'), דהנה לפי\"ד המזרחי והגו\"א, שפי' ולא שכחתי מלברכך קאי על הודי' ושבח שבלב, ולא על נוסח הברכה, דנוסח הברכה דרבנן הוא, וא\"א שכיון עליו הפסוק עייש\"ד, לפ\"ז נתחדש לנו דבר חדש, דמה שאמז\"ל ברכות דרבנן, זהו רק נוסח ומטבע של ברכות שתקנו חז\"ל, אבל שבח והודי' בלב חיובא דאורייתא הוא, להזכיר חסדי המקום ית'."},{"passage_id":"devurim_ab30e614_p27","passage_content":"וכעי\"ז מצאתי בה' ברכות להריטב\"א ז\"ל (ס\"ב, שנדפס מכת\"י) וז\"ל לא באה בתורה שבכתב מצוה לברך אדם על ההנאה קודם שיהנה, לפי שהשכל מורה ע\"ז לבעלי האמת, וכל שלא בירך, לחמו במעיו נהפך ואינה הנאה, אבל מדברי סופרים לברך בשם ומלכות וכו' עכ\"ל, הרי שנוסח ומטבע הברכות לבד, הוא מדרבנן, אבל השבח וההודי' חיובא דאורייתא מצד הסברא, וכאמרז\"ל (ברכות ל\"ה) סברא היא עיי\"ש."},{"passage_id":"devurim_ab30e614_p28","passage_content":"ונראה שגם התויו\"ט אינו חולק על עצם הסברא, דהודי' חיובא דאורייתא הוא, אלא שהוכיח מדברי הגמ', וסייעתא דרב ור\"י הנ\"ל, שלא התכוון הכתוב על הודי' לבד, אלא על נוסח הברכה בשם, או בשם ומלכות, למר כדאית לי' ולמר כדאית לי', וע\"כ קרא אסמכתא בעלמא עיי\"ש, אבל אינו דוחה דברי הרא\"ם, לחלוק עליו בעצם הסברא, ועכ\"ח שבזה יודה אליו, שההודי' ושבח חיובא דאורייתא הוא."},{"passage_id":"devurim_ab30e614_p29","passage_content":"ובזה יתבאר לנו דברי התוס' במס' ברכות (דף ל\"ה ע\"א) על מ\"ש בגמ' שם, אשכחן ברכה לאחריו, לפניו מנין, הא לא קשיא דאתי' בק\"ו, כשהוא שבע מברך כשהוא רעב לא כ\"ש, וכתבו התוס' לאו ק\"ו הוא, דא\"כ תהא ברכה דלפניו מדאורייתא, ולעיל פרק מי שמתו (דף כ\"א ע\"א) אמרו, בבעל קרי שמברך על המזון לאחריו, ואינו מברך לפניו דלאו דאורייתא הוא עכ\"ד התוס', ולכאורה דבריהם צ\"ב, דבגמ' אוקמי' לי, הכי לפי המסקנא דק\"ו הוא, ולפי הפשטות ק\"ו גמור הוא דלא איפרכא בגמ, ק\"ו זה, ואיך כתבו התוס' לדחות מסקנת הגמ' ולומר דלאו ק\"ו הוא."},{"passage_id":"devurim_ab30e614_p30","passage_content":"ואפ\"ל דבאמת איכא למפרך האי ק\"ו, מ\"ש כשהוא שבע מברך כשהוא רעב לא כ\"ש, עפימ\"ש הרמב\"ם ה' תפלה פ\"ה ה\"ב וז\"ל הרעב והצמא ה\"ה בכלל חולים, אם יש בו יכולת לכוון את דעתו יתפלל, ואם לאו אל יתפלל עד שיאכל וישתה, וכן פסק בש\"ע (סי' פ\"ט ס\"ד) דמותר לו לאכול ולשתות ואח\"כ יתפלל, אלא שבש\"ע תלה הדבר באם רצה, משמע שאין מחויב ומותר לו להתפלל כשהוא רעב אם ירצה, וכתב המג\"א הטעם משום דעכשיו בזמה\"ז בלא\"ה אין מכוונים כ\"כ, עיי\"ש, ועכ\"פ דבר ברור שא\"א לכוין בתפלתו כשהוא רעב, ומבואר בש\"ע שצריך שיהי' לו כוונה בתפלתו, ובפרט בהזכרת השם, אם במזכיר ש\"ש בלי כוונה ענשו גדול ר\"ל, ומעתה אזדה לה כח הק\"ו, ואין ללמוד ברכה לפני' בק\"ו, דכשהוא שבע מברך כשהוא רעב לא כ\"ש."},{"passage_id":"devurim_ab30e614_p31","passage_content":"ולדרכיו אפשר לתרץ כוונת הגמ', וגם דברי התוס' בדרך זה, דמ\"ש בגמ, דק\"ו הוא, כשהוא שבע מברך רעב לא כ\"ש, לא כוונו על נוסח הברכה בשם ומלכות, דלאו ק\"ו הוא דאינו רק מדרבנן כמ\"ש התוס', וגם ק\"ו פריכא היא, דהזכרת ש\"ש בעי כוונה, וא\"א לדון ולילף רעב משבע בק\"ו כנ\"ל, אמנם אפשר שכוונת הגמ' למילף מק\"ו, ברכת שבח והודי' בלי הזכרת שם ומלכות, או בלב שהוא דאורייתא, ואפשר שזה הוא ק\"ו גמור, דאין בה הזכרת ש\"ש, ואין הכוונה מעכבת בה, וליכא פירכא הנ\"ל."},{"passage_id":"devurim_ab30e614_p32","passage_content":"ולפי שהודי' ושבח בלב דאורייתא, ע\"כ תיקנו חז\"ל לברך בפה, בשם או בשם ומלכות, למר כדאית לי' ולמר כדאית לי', וכעין שאמרו בבדיקת חמץ, דמדאורייתא השבתה וביטול בלב סגי, אלא לפי דמחשבה מבטל מחשבה, ופן יהי' דעתו עלי', וחס עליו ויבטל מחשבתו הקודמת, ע\"כ הצריכו חז\"ל בדיקה במעשה, ואין מחשבה מוציא מידי מעשה, וכמו\"כ לעניננו מקור החיוב דברכה, דאורייתא הוא, אלא דמדאורייתא במחשבה סגי, וחייבוהו חכמים לברך בפה, ובנוסח ובמטבע שטבעו חכמים בברכות."},{"passage_id":"devurim_ab30e614_p33","passage_content":"לפי\"ז יהי' תירוץ הגמ' בדרך זה, ולאו ק\"ו הוא, וכיון שנלמד עצם חיוב הברכה בק\"ו, ודאורייתא הוא, תקנו חכמים מטבע ברכה לפני' על סמך דאורייתא, וא\"ש מ\"ש התוס' דלאו ק\"ו הוא, וראייתם ממ\"ש בעל קרי אינו מברך על המזון לפניו דלאו דאורייתא, כוונת התוס' על ברכה בהזכרת השם שאינה מדאורייתא, ומ\"ש בגמ' דק\"ו הוא, הכוונה על הודי' ושבח בלי הזכרת שם ומלכות, ודברי שניהם אמת ול\"ק קושיתנו הנ\"ל."},{"passage_id":"devurim_ab30e614_p34","passage_content":"וכמו\"כ איכא למימר בחיוב ברכות המצות, דילפינן שם (דף כ\"א ע\"א) ברכת התורה לאחרי', מן ברכת המזון מק\"ו עיי\"ש, ומסקנת הגמ' דאיכא למיפרך, מה למזון שכן נהנה, ואידחי לה ק\"ו, וממילא ברכת התורה לאחריו אינה אלא מדרבנן, אמנם הך פירכא איכא למדחי לכאורה, עפימ\"ש ק\"ז הישמח משה זלל\"ה (בפ' תשא) על הא דמבואר ברמ\"א ובש\"ך (יור\"ד סי' קנ\"ז) דאם הוא אדם חסיד ויר\"ש, כ\"ע מודי דרשאי למסור עצמו על קידוש השם אפי' על מצוה קלה, ולכאורה יש להפליא הכי בשביל שהוא חסיד ויר\"ש ישתנה דינו, הלא כתיב וחי בהם, ותוכן תירוצו דיש עוד פי' אחר בפסוק וחי בהם, היינו שכל עשיותיו ותנועותיו ועסקיו יהי' רק בתומ\"צ, וזולתן לא יהיו לו שום חיות בעולם, וכ\"כ יהי' דבוק ונתעצם, עם התורה והעבודה והמצות, עד אשר אם ירצו להעבירהו על א' ממצות ד' יופסק חיותו, והצדיקים עיקר חיותם הוא בתוה\"ק, וממילא מחויבים למסור נפשם על כל עבירות ומצות קלות, לאשר כי הן המה חיותם ממש, אלא שלאו כל אדם בבחי' זו, וע\"כ לא ניתנה הלכה זו לכל, דהתוה\"ק ניתנה כפי מדריגת כאו\"א כפי אשר יוכל שאת, כמ\"ש קול ד' בכח, בכוחו לא נאמר וכו', וא\"כ אצל ההמונים אשר כל עסקם בעניני העולם, ואינם בבחי' הנ\"ל, בהם יתקיים הפי' הפשוט וחי בהם, ולא שימות בהם עיי\"ש לדרכו."},{"passage_id":"devurim_ab30e614_p35","passage_content":"עכ\"פ לפי\"ז ליכא למפרך מה למזון שכן נהנה, דמי שהוא עובד ד', יותר נהנה בעשיית המצות מכל הנאות העוה\"ז, ויפה שעה א' בתשובה ומע\"ט מכל חיי העוה\"ב, ומכ\"ש מכל חיי העוה\"ז, ואם נפרש וחי בהם כפירוש הראשון הנ\"ל, אדרבה נתחזק כח הק\"ו, ואיכא למילף ברכת המצות מברכת המזון בק\"ו, ויהי' ברכת המצות לאחריו דאורייתא, אמנם א\"א לקבוע הלכה זו לכל אדם, כמ\"ש ק\"ז זלל\"ה, דלאו כל אדם בבחי' זו, שיהי' נהנה מעבדות השי\"ת ותומ\"צ, יותר מכל הנאות עוה\"ז, ואפשר דעכ\"פ אהני לה ק\"ו, לחייבו בברכת הודי' ושבח בלב מדאורייתא, אבל נוסח הברכה בהזכרת השם אינה אלא מדרבנן, וכמ\"ש בברכת הנהנין לפניו כנ\"ל."},{"passage_id":"devurim_ab30e614_p36","passage_content":"ולפי\"ז יתורץ קושית התויו\"ט הנ\"ל, דבאמת צדקו דברי הרא\"ם והגו\"א, דאין לפרש ולא שכחתי על נוסח הברכה בפה, דלאו דאורייתא היא, וא\"א לומר שיכוין הכתוב להזהיר על דבר שהוא תקנתא דרבנן, וא\"א לומר דקרא אסמכתא בעלמא, כיון דמיותר הוא וכמו שהוכחנו לעיל, אמנם אחר שתיקנו חכמים לברך בפה וכמטבע הברכות, אם אינו עושה כתקנת החכמים, לא קיים המצוה כלל, ואפי' מדאורייתא לא יצא ידי חובתו, וכמ\"ש הרבינו יונה בריש מס' ברכות, וכ\"כ התוס' ורוב הראשונים בכל מילתא דתקנו רבנן עייש\"ד."},{"passage_id":"devurim_ab30e614_p37","passage_content":"ולפי\"ז א\"ש, דמ\"ש בתורה ולא שכחתי, קאי רק אהודי' בלב כדברי הרא\"ם ז\"ל, ומ\"ש בגמ' דברכות (דף מ' ע\"ב) דרב מפרש לי' לקרא, ולא שכחתי מלברך ומלהזכיר שמך עליו, ור' יוחנן מפרש לי' בברכה עם הזכרת שם ומלכות, וכ\"כ רש\"י שם ולא מלברכך ברוך אשר קדשנו במצותיו וצונו להפריש תרומה ומעשר, מימרא זו נשנית לאחר תקנת חכמים, ואז ודאי צריך להתודות בודוי מעשר, שקיים כתקנת חכמים בהזכרת השם, או שם ומלכות לר\"י, דאל\"ה גם דאורייתא לא יצא, וא\"א לומר עשיתי ככל אשר צויתני, אם לא קיים כתקנת חכמים, ומתורץ קושית התויו\"ט הנ\"ל, וא\"צ לדחוק ולומר דאסמכתא הוא, דקרא כי אתא לדרשא גמורה אתי, על הודי' בלב, אלא שאחר תקנת חכמים, מחויב להתודות ולהזכיר שקיים גם תקנת חכמים לברך בפה, כמטבע שטבעו חכמים."},{"passage_id":"devurim_ab30e614_p38","passage_content":"ולדרכנו אפשר לתרץ קושית הפנ\"י, שהקשה על אמרם ז\"ל סברא היא אסור לאדם שיהנה בלא ברכה, והלא סברא דאורייתא, וברכות אינם אלא דרבנן, ולדרכנו מהני הסברא לחייבו מדאורייתא על הודי' בלב, ונוסח הברכה בפה אינה אלא מדרבנן."},{"passage_id":"devurim_ab30e614_p39","passage_content":"ומ\"ש רש\"י במס' ברכות (דף כ' ע\"ב) במתני' דבעל קרי אינו מברך על המזון לפניו, דלאו דאורייתא, וכתב רש\"י ז\"ל דאפי' בהרהור אינו מברך, ולכאורה הודי' בלב דאורייתא היא, ואמאי לא לברך, ואפשר לפי דמתני' לאחר תקנה מיירי, שתקנו לברך בהזכרת השם, ובהרהור כזה בנוסח הברכה ובשם ומלכות לאו דאורייתא היא, ולא אצרכוהו רבנן, דכיון דעיקר הזכרת השם מדרבנן הוא, למה יהרהר בשמות הקדושים, בשעה שאינו טהור, וכמ\"ש רש\"י במתני' שם, וז\"ל כיון דברכות לאו מדאורייתא מחייב, לא אצרכוהו רבנן עכ\"ל, וכמו\"כ בהרהור השמות הק' דלאו דאורייתא, לא אצרכוהו להרהר ואינו מברך אפי' בהרהור, אבל ההרהור בהודי' לבד דאורייתא היא, וגם בעל קרי מחייב בה, ומתורץ כל הענין."},{"passage_id":"devurim_ab30e614_p40","passage_content":"ועתה נבוא לבאר דברי המדרש הנ\"ל אין טוב אלא תורה וכו' (עיין לעיל קושיא ג') ונקדים מ\"ש רש\"י ז\"ל במס' שבועות (דף ט\"ז ע\"א), עמ\"ש שם בברייתא, אבא שאול אומר שני ביצעין (פי' המתרגם אחו ואגם) היו בהר המשחה (הר הזיתים) תחתונה ועליונה, תחתונה נתקדשה בכל אלו, עליונה לא נתקדשה בכל אלו, אלא בעולי גולה שלא במלך ושלא באורים ותומים, תחתונה שהיה קדושתה גמורה עמי הארץ נכנסין לשם ואוכלין שם קדשים קלים אבל לא מעשר שני, וחברים אוכלין שם קדשים קלים ומעשר שני וכו', ופרש\"י דעמי הארץ המפרישים מעשרות היו זריזין לעשות בו מצוה מן המובחר, לפי שהיו שומעין דרשה עשר בשביל שתתעשר וכו', לכך היו נכנסים עד תוך חומת ירושלים הפנימית, לקיים לפני ד' אלקיך, אבל בקדשים לא היו מטריחין עצמן ואוכלים אותם לפנים מחומה חיצונה וכו' עכ\"ד."},{"passage_id":"devurim_ab30e614_p41","passage_content":"ויובן בזה מ\"ש בתנחומא, עה\"פ כי ציד בפיו שהי' צד את יצחק הצדיק בפיו וכו', הי' אומר לאביו, אבא המלח מהו שתהא חייבת במעשר, ולכאורה אם הי' רצונו לרמות את יצחק, מדוע בחר בזהירות מצות מעשר, יותר מבשאר מצות וכן הקשו מפרשי התנחומא, ואפשר שידע מסגולת המעשר שמביא לידי עשירות, כמ\"ש ז\"ל עשר בשביל שתתעשר, וע\"כ כיון שהוכרח לאחוז באיזה מצוה, כדי לרמות את אביו, בחר במצות מעשר להיות זהיר בו שמביא לידי עשירות."},{"passage_id":"devurim_ab30e614_p42","passage_content":"ובזה יבואר התנחומא הנ\"ל (קושיא ו'), עשר תעשר וגו', אם זכיתם סוף שהם יוצאים לזרוע השדה, ואם לאו עשו מתגרה בכם, שנא' לצוד ציד להביא, ר\"ל שאם לא תקיימו מצות מעשר כראוי יהי' ח\"ו קטרוג עליכם מצד עשו, שבמצוה זו הי' הוא נזהר בכל ההידורים, וע\"כ אמרו דעשו מתגרה בכם באם לא תהיו זהירים במצות מעשר. וכמ\"ש במצות כבוד אב לפי שהי' נזהר בו, יש לו כח לקטרג ח\"ו."},{"passage_id":"devurim_ab30e614_p43","passage_content":"אמנם עשו לא כיון בו לשם מצוה כלל, אלא להנאה עצמית כדי שיתעשר, אבל בישראל אע\"ל שאמרו חז\"ל עשר בשביל שתתעשר, צריך שיהי' כל כוונתו לעשות רצונו ית', ולשמירת התורה והמצות, ואף שהתירה תוה\"ק ליתן המעשרות בכוונה להתעשר על ידה, כמשה\"כ בחנוני נא בזאת וגו', אבל סוף כוונתו יהי' להשיג העשירות לתכלית שמירת התורה, דאל\"ה אין לה חשיבות כלפי מעלה, וא\"א שיצוה הכתוב לעשות מצות לשם מתן שכרן לבד."},{"passage_id":"devurim_ab30e614_p44","passage_content":"וז\"ש במדרש ושמחת בכל הטוב אין טוב אלא תורה, ואע\"פ ששמחה דקרא קאי על אסיפת התבואות, כמו שדרשו ז\"ל, דזמן שמחה מעצרת ועד החג שהוא זמן אסיפת גרנות, אבל הזהירונו חז\"ל שאין טוב אלא תורה, וגם בעשירות תכוין רק לעבודת השי\"ת, כדי שתהי' פנוי לעסק התורה ולקיום המצות, וא\"ש דברי המדרש ושמחת בכל הטוב אין טוב אלא תורה, לפיכך משה מזהיר את ישראל עשר תעשר, דלכאורה איך יתכן שיצוה הכתוב לקיים המצוה ע\"מ לקבל פרס ובשביל שתתעשר, אמנם כיון שאין טוב אלא תורה, ועיקר העשירות צורך בו לעבדות השי\"ת, א\"ש מה שהזהיר משה את ישראל עשר תעשר בשביל שתתעשר."},{"passage_id":"devurim_ab30e614_p45","passage_content":"ועתה נבאר מאמה\"כ השקיפה ממעון קדשך מן השמים, כי למה יזכיר הכתוב לשון השקפה שהיא לרעה, ושאר הדקדוקים שבענין (עיין קושיא י' י\"א י\"ב) ונקדים מ\"ש ק\"ז הישמח משה זלל\"ה (בפ' תולדות ובפ' בראשית) על מ\"ש חז\"ל ערובין (דף י\"ט ע\"א) אלו פושעי ישראל שמלאים מצות כרימון, ולכאורה אם מלאים מצות, מ\"ט פושעי ישראל קרית להו, וגם למה המשילם לרמון דוקא, אמנם יש הפרש בין מעש\"ט של צדיקים ובין מעש\"ט של רשעים וכו', דמעש\"ט של צדיקים הם במחשבה זכה וצלולה בלתי לד' לבדו, לא כן הרשעים דאף אם עושים מעש\"ט, הוא רק להנאתן ולטובתן, ובשביל איזה תועלת וכדומה, והקליפה עיקר יותר מגוף הפרי, וזולת הפסולת והקליפה לא היו עושים המעש\"ט ההם, וה\"ז דומה לרימון, דכי שקלי לנץ דרימונא, שהיא השומר לפרי מיית רמונא, כדאיתא בברכות (ל\"ו ע\"ב) כמו כן מעשיהם הטובים של הרשעים וכו', וז\"ש פושעי ישראל מלאים מצות, אבל אינו אלא כרמון עייש\"ד."},{"passage_id":"devurim_ab30e614_p46","passage_content":"עכ\"פ יצוייר להיות מלאים מצות, ואעפ\"כ קראוהו חז\"ל פושעי ישראל, והגם שמותר לעשות שלא לשמה, כאמרז\"ל שמתוך שלא לשמה בא לשמה, אבל כ\"ז הותר רק כדי להגיע אל מדריגת לשמה, אבל אם העיקר והיסוד היא שלא לשמה, וזולת זה לא היו עושים המצוה כלל, כבחי' הנ\"ל שכתב ק\"ז זלל\"ה, בבחי' זו נקראו פושעי ישראל, אף אם מלאים מצות, כאמרז\"ל דשלא לשמה כה\"ג נוח לו שלא נברא."},{"passage_id":"devurim_ab30e614_p47","passage_content":"והנה אמרז\"ל במס' פסחים (דף נ' ע\"ב) רבא רמי כתיב כי גדול מעל השמים חסדך, וכתיב עד השמים וגו', ומשני כאן בעושין לשמה מעל השמים, ובעושין שלא לשמה עד השמים, ועיין פרש\"י שם, עכ\"פ כל בחי' שלא לשמה אף אם אינו בגדר הרשעים, אבל לא יעלה בחינתו מעל השמים, ובעולמות הגבוהים לפגם יחשב, וכפי בחי' העולם ההוא אפשר שישלוט ח\"ו קטרוג עליו, אף שלפי בחי' העולם שלמטה הימנו הותר בחי' שלא לשמה כה\"ג, וכעין שכתב בזוה\"ק אורייתא בלא דחילו ורחימו לא פרחית לעילא, ובעוה\"ז מקבלים עלי' שכר, אבל בעולם העליון לפגם יחשב."},{"passage_id":"devurim_ab30e614_p48","passage_content":"ומעתה נבין ענין הודוי מעשר שהוא בדרך ודוי ותפלה, ומתודה על בחי' המצות, שלא עשאם במחשבה זכה וצלולה, בלתי לד' לבדו ומאהבת השי\"ת, ובחשקות נמרצה לעשות רצון אבינו שבשמים, וע\"כ חושב כל אלו המצות, נתתיו ללוי לגר וליתום ולאלמנה וגו', לא עברתי ממצותיך, ולא שכחתי מלברך, ומונה והולך כולם, ועל כל אלה מתודה בלב נשבר, שלא קיימן מאהבת ד' ובדחילו ורחימו כדבעי, וז\"ש עוד, אחר שכבר חשב ומני כולהו, מתודה עליהם בכלליות שיש חסרון בכל אלה המעשים, ואומר עשיתי ככל אשר צויתני, שעשיתים רק בהחלט ובעכ\"ח מטעם הצווי, ונחסר מהם בחי' אהבה וחשקות ובחי' לשמה גמור."},{"passage_id":"devurim_ab30e614_p49","passage_content":"וז\"ש השקיפה ממעון קדשך מן השמים, שאם תשגיח על כל אלה מעשי המצות מן השמים יהי' ח\"ו השקפה לרעה, דבחי' זו לפגם יחשב מעל השמים, ובעולמות העליונים, וע\"כ אמה\"כ לשון השקפה שהיא לרעה, ואמר מן השמים שהיא מיותר לכאורה (עיין קושיא י\"א י\"ב) אמנם כ\"ז מענין הודוי הוא, שמפשפש במעשה המצות ודואג ומתבונן עליהם, שאם יהי' השקפה מן השמים יתעורר ח\"ו קטרוג על מעשי המצות אלו, ושמא יהי' ח\"ו השקפה לרעה."},{"passage_id":"devurim_ab30e614_p50","passage_content":"אמנם גדול כח מתנות עניים, שהופך מדת הרוגז לרחמים, ואפי' בשלא לשמה יש לו כח זה, דמ\"מ העני נהנה ויתבאר בהקדם מ\"ש החיד\"א ז\"ל בספרו ראש דוד (פ' ברכה) עה\"פ שמח זבולן בצאתך וגו', ויש להרגיש דלכאורה מה הי' עולה על הדעת, שיהי' זבולן או יששכר עלי עצב, שהוצרך משרע\"ה לומר שמח זבולן וגו', ואפ\"ל דהנה פליגי הראשונים ומהר\"ש פרימו, דהראשונים ס\"ל דאף אם החכם לומד שלא לשמה, אבל המחזיק בידו, האיש העשיר לא הפסיד, דהוא נתן את מעותיו על דעת שהחכם ילמוד לשמה, ואם הוא למד שלא לשמה, לגרמי' הוא דעבד, והעשיר לא הפסיד, ומהר\"ש פרימו חלק עליהם, וס\"ל דאם התורה הוא שלא לשמה העשיר הפסיד, דאם המקור מושחת, מאין תמצא מים במורד וכו' וסיים החיד\"א ז\"ל דלפי שיטת הראשונים יתפרש הפסוק שמח זבולן בצאתך על שיששכר באהליך, כי בכל אופן שמח, דגם אם ח\"ו ילמוד שלא לשמה, אין נגרע מחלקך עכת\"ד ז\"ל."},{"passage_id":"devurim_ab30e614_p51","passage_content":"ובספר צמח דוד מהה\"צ מדינאב ז\"ל הביא דברי הראש דוד הנ'\"ל ומוסיף עליו, דהנה לפי\"ז עוד יקשה, דהא תינח בזבולן הוצרך לפכח דאגתו כנ\"ל, אבל מה יאמר ביששכר, דתיבת שמח נאמר גם עליו, וממנ\"פ אם לומד לשמה א\"צ לפכח דאגתו, ואם ח\"ו לא, א\"כ במה ישמח, אמנם הדבר נכון דעיקר הטעם דיש לזבולן עוה\"ב, לפי שמביא את חבירו לעוה\"ב, וא\"כ כיון דהכרעת משרע\"ה דזבולן יש לו בכל אופנים עוה\"ב, א\"כ גם יששכר יש לו לשמוח, אפי' ח\"ו אם עוסק שלא לשמה, מ\"מ יגיע לו חלק לעוה\"ב, כיון שעל ידו יש לזבולן עוה\"ב עייש\"ד."},{"passage_id":"devurim_ab30e614_p52","passage_content":"ולפי\"ז גדול כח מתנות עניים שמהפך מדת הרוגז לרחמים, ואפי' בשלא לשמה לא יקופח שכרו, והנה הוא מתודה נתתיו ללוי לגר ליתום וגו', ויש ביניהם גם עושין לשמה, ואפי' אם יעשו שלא לשמה, מ\"מ המחזיק לא יקופח שכרו כסברת הראשונים הנ\"ל, ועי\"ז גם המקבל בא בשכרו כאלו עשה לשמה, לפי שמביא את המחזיק לעוה\"ב, כמ\"ש בס' צמח דוד הנ\"ל, וזשה\"כ וברך את עמך את ישראל, שאחר שהתודה שנתן מתנותיו שלא לשמה, עשיתי ככל אשר צויתני כנ\"ל, חוזר ומתפלל וברך את עמך את ישראל, שבצירוף כל ישראל יחד, בחי' עמך, ובחי' ישראל שהם בני עלי' העושים לשמה, מגיע לכולם שכרם משלם, ויהי' השקפה לטובה, וז\"ש את עמך את ישראל, דאת לרבות בא, שכל אחד מתרבה חלקו בצירוף חלק חבירו, דהמחזיק יושלם חלקו ע\"י הלומד, והלומד ע\"י המחזיק כנ\"ל, וכל אחד זוכה בזכותו של חבירו, -וזה ענין הודוי שמתודה על מעשה המצות שלא היו בבחי' לשמה, ומתפלל לפני השי\"ת שיעלו לרצון בצירוף כל ישראל, כמ\"ש וברך את עמך את ישראל כנ\"ל. -וא\"ש מה שמדבר הכתוב כאן בלשון רבים (עיין קושיא י\"ג) לפי שמתפלל בזכות הרבים ובצירוף כל ישראל, ע\"כ אומרה בלשון רבים."},{"passage_id":"devurim_ab30e614_p53","passage_content":"ויתבארו לדרכנו סמיכת הפרשיות, שאחר פרשיות בכורים והמעשרות, אמה\"כ היום הזה ד' אלקיך מצוך לעשות את החקים אלה וגו', ושמרת ועשית אותם בכל לבבך ובכל נפשך, פרש\"י בת קול מברכתו, הבאת בכורים היום, תשנה לשנה הבאה, וכתב הרא\"ם שדרשו כן מפני סמיכות הפרשיות בכורים ומעשרות וכו', דאל\"כ מאי ושמרת ועשית, דמשמע שהוא צווי לעתיד, הרי כבר שמר ועשה, אלא עכ\"ח שפי' ושמרת ועשית אינו צווי, אלא ברכה שתזכה לשנה הבאה לשמור ולעשותו וכו', והח\"ס זלל\"ה הקשה, והרי בכל שנה הבת קול מבשרו שיביא לשנה הבאה, וכי לעולם יחי', ואיך אפשר זה עיי\"ש, ובאמת אין זו קושיא, דאין זה הבטחה, שב\"ק מבטיחתו שיביא לשנה הבאה, אלא ברכה אם יזכה אלי' בצירוף שאר זכיות."},{"passage_id":"devurim_ab30e614_p54","passage_content":"ולדרכנו אפ\"ל עוד בחי' בזה, עפימ\"ש לעיל דענין הודוי שמתודה לפני השי\"ת, שלא קיים המצות האלו בעשי' לשמה, ובמחשבה זכה וצלולה בלתי לד' לבדו, ובכל לבבך ובכל נפשך, וע\"כ היום הזה ד' אלקיך מצוך וגו', ושמרת ועשית אותם בכל לבבך ובכל נפשך, והוא צווי וגם ברכה, שלשנה הבאה יזכה לקיים מצות בכורים והמעשרות בכל לבבך ובכל נפשך, ומאהבת השי\"ת ובחי' לשמה, ולא יהי' השקפה לרעה כלל."},{"passage_id":"devurim_ab30e614_p55","passage_content":"עוד בחי', עפי\"מ שפרשתי מ\"ש לשנה הבאה בירושלים, ולכאורה למה לנו לדחותו ולבקש על לשנה הבאה, והרי אנו מחכים ומצפים אל הגאולה שיהי' מיד, כמאמר אלי' היום אם בקולו תשמעו, ופירשתי עפ\"י דברי הספרי (פ' בהעלותך) בשנה השנית לצאתם מארץ מצרים וגו', ללמדך שמונים מיציאתם ממצרים וכו', באו לארץ התחילו מונים לביאתם וכו', נבנה הבית התחילו למנות לבנינו וכו', חרב הבית התחילו מונים לחרבנו וכו', והנה לע\"ל אמרז\"ל (ברכות י\"ב ע\"ב) שתהי' יצ\"מ טפלה וגאולה העתידה עיקר, ובודאי מיד אחר הגאולה יתחילו למנות השנים לגאולה העתידה, ויתחיל חשבון חדש במנין השנים, וז\"ש לשנה הבאה בירושלים, באמת אנו מצפים שיהי' מיד, אבל בין כך יהי' שנה חדשה, ויתחיל חשבון חדש במנין השנים, ואפי' אם נזכה להיום אם בקולו תשמעו יהי' נקרא שנה הבאה."},{"passage_id":"devurim_ab30e614_p56","passage_content":"ואפ\"ל עוד בחי' בזה עפימ\"ש בנזה\"ק (פ' ויחי) הובא בערבי נחל (בדרוש ג' בה\"ג) דלעולם אי אפשר להיות קץ הגאולה, אם לא בהגיע אותה העת, אשר בו מאיר הצירוף ההוא המורה על הגאולה, ולפי\"ז תקשי איך אמרו חז\"ל זכו אחישנה, אמנם כאשר ישראל עושים תשובה וראויין להגאל, ועדיין לא בא אותו עת הארת הצירוף, אז הקב\"ה מחליף את הזמנים, ומקדים אותו הזמן לקבעו מיד, ומאיר עתה צירוף הגאולה עייש\"ד (הובא בדברינו כ\"פ), והנה כתב רש\"י ז\"ל (בפ' ויצא) עה\"פ והנה רחל בתו באה עם הצאן, הטעם למטה בא', ופירושו אתי' לשון הווה ועדיין לא באה, והשני ורחל באה, הטעם למעלה בבי\"ת, ופירושו אתת שכבר באה, עכ\"פ לשון באה משמשת בשתי פנים, שהולך ובאה, וגם שכבר באה, ולפי\"ז מה שאומרים לשנה הבאה בירושלים, אין בזה דחי' על שנה אחרת, דאם יזכו ישראל שיהי' גאולתם בבחי' אחישנה, כבר באה ברגע א' ע\"י החלפת הזמנים, ואז פירושו לשנה הבאה שכבר באה, ואף אם עכשיו לא הגיע אותו הזמן המוכן לגאולה יוכל להיות ברגע א' ע\"י החלפת הזמנים כנ\"ל."},{"passage_id":"devurim_ab30e614_p57","passage_content":"ולפי\"ז אפ\"ל שבת קול מברכתו, הבאת בכורים היום תשנה לשנה הבאה, הכוונה שיהי' הגאולה מיד, והגאולה נקרא לשנה הבאה אפי' אם יהי' מיד כמ\"ש לעיל, וז\"ש שיזכה להביא הבכורים מיד בירושלים הבנוי', ובגאולה האמיתית, ואז יהי' רוח הטומאה יעביר מן הארץ, ויתבטלו המשביתים והמפריעים מעבודת השי\"ת, ושמרת ועשית בכל לבבך ובכל נפשך, ותהי' יכול לקיים המצוה בשלימות, ובבחי' לשמה מאהבת השי\"ת."},{"passage_id":"devurim_ab30e614_p58","passage_content":"ולדרכנו יתורץ קושית הרמב\"ן ז\"ל, ע\"ד רש\"י ז\"ל אין לך אלא כהן שבימיך כמו שהוא (עיין לעיל קושיא ח'), דהנה הבאנו לעיל דברי הראש דוד, בפלוגתת הראשונים אם התלמיד חכם המקבל אינו עוסק לשמה, מה יהי' דינו של הנותן והמחזיק, אם יזכה בשכרו כדין עושה לשמה (עיין לעיל) והנה זה המביא הבכורים, דואג ומפחד שמא לא קיים המצוה בבחי' לשמה, ובכל לבבו ובכל נפשו, וכמ\"ש לעיל שזהו ענין הודוי, אולם חושב ומתנחם שע\"י הכהן המקבל הבכורים, וע\"י שהוא יעבוד עבודתו לשמה, יבוא גם הנותן בשכרו כעושה לשמה כנ\"ל, ומעתה יחוש המביא בכורים, שמא גם הכהן אינו עוסק לשמה, ולא יוכל להעלהו לבחי' עושה לשמה, ע\"כ הזהיר הכתוב ובאת אל הכהן אשר יהי' בימים ההם, אין לך אלא כהן שבימיך, ובכל אופן תקיים את המצוה כפי הכנתך, ותזכה נרי צירוף הנותן והמקבל, ובצירוף כל ישראל, כמ\"ש לעיל בביאור הכתוב וברך את עמך את ישראל."},{"passage_id":"devurim_ab30e614_p59","passage_content":"ואפ\"ל עוד בחי' בזה, דהנה בהעלאת מעשר שני לירושלים, מבואר טעמא דקרא, באמרו (דברים י\"ד, כ\"ג) ואכלת לפני ד' אלקיך במקום אשר יבחר וגו', מעשר דגנך ותירשך ויצהרך ובכורות בקרך וצאנך, למען תלמד ליראה את ד' אלקיך כל הימים, והתוס' בב\"ב (כ\"א ע\"א) הביאו דברי הספרי למען תלמד ליראה, גדול מעשר שני שמביא לידי תלמוד, לפי שהי' עומד בירושלים עד שיאכל מע\"ש שלו, והי' רואה שכולם עוסקים במלאכת שמים ובעבודה, הי' גם הוא מכוון לבו ליר\"ש, ועוסק בתורה עיי\"ש בתוס', והחינוך כתב טעם זה גם על מצות ראי'."},{"passage_id":"devurim_ab30e614_p60","passage_content":"ואפשר שטעם זה, ישנו גם בהבאת בכורים, וזה ירמוז בכתוב והלכת אל המקום אשר יבחר ד' אלקיך לשכן את שמו שם ובאת אל הכהן וגו', שיתעורר מקדושת המקום וקדושת הכהנים בעבודתן, וכמו\"ש בגמ' הנ\"ל שהי' מושיבין מלמדי תנוקת בירושלים, מאי דרוש כי מציון תצא תורה, וכתבו התוס' לפי שהי' רואה קדושה גדולה, וכהנים עוסקים בעבודה, הי' מכוון לבו יותר ליראת שמים וכו', ואפשר שזה טעם המצוה ובאת אל הכהן וגו', ולא שישלח בכוריו עם שליח, אלא הוא בעצמו יבוא, לדבק עצמו עם הכהנים משרתי ד', למען ילמד ליראה, ומעתה הי' הו\"א לומר שאם הכהן אין בו מבחי' היראה, וכמו שהי' בבית שני כהנים צדוקים, לא יביא אליו בכוריו, אבל גזה\"כ הוא שבכל ענין חייב להביא בכוריו."},{"passage_id":"devurim_ab30e614_p61","passage_content":"ואפשר שע\"ז רמז רש\"י ז\"ל במתק לשונו, אין לך אלא כהן שבימיך כמות שהוא, ובפ' שופטים כתב אין לך אלא שופט שבימיך, ולא כתב כמות שהוא, ואפ\"ל הכוונה רק אם הכהן כמות שהוא, ויש לו דעת עצמו ודעת דקדושה כראוי לכהן, כמ\"ש כי שפתי כהן ישמרו דעת, אבל אם הוא נשפע מהשפעת אנשי רשע שבדור, ונתבטלה דעתו ורצונו, נמצא שאינו כמות שהוא אלא נשתנה מהותו ודעתו לדעת הנשפע מהם, אז אין לדבק בו וללמוד ממנו, ואף שמחויב להביא לו בכורים דגזה\"כ הוא, אבל אל ילמד מדרכיו, וזה שדייק רש\"י ז\"ל לומר כמות שהוא, שהוא תנאי בדבר, ולא הוצרך לומר כן בשופט, דפשיטא הוא דאם השופט משוחד מאחרים, אינו ראוי להיות שופט, ומבואר כן בפסוק, אלא שבכהן הוצרך למעט ולומר כמות שהוא."},{"passage_id":"devurim_ab30e614_p62","passage_content":"ועתה נבוא לבאר ענין ברכה וקללה (עיין לעיל קושיא י\"ד וט\"ו) עפי\"מ שפירשנו (בפ' ראה) לתרץ קושית הכתנות אור דל\"ק מידי, דמה שמצינו אצל יצחק אבינו שפתח בקללה וסיים בברכה, ואמר אורריך ארור ומברכיך ברוך, מיירי באוררי ברא, דטבע הרשעים ששונאים את הצדיקים, כמ\"ש בישמח משה (פ' בלק) שזו שימה מאת ד', ששנאה כבושה יש בין צדיק לרשע בטבע, אף אם אין מכירין זה את זה, ואינם יודעים על מה, אבל מחסדי הבוי\"ת הושם כן בטבעם, כדי שלא יבואו לידי התחברות, ושנאה זו טובה גדולה לצדיקים עייש\"ד, וכעין זה כתב הח\"ס זלל\"ה, עה\"פ ויכחשו איביך לך, שלא הובטח להם שלא יהי' להם אויבים כלל, ויהפכו לאוהבים, דזה דבר שא\"א, דטבע הרע שונא אל הטוב, גם מצינו שאמר הקב\"ה לאברהם אבינו מקללך אאור, ולא הבטיחו שלא יהי' לו מקללים, כי הסט\"א שונא את הטוב ורודף אחריו, אלא שהבטיחו השי\"ת שלא יזיק לו קללתם, ויקללו המה ואתה תתברך, ויחול הקללה על המאוררים, וא\"כ אין בקללתם ממש, אלא גרמת צער בעלמא, וע\"כ הקדים אורריך ארור למברכך ברוך שהצדיקים תחלתן יסורים וסופן שלוה, אבל מה שאמר משרע\"ה ראה אנכי נתן לפניכם ברכה וקללה, וכן ברכות וקללות שבהר גריזים והר עיבל, הם מן השמים, וע\"כ אינו מן המידה להתחיל בקללה פן יזיק ח\"ו, וע\"כ לפי שהי' משרע\"ה אוהב את ישראל התחיל בברכה, וע\"י אמירתו המשיך הברכה לישראל, ונמתק הקללה ולא יחולו ויתהפכו לברכות, ומה\"ט פתחו בברכה בהר גריזים, כדי להמתיק הקללות שלא יחולו כלל, ועוד נבאר להלן."}]},{"dvar_torah_id":"devurim_27602f3c","title":"ברכות בבואך ובצאתך בתורה","summary":"המדרש מלמד על הברכות בבואך ובצאתך, שהן תלויות בכוונת האדם לעסוק בתורה גם בעסקי העולם. הגלות היא צורך לגאולה, והברכות יתגשמו עם בניין ירושלים. תוכחות משה נמסרו בדרכי רחמים, והגאולה העתידה תביא עמה ברכות שלמות.","contents":[{"passage_id":"devurim_27602f3c_p1","passage_content":"איתא במדרש תנחומא ברוך אתה בבואך, על תנאי בבואך לבתי כנסיות ולבתי מדרשות, וברוך אתה בצאתך מבתי כנסיות ומבתי מדרשות, ולכאורה נראה כסתירה, דמתחלה ניתנה הברכה על תנאי בבואך לביהמ\"ד, ומיד אמר שתתברך גם בצאתך מביהמ\"ד, ובמד\"ר (פ\"ז ס\"ה) דרשו ברוך אתה בבואך בפרגמטיא שלך, וברוך אתה בצאתך, בפרגמטיא שלך, ודוד מפרשה (תהלים קכ\"א) ד' ישמר צאתך ובואך מעתה ועד עולם, וצ\"ב דהיכן מפורש בהאי קרא ראי' לדרשת המדרש, גם פלא שדרשו בבואך בפרגמטיא ובצאתך לפרגמטיא, ולמה שינו מדרשתם במקרא שדרשו בבואך לביהמ\"ד ובצאתך לפרגמטיא."},{"passage_id":"devurim_27602f3c_p2","passage_content":"אמנם אפשר לפרש כוונת המדרשים, שגם ביציאתך לפרגמטיא, תהי' דבוק בתוה\"ק ודעתך עלי', וכמ\"ש הרא\"ש ז\"ל בפ\"א במס' ברכות (י' י\"ג) בבנ\"א שרגילין תמיד לעסוק בתורה, אפי' כשיוצאין לעסקיהם, לא חשיב הפסק לענין ברכה, שתמיד דעתם על לימודם, וכן צריך להיות, שיהי' מקושר בתוה\"ק גם בצאתו לפרגמטיא, ויעסוק בה כפי דיני התורה, ובכוונה שתהי' פרנסתו מצוי', כדי שיוכל לשמור ולקיים מצותיו ית', ולעסוק בתורה ולהחזיק לומדי תורה, וכמ\"ש רז\"ל ושמחת בכל הטוב אין טוב אלא תורה, וכמו שפירשנו לעיל, שבכל עניני עוה\"ז, אחת יהי' כוונתו, להשיג הטוב המעולה, והוא קיום ועסק התורה, ואם ככה יהי' כוונתו, אז גם עסקו בפרגמטיא ובעניני עוה\"ז, הוא נצחיות ועומדת לעד, לא כשאר עניני עוה\"ז, שהם כצל עובר ואיננו."},{"passage_id":"devurim_27602f3c_p3","passage_content":"ומעתה יתבארו דברי התנחומא הנ\"ל, ברוך אתה בבואך על תנאי בבואך לבתי כנסיות ולבתי מדרשות, וברוך אתה בצאתך ביציאתך מבתי כנסיות ובתי מדרשות, ואין זה סותר לתחילת המאמר, אבל הכוונה שתהא יציאתך כביאתך, וגם יציאתך יהי' על תנאי בבואך לביהמ\"ד, שתהי' מקושר עם התוה\"ק, ויציאתך לפרגמטיא יהי' רק כדי להשיג עסק התורה וקיום המצות, וע\"כ גם בצאתך לפרגמטיא, יגיעך אותן הברכות כבואך לביהמ\"ד, דגם זו היא מעסק התורה וקיום המצות, וז\"ש במדרש רבה ברוך אתה בבואך לפרגמטיא, וברוך אתה בצאתך לפרגמטיא, שגם בצאתך לפרגמטיא יהי' כוונתך על בואך לביהמ\"ד, ויהי' שכר היציאה כביאה, נצחיות וקיימת לעוה\"ב, ודוד מפרשה ד' ישמר צאתך ובואך מעתה ועד עולם, שאם יהי' כוונתך בצאתך ובואך לשם ד', אז יהי' מעתה ועד עולם נצחיות וקיימת לעוה\"ב."},{"passage_id":"devurim_27602f3c_p4","passage_content":"עוד איתא בתנחומא ברוך אתה בעיר זו ירושלים וכו', וברוך אתה בשדה זו ציון, שנא' (ירמי' כ\"ו) ציון שדה תחרש, ואימתי מראה הקב\"ה לישראל הברכה הזאת, כשיבנה ירושלים ויחזיר הגליות לתוכה וכו', ולכאורה שדה נקראת בחורבנה, כמשה\"כ ציון שדה תחרש, ואין זה ברכה."},{"passage_id":"devurim_27602f3c_p5","passage_content":"אמנם יתבאר עפ\"י מ\"ש השלה\"ק שהגלות צורך הגאולה, וכפל ענין זה בחיבורו כ\"פ, והאריך בזה האריז\"ל בשער המצות (פ' ראה), דתכלית כל הגליות לברר ניצוצות הקדושות משם, וכ\"ז צורך לגאולה, עיין בספרי ויואל משה (מ\"א סי\"ט) הארכתי בזה, וז\"ש במדרש ברוך אתה בשדה וכו', וקאי על זמן חורבנה שהוא בבחי' שדה, ואז יצטרכו ישראל לברכה, שיוכלו לברר הניצה\"ק, ולהחיש עי\"ז זמן גאולתם, וסיום המדרש ואימתי מראה הקב\"ה לישראל הברכה הזאת, כשיבנה ירושלים ויחזיר הגליות לתוכה וכו', ר\"ל דאז יראו עינינו, וישיגו כל ישראל, שהגלות הי' צורך לגאולה וטובה לישראל, כמ\"ש השלה\"ק דגלות ישראל שפיזרם הקב\"ה בעולם טובה הוא לישראל, וכן מבואר בדרז\"ל בכ\"מ (הבאתי בספרי ויואל משה מאמר ב' סי' ק\"י עיי\"ש) וז\"ש כשיחזרו הגליות מראה הקב\"ה לישראל הברכה הזאת, ויבינו שהי' ברכה וטובה להם."},{"passage_id":"devurim_27602f3c_p6","passage_content":"ואפ\"ל רמז במשה\"כ ונסחתם מעל האדמה אשר אתה בא שמה לרשתה (עיין קושיא י\"ט וקושית הח\"ס ז\"ל) ויתבאר עפימ\"ד במס' ברכות (דף ח' ע\"א) א\"ל לר' יוחנן איכא סבי בבבל, תמה ואמר למען ירבו ימיכם וגו' על האדמה כתיב, אבל בחו\"ל לא, כיון דאמרי לי' מקדמי ומחשכי לבי כנישתא, אמר היינו דאהני להו וכו', ולכאורה עדיין הקושיא במקומה עומדת, דעל האדמה כתיב אבל בחו\"ל לא, וכתב המהרש\"א ז\"ל בח\"א דיש לפרש, עפימ\"ש במס' מגילה (דף כ\"ט א') עתידין בתי כנסיות ובתי מדרשות שיקבעו בא\"י וכו', וע\"כ ה\"ה מכלל א\"י, שיקבעו שם לעתיד, והו\"ל כאלו הם על האדמה עיי\"ש."},{"passage_id":"devurim_27602f3c_p7","passage_content":"ואפשר שע\"ז ירמוז הכתוב, אחר שכבר אמר גזירת הגלות, יולך ד' אותך ואת מלכך אל עם אשר לא ידעת וגו', אמר עוד בסוף התוכחה לרמז, שבאחרית הימים יהי' עוד בחי' גלות קשה מן הראשונה, ובעוה\"ר כל זאת באתנו וקרה לנו בימינו, שנחרבו אלפים בתי כנסיות ובתי מדרשות ות\"ת וישיבות, וגלו ישראל מתוכם, ורש ונסחתם מעל האדמה ותרגום אונקלוס ותטלטלון וכו', ובתי כנסיות ובתי מדרשות נקראו על האדמה כמ\"ש המהרש\"א ז\"ל, אשר אתה בא שמה לרשתה, ר\"ל שתבוא עמהם לא\"י לרשתה, ומאותן המקומות הקדושות גלו ישראל, וזה יהי' סוף התוכחה, והקב\"ה יחיש גאולתינו ופדות נפשינו, ויתהפכו כל אלה לברכות."},{"passage_id":"devurim_27602f3c_p8","passage_content":"ועתה נבוא לבאר טעם השינויים שבין פ' תוכחה שבתו\"כ לתוכחה שבמשנה תורה, אמחז\"ל במס' מגילה (דף ל\"א נרב) אין מפסיקין בקללות וכו', אמר אביי ל\"ש אלא בקללות שבתורת כהנים, אבל קללות שבמשנה תורה פוסק, מ\"ט הללו בלשון רבים אמורות, ומשה מפי הגבורה אמרן, והללו שבמשנה תורה משה מפי עצמן אמרן, וכתב הרמב\"ן ז\"ל (בפ' בחקתי) ע\"ד הגמ' הנ\"ל, משה מפי עצמן אמרן, הגבורה עשתה משה שליח בינו ובין כל ישראל, וביארנו בדברינו (פ' ראה) דעדיין צריך להבין לחלק ביניהם, ומ\"ט מפסיקין בתוכחות שבמשנה תורה, ואין מפסיקין בתוכחות שבתו\"כ, וכי מפני שמשה הי' שליח מפי הגבורה נשתנו, והרי בכל התורה הי' משה רבינו סרסור בין ישראל לאביהם שבשמים."},{"passage_id":"devurim_27602f3c_p9","passage_content":"ובארנו שם עפ\"י המבואר בספה\"ק, דיש ב' בחי' בדיבור משה רבינו, בחי' זה הדבר שהי' שכינה מדברת מתוך גרונו, ובחי' כה אמר ד' שהי' שליח בדיבורו ית', ומבואר בכתבי האריז\"ל דתורה שבכתב הוא דין, ותושבע\"פ רחמים, וע\"כ תוכחות שבתו\"כ שמשה מפי הגבורה אמרן, היו בבחי' תושב\"כ ומצד הדין והגבורה, וע\"כ אין מפסיקין בהן, כמ\"ש בגמ' הטעם שאמר הקב\"ה אינו בדין, שיהיו בני מתקללין ואני מתברך עיי\"ש, אבל תוכחות שבמשנה תורה שמשה מפי עצמן אמרן והי' שליח בדבר, ונאמרו בבחי' כה והיא בחי' תושבע\"פ, נמתקו על ידו ונתהפכו מדין לרחמים, ולכן נזכר שם הוי' בכמה פסוקים בתוכחה זו, להורות כי מצד החסד הם באים עייש\"ד באריכות."},{"passage_id":"devurim_27602f3c_p10","passage_content":"ובזה נבין מה שנכתבו הארורים לבד, ולא נכתבו הברכות בפירוש, אלא שלמדום חז\"ל מהיקש הקללות (עיין קושיא י\"ד) ולדרכנו יובן, דהקללות הי' צורך והכרח לאומרם מפי משרע\"ה, וע\"י בחינתו וימתקו ויתהפכו לברכות, כמ\"ש ז\"ל במד\"ר פ' בחקתי, אם זכיתם הריני הופך לכם הקללה לברכה, ויתהפכו הקללות לצירופים אחרים, ויהיו כלו ברכות וחסד ורחמים, משא\"כ הברכות אין צורך בהמתקתן, כי הם ברכות בלא\"ה וכלו חסד ורחמים."},{"passage_id":"devurim_27602f3c_p11","passage_content":"והרמב\"ן ז\"ל בפ' בחקתי (כ\"ו ט\"ז) האריך לחלק בין תוכחות שבתו\"כ לאותן שבמשנה תורה. ותו\"ד כי האלות שבתורת כהנים ירמזו לגלות ראשון, שכן תראה בפסוקי התוכחות, שכל אלו נתקיימו בגלות ראשון וכו', ותסתכל בענין הגאולה ממנו, שאינו מבטיח רק שיזכור ברית אבות וכו', ולא שיאסוף את נידחיהם, כי כן הי' בעלותם מבבל, שלא שבו כולם רק יהודה ובנימין ומקצת השבטים, גם לא הבטיח שיסלח חטאתם ויוסיף אהבתם כקדם וכו', אבל הברית שבמשנה תורה רמז לגלותינו זה, ולגאולה שנגאל ממנו וכו', והפיצך ד' בכל העמים מקצה הארץ עד קצה הארץ, הוא גלותינו היום שאנו מפוזרים מסוף העולם ועד סופו וכו' וכן כל הפסוקים מורים על עונשי הגלות המר הזה, ואח\"כ מבטיח הכתוב על הגאולה, שיהי' גאולה שלימה ומעולה על כלנו, והבטיח והטיבך והרבך מאבותיך וגו' ונתן ד' אלקיך את האלות האלה על אויביך ועל שונאיך אשר רדפוך, ואלה הדברים יבטיחו בגאולה העתידה הבטחה שלימה וכו' ע\"כ מקצת לשונו עיי\"ש שהאריך."},{"passage_id":"devurim_27602f3c_p12","passage_content":"ואפשר לומר מה שסיים הכתוב בתוכחות שבמשנה תורה אלה דברי הברית וגו' הם דברי ניחומים (עיין לעיל קושיתנו ט\"ז י\"ז י\"ח) עפימ\"ש חז\"ל במס' ברכות (דף ה' ע\"א) יסורין ממרקין כל עוונותיו של אדם ק\"ו משן ועין, מה שן ועין שהן א' מאבריו של אדם, עבד יוצא בהן לחירות, יסורין שממרקין כל גופו של אדם עאכו\"כ, ורשב\"ל אמר נאמר ברית במלח דכתיב ולא תשבית מלח ברית וגו', ונאמר ברית ביסורין דכתיב אלה דברי הברית, מה ברית האמור במלח, מלח ממתקת הבשר אף ברית האמור ביסורין, יסורין ממרקין כל עונותיו של אדם עכ\"ל הגמ', ופירשתי בזה דברי המדרש ויעבידו מצרים את בני ישראל בפרך, חד אמר בק\"ו, וחד אמר בגז\"ש, ואיתא עוד במד\"ר פלוגתא בפסוק זה בפרך, ר\"א אומר בפה רך, ר\"ש בר נחמן אומר בפריכה (בעבודה קשה המפרכת את הגוף ומשברתו), ונראה דכל אלו הפלוגתות תליא חדא בחבירתא, דהנה יש חילוק אם נלמד יסורין בק\"ו משן ועין, או בגז\"ש דברית ברית, דאם נלמד בק\"ו משן ועין, אז ח\"ו כל כמה שהיסורין גדולים, כח הק\"ו חזק יותר, אבל אם נלמד בגז\"ש מה מלח ממתקת את הבשר אף יסורין ממרקין, א\"כ כמו שמלח ממתקת את הבשר רק במיעוטו, אבל רבוי המלח מקלקל את הבשר ומחלישו, כמו\"כ המתקת היסורין לא יבואו אלא במיעוטו, במה שצורך למירוק עונות, אבל לא ירבה עלינו הקב\"ה ח\"ו היסורין, ובזה פליגי הני תרי מ\"ד, דחד אמר בק\"ו, שהיו היסורים בכח הק\"ו והיו מרובים, ואתי' כמ\"ד בפרך בפריכה, בעבודה קשה המפרכת הגוף, וח\"א בגז\"ש שלא היו אלא כדי מירוק עונות, ואתי' כמ\"ד בפה רך (עיין דברינו במקו\"א הארכנו בזה)."},{"passage_id":"devurim_27602f3c_p13","passage_content":"וע\"כ חתם וסיים משרע\"ה התוכחות שבמשנה תורה, המרמזים על אורך הגלות האחרון, ואמר אלה דברי הברית, והוא דברי נחמה לנו, דעצם היסורין נלמד בגז\"ש מברית האמור במלח, ולא יבואו לעולם אלא במדה ובמשקל ובמיעוטו, כמשפט המלח שנלמד ממנו, ואהני לן גם הק\"ו, ללמוד ממנו שהיסורין מוציאין לחרות מהגלות, בק\"ו משן ועין שעבד יוצא בהם לחירות, אבל עצם היסורים ומידתם נלמד בגז\"ש מברית האמור במלח כנ\"ל."},{"passage_id":"devurim_27602f3c_p14","passage_content":"ועוד ירמוז על ברית אבות, כמ\"ש התוס' במס' שבת (דף נ\"ה ע\"א) דאע\"ג דזכות אבות תמה, אבל ברית אבות לא תמה לעולם, ויתהפכו כל הקללות האלו לעתיד, לצירופים אחרים ויהיו כולם ברכות, וז\"ש אלה דברי הברית פוסל את הראשונים, דאלה דברי הברית יתהפכו לעתיד ויהי' פוסל את הראשונים, והקללות יתהפכו ויתבטלו, וע\"כ נאמרה אלה דברי הברית בתוכחות שבמשנה תורה לבד, דזה רומז על הגאולה העתידה, ואז יתבטלו לגמרי הקללות ולא יהיו עוד."},{"passage_id":"devurim_27602f3c_p15","passage_content":"ועתה נבוא לבאר מאמה\"כ, ותבואו אל המקום הזה (עיין קושיא כ') וקושית הרא\"ם ז\"ל שם, דפסוק ויצא סיחון אין לו קישור אף לאחד מן הפירושים שברש\"י ז\"ל עיין לעיל, ואפ\"ל עפימ\"ש רש\"י ז\"ל ולא נתן ד' לכם לב לדעת וגו' עד היום הזה, שהיו חפצים ומתאוים ומשתוקקים אל התורה, ושמח משה על הדבר, ועל זאת אמר להם היום הזה נהייתה לעם וגו', היום הזה הבנתי שאתם דבקים וחפצים במקום עכ\"ל, ואפשר לרמוז במה שהאריך הכתוב לומר, ולא נתן ד' לכם לב לדעת ועינים לראות ואזנים לשמוע, ולמה מני ואזיל כולהו, אמנם עד עתה לא הי' להם עדיין הרצון והתשוקה אמיתית אל התורה, עד שיתבטלו אלי' כל הרצוניות שבעולם, וא\"כ הי' להם גם רצון אחר זולת התורה וקיומה, ואיתא בספה\"ק דאין לך משוחד בעולם יותר ממי שמשוחד אל תאותיו ורצוניותיו, והמשוחד לא יוכל לראות האמת, כי השוחד יעור עיני חכמים, ולא ישמע ולא יבין את האמת, אלא ההפכו כפי רצונו, וז\"ש הכתוב ולא נתן ד' לב לדעת ועינים לראות ואזנים לשמוע עד היום הזה, שהגעתם למדריגה זו שאתם חפצים במקום, מעתה יהי' לכם לב לדעת ולהכיר את דרך התוה\"ק ודרך האמת ועינים לראות ואזנים לשמוע, מה שלא הי' אפשר עד הנה."},{"passage_id":"devurim_27602f3c_p16","passage_content":"ובזה יתבאר הקישור ותבואו אל המקום הזה ויצא סיחון וגו', דלכאורה מה ראה סיחון שיצא להלחם עם ישראל, והרי לא רצו ישראל להתגרה אתו במלחמה, כ\"א לעבור בארצו, ואילו הניחם לעבור, לא הי' הצווי לכבוש את ארצו עדיין, והרי שמעו כל העמים גודל הנסים שנעשו לישראל, כמאה\"כ שמענו אשר הוביש ד' את מי ים סוף מפניכם ונמס לבבינו וגו', ואיך לא פחד סיחון ויצא להלחם באין הכרח."},{"passage_id":"devurim_27602f3c_p17","passage_content":"אמנם יובן עפימ\"ש ק\"ז הישמח משה זלל\"ה (בפ' בלק) שמטבע הרשעים ששונאים לצדיקים, ולפי גודל הטומאה של האיש ההוא כך הוא השנאה, כי השנאה הוא לפי ההתרחקות, ומצדיק גמור שהוא קדושה גדולה, הוא מרוחק יותר וע\"כ שנוא הוא בעיניו יותר, וכן מי שהוא מטומאה גדולה הוא מרוחק מאוד מהקדושה, וע\"כ נתגבר אצלו השנאה ביותר, עייש\"ד שהאריך בזה, וכתב שהוא שומה מאת ד' ולטובת הצדיקים, והנה סיחון ועוג היו בקליפה ובטומאה גדולים מאוד, כדאיתא בספה\"ק, וע\"כ עכשיו שהרגישו שנתעלו ישראל בצדקתם ובמדריגתם, כמ\"ש ולא נתן ד' לכם לב לדעת עד היום הזה, וכן ותבואו אל המקום הזה פרש\"י שהגעתם אל מדריגה גדולה כזו, וע\"כ נתגבר שנאתם, וגודל השנאה מעוור עינים, ולא השגיחו על הנסים שנעשו לישראל, והלכו להלחם עמהם אף נגד השכל."},{"passage_id":"devurim_27602f3c_p18","passage_content":"ובזה יבואר הקישור ותבואו אל המקום הזה, היינו שהגעתם אל המדריגה הגדולה הזאת, ע\"כ ויצא סיחון וגו', דאילולי הצדקות וגודל מדריגתם, הי' השכל מחייב אותם שלא לצאת במלחמה, ובזה יתבאר דברי המכילתא (בפ' בא) ויחזק ד' את לב פרעה וירדוף אחרי בני ישראל, להודיע שבחן של ישראל שאלו היתה אומה אחרת לא הי' פרעה רודף אחריהם עכ\"ד המדרש, ולדרכנו דלגודל המכות שסבל, והנסים הגדולים שראה, הי' השכל מחייבו שלא לרדוף אחריהם, ואלו הי' אומה אחרת לא הי' רודף אחריהם, אלא לצד גודל קדושתן של ישראל, התגבר עליו שנאתו ועשה אף היפך ממה שהשכל מחייבו."},{"passage_id":"devurim_27602f3c_p19","passage_content":"ולפי\"ז א\"ש משה\"כ ותבואו אל המקום הזה, כי שם מקום מורה כאן על ב' בחי', אל המדריגה הגדולה כפרש\"י, וגם אל המקום הזה ארץ סיחון ועוג כפשוטו, ותליא זה בזה, דלפי שבאתם למדריגה הגדולה הזו, ע\"כ ויצא סיחון להלחם וכבשתם את המקום הזה, ואלולי כן לא הי' עדיין הצווי לכבוש ארץ סיחון ועוג."},{"passage_id":"devurim_27602f3c_p20","passage_content":"ונבוא לבאר דברי הספרי שהתחלנו בה, והי' כי תבוא אל הארץ עשה מצוה זו שבשבילה תכנס לארץ (עיין קושיא א') וקושית הפלאה שם. ויובן עפי\"מ שפירשנו לעיל דברי רש\"י ז\"ל, בת קול מברכתו הבאת בכורים היום, תשנה לשנה הבאה, ופירשנו דהגאולה העתידה נקרא לשנה הבאה, כי יהי' חשבון חדש למנין השנים, עיי\"ש בב' אופנים, וזהו כוונת הברכה שב\"ק מברכתו שנזכה מיד לגאולה שלימה, ולהביא בכורים בביהמ\"ק בכל לבבך ובכל נפשך (עיין לעיל) עכ\"פ מסגולת המצוה של בכורים לקרב הגאולה, ובזה יבואר הספרי בשבילה תכנס לארץ, בגאולה העתידה ובביאת גואל צדק בב\"א."},{"passage_id":"devurim_27602f3c_p21","passage_content":"ופירשתי עוד (עיין בחי' פ' עקב) דברי הספרי הנ\"ל, עפי\"ד המד\"ר (פ' ראה) כי ירחיב ד' את גבולך, אפשר שהקב\"ה מרחיב גבול א\"י, א\"ר יצחק המגלה הזאת אין אדם יודע כמה ארכה וכמה רחבה, כשהיא נפתחת היא מודעת כמה היא, כך א\"י כל רובה הרים וגבעות וכו', ולעתיד שנא' והי' העקוב למישור והרכסים לבקעה, היא מודעת כמה היא, ואיתא בספרי שהראה הקב\"ה למשה כל חדרי א\"י וכו', ומעתה פנימיות הארץ יתגלה רק לעתיד, כשיתפתחו ההרים, וזשה\"כ כי ירחיב ד' את גבולך וגו' ובזה יתבאר הספרי עשה מצוה זו שבשבילה תכנס לארץ, דסגולת מצוה זו למהר את הגאולה כנ\"ל, ותכנס לארץ היינו לפנימיות הארץ, ויתגלה הטמון שבה, ויתפתחו ההרים (עייש\"ד באריכות). וז\"ש מראשית כל פרי האדמה, לרמוז שעדיין לא זכינו רק אל ראשית פרי האדמה ממתנות ארץ ישראל, והעיקר יתגלה אלינו לעתיד, כאשר ירחיב ד' גבול ארץ ישראל, וע\"כ אמר פרי האדמה ולא פרי העץ, להורות על בחי' הנ\"ל (ויתורץ קושיא ב')."}]},{"dvar_torah_id":"devurim_f59d7bfb","title":"הגדת בכורים והכרת הטוב","summary":"בביאת בכורים ישנה מצווה להודות לה' על הארץ, תוך הדגשת הכרת הטוב. הכהן מייצג את השפעת הקדושה, וההבאה היא הכנה לירושת הארץ לעתיד. יש להיזהר מהשכחה ולהבין שהכל מה' יתברך.","contents":[{"passage_id":"devurim_f59d7bfb_p1","passage_content":"והיה כי תבוא אל הארץ אשר ד' אלקיך נתן לך נחלה וגו', כבר דקדקנו לעיל על מלת והי' דמיותר, והרבה פעמים נזכר ביאת הארץ בתורה, כי תבא אל הארץ, כי תבואו וגו', ולא נאמר בהם והי'."},{"passage_id":"devurim_f59d7bfb_p2","passage_content":"ב) גם מ\"ש אשר ד' אלקיך נתן לך, למה הזכיר הודעה זו, וכבר נאמרה ונשנית כ\"פ בתורה, וידוע הוא, ולא עוד אלא שכפל מיד בפסוק שלאחריו, אשר תביא מארצך אשר ד' אלקיך נתן לך, וצ\"ב הכפל למה."},{"passage_id":"devurim_f59d7bfb_p3","passage_content":"ג) בבעה\"ט דריש סמוכין, לעיל מיני' כתיב תמחה את זכר עמלק, וסמיך לי' והי' כי תבא אל הארץ, שנצטוו למחות זכר עמלק מיד בכניסתן לארץ וכו', ונראה שהוא דורש והי', אין והי' אלא מיד, וכמו שדרשו בספרי עה\"פ והי' כי תבוא אל הארץ, אבל צ\"ב דהרי מחיית עמלק לא הי' מיד, דלא נצטוו ישראל במצוה זו, אלא אחר הקמת המלך כמבואר בגמ', גם לא יושלם פעולה זו אלא לעתיד."},{"passage_id":"devurim_f59d7bfb_p4","passage_content":"ד) בספרי עשה מצוה האמורה בענין, שבשכרה תכנס לארץ, כבר הבאנו לעיל קושית ההפלאה ז\"ל, על דברי הספרי הנ\"ל ועוד לאלקי מילין."},{"passage_id":"devurim_f59d7bfb_p5","passage_content":"ה) הגדתי היום לד' אלקיך כי באתי אל הארץ וגו', צ\"ב הגדה זו למה, והרי נראה ביאתו במה שהביא מפרי האדמה, ומהו הכוונה בהודעה זו."},{"passage_id":"devurim_f59d7bfb_p6","passage_content":"ו) גם הקשו המפרשים באמרו לכהן ד' אלקיך, וכי אלקיך של כהן הוא, והול\"ל ד' אלקינו, שלא להוציא את עצמו מן הכלל."},{"passage_id":"devurim_f59d7bfb_p7","passage_content":"ז) ובאת אל הכהן אשר יהי' בימים ההם, פרש\"י בשם הספרי אין לך אלא כהן שבימיך כמו שהוא, כבר הבאנו לעיל קושית הרמב\"ן ז\"ל ותמיהת הרא\"ם ז\"ל עליו, גם מהו הכוונה שהוסיף רש\"י על דברי הספרי, במ\"ש כמו שהוא, וכבר פירשנו לעיל ועוד לאלקי מילין."},{"passage_id":"devurim_f59d7bfb_p8","passage_content":"ח) עוד ראוי להעיר במה שהעירו המפרשים, מהו כל החרדה והשמחה הגדולה במצות בכורים, כמ\"ש במס' בכורים (פ\"ג מ\"ב) כיצד מעלין את הבכורים, כל העיירות מתכנסות וכו', הפחות והסגנים והגזברים יוצאים לקראתם וכו', החליל מכה לפניהם וכו', ודברו הלוים בשיר, ולא מצינו שמחה ופירסום כזו בעלית מעשר לירושלים, ובעלי' לרגל, וזביחת קרבן פסח ומדוע נשתנה מצות בכורים."},{"passage_id":"devurim_f59d7bfb_p9","passage_content":"ט) את ה' האמרת היום להיות לך לאלקים וגו', וד' האמירך היום להיות לו לעם סגולה וגו', פרש\"י האמרת והאמירך אין לו עד במקרא, ולי נראה שהוא לשון הפרשה והבדלה, הבדלתיו לך מאלהי הנכר להיות לך לאלהים, והוא הפרישך אליו מעמי הארץ להיות לו לעם סגולה, ומצאתי להם עד, והוא לשון תפארת כמו (תהלים צ\"ד) יתאמרו כל פועלי און, עכ\"ל ודבריו צ\"ב, דאיתא בתו\"כ פ' קדושים הביאו רש\"י ז\"ל והבדלתם בין הבהמה הטהורה לטמאה וגו', א\"צ לומר בין פרה לחמור, והלא מפורשים הם ומובדלין וניכרין, אלא בין נשחט רובו של סימן לנשחט חציו, וכמה בין רובו לחציו מלא שערה, מבואר דלשון הבדלה לא שייך, אלא בסוגים קרובים ודומין זה לזה במקצת, עד שהוצרכו להבדלה, אבל איך יצדק לשון הבדלה על את ד' האמרת היום, שהבדלתיו מאלהי הנכר להיות לך לאלקים, שאין כאן שום דמיון השתוות, שיהא צריך לעשות הבדלה."},{"passage_id":"devurim_f59d7bfb_p10","passage_content":"ובעלי תוס' פירשו האמרת לשון תמורה וחילוף, כלומר בשביל ד' החלפת כל האלהות, ובחרת בהקב\"ה, וד' האמירך החליף כל האומות שבעולם ובחר בך וכו', ודומה לו יתאמרו כל פועלי און, שמחליפין דבריהם ואינם עומדים בדיבורם וכו', וצ\"ב דאיך יצדק לשון תמורה עליו ית', כמשה\"כ ומה דמות תערכו לו, וכי ח\"ו בתורת תמורה בחרו ישראל בהקב\"ה, וגם ד' האמירך היום איך יצדק לפרש בלשון תמורה, וכי תמורת העכו\"ם בחר ד' בנו וצ\"ב."},{"passage_id":"devurim_f59d7bfb_p11","passage_content":"ונבוא אל הביאור ונקדים מ\"ש הרמב\"ם ז\"ל (בפ\"ד מהל' בכורים ה\"ג) הגר מביא וקורא, שנא' לאברהם אב המון גוים נתתיך, ה\"ה אב כל העולם כולו, שנכנסין תחת כנפי השכינה, ולאברהם היתה השבועה שיירשו בניו את הארץ, והקשה המשנה למלך, וז\"ל תמיה לי, דאף שיכולין לומר לאבותינו, מ\"מ כיון שלא נטלו חלק בארץ, אינם יכולים לומר אשר נתת לי וכו', ורבינו בעצמו כתב (בסוף ה' מעשר שני) דגרים אינם מתודים, מפני שאין להם חלק בארץ."},{"passage_id":"devurim_f59d7bfb_p12","passage_content":"ובמוסגר שם נדפס תירוץ בשם מהר\"ם בן חביב, לחלק בין בכורים למעשר, דגבי בכורים נקט קרא לישנא דלעתיד, דכתיב אשר נשבעת לאבותינו לתת לנו, וכיון שכן יכול הגר לומר כן וכו', דלעתיד יטלו הגרים נחלה בתוך בני ישראל כמבואר ביחזקאל וכו', אבל גבי ודוי מעשר, דכתיב אשר נתת לנו וגו' לשון עבר, אין הגר יכול לומר ודוי זה, כיון שלא נטל חלק בארץ עכת\"ד, וכ\"כ בכפות תמרים עיי\"ש, אמנם הא גופא טעמא בעי, למה נאמר בבכורים לישנא דלעתיד, ולא במעשר."},{"passage_id":"devurim_f59d7bfb_p13","passage_content":"ואפ\"ל בפשטות, דודוי הי' בשנה השלישית, שלא הי' נוהג מע\"ש כ\"א מעשר עני, והאברבנאל פר' כל פרשת הודוי על מעשר עני עיי\"ש, עכ\"פ גם לפי הפשטות הוא מתודה וגם נתתיו ללוי ולגר ליתום ולאלמנה, ועל לעתיד נאמר אפס כי לא יהי' בך אביון, ע\"כ לא כתבה תורה פרשה זו בלשון עתיד, דאין זה מבחי' העתיד, אבל פרשת קריית בכורים עיקר בחי' רומזת אל העתיד כמו שיתבאר."},{"passage_id":"devurim_f59d7bfb_p14","passage_content":"ונקדים בביאור הספק הנ\"ל, מהו כל החרדה הזאת אשר צוה השי\"ת, להגדיל השמחה על ירושת הארץ, במצות בכורים יותר מבכל המצות, וכבר עמד בזה האלשיך הק' יעיי\"ש, ותוכן דבריו כי זאת כוונתו ית' במצוה זאת, כי הלא יראה האדם עצמו, בארץ זבת חלב ודבש שמן ודשן, תחת גפנו ותחת תאנתו וכו', בתים מלאים כל טוב וכו', חטה ושעורה לרוב מאוד, הלא ידיחנו יצרו בשרירות לבו לאמר, כחי ועוצם ידי עשה לי את החיל הזה, ע\"כ צוה לנו אלקי עולם, כי שנה בשנה נקח מראשית כל פרי האדמה ונשים בטנא, והלוך נלך עד המקום אשר בחר ד', ולהניחו לפניו ית', באומרים לפניו יתברך לא לנו ד' לא לנו, כי הכל שלך ומידך נתנו לך (וכ\"כ הרמב\"ם ז\"ל, הביאו הכלי יקר, שעיקר טעם מצוה, ההכנעה וההשתעבדות אל השי\"ת עיי\"ש)."},{"passage_id":"devurim_f59d7bfb_p15","passage_content":"ובזה תלוי קיום כל התורה כולה, שנשריש בלבותינו ידיעה זו, וע\"ד כן נתן לנו הקב\"ה את הארץ, כי זה דרכו ית', כי העולה על רוחו כי קנינו אשר רכש לו עוצם ידו עשה לו הכל, אדון הכל יסירנו ממנו, אך החושב כי הכל שלו ית', ד' יעזבנו בידו, ובזה נבין כל הזהירות והחרדה שצוה השי\"ת במצוה זו, והטיבו אשר דברו חז\"ל, במד\"ר פ' בראשית, שבשביל מצות בכורים נברא העולם, כי זהו יסוד הכל שנחזיק לו ית' טובה, על המחי' ועל הכלכלה, וההיקש בכל יתר הדברים, כי זהו בנין אב על כולם עיי\"ש שהאריך. וכ\"כ האברבנאל, כי להיות המצוה הזאת ענינה, קבלת עול מלכות שמים ואדנות, ולהורות כי השגחת הארץ מאלקי הארץ היא, ולכן הי' הפירסום גדול בהבאת הביכורים, והכבוד והמורא בהם עצום מאוד, להשריש בלבות בני אדם אמונתו יתברך עיי\"ש."},{"passage_id":"devurim_f59d7bfb_p16","passage_content":"ואפ\"ל עוד, מה שבמצות בכורים לבדו צוה השי\"ת לעשות פעולות אלו, ולא במצות מעשר שני ובשאר מצות התלוים בגדולי הארץ, עפימ\"ד במד\"ר בראשית (פ\"א ס\"ד) ר' הונא בש\"ר מתנה אמר, בזכות ג' דברים נברא העולם, בזכות חלה, ובזכות מעשרות, ובזכות בכורים וכו', ואין ראשית אלא מעשרות שנא' ראשית דגנך, ואין ראשית אלא בכורים שנא' ראשית בכורי אדמתך וגו', וכתב היפ\"ת כי המה תכלית הבריאה, כי הקב\"ה ברא את עולמו למען יכירוהו ברואיו, וידעו כי הוא ראשית הסיבה, ולטעם זה צוה להקדיש הראשית לד', שידעו כי לו לבדו הוא הראשית בכל מפעל, ועל כי שלשה אלה מגידים לבנ\"א, כי ד' הוא ראשית הסיבה, נקראו ג\"כ תכלית הבריאה עיי\"ש."},{"passage_id":"devurim_f59d7bfb_p17","passage_content":"ודקדק היפ\"ת למה איחר לחשוב בכורים לבסוף, ובתורה קדמה מצות בכורים לכל אלה, דכתיב בפ' משפטים ראשית בכורי אדמתך תביא בית ד' אלקיך, ומעשר וחלה נאמרו מאוחר לה, ולמה הקדימו את המאוחר עיי\"ש, ובנזה\"ק תירץ לפי דרכו, דבכורים בחינתם גבוה בעולמות העליונים למעלה מכולם, וע\"כ מונה בכורים לסוף דאחרון אחרון חביב, והיסוד של נתינת הארץ תלוי בו עייש\"ד, ואפשר דע\"כ צוה השי\"ת לשמוח על נתינת הארץ במצות בכורים, כי בזה תלוי יסוד ירושת הארץ, ולהלן יתבאר עוד."},{"passage_id":"devurim_f59d7bfb_p18","passage_content":"ונקדים מ\"ש האוהחה\"ק (בפ' ראה) לפרש סמיכת פרשה ראה אל הקודמת, שאמר בסוף פ' עקב כל המקום אשר תדרוך כף רגלכם בו לכם יהי' וגו', ע\"ז אמר ראה אנכי נתן לפניכם היום ברכה וקללה, שיש בנתינה זו ברכה וקללה וכו', את הברכה אשר תשמעו וגו' תהי' נתינה זו לכם לברכה, ואם לא תשמעון אין זו לכם אלא קללה, שבאמצעותה יתקנאו בכם האומות, ויאבדו אתכם ממנה ח\"ו וכו' עייש\"ד, והנה לפי\"ז לכאורה לשמחה מה זו עושה, ומהו כל החרדה לשמוח במצוה זו על נתינת הארץ, ולפעמים ח\"ו עוד לקללה תחשב ולרעתם היא, אם לא יזכו אלי' בשמירת התורה והמצות, ובפרט כי ידעו והשיגו, שעתידה ליחרב ויגלו ממנה, ונרמז להם בפסוקי התורה החורבן המעותד ח\"ו לבוא, וא\"כ לשמחה מה זו עושה, וכבר הבאנו כ\"פ קושית היפ\"ת כי מה צורך הי' בבנין בית שני, שלא היתה לכתחילה אלא בנין לשעה ומעותד ליחרב, וטוב הי' להמתין על בנין המקוה, ולא יצטרכו ישראל לסבול צער החורבן והגלות יעיי\"ש מה שנדחק לתרץ, ועכ\"פ איך יצוייר השמחה בביאת הארץ הזו, בידעם שמעותד ליחרב ויגלו ממנה."},{"passage_id":"devurim_f59d7bfb_p19","passage_content":"אמנם יתבאר עפימ\"ש ק\"ז הישמח משה זלל\"ה (בפ' תצוה) שהי' הכרח בב' מקדשות, להיותם הכנה להכשיר המקום, בכח קדושת העבודה ומעשה הקרבנות, ועי\"ז קנתה הארץ כח רוחני וקדושה נפלאה, שתוכל מעתה לסבול קדושת הבית השלישי מעשה ידי יוצר, עיי\"ש שהסביר דבריו במשל, ולפי\"ז כשנצטווינו במצוה זו דבכורים לשמוח על נתינת הארץ, צריך הכתוב להזכיר בה בנין דלעתיד, דאל\"כ לשמחה מה זו עושה, מאחר שעתידה ליחרב, אלא לפי שהצורך וההכרח בהם להכנת בנין העתיד, וזהו טעם השמחה בהם, שנזכה בשבילה אל בנין המקוה והנצחי."},{"passage_id":"devurim_f59d7bfb_p20","passage_content":"ומעתה א\"ש מה שנאמרה פרשת בכורים בלשון עתיד, אשר נשבעת לאבותינו לתת לנו, ולא אמר אשר נתת לנו, כמ\"ש במצות מעשר, כי ירמוז על ירושת הארץ דלעתיד לטעם הנ\"ל, וז\"ש והי' כי תבוא אל הארץ, דמלת והי' רומז על ביאה דלעתיד, -ובדרך זה יתפרש הסמיכות שכתב בבעה\"ט, דלעיל כתוב תמחה את זכר עמלק, עפימ\"ד בזוה\"ק (בראשית כ\"ה ע\"א) תמחה את זכר עמלק אינון הן ערב רב שבישראל, ואז יהי' שמו שלם וכסאו שלם עיי\"ש, וממילא כשיתבטלו הערב רב מן העולם, אז יהי' ירושת הארץ ברכה לישראל, ויהי' השמחה בשלימות, ובזה יתבאר הסמיכות והי' כי תבוא אל הארץ אין והי' אלא שמחה, דאז יהי' השמחה שלימה בביאת הארץ, ובזה יתבאר דברי הספרי עשה מצוה זו שבשכרה תכנס לארץ, והכוונה על בית השלישי שיהי' ירושת הארץ נצחי, וע\"ד כן שמחים בירושת הארץ במצוה זו, לפי שכ\"ז הכנה אל ירושת הארץ דלעתיד, וזהו שנותן טעם בעשיית מצוה זו, לפי שבשכרה תכנס לארץ לעתיד."},{"passage_id":"devurim_f59d7bfb_p21","passage_content":"ועתה נבוא לבאר ענין הנ\"ל ולא שכחתי מלברכך וקושית התויו\"ט על הרא\"ם ז\"ל, הובא לעיל בדרוש הקדום דהנה בגמ' דברכות (דף ל\"ה ע\"א) מסקינן אלא סברא הוא אסור לאדם שיהנה בלא ברכה, והקשה הפנ\"י דמשמע מכל הפוסקים, דלפום הך מסקנא דהכא, כל ברכת הנהנין הן מדרבנן, לבד מבהמ\"ז לאחריו, ולכאורה יש לתמוה, דבכל הש\"ס משמע דמידי דאתי' מסברא הוי דאורייתא, וחזינן דמקשה הש\"ס בכ\"מ, הא למ\"ל קרא סברא הוא, אלמא דיש לו תוקף דאורייתא כמו דבר המפורש בקרא."},{"passage_id":"devurim_f59d7bfb_p22","passage_content":"והצל\"ח שם מתרץ קושית הפנ\"י, דאימור דאמרי' סברא דאורייתא הוא, לענין דינא כמ\"ש במס' כתובות (דף כ\"ב) מנין להפה שאסר הפה שהתיר, ובב\"ק (דף מ\"ו ע\"ב) מנין למוציא מחבירו עליו הראי', שבאלו המקומות מקשה הגמ' למ\"ל קרא סברא הוא, אבל לומר על דבר שנלמד מסברא שיהי' נחשב למצוה דאורייתא, זה לא שמענו, דאם יהי' הדבר כן, לחנם נכתבו כל המצות שהם שכליות, אלא ודאי כוונת הגמ' כאן לענין ברכות, דכיון דסברא היא דאסור לאדם שיהנה בלא ברכה, לכך תקנו חז\"ל ברכות הנהנין עכ\"ל הצל\"ח. והנה מ\"ש לחלק מוכרח הוא, וראייתו מוכרחת, דאל\"כ לחנם נכתבו כל המצות שכליות, אמנם אעפ\"כ טעמא בעי, וצריך הסבר מדוע יהי' לענין דינא, דבר הנלמד מסברא כדאורייתא, ולא כן לענין מצוה."},{"passage_id":"devurim_f59d7bfb_p23","passage_content":"ויובן עפימ\"ש בחובת הלבבות (שער עבודת אלקים פ\"א), שהדרך שיעורר את האדם על חיובו בעבודת השי\"ת וחלקי', יהי' בשני פנים, אחד הוא הערת השכל נטוע בהכרת האדם, נוצר עליו בשורש בריאתו ותולדתו, והשני הערת התורה קנוי בדרך השמע, והוא התורה אשר יגיענה הנביא אל ברא, להורותם דרך העבודה אשר הם חייבין בה לבורא יתברך, והאריך שם לבאר מעלת כאו\"א מאלו יתירה על חבירו, ויש צורך והכרח לשלימות האדם, שיגיע אליו הערת שניהם."},{"passage_id":"devurim_f59d7bfb_p24","passage_content":"והנה מצות התורה יש תכלית למספרן, והן בסך ידוע תרי\"ג מצות, אך מצות השכל כמעט אין להם תכלית, כי בכל יום יוסיף האדם דעת בהן, כל אשר תוסיף הכרתו, ויבין טובות האלקים, ועוצם יכלתו ומלכותו, יוסיף להכנע לו ולהשפיל לפניו, ועל כן דוהמע\"ה התחנן אל ד' להעיר אותו עליהם, כמ\"ש (תהלים קי\"ט) גל עיני ואביטה נפלאות מתורתך וגו', ואומר (שם) לכל תכלה ראיתי קץ רחבה מצותך מאוד, ר\"ל כי כל מה שאנו חייבים מעבודתך על התמדת טובותיך אין קץ לו, וכבר נאמר על קצת הפרושים, שהיו כל ימיהם בתשובה, מפני שהיו מחדשים בכל יום תשובה, בעבור תוספת הכרתם בגדולת האלקים, וקיצורם במה שהם חייבים לו מן העבודה וכו'."},{"passage_id":"devurim_f59d7bfb_p25","passage_content":"אמנם אעפ\"י שמצות השכל, יתירים במספר על מצות התורה כנ\"ל, אבל הצורך בהערת התורה, ויתירה עליו בשבעה פנים וכו', כי הערה השכליית אינה כוללת כל המצווים, מפני קוצר מחשבת קצתם, ויתרון הכרת קצתם על קצתם, ויש שיהי' האדם מקצר בקצת עניניו, ומוסיף בקצתם, ומתחלפת הערת השכל בו, כהתחלף הכרתו, אבל הערת התורה אינה מתחלפת, אלא כוללת כל מי שהגיע לתנאי הצווי, וצורתה צורה אחת, לנער ולבחור ולזקן ולמשכיל ולכסיל וכו' יעיי\"ש שהאריך טובא, -ובסודן של דברים ישנם ענינים גבוהים ורמים, כדאיתא בזוה\"ק שתרי\"ג מצות הם עטין דמלכא, ובפרע\"ח כתב בשם האריז\"ל שהם כנגד איברין דמלכא, אמנם הצורך וההכרח לשלימות הנפש, גם אל הערת השכל, כאשר ביאר שם בחוה\"ל על ז' פנים עיי\"ש."},{"passage_id":"devurim_f59d7bfb_p26","passage_content":"והנה כתב הרמב\"ן ז\"ל (בריש פ' קדושים), כי התורה הזהירה בעריות ובמאכלים האסורים, והתירה אכילת הבשר והיין, והביאה איש באשתו, א\"כ ימצא בעל התאוה מקום להיות שטוף בזימת אשתו ונשיו הרבה, ולהיות בסובאי יין ובזוללי בשר למו, והנה יהי' נבל ברשות התורה, לפיכך בא הכתוב אחרי שפרט האיסורים שאסר אותם לגמרי, צוה עוד בדבר כללי, שנהי' פרושים מן המותרות וכו', כענין שאמרו קדש עצמך במותר לך וכו', ואין באכילה וביאה זו מצוה ל\"ת פרטית, ולא נמנה בתרי\"ג מצות, אלא מצוה כללית עכ\"ל."},{"passage_id":"devurim_f59d7bfb_p27","passage_content":"וכמו\"כ בהערת השכל במצות שהשכל מחייבתן, אבל התוה\"ק לא צוה אותנו בהן, בלתי ספק שיש צורך ותועלת מרובה בהם לבעלי השכל, להשיג על ידה שלימות הנפש, וחיובא דאורייתא אית בהו, אלא שהחיוב בהם בדרך כלל, ואינה כוללת כל המצווים, ותלוי כפי דעת האדם, וכפי כח המשיג בהן, וע\"כ לא יחשב בגדר מצוה פרטי, ואינו נחשב במנין התרי\"ג."},{"passage_id":"devurim_f59d7bfb_p28","passage_content":"עכ\"פ יבואר בזה לעניננו דהא דסברא היא דאסור לאדם להנות מעוה\"ז בלא ברכה הערת השכל יחייבהו, אבל אינה מצוה פרטיית, ולא נמנה בתרי\"ג מצות, והערת התורה לא יחייבוהו, ואינה מצות עשה דאורייתא, אלא חיובא כללית מצד הסברא והשכל, מה שאנו חייבים לבוי\"ת מהכניעה והשתעבדות, על התמדת טובתו אלינו, אבל פרטיות המצוה לברך ברכת הנהנין, ושיהי' הצווי שוה בכל אדם, חרל תקנוה ומצוה דרבנן היא, ובזה יבואר הענין קצת."},{"passage_id":"devurim_f59d7bfb_p29","passage_content":"ואפשר לבאר עוד, דהנה סברא הוא דאסור לאדם שיהנה מן העוה\"ז בלא ברכה, אמנם מבואר בספ\"ח (סי' מ\"ו) יכוין האדם לברך לשם בוראו, אשר הפליא חסדו עמו, ונתן לו הפירות או הלחם ליהנות מהם, וצוהו את המצות, ולא יעשה כאדם העושה דבר כמנהג, ומוציא דברים מפיו בלא הגיון הלב, ועל זה חרה אף ד' בעמו, ושלח לנו את עבדו ישעי', ואמר (ישעי' כ\"ט י\"ג) יען כי נגש העם הזה בפיו ובשפתיו כבדוני ולבו רחק ממני, ותהי' יראתם אותי מצות אנשים מלומדה, אמר הקב\"ה לישעי' ראה מעשי בני וכו', בעת שהן מברכין אינן מתכונים לברכני, לכן ע\"כ חרה אפו בו ונשבע בשמו הגדול, לאבד חכמת חכמיו, היודעים אותו ומברכין אותו כמנהג ולא בכוונה ומאריך שם בעונש המברך שלא בכוונה."},{"passage_id":"devurim_f59d7bfb_p30","passage_content":"וכתב המחבר (באו\"ח סי' ק\"א ס\"א) אם לא כיון באבות, אע\"פ שכיון בכל השאר יחזור ויתפלל, אלא שכתב רמ\"א בשם הטור, והאידנא אין חוזרין בשביל חסרון כוונה, שאף בחזרה קרוב הוא שלא יכוין, א\"כ למה יחזור עכ\"ל, עכ\"פ מעיקר הדין ודאי בעי כוונה, אבל קרוב הדבר להכשל ח\"ו, להתפלל ולברך בלא כוונה וענשו גדול ר\"ל."},{"passage_id":"devurim_f59d7bfb_p31","passage_content":"ומעתה סברא הוא לברך ברכה הראוי', ובכוונת הלב, ובדרך שבח לפני המקום ב\"ה, אבל בלא כוונת הלב, הי' סברא שלא לומר, שאין זה דרך שבח המחויבת להבוי\"ת, אלא שחז\"ל תקנו וחייבו לברך, אף שקרוב הדבר שלא יכוונו."},{"passage_id":"devurim_f59d7bfb_p32","passage_content":"היוצא לנו מזה דמ\"ש בגמ' סברא הוא דאסור להנות בלא ברכה, בעצם הברכה ראוי להתחייב בה עפ\"י הסברא, אבל א\"א לקבוע הלכה מצד הסברא, לפי שרובא דרובא אינם מכוונין בה כראוי, ולבם רחק מהם בשעת הברכה, ועושין היפך הסברא, דהסברא יחייבו לברך בדרך שבח לבוי\"ת ובכוונה הראוי' אבל בלי כוונה שתיקתו יפה מדיבורו, אלא שחז\"ל חייבו לברך בכל אופן וממילא ל\"ק קושית הפנ\"י, דאע\"ג דסברא הוא דאסור להנות בלא ברכה וסברא דאורייתא, מ\"מ חיובא דברכות אינו אלא מדרבנן, דהסברא לא יחייבהו אלא במברך בכוונה, וחז\"ל חייבו לברך בכל אופן, אע\"פ שאין בידינו לכוין כדבעי."},{"passage_id":"devurim_f59d7bfb_p33","passage_content":"ובדרך הנ\"ל יתבארו דברי התוס' בברכות (ל\"ה ע\"א) שכתבו שם דלאו ק\"ו הוא, דא\"כ תהא ברכה לפניו דאורייתא, ובפרק מי שמתו (דף כ\"א ע\"א) אמרי' דלאו דאורייתא, ולכאורה דבריהם צ\"ב דלפי מסקנת הגמ' אמרי' דק\"ו הוא, ולא אפריכא ק\"ו זו בגמ', והאיך כתבו התוס' דלאו ק\"ו הוא, (עיין הקושיא לעיל בדרוש הקדום), אולם ק\"ו זו יש לה פירכא כמו שכתבנו (לעיל שם) עפימ\"ש הרמב\"ם דהרעב והצמא בכלל החולים הם, ואם א\"א להם לכוין אל יתפללו, ובש\"ע פסק דמותר להתפלל אם הוא רעב, ואם ירצה מותר לו לאכול ולשתות ואח\"כ יתפלל, עכ\"פ א\"א לכוין כשהוא רעב, ומעתה האי ק\"ו כשהוא שבע מברך כשהוא רעב לא כ\"ש, אית לי' פרכא כמ\"ש לעיל."},{"passage_id":"devurim_f59d7bfb_p34","passage_content":"אמנם מ\"ש בגמ' דק\"ו הוא, כן הוא אליבא דאמת, כאשר יהי' כל כוונתו לש\"ש, ליתן שבח והודי' להשי\"ת, אז ליכא פרכא הנ\"ל, דלא ימנעהו הרעבון מלכוין בברכה, אלא תשבע ותתענג נפשו ממה שימלא פיו תהלתו ית', וכמ\"ש ק\"ז הייטב לב זלל\"ה, לפרש הפסוק כמו חלב ודשן תשבע נפשי ושפתי רננות יהלל פי, ר\"ל דבזה ששפתי רננות יהלל פי, תשבע נפשי כמו חלב ודשן, ואם ארעב לא אומר לך, אבל אם מרגיש רעבון הרי זה מוכיח שאין אמירתי כראוי לך ית' עייש\"ד."},{"passage_id":"devurim_f59d7bfb_p35","passage_content":"עכ\"פ מעצם הסברא יש לדון ק\"ו זו, דרעב יתחייב יותר לברך, ואם כשהוא שבע מברך רעב לא כש\"כ, וק\"ו דאורייתא הוא, אלא לפי מהות העולם לאו כל אדם במדריגה זו, וכשהוא רעב לא יוכל לכוין, וליכא חיובא דאורייתא בברכה לפני' מצד הק\"ו, אלא שחז\"ל חייבוהו לברך, וע\"כ ברכה לפני' דרבנן, ואי לאו חיובא דרבנן הי' ראוי שלא לברך, כיון שאין יכול לכוין כשהוא רעב, וכמ\"ש בספ\"ח הנ\"ל דזה גורם חרון אף ר\"ל, אלא שחז\"ל רמיא חיובא עלי' לברך ברכה לפני', ושפיר כתבו התוס' דלאו ק\"ו הוא, אלא ברכה לפני' דרבנן הוא."},{"passage_id":"devurim_f59d7bfb_p36","passage_content":"ונקדים מ\"ש ק\"ז הייטב פנים זלל\"ה (במאמרי חנוכה) מליצה נאה ולימוד זכות על ישראל, ותו\"ד שכן חובת כל היצורים ר\"ת שכחה, ור\"ל דאם נתבונן מחובתינו להשי\"ת, השכל מחייב להכנע מפניו ולעשות ככל מצותיו ית', אלא שיש התנצלות קצת ע\"י אונס שכחה. וזה מרומז בר\"ת שכן חובת כל היצורים עכת\"ד, ומעתה אילולי השכחה הי' השכל מחייב להכיר חובתינו בעבודת השי\"ת, וליתן שבח והודי' לפניו ית', ואז הי' הברכה מחויבת מדאורייתא מצד הסברא, וסברא דאורייתא הוא, אלא לפי שהסברא המחייבת הוא מצד הערת השכל, ובהתגברות השכחה נחלש כח השכל המחייב, ע\"כ הצריכו חז\"ל לחייב בברכה, מטעם תקנתם ומצד הערת התורה."},{"passage_id":"devurim_f59d7bfb_p37","passage_content":"ונעתה יתורץ קושית התויו\"ט הנ\"ל דבאמת א\"א לקבוע הלכה, לחייב בברכה מדאורייתא, מצד הערת השכל המחייבת ליתן שבח והודי' לשמו ית', כמ\"ש לעיל, וע\"כ מצד הלכה ומצד הערת התורה חיוב הברכה אינו אלא מדרבנן, ומ\"ש בגמ' דברכות (דף מ' ע\"ב) ולא שכחתי מלהזכיר שמך ומלכותך עליו, ומשמע דברכה דאורייתא הוא, הכוונה מצד הערת השכל, דכיון דמתודה ואומר ולא שכחתי, ואם אין שכחה אז השכל מחייב לברך ולשבח לפניו ית', וסברא דאורייתא הוא, וזה שמתודה לומר ולא שכחתי, שלא נכשל בשכחה, ולא בא לגדר ורם לבבך ושכחת, באופן זה הברכה מחוייבת מדאורייתא, ומ\"ש ברכה דרבנן הוא אתי נמי שפיר, דלפי המצב שאנו בה, ובעוה\"ר השכחה גובר, ואזדה הסברא המחייבת, ואיו כאן הערת השכל, ורק תקנתא דרבנן היא המחייבת בברכה, וע\"כ הברכה רק מדרבנן, ואין כאן סתירה כלל."},{"passage_id":"devurim_f59d7bfb_p38","passage_content":"ולדרכנו יתבאר דברי המדרש הנ\"ל, ושמחת בכל הטוב אין טוב אלא תורה, לפיכך משה מזהיר את ישראל עשר תעשר, בהקדם מ\"ש הזית רענן מבעל מג\"א, על דברי המד\"ר (פ' בראשית פ\"א ס\"ד) בראשית בזכות מעשרות נברא העולם שנקרא ראשית דגנך (הובא לעיל) ופי' עפימ\"ד במד\"ר פ' עקב (פ\"ג ס\"ג) מעשה ב\"ר פנחס בן יאיר שהלך לעיר אחת, והיו העכברים אוכלים בתחומה של אותה העיר, באו ובקשו הימנו וכו', אמר להן למה אין אתם מפרישין מעשרותיכם כראוי וכו', וערב אותן שאם מפרישין מעשרותיהם כראוי, אין עכברים אוכלין עוד וכו', ולא נראו עוד, ומעשה זו הובא בירושלמי (פ\"ק דמס' דמאי), ואיתא התם שאסף כל העכברים והיו מצפצפים, ואמר להם דעו מה שהם אומרים, שבשביל שלא הפרשתם מעשרותיכם לפיכך הם אוכלים את התבואה, - ואמרז\"ל במס' הוריות (י\"ג ע\"ב) האוכל ממה שהעכבר אוכל משכח תלמודו, ופי' בזה רמז הכתוב, לא עברתי ממצותיך שהפרשתי המעשרות כראוי כפרש\"י ז\"ל, ולא שכחתי ועי\"ז לא באתי לידי שכחת התורה, ויובן בזה דברי המדרש בשביל מעשרות נברא העולם, ור\"ל דקיום העולם תלוי בו, דא\"א שיתקיים העולם בלי תורה, כמשה\"כ אם לא בריתי יומם ולילה וגו', ואיתא בתרגום ירושלמי ובזוה\"ק בחוכמא ברא ד' ית שמיא וית ארעא, ומוכרח שיתקיים חכמת התורה ולא יאבדוהו ע\"י שכחה, ומסוגל לזה מצות מעשר כנ\"ל, וא\"ש דברי המד\"ר בשביל מעשר נברא העולם, ר\"ל דקיום העולם תלוי בו עכת\"ד הזית רענן ז\"ל."},{"passage_id":"devurim_f59d7bfb_p39","passage_content":"וכמו\"כ במצות בכורים, כתבו המפרשים שעיקר טעם המצוה, הוא ההכנעה וההשתעבדות, שיתבונן האדם ויזכור היטב, כי ממך הכל ומידך נתנו לנו, ואחרי שיהי' שמן ודשן תחת גפנו ותאנתו ויאסוף תבואתו כי ירבה מאוד, חששה תורה פן ח\"ו יבוא לגדר ורם לבבך ושכחת את ד' אלקיך, ע\"כ חייבתו תוה\"ק בהבאת בכורים, ושיגלה דעתו בקול רם, וזכירה בפה, וז\"ש הגדתי היום וגו' כי באתי אל הארץ אשר נשבע ד' לתת לנו, ויתן לנו את הארץ הזאת וגו', פרי האדמה אשר נתתה לי ד' וגו', וכ\"ז לתכלית ולכוונה הנ\"ל, כדי שיזכור שנתינת הארץ מאתו ית', והכל שלך ומידך נתנו לנו."},{"passage_id":"devurim_f59d7bfb_p40","passage_content":"וכמו שמצינו בזכירת עמלק (במס' מגילה י\"ח) זכור את אשר עשה לך עמלק, יכול בלב, כשהוא אומר לא תשכח הרי שכחת הלב אמור, הא מה אני מקיים זכור בפה, וכמו\"כ במצות בכורים הצריכה תוה\"ק שתהא זכירה זו בפה, נוסף על זכירת הלב, כדי שתהי' זכירה גמורה ומושרש בפנימיותו, שנתינת הארץ הוא מהשי\"ת, וע\"כ כפל הכתוב נתינת הארץ כ\"פ בפרשת מקרא בכורים, וכפל בכולם לומר אשר ד' אלקיך נתן לך, ולהלן אשר נתתה לי ד' וגו', אשר נתן לך ד' אלקיך, כי זאת עיקר טעם המצוה, להזכיר זכירת הארץ ושהוא מהשי\"ת."},{"passage_id":"devurim_f59d7bfb_p41","passage_content":"ואמרי' בגמ' ברכות (דף מ\"ח ע\"ב) תניא ר\"א אומר כל שלא אמר ארץ חמדה טובה ורחבה בברכת הארץ (בבהמ\"ז), לא יצא ידי חובתו וכו', ר יוסי אומר צריך שיזכור בו תורה, פרש\"י שבזכות התורה והמצות ירשו את הארץ, שנא' (דברים ח') למען תחיון ורביתם ובאתם וירשתם את הארץ עכ\"ל, וע\"כ בהבאת בכורים שחייבתו תוה\"ק לשבח ולהודות על נתינת הארץ, צריך לצרף אלי' גם זכירת התורה, שנתינת הארץ מקושר בקיום התוה\"ק, וח\"ו בלי קיום התורה אין שבח בנתינת הארץ, וכמו שהבאנו לעיל דברי האוהחה\"ק (בפ' ראה) שיש בנתינה זו ברכה וקללה ח\"ו עיין לעיל, וזשה\"כ ושמחת בכל הטוב, ודרשו חז\"ל אין טוב אלא תורה, שבהבאת הבכורים שצוה השי\"ת להגדיל השמחה על נתינת הארץ, צריך לצרף אלי' זכירת התורה, שבלי קיום התורה ח\"ו אין שמחה בנתינת הארץ וזה שדרשו חז\"ל ושמחת בכל הטוב אין טוב אלא תורה, שזו היא עיקר השמחה בנתינת הארץ, וסיום המדרש לפיכך משה מזהיר את ישראל עשר תעשר, שבזכות מעשר לא יבוא לידי שכחת התורה, כמ\"ש בזית רענן הנ\"ל, וא\"ש קישור המדרש."},{"passage_id":"devurim_f59d7bfb_p42","passage_content":"ונבוא לבאר קושית המפרשים, במ\"ש הכתוב הגדתי היום לד' אלקיך וגו' וכי אלקיך דכהן הוא, והול\"ל לד' אלקינו, ופלא שלא הזכירו המפרשים, דקושיא זו איתא בזוה\"ק פ' יתרו (דף ע\"ט ע\"ב), וז\"ל מה הוא הגדתי היום לד' אלקיך, לד' אלקינו מבעי' לי' וכו', וכן הקשו על כמה פסוקים שאמר משה לישראל בלשון הזה, דכתיב (דברים ח') כי ד' אלקיך מביאך אל ארץ טובה וגו', וכתיב (דברים ז') אשר ד' אלקיך נתן לך וגו' אלא הכי תנינן כל הדר בא\"י דומה כמי שיש לו אלקי, וכל הדר בחו\"ל דומה כמי שאין לו אלקי, מ\"ט משום דזרעא קדישא לארעא קדישא סלקא, ושכינתא באתרה יתבא, והאי בהאי תליא וכו', ומה דלא אמר אלקינו, משום דהא משה לא זכה למיעל לארעא, ובג\"כ אלקיך, לאינון דהוו זמינין למיעל לארעא קדישא, ולקבלא אפי שכינתא, והקשו עוד בזוה\"ק דהכא כתיב ובאת אל הכהן וגו', ואמרת אליו הגדתי היום לד' אלקיך, והא אינון בארעא שריין, מ\"ט אלקיך ולא אלקינו, אלא אינון בעיין לאחזאה ולאודאה, דבגיני דחסד עלאה זכאן לכל האי, ושריין בארעא ועאלן לההיא ארעא וכו', ובג\"כ הוו אמרי מלין אלין לכהן, הגדתי היום לד' אלקיך, משום דאתי מסטרא דחסד וכו' עכ\"ל הזוה\"ק."},{"passage_id":"devurim_f59d7bfb_p43","passage_content":"ולכאורה המשך דברי הזוה\"ק צ\"ב, דמעיקרא הקשו למה אומר המביא בכורים לכהן הגדתי היום לד' אלקיך, ותרצו דמשה נמי אמר לישראל אלקיך, משום דלא זכה למיעל לא\"י, ומאי האי לגבי' דהאי דהא ישראל המביא בכורים, בארעא שרייא כאשר הקשו לבתר הכי, ולא שייך כאן האי טעמא, ואם כוונתם לתרץ ג\"כ מ\"ט אמר משה לישראל אלקיך, אבל מ\"ט הביאו קושייתם ותירוצם לכאן, ותירוץ זה אינו מספיק לעניננו."},{"passage_id":"devurim_f59d7bfb_p44","passage_content":"ובניצוצי אורות להה\"ג החיד\"א זלל\"ה דקדק בדברי הזוה\"ק הנ\"ל, במ\"ש דמשה לא זכה למיעל לארעא, דהרי מבואר בזוה\"ק במקרא וכ\"כ האריז\"ל, דהטעם שלא נכנס לפי שבחינתו למעלה מבחי' א\"י, ואיך שייך לומר דלא זכה וכו', ותירץ דמ\"ש לא זכה, שאלו נכנס משרע\"ה לא\"י הי' מתקן העולם, ומסיר להט החרב וגו', כמ\"ש הרמ\"ע ז\"ל, והי' מבטל יצרא דע\"ז כמ\"ש בפ\"ק דערכין, ועוד אם הי' נכנס עלה יעלה לבחי' עליונה עכ\"ל החיד\"א ז\"ל. אמנם קושיא ראשונה צ\"ב להבין דברי הזוה\"ק."},{"passage_id":"devurim_f59d7bfb_p45","passage_content":"ואפשר לומר דהא בהא תליא, דמה שלא זכו ישראל לנתינת הארץ אלא מסטרא דחסד, לפי שלא הי' עדיין שלימות התיקון, אבל אילו נכנס משרע\"ה לא\"י, הי' נשלם התיקון על ידו מיד, והי' מגיע להם נתינת הארץ מצד הדין, ולא הי' צריך לומר לכהן ד' אלקיך אלא ד' אלקינו, וע\"כ הקדימו בזוה\"ק הקדמה זו דלא זכה משה רבינו ליכנס לא\"י, ולא נשלם עדיין התיקון וע\"כ אמר הגדתי לד' אלקיך, דבגיני דחסד עלאה זכאן למיעל לארץ ישראל, והא בהא תליא, ובלא הקדמה זו לא הי' תירוצם מספיק, ורק בצירוף הקדמה זו יושלם תירוצם."},{"passage_id":"devurim_f59d7bfb_p46","passage_content":"ואפשר לומר עוד, עפימ\"ש בספה\"ק צמח ד' לצבי (פ' ראה) לפרש הפסוק אבד תאבדון את כל המקומות אשר עבדו שם הגוים, ותו\"ד דקדושת ארץ ישראל אינה סובלת ע\"ז עלי', אלא שהגוים העובדים שם ע\"ז, המשיכו לשם רצועה מארץ העמים, ע\"י קיפול ארצות, ונתחלף המקום באדמת חו\"ל, והביא ראי' לזה מדברי רש\"י (ירמי' ד') עיי\"ש (הבאתי דבריו בספרי ויואל משה מאמר ב' סי' קכ\"ט וסי' ק\"ל) והארכתי שם לבאר, שזהו מבחי' ולא תקיא אתכם הארץ בטמאכם אותה כאשר קאה את הגוי אשר לפניכם וגו', שע\"י החטאים נתרוקן בחי' הארץ, וקדושת ארץ ישראל מסתלקת ונסתרה מהם עיי\"ש."},{"passage_id":"devurim_f59d7bfb_p47","passage_content":"ומעתה זה המביא בכורים, ושש ושמח ומשבח על נתינת הארץ שזכה אלי', איך יהי' שמחתו שלימה, ומי יודע אם זוכה להיות שורה בקדושת ארץ ישראל, ואולי עונותיו יסובבוהו, להיות קדושת הארץ מסתלקת ממקום משכנו, ואפשר שנתחלף ע\"י קפול ארצות באדמת חו\"ל, אמנם ע\"י שמביא בכוריו אל הכהן, העומד לשרת במקום המקדש, והבאנו לעיל מדברי התוס\" ב\"ב (כ\"א ע'\"א) שע\"י שרואה קדושה גדולה, וכהנים עוסקין בעבודה הי' מכוין את לבו ליר\"ש וכו' עיי\"ש, ממילא נמשך עליו מכח קדושתו של הכהן, ובזכותו זוכה לקדושת המקום, ויכול לומר כי באתי אל הארץ, דבזכותו של כהן יזכה לקדושת הארץ, וז\"ש הגדתי היום לד' אלקיך כי באתי אל הארץ, דייק לומר אלקיך, דע\"י הכהן זוכה להשפעת אלקות ולביאת הארץ, להיות שורה בקדושת הארץ (ומתורץ קושיא ה'-ו')."},{"passage_id":"devurim_f59d7bfb_p48","passage_content":"וכעין בחי' הנ\"ל שכתב בספה\"ק צמח ד' לצבי, שמתחלפת קדושת הארץ בסיבת החטא, ישנו עוד בחינת חליפין מה שהחטא גורם, ויבואר עפימ\"ש האוהחה\"ק (בפ' ראה) עה\"פ כי יסיתך אחיך וגו', וזלה\"ק דבאמצעות דרכים הרעים, והרבות בחטאים, תתחלף נפשו ותכנס בגדר אחרת וכו', והוא שתתחבר ותשתתף עם חלק הרע ותשר לו בטבעה, וזה הוא גמר נפש האדם לכפור בעיקר ולעבוד ע\"ז ר\"ל, עכת\"ד ז\"ל, (ובקונטרס על הגאולה ועל התמורה סי' ק\"כ) פירשנו בזה דברי המדרש (רות פ\"ז אות י\"א) וזאת לפנים בישראל על הגאולה ועל התמורה וכו', לשעבר היו מקלסין על הגאולה וכו', ועכשיו על התמורה שנא' וימירו את כבודם בתבנית שור אוכל עשב, ולכאורה צ\"ב דפשטות הכתוב מיירי בהלכות קנינים, כמו שדרשו ז\"ל במס' ב\"מ (דף מ\"ז ע\"א) תמורה זו חליפין וכו', ועיקר קנין חליפין וכל תנאי', נלמד מהאי קרא, דבעינן דבר מסוים כנעל, ואי בכליו של קונה או של מקנה עיי\"ש, ואיך הוציאוהו חז\"ל לעקרו מפשוטו לגמרי, ודרשוהו על חטא העגל."},{"passage_id":"devurim_f59d7bfb_p49","passage_content":"אמנם לפי דברי האוהחה\"ק הנ\"ל, תפרש דרשתם ז\"ל, בדרך קרובה אל המשמעות, דהנה ענין חליפין מדרכי הקנין עפ\"י התורה, וחידוש הוא שחידשה תורה בזה, דאע\"ג שלא מסר המוכר, ולא משך הלוקח, ולא נעשה בחפץ הנקנה שום א' מדרכי הקנין, אבל ע\"י שמקבל מחבירו איזה דבר, אפי' הנאה מועטת בתורת חליפין, מיד נקנה חפץ הקנין לחבירו בקנין גמור."},{"passage_id":"devurim_f59d7bfb_p50","passage_content":"וכמו\"כ יש קנין ברוחניות, כי כל מעשה בנ\"א, יש להם שורש ומקור בגבהי מרומים, ומכ\"ש קניןן זה, דמדרכי התורה היא, וע\"כ בסיבת החטאים ר\"ל, ע\"י שמקבל אפי' הנאה מועטת ולשעה, משורש הרע והסט\"א, אז בזמן וברגע ההוא, נקנה נפשו לחלקם ר\"ל, מבלי שום מסירה וקנין, רק בקבלה זו לבד כענין חליפין, והיא הבחי' שכתב האוהחה\"ק שתתחלף נפשו ותכנס בגדר אחרת."},{"passage_id":"devurim_f59d7bfb_p51","passage_content":"ונדקים עוד מ\"ש שם בהקדמת הקונטרס עה\"ג (עמוד ד') וימירו את כבודם בתבנית שור וגו', שלא המירו ישראל ח\"ו את עצם אלקותו ית', כמבואר בדברי הראשונים ז\"ל, שלא חשבו ישראל העגל לשם ע\"ז כלל עיי\"ש, אלא המירו את הכבוד, ושבחו ית' בשבח וכבוד העגל, שחשבו ליתן כבוד להשי\"ת, וזה הי' כוונתם באומרם אלה אלהיך ישראל וגו', אבל הי' מעורב בזה ג\"כ כוונה לאמצעות הצורה שבעגל כמ\"ש הרמב\"ן ז\"ל, ע\"כ נתחלף הכבוד שנתנו להשי\"ת בכבוד העגל, וז\"ש הכתוב וימירו כבודם וגו', שנעשה החילוף והתמורה בכבוד ועבדות השי\"ת, ולא בעצם אלקותו ית' ח\"ו, - וכעי\"ז כתב החובת הלבבות הובא שם (סי' ק\"כ) וז\"ל ובחירתם רעה בערך התמורה והמומר בה, עד אשר חשבו דרכו הרעה כי היא הטובה, ותעותו כי היא הישרה, כמו שאמר וימירו את כבודם בתבנית שור וגו', ופי' המרפא לנפש שמחליפים עבודת השי\"ת בעבודת העולם וטובה ברעה וכו', עכ\"פ מבואר דזהו ענין התמורה שכיון עלי' הכתוב בחטא העגל, וע\"י שהמירו כבודו ית' נתחלף נפשם כבחי' האוהחה\"ק הנ\"ל."},{"passage_id":"devurim_f59d7bfb_p52","passage_content":"ובזה יבואר הכתוב את ד' האמרת היום וגו' וד' האמירך היום וגו', ולדרכנו מה שפרש\"י לשון הבדלה והפרשה וכו', ומה שפי' בעה\"ת מלשון תמורה וחילוף, על בחי' א' נאמרו ועל קוטב א' יסובבו, ואין הכוונה על תמורת אלקות, כי מה דמות תערכו אליו ית', ולא יצדק עליו ית' לשון תמורה, וכמו\"כ משפרש\"י הבדלתיו לך מאלהי הנכר להיות לך לאלהים, אין הכוונה על עצם האלקות כקושיתנו לעיל (קושיא י\"ג), דהא לא שייך הבדלה אלא בסוגים ומושגים קרובים להיות שווים במקצת, אמנם הכוונה על עבדות אלקות, ושבחו וכבודו ית' שהחליפו והמירו בחטא העגל, ונתנו הכבוד והשבח לע\"ז, וז\"ש הכתוב את ד' האמרת היום להיות לך לאלקים, שעכשיו הבדלתיו מאלהי הנכר להיות לך לאלקים, וכמו\"כ מה שפירש בעה\"ת שהוא לשון תמורה וחילוף שהחלפת כל האלהות ובחרת בהקב\"ה, הכוונה שהעבדות והשבח שהומר על ידך בחטא העגל לע\"ז, עכשיו חזר והחלפת והמרת, להיות יתד במקום נאמן, במקום הקדושה ולאלקותו ית', וזה הי' ע\"י הבדלה והפרשה מעניני ע\"ז והתרחקות מהשפעתה - וע\"י שזכית להיות מופרש מע\"ז ומבחי' התמורה הרעה הנ\"ל, מדה כנגד מדה ד' האמירך היום להיות לו לעם סגולה וגו' שהפרישך מעמי הארץ וכו', וגם יצדק לשון תמורה וחילוף, בזה לפי שבסיבת חטא העגל נתחלף נפשך ונקנה לסט\"א, ועכשיו שהבדלת והפרשת מכל בחי' ע\"ז, יחליף השי\"ת בחי' נפשך, להיות חוזרת אל שורש ומקור הקדושה, להיות לו לעם סגולה וגו'."},{"passage_id":"devurim_f59d7bfb_p53","passage_content":"ולדרכנו אפשר לרמז בפסוק (מיכה ג' י\"א) ראשי' בשוחד ישפטו וכהני' במחיר יורו ונביאי' בכסף יקסומו, דלכאורה כולהו שוחד נינהו, ולמה נזכרו בשמות מחולקין, וקראו הכתוב שוחד אצל ראשים ואצל כהנים מחיר וכו' ועיי\"ש בקונטרס עה\"ג (סי' פ\"ז) מה שפי' בזה, ולדרכנו אפ\"ל, דהנה הכהנים היו עובדי השי\"ת כמשה\"כ כי שפתי כהן ישמרו דעת, וכמ\"ש התוס' ב\"ב הנ\"ל, דמסגולת העבודה וקדושת המקדש, הי' ראוי שיכוונו את לבם ליר\"ש, ואיך יצוייר שגם הכהנים הסכימו בעצה רעה כעצת נביאי הבעל, דחזינן שהזכירן הכתוב כאחד, אמנם ע\"י השוחד נעשו משוחדים לעושי הרע, ועי\"ז נתחלף נפשם בבחי' תמורה וחליפין, ונעשה כברי' חדשה וכאדם אחר, ואינו אותו שהי' מלפנים."},{"passage_id":"devurim_f59d7bfb_p54","passage_content":"ופרשתי במאמה\"כ לא תקח שוחד כי השוחד יעור עיני חכמים, ולכאורה למה כתבה תוה\"ק טעם מצוה זו, ויספיק שיאמר לא תקח שוחד, כמו בשאר המצות שלא הזכיר הכתוב טעמם ונימוקם, וכתב הב\"ח (בריש ה' סוכה) דלפי שאמר הכתוב בטעם מצות סוכה למען ידעו דורותיכם וגו', ע\"כ צריך לכוין טעם המצוה, ואע\"ג דבשאר מצות לא בעי כוונה עיי\"ש, עכ\"פ מבואר דכ\"מ שהזכיר הכתוב טעם המצוה, ללמדנו בא על פרטי ותנאי המצוה, ונפק\"מ להלכתא, וראוי להבין בלאו דשוחד, למה הזכיר הכתוב טעמו של איסור שוחד."},{"passage_id":"devurim_f59d7bfb_p55","passage_content":"ואפשר לומר דהנה לדעת הרמב\"ם, דס\"ל ספיקא דאורייתא מה\"ת לקולא, לא אסרה תורה אלא איסור מבורר ודאי, ולא ספק, והספק בהם מותר מכרת, ואסור מדרבנן, אבל בספק ספיקא גם חז\"ל לא אסרו, ואפי' לדברי הפוסקים דספיקא דאורייתא מה\"ת לחומרא, מ\"מ ישנם ספיקות שמותרין, כמבואר בשו\"ע בדיני ספק ספיקא (כגון ספק ספיקא בספק על ספק לא על) וישנם צדדים שאפשר להתיר על ידיהם האיסור."},{"passage_id":"devurim_f59d7bfb_p56","passage_content":"אמנם הדיין שלוקח שוחד אין בידו לברר ולהכריע ולהתיר מכח ספק ספיקא, לפי שהעיד הכתוב כי השוחד יעור וגו', וכיון שמשוחד אין דעתו צלולה, כמ\"ש חז\"ל ולא עוד אלא שמטפשין, וספק חסרון ידיעה אינו נכנס בצירוף ספק ספיקא, דדעת שוטים אינה כלום, וז\"ש הכתוב לא תקח שוחד, ופן יהי' לך מבוכה וספק, ותרצה לברר עפ\"י כללי ספק ספיקא שאין אצלך חשש איסור שוחד, הגם שאם הי' ספק כזה בא' משאר איסורין שבתורה, הר אפשר להתיר באופנים הנ\"ל, אבל בלאו דשוחד הזהיר הכתוב, כי השוחד יעור עיני חכמים, וכל ספקותיך בגדר חסרון ידיעה, ואינם מצטרפים להתרת האיסור, וזה שבא הכתוב ללמדנו בטעם האיסור."},{"passage_id":"devurim_f59d7bfb_p57","passage_content":"עכ\"פ ע\"י השוחד נתחלף דעתו, ועושה דברים נגד דעתו ורצונו והרגלו הקודמת, וכפי הבחי' הנ\"ל שכתב האוהחה\"ק, דע\"י מעשה החטא נתחלפת נשמתו, והוא בבחי' תמורה כמ\"ש לעיל, וזה ירמוז הקרא לדרכנו, כהני' במחיר יורו, שע\"י השוחד באו לבחי' תמורה בדעת ובבחי' הנפש, ומעתה אין תימא שנשתוית דעתם לדעת נביאי הקסם שנזכר בפסוק הנ\"ל."},{"passage_id":"devurim_f59d7bfb_p58","passage_content":"נחזור לעניננו שהמביא בכורים צוהו הכתוב לומר לכהן הגדתי היום לד' אלקיך וגו', וכמ\"ש הזוה\"ק שבזכות הכהן זוכה לביאת הארץ, וע\"כ אומר אלקיך ולא אומר אלקינו, וכפי שבארנו לעיל שע\"י הכהן יזכה לבחי' הקדושה והשפעת אלקות וקדושת הארץ, ופן אמר יאמר ישראל המביא בכורים, שהימים הראשונים היו טובים מאלה, וכל אלו הבחי' הי' אפשר שיזכה בהם ע\"י הכהן שהר בדורות הקודמים, אבל איך יאמר הגדתי היום לד' אלקיך אל הכהן שבימיו, ולהמשיך בחי' השפעות אלקות עליו מבחי' קדושתו של הכהן, ושמא הכהן הזה מאותן שהם בבחי' תמורה כמו שרמז הכתוב כהני' במחיר יבואו, ועוד יזיק לו אם ימשיך מבחי' עליו, ע\"כ אמר הכתוב אל הכהן אשר יהי' בימים ההם, ודרשו חז\"ל בספרי אין לך אלא כהן שבימיך, אם הוא עובד ד' ומתנהג בקדושתו, אין לך לחקור אחרי פנימיותו, והנסתרות לד' אלקינו, והוסיף רש\"י ז\"ל על דברי הספרי, תיבות כמו שהוא, לומר דעכ\"פ צריך שיהי' עובד ד', ומתנהג בקדושת כהונתו, שלא יהי' בחי' התמורה ניכרת בו, וז\"ש כמו שהוא ולא נתחלף בבחי' תמורה כנ\"ל."}]},{"dvar_torah_id":"devurim_5d5b267b","title":"זכות ביאת הארץ ובנין המקדש","summary":"בביאת הארץ יש להבין שהזכות היא לא בזכות ישראל אלא בזכות ברית אבות. המקדש מהווה כפרה על עוון העגל, ובזכותו זוכים לנתינת הארץ מחדש, כאשר כל מצוה מקנה זכות חדשה לביאה לארץ.","contents":[{"passage_id":"devurim_5d5b267b_p1","passage_content":"באופן אחר אפשר לבאר דברי הספרי הנ\"ל, בהעיר עוד במ\"ש הכתוב והי' כי תבוא אל הארץ וגו', ויספיק לומר כי תבוא אל הארץ, והרבה פעמים נזכר ביאת הארץ, כי תבא, כי תבואו, ולא נאמר בהם והי' וצ\"ב הכוונה בהזכירו כאן, גם אומרו אשר ד' אלקיך נתן לך, וידוע שד' ית' הוא הנותן את הארץ, ולא עוד אלא שכפל עוד בפסוק שלאחריו אשר תביא מארצך אשר ד' אלקיך נתן לך, וכבר אמור, וטעמא בעי בהזכירו ב' פעמים."},{"passage_id":"devurim_5d5b267b_p2","passage_content":"ב) הגדתי היום לד' אלקיך כי באתי אל הארץ וגו', ראוי להבין למה הוצרך להגדה זו, והרי נראה ביאתו במה שהביא מפרי האדמה ומה הכוונה באמירה זו."},{"passage_id":"devurim_5d5b267b_p3","passage_content":"ג) ויביאנו אל המקום הזה, פרש\"י זה ביהמ\"ק, ויתן לנו את הארץ הזאת פרש\"י כמשמעו, ולכאורה הו\"ל להקדים לשבח על ביאת הארץ, שהיא קודמת לבנין ביהמ\"ק, וקושיא זו מתורצת עפ\"י דרשת הספרי, שדרשו בשכר ויביאנו אל המקום הזה דהיינו ביהמ\"ק, ניתן לנו את הארץ הזאת, אבל יקשה ע\"ז כקושית ההפלאה ז\"ל על דברי ספרי הנ\"ל, דאיך שייך לומר בשכרה, כיון שביאת הארץ תקדים אלי' בהכרח."},{"passage_id":"devurim_5d5b267b_p4","passage_content":"ד) וכתבת עליהן את כל דברי התורה הזאת בעברך למען אשר תבוא אל הארץ אשר ד' אלקיך נתן לך, דקדקו המפרשים דלשון למען אשר תבא צ\"ב, דהרי במצוה זו נצטוו אחרי עברם את הירדן, וכבר באו לארץ, ולא יוצדק לומר למען אשר תבא, גם אומרו אשר ד' אלקיך נתן לך, וכבר נאמרה בפסוק שלפני' אל הארץ אשר ד' אלקיך נתן לך, גם ידוע הוא בלא\"ה, והאוהחה\"ק דקדק עוד במלת לך כאשר דבר ד' אלקי אבתיך לך, כי אחרי שאמר למען אשר תבא אל הארץ וגו', מובן שאליהם הוא מדבר."},{"passage_id":"devurim_5d5b267b_p5","passage_content":"וביאר הוא ז\"ל בכוונת הכתוב לפי שקדם מאמר משה לישראל, כי ביאת הארץ לא בזכות ישראל, כאומרו לא בצדקתך וגו' אלא ברשעת הגוים וגו', לזה בא דברו כאן, כי באמצעות המעשה האמור בענין, תהי' ביאתם בזכות עצמם. וזהו שיעור הכתוב למען אשר תבא, פי' תהי' ביאתך לארץ אשר ד' אלקיך נתן לך, כאשר דבר ד' וגו' לך, למען שאתה ראוי, ולא תצטרך לזכות ברית אבות, ומתורץ בזה מלת לך, עכדה\"ק."},{"passage_id":"devurim_5d5b267b_p6","passage_content":"ואפשר להוסיף על דבריו ז\"ל, ובזה יתורצו שאר הדקדוקים שבענין, עפימ\"ש בירושלמי, מאן דאכיל דלאו דידי', בהית לאסתכולי באפי', ואיתא בגמ' מס' ברכות (דף י' ע\"ב) בחזקי' שתלו לו בזכות אחרים, שנא' (מ\"ב י\"ט) וגנותי על העיר הזאת להושיעה למעני ולמען דוד עבדי, והיינו דריב\"ל, דאמר ריב\"ל מאי דכתיב (ישעי' ל\"ח) הנה לשלו' מר לי מר, אפי' בשעה ששיגר לו הקב\"ה שלום, מר הוא לו עכ\"ד הגמ', ולפי\"ז א\"ש משה\"כ למען אשר תבא אל הארץ וגו', שבזכות המצוה הזאת תהי' ביאתם לארץ בזכות עצמם, ונחשב כביאה חדשה, ולא ידמה בחינתה לביאה הקודמת שלא הי' בזכותם, וא\"ש מה שכפל הכתוב עוה\"פ, לומר אשר ד' אלקיך נתן לך, שאחר קיום המצוה וכתבת עליהן את כל דברי התורה הזאת, יהי' נתינה חדשה, בבחינה מחודשת, ויהי' לך ובזכותך, וז\"ש אשר ד' אלקיך נתן לך."},{"passage_id":"devurim_5d5b267b_p7","passage_content":"ונקדים עוד מ\"ש האוהחה\"ק (בפ' עקב) עה\"פ לא בצדקתך וביושר לבבך אתה בא לרשת את הארץ וגו', דבאמת דור באי הארץ דור כשר היו, וכן תמצא שאמר להם, ואתם הדבקים בר אלקיכם וגו', אלא שלא היו שלמים לתת להם את הארץ וכו', ולא הי' בזכותם שיעור אשר יזכו בשבילו לרשת את הארץ, אם לא היתה ברית אבות וכו' עכ\"ל, ובפסוק שלאחריו חזר והקשה, במשה\"כ וידעת כי לא בצדקתך ד' אלקיך נתן לך את הארץ וגו', זכור אל תשכח את אשר הקצפת את ד' וגו', ומונה והולך כל החטאים שעשו ישראל במדבר, וקשה מה מוכיח ממה שעבר, בזמנים שהיו בהם רשעים לזמן זה, שאפשר שצדקתם שהם עומדים בה היום, תספיק להם לרשת את הארץ, ויכולין לומר בצדקתי הביאני ד', עיי\"ש שנדחק לתרץ, ובאמת כל אלו שעשו את העגל, ושחטאו בתבערה ובמסה ובקברות התאוה, כבר מתו במדבר ודור באי הארץ צדיקים היו, ובמה יצדק מאמר לא בצדקתך וגו', ומדוע מונה והולך כל החטאים האלה שלא הי' להם חלק בהם כלל."},{"passage_id":"devurim_5d5b267b_p8","passage_content":"אכן יתבאר עפימ\"ש בש\"ך עה\"ת (פ' דברים ופ' מסעי) שהקשה ג\"כ כקושיא זו, על מה שהוכיחן משה רבינו בסוף שנת הארבעים, על כל החטאים שעשו ישראל במדבר בערבה מול סוף וגו', והרי דור באי הארץ היו בהם פחותים מבן עשרים, כשעשו אבותיהם את הדברים האלה, ואותו הדור שעשאום כבר ספו תמו וכו', וכו', ותוכן תירוצו שכל אלו שמתו במדבר ואלו שמתו במסה וכו', כולם נתקנו ע\"י שבאו בגלגול בניהם ובנותיהם בסוד העיבור, וע\"כ הוכיחם משה רבינו על מה שעשו בגלגולם הקדום עייש\"ד."},{"passage_id":"devurim_5d5b267b_p9","passage_content":"וכמו\"כ לעניננו אפשר לתרץ קושית האוהחה\"ק, ויובן מ\"ש משרע\"ה לא בצדקתך ד' אלקיך נתן לך את הארץ, ונתן טעם זכור אל תשכח את אשר הקצפת את ד' אלקיך במדבר, אע\"פ שלא דיבר משה לאותו הדור שעשו את העגל, אבל עוד לא ניתקן ונתכפר להם חטא העגל שעשו בגלגול הקדום, וע\"כ לא היתה זכותם מספקת לרשת את הארץ, אם לא היתה ברית אבות, ובזה יובנו דברי האוהחה\"ק, מ\"ש שלא הי' בזכותם שיעור אשר יזכו לרשת את הארץ וכו', ור\"ל אע\"פ שהיו דור כשר ודבקים בד', אבל לסיבת חטאם בגילגולם הקדום, שלא נתכפר להם עדיין, ע\"כ לא היתה ביאת הארץ בזכות עצמם."},{"passage_id":"devurim_5d5b267b_p10","passage_content":"ונקדים עוד דברי הש\"ס כתובות (ס\"ב ע\"ב) א\"ל בני דעת קונך יש בך, מעיקרא כתיב תביאמו ותטעמו בהר נחלתך מכון לשבתך, ולבסוף כתיב ועשו לי מקדש ושכנתי בתוכם, פרש\"י מדעת קונך יש בך, שאמר להרחיק זמן חופתו, וחזר וקרבה מרוב חיבת כלתו, דמעיקרא כתיב תביאמו ותטעמו וגו', שיבואו לא\"י ואח\"כ יבנו לו מקדש, ולבסוף אמר ועשו לי מקדש במדבר, וכתב המהרש\"א ז\"ל דאין לומר בזה שנוי רצון לפניו ית', לפי דברי המדרש דהמשכן בא לכפר על עון העגל, וע\"כ קודם שעשו את העגל, לא הי' צורך לעשות להם המשכן מיד במדבר, והשנוי הי' מצד מעשיהם, לפי שחטאו בעגל הוצרכו לכפרה, וצוה הקב\"ה לעשות המשכן מיד, לכפר על עון העגל, עכ\"ד ז\"ל."},{"passage_id":"devurim_5d5b267b_p11","passage_content":"והנה אף שהמשכן הי' מכפר על עון העגל, אבל לא נתכפר עונם לגמרי, אלא בבנין ביהמ\"ק, ונרמז במ\"ש ובנה לנו בית הבחירה לכפר על כל עונותינו, שזו היתה כפרה גמורה, ולא נשאר רושם החטא כלל, נמצא לפי\"ז דתחילת ביאתם לארץ, לא הי' בזכות עצמם, אלא ע\"י ברית אבות, שעדיין לא נתכפר להם חטא העגל לגמרי, ואחר שזכו לבנין ביהמ\"ק נתכפר עונם לגמרי, וזכו לביאת הארץ ונתינה חדשה בזכות עצמם, ויובן בזה דברי הספרי ויביאנו אל המקום הזה זה ביהמ\"ק, ויתן לנו את הארץ זה א\"י, והקדים בית המקדש, דע\"י הביהמ\"ק זכו לנתינת הארץ וביאה חדשה, וא\"ש דברי הספרי בשכר ויביאנו אל המקום הזה ויתן לנו את הארץ הזאת כנ\"ל."},{"passage_id":"devurim_5d5b267b_p12","passage_content":"ויובן בזה משה\"כ הגדתי היום לד' אלקיך כי באתי אל הארץ אשר נשבע ד' לאבותינו לתת לנו, ר\"ל שע\"י הבאתו בכוריו לביהמ\"ק, וע\"י בחינת המקדש, נתכפר לו עונו, וזוכה לביאה חדשה בזכות עצמו, וז\"ש כי באתי אל הארץ, ואע\"פ שכבר בא, אבל נשתנה בחינתו וביאה חדשה יקרא לה, וז\"ש אל הארץ אשר נשבע ד' לתת לנו ר\"ל בזכותינו."},{"passage_id":"devurim_5d5b267b_p13","passage_content":"וז\"ש והי' כי תבוא אל הארץ אשר ד' אלקיך נתן לך, דקדק לומר והי' לשון עתיד, שע\"י מצוה זו תזכה לבוא אל הארץ אשר ד' נתן לך בזכותך, ויובן דברי הספרי עשה מצוה זו שבשכרה תכנס לארץ, ר\"ל שיהי' ביאת הארץ בשכרך ובזכותך."},{"passage_id":"devurim_5d5b267b_p14","passage_content":"ואפ\"ל עוד אין והי' אלא לשון שמחה, ואם אין האדם זוכה בזכותו, אין שמחה עמה, כמ\"ש חזקי' הנה לשלום מר לי מר, ומאן דאכיל דלאו דילי' בהית לאסתכולי באפי, ועתה שיזכו לנתינת הארץ בזכותן, אמר הכתוב והי' כי תבוא אל הארץ, שיהי' שמחה בנתינתה בבחי' זו."}]},{"dvar_torah_id":"devurim_4a0f398f","title":"הכנה לביאת הארץ וקדושת המקדש","summary":"בביאת הארץ יש הכנה רוחנית, והקדושה נמשכת מהבכורים והתפילה. הקב\"ה מעלה את ישראל לקדושת א\"י, ובכך מתקבלות תפילותיהם. מצוות מחיית עמלק נדרשת מיד עם הכניסה לארץ, והקריאה בפרשת עמלק מקנה את הזכות לכך.","contents":[{"passage_id":"devurim_4a0f398f_p1","passage_content":"עוד אפ\"ל בביאור הענין בהקדם דברי הספרי, והי' כי תבוא אל הארץ, אין והי' אלא מיד, עכ\"ד הספרי, וצ\"ב דמצות ביכורים אינו נוהג מיד, אלא לאחר ירושה וישיבה, ובזית רענן מבעל מג\"א תירץ דכוונת הכתוב שיהי' ביאת הארץ מיד, וגם זה צ\"ב דכבר נתבשרו על זה שיבואו לארץ מיד, דכ\"ז הי' בשנת הארבעים סמוך לכניסתן לארץ."},{"passage_id":"devurim_4a0f398f_p2","passage_content":"ב) ויביאנו אל המקום הזה, פרש\"י מדברי הספרי, אל המקום זה ביהמ\"ק, ויתן לנו את הארץ זה ארץ ישראל, וצ\"ב, למה סתם הכתוב ולא פירש לאיזה מקום כוונתו, וכעי\"ז הקשה הרמב\"ם ז\"ל בס' המורה, עה\"פ יראה כל זכורך וגו', במקום אשר יבחר ד', דאחרי שהמקום הי' ידוע לישראל, שהוא הר המורי' ומקום המקדש, למה הסתירו הכתוב, וכאן יקשה יותר, שאמר המקום הזה כמראה לנוכח, ולא גילה מקומו אי', גם צ\"ב מ\"ש המקום הזה, דמלת זה מיעוטא הוא, ומה בא למעט זולתו."},{"passage_id":"devurim_4a0f398f_p3","passage_content":"ג) להלן בסוף הפרשה ולא נתן ד' לכם לב לדעת וגו' עד היום הזה, פרש\"י ז\"ל להכיר את חסדי הקב\"ה ולהדבק בו עד היום הזה וכו', דבר אחר ולא נתן ד' לכם לב לדעת עד היום הזה, שאין אדם עומד על סוף דעתו של רבו וחכמת משנתו, עד ארבעים שנה, ולפיכך לא הקפיד עליהם המקום עד היום הזה, אבל מכאן ואילך יקפיד, ולפיכך סמך לי' ושמרתם את דברי הברית הזאת וכו', וכתב הרא\"ם ז\"ל דלשני הפירושים שברש\"י, מ\"ש ותבואו אל המקום הזה וגו' אין הכוונה אל המקום, אלא פירושו אחר שבאת אל המדריגה הזאת, להשיג מחכמתו ית' וחסדי המקום, מעתה הוא מדקדק עמכם בשמירת המצות, וע\"כ סמך לי' ושמרתם את דברי הברית, אבל הקשה למה הפסיק הכתוב במאמר ויצא סיחון וגו', בין ותבואו אל המקום הזה, ובין ושמרתם את דברי הברית, שהם דבקים זה לזה, גם ראה להבין דאם לזה יתכוין הכתוב, למה אמר ותבואו אל המקום הזה, ושם זה מורה על בחי' המקום, ולא על בחי' המדריגות, וכבר ביארנו בזה בדרושים הקודמים ועוד לאלקי מילין."},{"passage_id":"devurim_4a0f398f_p4","passage_content":"ד) במדרש תנחומא היום הזה ד' אלקיך מצוך לעשות, זש\"ה באו נשתחוה ונכרעה נברכה לפני ד' עושנו (תהלים צ\"ה) והלא כריעה בכלל השתחויה וכו', ומה ת\"ל נשתחוה נכרעה נברכה, אלא צפה משה ברוה\"ק, וראה שביהמ\"ק עתיד ליחרב, והבכורים עתידין ליפסק, עמד והתקין לישראל שיהיו מתפללין ג' פעמים בכל יום וכו', וצ\"ב דמה ענין תקנת התפלות למצות בכורים, ומצינו בגמ' דתפלות כנגד תמידין תקנום, אבל כנגד מצות בכורים ליכא מאן דאמר הכי, וראוי להבין כוונת דבריהם ז\"ל."},{"passage_id":"devurim_4a0f398f_p5","passage_content":"ולבאר הענין נקדים מ\"ש בספה\"ק נועם אלימלך (פ' שמות) עה\"פ וארד להצילו מיד מצרים ולהעלותו מן הארץ ההוא אל ארץ טובה וגו', ועתה הנה צעקת בנ\"י באה אלי וגו', ודקדק ז\"ל משה\"כ ועתה הנה צעקת בנ\"י באה וגו', אחר מאמר להעלותו אל ארץ טובה וגו', והיה ראוי להקדימו לפני אמרו וארד להצילו מיד מצרים, שזה הי' מכלל שמיעת צעקתם, ותרד לתרץ עפ\"י דברי הגמ' ברכות (דף ל' ע\"א) היה עומד בא\"י יכוין את לבו כנגד ירושלים וכו', היה עומד בבית המקדש יכוין כנגד בית קדשי הקדשים וכו', ולכאורה אם בכוונה תליא מילתא, גם העומד בחו\"ל יכוין לבו כנגד בית קדשי הקדשים, אך נראה דרבותינו ז\"ל הורו לנו דרכי התפלה, באופן שיעלו לרצון לפני השי\"ת ב\"ה וב\"ש, דקדושת א\"י היא יותר מחו\"ל, וקדושת ירושלים היא יותר מא\"י, וכן כולם קדושתם זו למעלה זו, וא\"א לאדם שיאחוז בקדושה רבה העליונה בפעם א', רק צריך לילך ממדריגה למדריגה. וזה שאמרו חז\"ל, מי שהוא עדיין בחו\"ל יאמץ ויקדש עצמו בקדושה יתירה, שיבא לקדושת א\"י, ואחר שיזכה לקדושה יתירה והיינו העומד בא\"י, יכוין לבו לאמץ עוד בקדושה נוספת כנגד ירושלים, וכן כולם וכו', אבל בודאי מי שעומד בחו\"ל דהיינו שעדיין לא נתקדש כלל, והוא מלא מחשבות זרות ותאוות גשמיות, בלתי אפשרי שתעלה תפלתו לפניו ית', והנה כשהיו ישראל במקום טומאה, ונתגשמו מאוד מחמת צרות עול שעבוד וסבלות מצרים, בלתי אפשרי הי', שתעלה צעקתם לפני השי\"ת, ולכן אמר השי\"ת וארד להצילו מיד מצרים ולהעלותו אל ארץ טובה וגו', ר\"ל שאעלה אותם ואביא אותם אל קדושת ארץ ישראל, ועתה הנה צעקת בנ\"י באה אלי וגו', עי\"ז יקובל תפלתם עכ\"ד ז\"ל."},{"passage_id":"devurim_4a0f398f_p6","passage_content":"ועד\"ז יתבאר לנו במאמה\"כ ותבואו אל המקום הזה ויצא סיחון וגו', עפי\"מ שבארנו לעיל (בדרוש הקדום) דלכאורה מה ראה סיחון שיצא להלחם עם ישראל, והרי לא רצו ישראל להתגרה אתו במלחמה, כ\"א לעבור בארצו, ואילו הניחם לעבור, לא הי' הציווי לכבוש את ארצו עדיין, והרי שמעו כל העמים גודל הנסים שנעשו לישראל, ואיך לא פחד סיחון ויצא להלחם באין הכרח, אך לפי שראה סיחון שנתעלו ישראל בצדקתם ובמדריגתם, כמ\"ש ולא נתן ד' לכם לב לדעת וגו' עד היום הזה, ולפי גודל טומאתם בקליפה נתגבר שנאתם עכשיו יותר, כמ\"ש ק\"ז הישמח משה זלה\"ה (בפ' בלק), כי השנאה הוא לפי ההתרחקות, וע\"י גודל השנאה נתעור עיניהם, ולא השגיחו על הנסים שנעשו לישראל, והלכו להלחם עמהם אף כנגד השכל."},{"passage_id":"devurim_4a0f398f_p7","passage_content":"ובזה יתבאר קישור הכתוב ותבואו אל המקום הזה, היינו שהגעתם אל המדריגה הגדולה הזאת כדרשת חז\"ל, ע\"כ ויצא סיחון וגו', דאילולי הצדקות וגודל מדריגתם, הי' השכל מחייב אותם שלא לצאת ולהתגרות במלחמה (עיין בדברינו לעיל בדרוש הקדום ביתר ביאור), אמנם מה שאמה\"כ ותבואו אל המקום הזה, ומלת מקום מורה בכ\"מ על בחי' המקום, לא על בחי' המדריגה כקושיתנו הנ\"ל, ובפשטות אפ\"ל דארץ סיחון ועוג יש להם מבחי' קדושת הארץ, וגם זה סייע להם לישראל שנתעלו במדריגתם, והפשט והדרש מקושרים ויתאחדו כאחד, דלפי שבאו במקום הזה שהוא מבחי' א\"י, ע\"כ נתעלו במדריגה עליונה, ולטעם זה ויצא סיחון וגו', אמנם לפי\"ד הנועם אלימלך זלה\"ה יתבאר יותר, ואפשר שהעלה הקב\"ה את ישראל להביאם לקדושת ארץ ישראל וקדושת המקדש, וכבחי' שפי' הנוע\"א זלה\"ה ולהעלותו אל ארץ טובה וגו', שזכו לזה בעודם במצרים, ואף כאן נתעלו ישראל לבחי' זו, וזהו ותבואו אל המקום הזה, המורה על בחי' המקום כפשוטו, ולטעם זה זכו למדריגה הגדולה כמשה\"כ ולא נתן ד' לכם לב לדעת וגו' עד היום הזה, ולטעם זה ויצא סיחון וגו', ומקושר פשוטו של מקרא עם מדרשו, וא\"ש הקישור ויצא סיחון וגו'."},{"passage_id":"devurim_4a0f398f_p8","passage_content":"ועד\"ז יתבאר לעניננו בפ' בכורים, ויביאנו אל המקום הזה וגו' ודרשו רז\"ל בספרי אל המקום זה ביהמ\"ק, ויתן לנו את הארץ זה ארץ ישראל, דהנה המביא בכורים מזכיר מחסדי המקום ית', ומתחיל מארמי אובד אבי וירד מצרימה וגו', ונצעק אל ד' אלקי אבתינו וישמע ד' את קלנו וגו', וע\"כ סיים ויביאנו אל המקום הזה ויתן לנו את הארץ הזאת, ר\"ל שהעלה הקב\"ה את אבותינו לקדושת א\"י ולקדושת המקדש, כבחי' שכתב הנוע\"א זלה\"ה, ועי\"ז נתקבלה צעקתם ותפלתם, ולולי זה הי' בלתי אפשרי שתעלה צעקתם לפני השי\"ת, לגודל התגשמותם מטומאת מצרים ועול השעבוד."},{"passage_id":"devurim_4a0f398f_p9","passage_content":"ועד\"ז ירמזו דברי הספרי (בקושיא א') והי' כי תבוא אל הארץ, אין והי' אלא מיד, ר\"ל דאף טרם שיזכו ישראל לביאת הארץ בפועל, יתעלו ע\"י הבוי\"ת לקדושת הארץ ולקדושת הקדשי קדשים כפי הכנתם ותשוקתם להמשיך השפעת הקדושה אליהם, וע\"ד שאמרז\"ל בתפלה (ברכות דף ל' נרא) היה עומד בחו\"ל יכוין את לבו כנגד א\"י, הי' עומד בא\"י יכוין את לבו כנגד ירושלים, הי' עומד בבית המקדש יכוין כנגד קדשי הקדשים, וכבחי' שפי' בספה\"ק נועם אלימלך זלל\"ה, וז\"ש בספרי והי' כי תבוא אל הארץ, אין והי' אלא מיד, שאפשר לזכות לביאת הארץ מיד, אם יקדים הכנה הראוי' לה, וכמו שהי' בכל הדורות צדיקים וקדושים שלא זכו לביאת הארץ בפועל, אבל זכו ונתעלו לקדושת הארץ וקדושת המקדש, וזכו לבחי' המקום, ובבחי' ויביאנו אל המקום הזה כמו שפירשנו."},{"passage_id":"devurim_4a0f398f_p10","passage_content":"ועד\"ז יתבאר הסמיכות מ\"ש הבעה\"ט, לעיל מיני' כתיב תמחה את זכר עמלק, וסמיך לי' והי' כי תבואו אל הארץ וכו', עפימ\"ש האלשיך הק' (בפ' בשלח) דענין מחיית עמלק א\"א, כ\"א שיפיל הקב\"ה תחלה את שר של עמלק והוא הס\"מ, והנה בכל חטא ועון מוסיפין לו כח, וע\"כ צריך לרחוץ ולטהר מכל נדנוד חטא, בל ישען על עוננו עייש\"ד, ואם יהי' לנו הכנה הראוי' לזה, אז יתקיים והי' כי תבואו אל הארץ מיד, ונזכה אל בחי' המקום ולהתעלה אל קדושתה, וז\"פ הסמיכות."},{"passage_id":"devurim_4a0f398f_p11","passage_content":"ומה שסתם הכתוב באמרו המקום הזה, ולא הזכיר שם המקום בפירוש, גם צ\"ב מ\"ש המקום הזה ומהו הכוונה במלת הזה כקושיתנו לעיל, ואפ\"ל עפימ\"ש הרד\"ק ז\"ל (ירמי' ז') עה\"פ אל תבטחו לכם אל דברי השקר לאמר היכל ד' היכל ד' היכל ד' המה, שאומרים להם נביאי השקר המתעים אותם וכו', לא יחריב היכלו בעבור העון, ולא תחרב העיר הזאת ואמר ג' פעמים היכל ד', לפי שהיו שלשה אולם והיכל ודביר, כן פי' אדוני אבי ז\"ל, ופי' כי פסוק ארץ ארץ ארץ (ירמי' כ\"ב כ\"ט) תשובת דבריהם, אמר הרי היכלות שאתם אומרים לפני, חשובים כמו הארץ, כיון שאתם חוטאים לפני ומבזים ההיכלות, עכ\"ל הרד\"ק שהביא בשם אביו ז\"ל, ולכאורה הרי זה הי' בזמן הבית וכהנים בעבודתן ולוים בדוכנן, ואיך יתכן שנעלמה משם קדושת המקדש, וצ\"ל דלאלו החוטאים שבאו למקדש ד' בכוונה רעה, לחפות על כל פשעיהם כמ\"ש ירמי' (שם להלן) ובאתם ועמדתם לפני בבית הזה אשר נקרא שמי עליו, ואמרתם נצלנו למען עשות את כל התועבות האלה, נמצא שעשו המקדש סיבה לתועבותם, ע\"כ נסתרה מהם קדושת המקדש, כצ\"ל בכוונת הרד\"ק ז\"ל."},{"passage_id":"devurim_4a0f398f_p12","passage_content":"והובא בדברינו כ\"פ דברי הצמח ד' לצבי שלפעמים נתחלף קדושת המקדש ונעתקה משם אם העוונות גורמים ר\"ל, ולפעמים להיפך כמ\"ש הערבי נחל (פ' שלח) עפי\"ד הזוה\"ק וכתבי האריז\"ל, שהקשו הלא נודע שאיסור קדשים בחוץ חייבים עליו כרת, עבור כי אין מקום להקריב קרבן, אם לא בביהמ\"ק שעומד בא\"י, ושם עשר קדושות המבוארים בכלים, אבל חו\"ל אינו סובל קדושת הקרבת הקרבן, וא\"כ איך בכל מ' שנה שהיו ישראל במדבר בחו\"ל, הקריבו קרבנות אצל המשכן, ותירצו שכמו שמצינו ביעקב אע\"ה שקיפל הקב\"ה את כל א\"י והניחו תחתיו, כך הי' הענין בזה שמעת צאתם מארץ מצרים, אזי בכל מקום שהי' חנייתם, הי' שם כל עשר קדושות של א\"י וכו', ומקום המשכן הי' ממש מקום המקדש, וכל הקדושה שמקומה לשרות במקום ביהמ\"ק, הי' שם במקום המשכן, ולכן הקריבו שם קרבנות עייש\"ד שהאריך."},{"passage_id":"devurim_4a0f398f_p13","passage_content":"ומעתה א\"ש שסתם הכתוב ולא הזכיר שם המקום בפירוש, דלפעמים נעתק קדושת המקום, וכמו שזכו ישראל בעודם במצרים, וכבחי' שכתב בנוע\"א זלל\"ה שהעלה אותם הקב\"ה לקדושת א\"י, וכמו שזכו לזה דור המדבר כמבואר בזוה\"ק הנ\"ל, ולפעמים נתחלף ואזלה הקדושה ממקומה הראוי לה נע\"צ העונש. ובסיבת החטאים, כמ\"ש בס' צמח ד' לצבי הנ\"ל, ע\"כ סתם הכתוב ולא פי' מקומו אי', ואמר המקום \"הזה\" כי המביא בכורים מהלל ומשבח להשי\"ת שזכה להביא בכוריו למקדש ד', וקדושת המקדש במקומו הראוי' לה ועיין בדברינו (דברי יואל פ' תולדות תרנ\"א) דכיון שמצות התורה עליו להביא בכורים ולקרוא פ' בכורים, ולא אמרה תורה שלח לתקלה, ודאי שיש בכח מצוה זו, דבאותה שעה יש לחלק שדהו וארצו קדושת א\"י, ואפי' נתחלף מקודם בארץ חו\"ל ע\"י פגם חטאיו, אבל מצוה זו הבטחה הוא לו דחזרה לקדושת א\"י, ועד\"ז קדושת המקדש במקומה הראוי' לה, ולטעם זה אמר הכתוב המקום הזה והבן."},{"passage_id":"devurim_4a0f398f_p14","passage_content":"ועד\"ז יתבארו דברי התנחומא (לעיל קושיא ד') עפימ\"ש הכלי יקר בשם הרמב\"ם ז\"ל (בר\"פ זו) שעיקר טעם מצות בכורים הוא ההכנעה וההשתעבדות אל השם יתברך, כי מאת ד' היתה הארץ לי למנה ומתנה, ולא כחי ועוצם ידי עשה לי את החיל הזה, ועד\"ז פי' האלשיך הק' והאברבנאל (הו\"ד בדרוש הקדום) ופי' בזה הכלי יקר ז\"ל מאמה\"כ אשר תביא מארצך אשר ד' אלקיך נתן לך, כי ארץ זו לא תקרא ארצך, כי אם אחר הבאת הבכורים, ואחרי שהודית אשר ד' אלקיך נותן לך וגו', ולדרכנו אפ\"ל דע\"י ההכנעה וההשתעבדות, שיכיר ויודה כי מד' ניתן לו את הארץ, יזכה לביאה חדשה ולבחי' המקום, ובמקומה הראוי' לה, וזה ירמוז הכתוב ויביאנו אל המקום הזה ויתן לנו את הארץ הזאת, שע\"י שיודה שהבוי\"ת נתן לנו את הארץ הזאת, יזכה אל ויביאנו אל המקום הזה, וז\"ש והי' כי תבוא אל הארץ אשר ד' אלקיך נתן לך, דבזכות זה תבוא אל הארץ ולהתעלות לבחי' המקום, ע\"י שתכיר ותדע אשר ד' אלקיך נתן לך את הארץ."},{"passage_id":"devurim_4a0f398f_p15","passage_content":"והנה כמו\"כ כל ענין התפלה הוא רק להראות ההכנעה וההשתעבדות לפניו ית', כמ\"ש החובת הלבבות דהבוי\"ת יודע כל מחסורי בני אדם, וענין התפלה הוא רק להראות הכניעה אליו ית' על כל פרט ופרט מצרכנו, נמצא מבואר דמצות בכורים וענין התפלה בחי' אחת להם, וגם ע\"י התפלה אפשר להמשיך קדושת א\"י וקדושת המקדש, אם יהי' לו הכנה הראוי' לכך, וכמ\"ש רז\"ל יכוין את לבו כנגד א\"י, יכוין כנגד בית קדשי קדשים, וכבחי' שכתב בספה\"ק נוע\"א זלל\"ה. וז\"פ התנחומא והלא כריעה בכלל השתחוי' וכו', ומה ת\"ל נשתחוה נכרעה ונכרעה וע\"כ דרשו רז\"ל מכפל הלשונות על ענין התפלה, שעיקרו ג\"כ לטעם ההכנעה וההשתעבדות, דלפי שצפה משה ברוה\"ק וראה שביהמ\"ק עתיד ליחרב והביכורים עתידין ליפסק, עמד והתקין לישראל שיהיו מתפללין ג' פעמים בכל יום, ובחינתם שוה לבחי' הבכורים, וע\"כ אף אחר החורבן שא\"א לקיים מצות בכורים עוד, אבל ע\"י התפלה יקיים ההכנעה וההשתעבדות לפניו, ובכח התפלה להמשיך קדושת א\"י כבחי' הבכורים, והבוכ\"ע יעזור שיהי' לנו השפעה מן השמים לעשות תשובה שלימה, והבוכ\"ע ירחם עלינו וינחנו בדרך האמת ויתקבלו תפלות בנ\"י לפני הקב\"ה, וכמ\"ש ועתה הנה צעקת בנ\"י באה אלי, שצ\"ל תיכף ומיד, שאנו כבר בבחי' ולא יכלו להתמהמה וצריכים אנו לישועה מיד, ובמהרה נוושע בשנת גאולה וישועה, ונזכה לקבל פני משיח צדקנו מתוך נחת ושמחה בקדושה ובטהרה בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו בב\"א."},{"passage_id":"devurim_4a0f398f_p16","passage_content":"עוד אפשר לבאר דברי הספרי הנ\"ל באופן אחר בע\"ה, ונקדים מ\"ש בספרי, והי' כי תבוא, אין והי' אלא מיד, וצ\"ב דלא נתחייבו בבכורים מיד, אלא אחר ירושה וישיבה, ובזית רענן פי', דר\"ל דביאת הארץ יהי' מיד, אבל ג\"ז צ\"ב, דכבר הי' בסוף ארבעים שנה, וכבר נתבשרו על זה שיכנסו מיד לארץ, ולמה השמיענו במצוה זו דוקא."},{"passage_id":"devurim_4a0f398f_p17","passage_content":"בבעה\"ט דריש סמוכין, דלעיל מיני' כתיב תמחה את זכר עמלק, וסמיך לי' והי' כי תבוא אל הארץ, שנצטוו למחות את זכר עמלק, מיד בכניסתן לארץ, ונראה שדורש ג\"כ לשון והי' מיד, כדברי הספרי, וצ\"ב דלא נצטוו במצוה זו מיד, אלא אחר הקמת מלך כמבואר בגמ', וזה הי' הרבה שנים אחר כניסתן לארץ, גם עיקר מחיית עמלק לא תתקיים אלא לעתיד, וצ\"ב דרשא דמיד."},{"passage_id":"devurim_4a0f398f_p18","passage_content":"ויתבאר בהקדם דברי הגמ' ברכות (ח' ע\"א) א\"ל לר' יוחנן איכא סבי בבבל, תמה ואמר למען ירבו ימיכם וגו' על האדמה, אבל בחו\"ל לא, כיון דאמרי לי' דמקדמי ומחשכי לבי כנישתא, אמר היינו דאהני להו, וכתב המהרש\"א ז\"ל בח\"א עפימ\"ש במס' מגילה (כ\"ט א') עתידין בתי כנסיות ובתי מדרשות שבבבל שיקבעו בא\"י, א\"כ הו\"ל כאלו הם על האדמה, שהרי יקבעו לעתיד שם בא\"י עכ\"ל."},{"passage_id":"devurim_4a0f398f_p19","passage_content":"ובדבריו הקדושים יובן לי, לתרץ קושית הרמב\"ן ז\"ל (בפ' עקב) על מ\"ש רש\"י בשם הספרי, ושמתם את דברי אלה וגו', אף לאחר שתגלו, היו מצויינים במצות וכו', כדי שלא יהיו לכם חדשים כשתחזרו, וכתב הרמב\"ן דעיקר הכתוב בארץ מיירי, דכתיב למען ירבו ימיכם וגו' על האדמה, ומה שדרשו בספרי ושמתם לאחר שתגלו וכו', מפני שסמך ושמתם אל ואבדתם עיי\"ש שנדחק בפירושו, ולדברי המהרש\"א ז\"ל לא צריכנא לדחוקי, דגם בחו\"ל ובגלות יתקיים הפסוק למען ירבו ימיכם על האדמה, דבתי כנסיות שבחו\"ל הו\"ל כאלו הם בא\"י ע\"ש העתיד."},{"passage_id":"devurim_4a0f398f_p20","passage_content":"ונקדים מ\"ש ז\"ל בפסיקתא (פי\"ב) אמרו ישראל לפני הקב\"ה, רבון כל העולמים אתה אומר לנו הוו זכורים למחות את זכר עמלק, בשר ודם אנו, לשעה אנו, אתה שחי וקיים לעולמי עולמים הוי זכור, א\"ל הקב\"ה בני אין לכם אלא להיות קוראים פרשת עמלק בכל שנה, ומעלה אני עליכם כאלו אתם מוחים שמו מן העולם עכ\"ד הפסיקתא, ולפי זה אפשר שתתקיים מצות מחיית עמלק מיד, דע\"י הקריאה מעלה הכתוב, כאלו אתם מוחים שמו מן העולם."},{"passage_id":"devurim_4a0f398f_p21","passage_content":"והנה קריאה זו היא מצות עשה, וצריך שתהי' בס\"ת ובצבור בבית הכנסת, וע\"י שקוראין בביהכנ\"ס יתקיים ג\"כ ביאת הארץ מיד, דהו\"ל כאלו הם על האדמה ע\"ש העתיד כמ\"ש המהרש\"א ז\"ל, וא\"ש דברי הבעה\"ט שדריש הסמוכין לומר, שנצטוו למחות עמלק מיד בכניסתן לארץ, דאפשר שיתקיימו שניהם כאחד, וגם שיהי' מיד כנ\"ל. וא\"ש דברי הספרי אין והי' אלא מיד, דע\"י זכירת עמלק יתקיים ביאתן לארץ מיד, וז\"ש בספרי עשה מצוה האמורה בענין, ור'ל זכירת עמלק שנסמכה כאן, ומצותה ע\"י אמירה, שבשכרה תכנס לארץ, וה\"ה כאלו הי' בארץ ישראל, דבתי כנסיות ובתי מדרשות יש להם קדושת א\"י ע\"ש העתיד, ורש והי' לשון עתיד, דמה שנחשב לביאת הארץ הוא ע\"ש שעתידין ליקבע בא\"י."},{"passage_id":"devurim_4a0f398f_p22","passage_content":"R"},{"passage_id":"devurim_4a0f398f_p23","passage_content":"נצבים וילך"}]},{"dvar_torah_id":"devurim_43b51340","title":"הכנה לתשובה בעיקבתא דמשיחא","summary":"משה רבינו מדבר אל כל הדורות, מזהיר ומנחם את ישראל לקראת הקללות והיסורים, ומדגיש את חשיבות התשובה. הקללות מקיימות את ישראל, והגאולה תבוא בעקבות התשובה, אף בעיקבתא דמשיחא. הקשר בין עץ ואבן לכסף וזהב מסמל את התמודדות עם עבודת אלילים.","contents":[{"passage_id":"devurim_43b51340_p1","passage_content":"אתם נצבים היום כלכם לפני ד' אלקיכם, ראשיכם שבטיכם זקניכם וגו', כל איש ישראל וגו', יל\"ד דבמאמר הכתוב כלכם, הרי כלל כולם, ואח\"כ פרט ראשיכם זקניכם וגו', וחזר וכלל כל איש ישראל, ולמה כפל הדבר פעמים ושלש."},{"passage_id":"devurim_43b51340_p2","passage_content":"ב) במדרש אגדה והובא ברש\"י ז\"ל, למה נסמכה פ' אתם נצבים לקללות, לפי ששמעו ישראל מאה קללות חסר שתים וכו', הוריקו פניהם ואמרו, מי יוכל לעמוד באלו, התחיל משה לפייסם, אתם נצבים היום, הרבה הכעסתם למקום ולא עשה אתכם כלי' וכן', הקללות והיסורין מקיימין אתכם ומציבין אתכם לפניו וכו', עכ\"ד רש\"י ז\"ל, והכלי יקר הקשה כאן קושיא חזקה, איך קבלו ישראל תנחומין של הבל, כי מה שלא עשה בהם כלי' עד הנה, שמא לפי שעדיין לא נתמלא סאתם, לשיחולו עליהם כל האלות של התוכחה, ואם תאמר שהרבו כעסים למקום ב\"ה, והגדילו אשמה עד שהיו ראוים לכל אותן האלות, ואעפ\"כ השי\"ת ברוב רחמיו לא עשה בהם כלי', א\"כ משה כתב להם שטר ושוברו עמו, ועשה תרי דברים דסתרי אהדדי, כי מתחלה יעד להם קללות כדי שייראו מהם, ואח\"כ נחם אותם שלא יפחדו מהם."},{"passage_id":"devurim_43b51340_p3","passage_content":"ג) גם יש להבין מ\"ש הקללות והיסורין מקיימין אתכם, ומציבין אתכם לפניו, איך יהי' סגולת היסורין להיות דבר המעמיד ומקיים, ודי להם שלא יעשו ההיפך."},{"passage_id":"devurim_43b51340_p4","passage_content":"ד) במדרש תנחומא זש\"ה הפוך רשעים ואינם ובית צדיקים יעמוד, ראוי להבין מהו הכוונה באמרו הפוך רשעים, ומהו נפק\"מ באיזה אופן יהי' איבודם."},{"passage_id":"devurim_43b51340_p5","passage_content":"ה) בירושלמי הוריות (פ\"ג ה\"ה) איתא מ\"ט הקדים משה ראשים לזקנים, ויהושע הקדים זקנים לראשים וכו', ר\"י דסיכנין בש\"ר לוי אמר, משה ע\"י שצפה ברוה\"ק שעתידין ישראל להסתגר במלכיות, וראשיהן עומדין להשתדל עליהן, לפיכך הקדים ראשיהם, שאם אין ראשים משתדלין לפייס את המלכות, אין כח ביד הזקנים ללמוד תורה, עכ\"ד הירושלמי, ועיין בפ\"מ, ויש להבין שהרי משה רבינו דבר כאן אל דור באי הארץ, שהיו חרות משעבוד מלכיות, והי\"ל לדבר אליהם כפי בחינתם, ולהקדים זקנים לראשים, וכמו שדיבר יהושע אל הדור ההוא, ואם רצה לרמוז גם על דורות העתידים, הי\"ל לומר ב' הבחינות גם יחד, ומדוע דבר עמהם רק כפי בחינת העתיד, ולא כפי בחינתם, גם בפסוק לא חילק אלא אמר היום וגו', והזכיר ראשיכם זקניכם, משמע דבחינה זו שייך גם היום."},{"passage_id":"devurim_43b51340_p6","passage_content":"ו) להלן בפרשה כי אתם ידעתם את אשר ישבנו בארץ מצרים, ואת אשר עברנו בקרב הגוים אשר עברתם, ותראו את שקוציהם וגו' עץ ואבן כסף וזהב אשר עמהם, פן יש בכם איש או אשה וגו', אשר לבבו פונה וגו', ופי' הראב\"ע אשר עברנו בקרב הגוים קאי על אדום ועמון ומואב ומדין, ויש להבין למה אמר הכתוב בקרב הגוים, הלא לא עברו בקרב העמים האלה, ולא נתן להם הקב\"ה רשות לעבור בארצם שלא ברצונם, והסבו את גבולם כמבואר בכתוב, גם סיחון ועוג יצאו לקראתם, ואת מדין הכו לפי חרב ולא באו בקרבם כלל."},{"passage_id":"devurim_43b51340_p7","passage_content":"ז) גם למה מונה הכתוב כל הסיבות הגורמים לעבוד ע\"ז, הלא העיקר הוא האזהרה שלא לעבוד ע\"ז, ויספיק הכתוב באזהרה לבדה."},{"passage_id":"devurim_43b51340_p8","passage_content":"ח) למה כפל הדבר במילות שונות באמרו אשר עברנו, וחוזר ואומר אשר עברתם."},{"passage_id":"devurim_43b51340_p9","passage_content":"ט) גם למה שינה לשונו, ואמר אשר עברנו וכלל עצמו עמהם, ואח\"כ אמר אשר עברתם לנוכח."},{"passage_id":"devurim_43b51340_p10","passage_content":"י) גם ראוי להבין מ\"ש הכתוב, עץ ואבן כסף וזהב, דמאי נפק\"מ אם הוא עץ ואבן או משאר מינים, ולמה יאריך הכתוב למנות את כל אלו, ומצינו בפ' יתרו שנא' לא תעשון את אלקי כסף ואלהי זהב, ודרשו חז\"ל בו כמה דרשות, ובמכילתא אמרו והובא ברשיז\"ל, למה נאמר אלהי כסף ואלהי זהב, ודרשו בו שבא הכתוב להזהיר על הכרובים שלא יעשם של כסף, ולא יוסיף על שנים, עיי\"ש, ובירושלמי דסנהדרין דרשו מזה שלא ימנו דיינים בשביל כסף וזהב, וז\"ל לא תעשון אתי אלהי כסף ואלהי זהב הא דעץ שרי, אמר רב אשי אלוה הבא בשביל כסף ואלוה הבא בשביל זהב, עכ\"פ מבואר דמוכרח דלדרשא קאתו, דאל\"ה מיותר הוא, וא\"כ הכא למאי אתי."},{"passage_id":"devurim_43b51340_p11","passage_content":"יא) רש\"י ז\"ל פי' אותן של עצים ואבנים ראיתם בגלוי וכו', אבל של כסף וזהב עמהם, בחדרי משכיותם הם, לפי שהם יראים שמא יגנבו, לכך נאמר כסף וזהב אשר עמהם, ראוי להבין למה ירמוז הכתוב, על דבר שאין לנו בו תועלת בידיעתו, ומאי נפק\"מ לידע בדרכם של האומות, אם מטמינין את הע\"ז או לא, והלא עיקר המכוון כאן, הוא האזהרה שלא לעבוד שום ע\"ז, וא\"כ אשר עמהם מיותר."},{"passage_id":"devurim_43b51340_p12","passage_content":"יב) פן יש בכם איש או אשה וגו', אשר לבבו פונה היום, פרש\"י פונה היום מלקבל עליו הברית, וחזר ואמר הכתוב פן יש בכם שורש פורה וגו', והתברך בלבבו וגו', והמזרחי נדחק בדברי רש\"י ז\"ל, על מה שפי' אשר לבבו פונה היום מלקבל עליו הברית, הרי הכתוב מכחישו, ומפורש בכתוב אשר לבבו פונה וגו' ללכת לעבוד את אלהי הגוים וגו', וקאי על ע\"ז ולא על קבלת הברית, ע\"כ פי' בדרך רחוק, שמ\"ש רש\"י אשר לבבו פונה מלקבל הברית, לא כיוון לפרש לשון הפסוק, אלא זו מלשון רש\"י וקאי על פן הב', והראשון מדבר בע\"ז, והשני בקבלת הברית עייש\"ד, והגור ארי' דחה כל דבריו, שא\"א לפרש כן בדברי רש\"י, והוכיח כי שניהם על קבלת הברית אתי עיי\"ש, אבל א\"כ למה יאמר הכתוב פן יש בכם ב' פעמים, ליערבינהו וליתנינהו, והי\"ל לומר פן יש בכם איש או אשה או משפחה וגו', שורש פורה ראש וגו', אשר לבבו פונה וגו', וכן הקשה ג\"כ האוהחה\"ק."},{"passage_id":"devurim_43b51340_p13","passage_content":"יג) למען ספות הרוה את הצמאה, פרש\"י ז\"ל עפ\"י התרגום, שאוסיף לו פורענות על מה שעשה בשוגג וכו', ואצרפם עם המזיד ואפרע ממנו הכל, ורוה הוא שוגג שעושה שלא מדעת, וצמאה זה המזיד שעושה מדעת ובתאוה עכ\"ד, ראוי להבין למה יצרף ד' שוגג אל המזיד, וכי כך הוא המידה לענוש שוגג כמזיד, ואם בשעת עשי' שוגג הי' איך ישתנה דינו להיות כמזיד."},{"passage_id":"devurim_43b51340_p14","passage_content":"יד) למה אמרן הכתוב ברמז רוה וצמאה, והמשיל את השוגג והמזיד לרוה וצמאה, ואם רק לזה כיון הכתוב יאמר בפירוש שוגג ומזיד."},{"passage_id":"devurim_43b51340_p15","passage_content":"טו) והי' כי יבאו עליך כל הדברים האלה הברכה והקללה וגו', ושב ד' אלקיך את שבותך וגו' והיטבך והרבך מאבתיך, וזהו הבטחה לנו לכשיחזרו ישראל מארצות גלותם, אבל אינו מבואר בקרא איך שיהי, ההטבה והרבוי הזה, ובירושלמי פ\"א דקדושין הקשו כן מהו והטיבך והרבך, ונעתיק דבריהם להלן."},{"passage_id":"devurim_43b51340_p16","passage_content":"טז) בספר חוט המשולש עה\"ת (בפ' תבוא) מביא מדרש וזה תוארו, אבתיך חטאו ואינם, ואנחנו עונותיהם סבלנו, זש\"ה ברוך אתה בבואך וברוך אתה בצאתך, והוא פלא."},{"passage_id":"devurim_43b51340_p17","passage_content":"ולבאר כל הענין נקדים מה שדרשו חז\"ל במס' ב\"מ (ק\"ז ע\"א) ברוך אתה בבואך וברוך אתה בצאתך, שתהא יציאתך מן העולם כביאתך לעולם, מה ביאתך לעולם בלי חטא, אף יציאתך בלא חטא, עכ\"ד הגמ', והרש\"ש כתב מכאן סתירה קצת לבעלי דעת הגלגול, דא\"כ לא ברירא מילתא, ואפשר להיות גם ביאתך בחטא, וכבר אמרתי כי הקושיא מעיקרא ליתא, עפימ\"ש הרמב\"ן ז\"ל (בפ' בחקתי) כי כל יעודי הברכות שבתורה נאמרו על לעתיד, ולא השיגו ישראל מעולם לברכות האלה, אבל יתקיים עמנו בזמן השלמות, וא\"כ מ\"ש הכתוב ברוך אתה בבואך וגר, נאמרה על לעתיד, וא\"ש מה שדרשו חז\"ל מה ביאתך לעולם בלא חטא, כי אז לא יהי' עוד גלגול, כי כבר יכלו כל הנשמות שבגוף ויתקנו כולם."},{"passage_id":"devurim_43b51340_p18","passage_content":"ואפ\"ל עוד, דהנה לכאורה קשה על דרשתם הנ\"ל, דא\"כ הי\"ל לומר ברוך צאתך כבואך, שהרי הברכה לא נאמרה אלא על היציאה שתהא כביאה, וברוך אתה בבואך מיותר, וכן הקשה המזרחי ז\"ל בפ' תבא, ונראה לומר דזו ברכה כפולה, והתחיל הכתוב לומר והי' אם שמוע תשמע בקול ד' אלקיך לשמור לעשות את כל מצותיו וגו', אז ממילא לא יצטרכו הנשמות לחזור בגלגול, כי יתקנו הכל בגלגול ראשון, ויבואו לעולם רק נשמות חדשות ובלא חטא, וע\"ד מ\"ש האריז\"ל לפרש מה שאמרו חז\"ל, ובעוה\"ר יצאו מה שיצאו, ועדיין בן דוד לא בא, שיוצאים עוד הפעם נשמות שכבר יצאו לעולם, ולא תקנו את שלימות נשמתם, ואפשר שעוד קלקלו, וע\"כ עדיין בן דוד לא בא עיי\"ש. אבל לעתיד יתוקן הכל ולפי\"ז יהי' כוונת הכתוב בדרך זה, ברוך אתה בבואך שיהא ביאתך בלא חטא, ר\"ל שירדו נשמות חדשים נקיים מחטא, ואפי' יבואו בגלגול יהיו נשמות טהורות בלא חטא ויתגלגלו רק לטובת הדור, ועוד ברכה שתהא יציאתך כביאתך בלא חטא ומתורץ קושית המזרחי, ול\"ק קושית הרש\"ש."},{"passage_id":"devurim_43b51340_p19","passage_content":"ואפ\"ל עוד עפ\"י מ\"ש חז\"ל במס' סנהדרין (כ\"ז ע\"ב) פוקד עון אבות על בנים ועל שלשים וגו', כשאוחזין מעשה אבותיהם בידיהן, וכתב האוהחה\"ק (בפ' יתרו) שע\"כ אין ממתין הקב\"ה יותר מד' דורות, לפי שהם עלולים לחטוא, וכבר מושרש בקרבם כח הרע והקליפה עיי\"ש, וא\"ש מ\"ש הכתוב ברוך אתה בבואך, דזו ברכה בפני עצמה על ביאתך לעולם, שלא יהי' מושרש בך כח הרע דאז קשה להתגבר ועלול האדם לחטוא ח\"ו כדברי האוהח\"ק, ומתורץ קושית המזרחי."},{"passage_id":"devurim_43b51340_p20","passage_content":"ונבוא לתרץ דברי מדרש הנ\"ל הובא בחוט המשולש, דהנה הפסוק אבותינו חטאו ואינם ואנחנו עונותיהם סבלנו (איכה ה'), יובן גם עפ\"י פשוטו עפ\"י מ\"ש רז\"ל פוקד עון אבות על בנים כשאוחזין מעשה אבותיהם בידיהם, אמנם אפ\"ל עוד כוונת הכתוב, עפ\"י מ\"ש האריז\"ל לפרש, מ\"ש חז\"ל צדיק וטוב לו צדיק בן צדיק, צדיק ורע לו צדיק בן רשע וכו' (ברכות ז') שהכוונה עפ\"י סוד הגלגול, וצדיק בן צדיק יקרא, מי שהי' צדיק גם בגלגול הראשון, וע\"כ טוב לו, וצדיק בן רשע מי שהי' בגלגול הראשון רשע, עיי\"ש, עכ\"פ מבואר לפי דרכו שהגלגול יקרא בבחי' בן, והראשון בבחי' אב, ולפי\"ז יהי' כוונת הכתוב אבותינו חטאו ואינם, על שחטאנו בגלגול הראשון ע\"כ ואנחנו עונותיהם סבלנו, ולא יקשה קושית הגמ' (בברכות ז') והכתיב לא יומתו בנים על אבות כי איש בחטאו יומתו, כי יענשו בחטאם, אשר חטאו בגלגול הקדום, וא\"ש קישור דברי המדרש זש\"ה ברוך אתה בבואך, שיהא ביאתך לעולם בלא חטא ונשמה חדשה, ומעתה לא תסבול עונשים עבור חטאים מגלגול הקדום."},{"passage_id":"devurim_43b51340_p21","passage_content":"והנה רש\"י ז\"ל פי' עה\"פ ולא אתכם לבדכם אנכי כרת את הברית הזאת וגו', כי את אשר ישנו פה וגו' ואת אשר איננו פה עמנו היום, שאף עם דורות העתידים להיות, כרת משה את הברית, וקבלו עליהם הברית והשבועה, והעקידה ז\"ל הקשה, דאיך אפשר לחייב בדין שבועה, אותן הנשמות העתידין להבראות, הלא האדם בשבועה כתיב, שיהא אדם בשעת שבועה (שבועות כ\"ו) ותירץ שלא הי' שבועה מצד הדין, אלא שהטילו עליהם חומר איסור שבועה, והשלה\"ק כתב דמגמ' לא משמע כן, שאמרו בכ\"מ מושבע ועומד מהר סיני ואין שבועה חלה על שבועה, אלמא דשבועה ממש רמיא עלייהו, והגור ארי' תירץ, דאין ב\"ד יכול לבטל דברי ב\"ד חבירו אא\"כ גדול ממנו בחכמה ובמנין, ואין ב\"ד כבית דינו של משה, וע\"כ היו יכולים לקבל הברית גם על דורות הבאים עיי\"ש. אבל התינח על קבלת הברית א\"ש תירוץ זה, אבל איך אפשר שיחול השבועה גם על דורות הבאים, והרי האדם בשבועה כתיב, ועכ\"ח נצטרך לומר כתירוצו של שלה\"ק, שכל הדורות העתידים עמדו שם עם הגופים, עיי\"ש."},{"passage_id":"devurim_43b51340_p22","passage_content":"ובאמת מפורש כן בזוה\"ק (פ' לך דף צ\"א) וז\"ל כתיב כי את אשר ישנו פה וגו', הא אוקמוה דכלהו בני נשא דזמינין למהוי בעלמא, כלהו אשתכחו תמן וכו', ולעיל מיני' מבואר שם בזוה\"ק, דמה שהראה הקב\"ה לאדה\"ר דור דור ודורשיו, לא ברוח הקודש הראה אותו כן, אלא שראה בעינו ממש בההוא דיוקנא דזמינין למיקם בי' בעלמא, וא\"ת מפני מה לא ראו ישראל כל דורות העתידים כמו שראה אדה\"ר, ותירץ בזוה\"ק דכד אתייהיבת אורייתא לישראל, הוו תאבין לאסתכלא ולמחמי ביקרא דמריהון, בגין כך חמו יקרא דקב\"ה בלחודוי ולא מאחרא עיי\"ש, עכ\"פ נלמד מדברי הזוה\"ק שכל הנשמות שעתידין להיות, עמדו שם עם הגופים אלא שלא נראו, ומשרע\"ה דיבר אל כל הנשמות שבכל הדורות, ויש נשמה שעתידה להתגלגל כ\"פ בעולם, וכולן היו שם באותו מעמד, ומעתה אילו לא אמר הכתוב אלא כי את אשר ישנו פה ואשר איננו פה עמנו היום, לא הוה שמעינן אלא האבות שעמדו שם, ובניהם שעתידין להוליד, שהיו שם בכח האב, ונרמזו בכתוב עמנו היום (כ\"כ השביבי נגה בפי' דברי הזוה\"ק) ע\"כ כפל הכתוב לומר כל איש ישראל, להורות שכל הנשמות העתידים עמדו שם בגופיהן, וכולם קבלו עליהם הברית והשבועה ואל כולם דיבר משרע\"ה."},{"passage_id":"devurim_43b51340_p23","passage_content":"ומעתה א\"ש כפל הכתוב את אשר ישבנו בארץ מצרים ואת אשר עברנו בקרב הגוים אשר עברתם, כי מאחר שדיבר משרע\"ה אל כל דורות ישראל, שהיו ושעתידין להיות, ע\"כ שינה לשונו לכל דור כפי בחינתו, ולדור יוצאי מצרים אמר את ישבנו בארץ מצרים, והזהירם שיתרחקו מטומאת מצרים ומדרכיהם הרעים, וכמעשה ארץ מצרים לא יעשו, ולדור באי הארץ אמר אשר עברתם בלשון נוכח, ואצלם הי' רק העברה בעלמא, כמ\"ש הראב\"ע ז\"ל שקאי על מה שעברו בגבול אדום ומואב ועמון וכו', אבל לא הלכו בקרב הגוים, והזהיר גם אותם שלא ידבק בהם מטומאת הגוים ההם, כמאה\"כ ותראו את שקוציהם ואת גלליהם וגו' ויתרחקו מדרכיהם שראו אצלם בעברם דרך ארצם."},{"passage_id":"devurim_43b51340_p24","passage_content":"ומה שאמר בקרב הגוים וגו', בחינה זו אמר אל דורות הבאים, שיהיו בגלות בארצות שונות, ובקרב הגוים ממש, וע\"ד שפירשתי מאה\"כ הנסה אלהים לבוא לקחת לו גוי מקרב גוי, שנכנס בפנימיותם ובקרבם טומאת וקליפת מצרים, וע\"כ הוציא השי\"ת מקרבם את מצרים, ולא די שהוציא את ישראל ממצרים, אלא עוד הי' צורך להוציא את מצרים מקרבם, ולזה צריך סייעתא דשמיא לשרש אחרי' ולעקרו מפנימיותם, וכמו\"כ בשאר ארצות גלותם, הקליפה והשר של אותה האומה רוצה לשלוט בגופם וליכנס בפנימיותם, וצריך סייעתא דשמיא להנצל מזה, לפרוש ממנה, וע\"כ אמר בקרב הגוים, וזו אזהרה כללית עד סוף כל הדורות, בכל ארצות גלותם שיהיו בקרב הגוים, שיתרחקו מטומאת הגוים ההם, ולשרש מקרבם הקליפה של האומה ההוא, וללקט ולתקן הניה\"ק משם, וזהו הכנה לביאת המשיח כמ\"ש האריז\"ל, וע\"כ הזהיר משה רבינו את דורות העתידים באזהרה מיוחדת, כי אצלם צריך זהירות יתירה, ועבודה גדולה וסייעתא דשמיא להתרחק מטומאת הגוים, לפי שעברו בקרב הגוים, והגוים האלה בקרבם, וצריך לשרש אחרי' ולהוציאם."},{"passage_id":"devurim_43b51340_p25","passage_content":"ולדרכנו נבאר משה\"כ עץ ואבן כסף וזהב אשר עמהם, והדקדוקים נפרטו לעיל (קושיא י'-י\"א), ויובן עפ\"י מה שפירשתי מ\"ש חז\"ל במד\"ר (פ' נשא) צו את בני ישראל וגו', כל מקום שנאמר צו, הצווי מיד בשעת מעשה ונוהג לדורות, ר\"ש בן יוחאי אין צווי בכל מקום אלא במקום שיש חסרון כיס וכו', ובזוה\"ק בראשית (דף כ\"ז ע\"ב) אין צו אלא ע\"ז, וכן אמרו במס' סנהדרין (נ\"ו ע\"ב) ויצו זו ע\"ז, שנא' הואיל הלך אחר צו (הושע ה'), ויש להבין דלפי דרשתם דקרא מיירי באזהרת ע\"ז, איך נוהג צווי זו מיד ולדורות, הא אנשי כנה\"ג קטלוהו ליצרא דע\"ז, ואינו מתגרה עוד בישראל כמבואר במס' סנהדרין (ס\"ד ע\"א) ולמה צריך הכתוב לזרז עליה מיד ולדורות."},{"passage_id":"devurim_43b51340_p26","passage_content":"ופרשתי עפי\"מ דאיתא בספה\"ק דבדורות הראשונים הי' התגברות התאוה על ע\"ז, כי יצרא דע\"ז היתה תקיפא בימיהם כמבואר בגמ' בכ\"מ, ועכשיו נתבטלה התאוה ההוא, ואין יצה\"ר מתגרה עלי', אבל נשאר במקומה תאות הממון עכ\"ד, והנה תאוה זו כוחה רב, שגורר לדרכי ע\"ז ודרכי מינות, ע\"י שנעשה משוחד לבצע כסף, הולך אחרי' כשור לטבח יובל, ונתפס לדרכי מינות ודרכי ע\"ז, וע\"כ אר\"ש ביותר צריך הכ' לזרז במקום שיש חסרון כיס, כי ע\"י חסרון כיס יגרר לע\"ז, ולפי\"ז כל המאמרים בדברי רז\"ל עולים בקנה א', והא' משלים לחבירו, במ\"ש אין צו אלא לשון זירוז, וכל מקום שנא' צו מיד ולדורות, ודברי רשב\"י שאמר אין צו אלא במקום שיש בו חסרון כיס, ודברי הזוה\"ק אין צו אלא ע\"ז, ולפי דרכנו במקום שיש חסרון כיס, צריך לזרז מיד ולדורות על ע\"ז, כי תאות הממון גורר ח\"ו גם למינות וע\"ז."},{"passage_id":"devurim_43b51340_p27","passage_content":"והנה ע\"ז של חמדת כסף וזהב קשה יותר מע\"ז של עץ ואבן, דע\"ז שבגלוי אפשר להתחזק ולהשמר ממנו, אבל בע\"ז בדרך זה, כוונתם נסתרה, ומחופה במשכיות זהב וכסף, ומי שנגרר אחריהם אין בו ידיעה בתחילה, כי סופו להכשל בע\"ז, וע\"כ צריך זהירות יתירה, ושמירה גדולה לבל יכשל בהם, כיון שכל מעשיהם בסתר, וכמו שפרשתי בפ' ראה עה\"פ כי יסיתך אחיך בסתר, ופרש\"י דבר הכתוב בהווה, ולכאורה תיבת בסתר מיותר, ולמאי נפק\"מ אם הוא בסתר אם לא, ואין טעם זה מספיק, שבשביל שדבר הכתוב בהווה, יאמר הכתוב תיבה מיותרת, ופרשתי שכוונת הכתוב להזהיר, שדרך המסיתים לדבר בסתרן של דברים, ואינו מגלה כל לבו שכוונתו לע\"ז, וע\"כ צריך להשמר ממנו מאוד מאוד (עיין בחי' ראה)."},{"passage_id":"devurim_43b51340_p28","passage_content":"ומעתה א\"ש מאמר הכתוב עץ ואבן כסף וזהב אשר עמהם, כי משרע\"ה הזהיר את כל דורות ישראל, כל א' לפי בחינתו, ולדורות הראשונים אמר עץ ואבן זו ע\"ז שבגלוי, והזהיר אותם על ע\"ז ממש, כי היתה יצרא דע\"ז זו תקיפא בימיהם, כמשה\"כ אומרים לעץ אבי אתה ולאבן את ילדתני (ירמי' ב'), ולדורות העתידים אחר שבטלה יצרא דע\"ז, הזהיר אותם על ע\"ז של כסף וזהב, וע\"כ אמר הכתוב אשר עמהם ופרש\"י שדרכם להטמינם, ולכאורה מה נפק\"מ אם דרכם להטמינם או לא, אבל לדרכנו הזהיר הכתוב להשמר ממנו מאוד, לפי שדרכם להטמינם, ואין כוונתם גלוי', וע\"כ צריך שמירה יתירה."},{"passage_id":"devurim_43b51340_p29","passage_content":"וא\"ש מה שכפל הכתוב לומר פן יש בכם ב' פעמים, ופן יש הראשון אמר כלפי הדור ההוא שהי' בימיו, ולדורות הראשונים בזמן שהי' יצרא דע\"ז תקיף, וע\"כ אמר אשר לבבו פונה היום, ופרש\"י מלקבל עליו הברית וכוונתו ללכת לעבוד את אלהי הגוים ההם, שזו ע\"ז בגלוי, וכלפי דורות האחרונים אמר פן יש בכם שורש פורה וגו', שהשורש וארס ע\"ז טמונה בקרבם, ואינה בגלוי אלא בסתרי לבבם, ע\"כ הזהירם לשרש אחרי' ולהשמר ממנו מאוד, ומעתה אין להקשות על שכפל הכתוב פן יש בכם ב' פעמים, כמו שמצינו שדרשו חז\"ל נתן תתן, שמורה הכפל ללמד אפי' מאה פעמים, וכמו\"כ כאן שדיבר משה רבינו לאלפים דורות, ולכל א' כפי בחינתו, אין מן התימה שבאו הכתובים בכפל לשון."},{"passage_id":"devurim_43b51340_p30","passage_content":"ועתה נבאר משה\"כ למען ספות הרוה את הצמאה עפ\"י דברי רש\"י והתרגום, דרוה היינו שוגג וצמאה הוא מזיד, ולכאורה וכי דינא הכי לצרף את השוגג אל המזיד, אבל יובן עפ\"י מה שפירשנו לעיל, הפסוק פוקד עון אבות על בנים וגו' בב' דרכים, ועפ\"י פשוטו שיעניש המקום בנים ובני בנים ושלשים ורבעים בעון אבותם, כשאוחזין מעשה אבותיהם בידיהם, ועפ\"י דרך השני יענש האדם אפי' בכמה גלגולים, על מה שחטא בגלגול הקודם, אם יאחז רשע דרכו הרע, והיינו אוחזין מעשה אבותיהם בידיהם בבחי' הגלגול (עיין בדברינו לעיל). והנה אלו החטאים שעשו בגלגולים הקודמים, אינם אלא פגמי הנפש, והגוף הזה לא חטא בחטא זה, אלא גוף אחר ונשמה זו, וכמו כן כשיענש עבור חטא אביו או אבי אביו עד ד' דורות אינו אלא פגמי הנפש, והוא בבחי' שוגג אצל הגוף הזה, וע\"כ קראו הכתוב רוה, כי הוא לא תאב אל החטא הזה ונעשה בלא דעת ורצונו, וא\"א לענוש על חטא זה כי שוגג הוא אצלו, אבל כשאוחזין מעשה אבותיהם בידיהם ומוסיף זדונות בגלגול זה, או הבן אוחז בדרכי אביו וחוטא בזדון, זה יקרא צמאה, שעושה בזדון לבו ובתאות יצרו, ואז פוקד המקום ב\"ה גם על עונות הראשונים ויצרפם לאלו, ול\"ק קושיא הנ\"ל, כי הוא מפורש בקרא פוקד עון אבות על בנים עפ\"י דרשת חז\"ל כשאוחזים מעשה אבותיהם."},{"passage_id":"devurim_43b51340_p31","passage_content":"ועתה נבוא לבאר מאה\"כ והטיבך והרבך מאבתיך (עיין לעיל קושיא ט\"ו), הנה בירושלמי (פ\"א דקדושין ה\"ח) הקשו מהו והטיבך והרבך מאבתיך, והרבה מימרות נאמרו בזה, ואמרו שם אבותיך לא הי' עליהם עול מלכיות, ואתם אעפ\"י שיש עליכם עול מלכות, וכלפי דור באי הארץ אמר הכתוב מאבותיך, כמ\"ש הקרבן העדה, שמשכבשו את הארץ לא הי' עליהם עול מלכות עוד עכ\"ד, ובאמת מעולם לא הי' עליהם עול מלכות, שנולדו במדבר וכל ימיהם היו תחת הנהגת משרע\"ה, ויראה לגבי משה מלתא זוטרתא הוא, ואפ\"ל דבזה ניחם משה רבינו את ישראל, שכאשר ישובו ישראל לעתיד מארצות גלותם, והביאך ד' אלקיך אל הארץ אשר ירשו אבתיך, וגם דור המדבר יעמדו בתחי' ויחזרו עמנו לירש את הארץ, ונהיו בושים נגד מעשיהם וצדקותיהם, ע\"כ ניחם אותנו משה רבינו, דיש עלינו לימוד זכות גדול, דעול המלכיות שגברה עלינו בגשמיות וברוחניות, ותוקף הסט\"א וכוחות הטומאה והנסיונות העצומות שעמדו עלינו בכל ימי גלותינו, מה שלא הי' לדור באי הארץ, ולולי ד' שהי' בעזרינו לא הי' אפשר לעמוד בנסיונות אלו, ע\"כ הגם שלא הי' עבודתינו בערך עבודתם וצדקתם של דור המדבר דור דיעה, אבל בצירוף הנסיונות והיסורין והצרות שסבלנו, גם מיעוט עבודתינו להרבה יחשב כי לפום צערא אגרא."},{"passage_id":"devurim_43b51340_p32","passage_content":"וזהו כוונת הכתוב לפי דברי הירושלמי, והטיבך והרבך מאבותיך, שע\"י שהי' עלינו עול מלכיות מה שלא הי' באבותינו, יהי' נחשב גם מעוט עבודתינו בבחי' והטיבך והרבך נגד אבותינו, -ומסיים בירושלמי שם אבותיך אע\"פ שנגאלו חזרו ונשתעבדו, אבל אתם משאתם נגאלין אין אתם משתעבדין עוד, ובזה פירשו מ\"ש והטיבך מאבותיך, שיהא הגאולה בבחי' גדולה וטובה מגאולת אבותינו, וכ\"ז ע\"י עול המלכיות שעלינו, ואריכות הגלות שסבלנו יותר מהם, וע\"כ יהי' גאולתינו גאולת עולם ונצחיות, נמצא כי הגלות צורך הגאולה והכנתה, וא\"ש מ\"ש רש\"י בשם המדרש אגדה, שהקללות והיסורים מקיימין אתכם ומציבין אתכם לפניו, דע\"י הגלות והיסורין ועול המלכיות, שאנו סובלין יהי' גאולתינו גאולת עולם, ויהי' לנו קיום נצחי כמ\"ש בירושלמי הנ\"ל."},{"passage_id":"devurim_43b51340_p33","passage_content":"ובזה יתבאר דברי רש\"י ז\"ל, מ\"ש הרבה הכעסתם למקום ולא עשה אתכם כלי' וכו', וקושית הכלי יקר (הובא לעיל קושיא ב') דהנה כבר הבאנו לעיל מדברי רז\"ל שדיבר משרע\"ה אל כל הנשמות עד סוף כל הדורות, וגם אל הדור השפל אשר בימינו דיבר, שיכעיסו למקום ב\"ה הרבה, ויסבלו עול מלכיות וצרות ויסורין ובעוה\"ר נתקיימה בנו כל התוכחה, אבל ניחמם משה רבינו שלא יעשה הקב\"ה בהם כלי' ח\"ו, אלא הקללות והיסורין מציבין ומקיימין אתכם והוא צורך הגאולה, ועי\"ז יהי' עליהם לימוד זכות והטיבך והרבך מאבותיך כמבואר לעיל."},{"passage_id":"devurim_43b51340_p34","passage_content":"ומעתה מתורץ מה שהקדים משה רבינו ראשים לזקנים, כי מה שאמר אתם נצבים היום, הכוונה על דורות שבעיקבתא דמשיחא, דזה הבשחה שלא יעשה בנו כלי' ח\"ו, אלא הקללות והיסורין מקיימין ומציבין אותנו לפניו ית' והוא צורך הגאולה, והבטחה שבפסוק זה לא שייך לגבי הדור ההוא שהיו בימיו, כי דור זכאי היו באי הארץ, ומעולם לא הי' עליהם עול מלכיות ושעבוד כמ\"ש לעיל, ועכ\"ח הבטחה זו אמר משרע\"ה על הדורות שיהיו בעיקבתא דמשיחא, וע\"כ לדור הזה שנמסרין ביד המלכיות, צריך להקדים ראשים לזקנים כדברי הירושלמי הוריות הנ\"ל, דע\"י שהראשים משתדלין לפייס את המלכות, יש כח ביד הזקנים ללמוד תורה."},{"passage_id":"devurim_43b51340_p35","passage_content":"ועתה נחזור לתחלת הפרשה במה שהתחלנו אתם נצבים היום כלכם וגו', ודקדקו המפרשים מאי היום דנקט, ורש\"י בשם מ\"א פירש, כהיום הזה שהוא קיים, והוא מאפיל ומאיר, כך האיר לכם וכך עתיד להאיר לכם, והקללות והיסורין מקיימין אתכם ומצובין אתכם לפניו ע\"כ, ונקדים מתני' דסנהדרין (ק\"י ע\"ב) עשרת השבטים אינן עתידין לחזור, שנא' וישליכם אל ארץ אחרת כיום הזה, מה היום הולך ואינו חוזר, אף הם הולכים ואינן חוזרים דברי ר\"ע, ר\"א אומר כיום הזה, מה יום מאפיל ומאיר, אף י' השבטים שאפילה להם, כך עתידה להאיר להם, ע\"כ במשנה שם."},{"passage_id":"devurim_43b51340_p36","passage_content":"ולכאורה יקשה לר\"ע, איך ידרוש כאן אתם נצבים היום, ועכ\"ח יש לדרשו לשבח ולטובה, כי משה רבינו ניחמם כאן, באמרו אתם נצבים היום, שיהי' להם תקומה כפרש\"י, וגם מפורש בכתוב להלן למען הקים אותך היום לו לעם, ואם ידרשנו לטובה כאן בהכרח, א\"כ מדוע לא דרשו לטובה גם אצל עשרת השבטים."},{"passage_id":"devurim_43b51340_p37","passage_content":"אמנם יובן עפימ\"ש ק\"ז הישמח משה זלל\"ה בפלוגתא דר\"ע ור\"א הנ\"ל, דלא פליגי ואלו ואלו דברי אלקים חיים, דבאמת מצד עצמו, היום אינו חוזר כי תמול לעד לא ישוב, אבל ע\"י תשובה חוזרים הימים ונתקנו, כמ\"ש ביע\"ד ח\"א (דף א' ע\"ב) כי ז' ימים שבין ר\"ה ליוהכ\"פ, הם כנגד ז' ימי השבוע, ובכל יום יעשה תשובה על מה שחטא ביום הזה, דרך משל ביום ראשון של י' ימי תשובה, יעשה תשובה על כל מה שחטא כל ימיו בראשון לשבת, וכן בשני בשבת, וכן כל ז' ימים, ובזה מתקן כל ימיו, וכתב ק\"ז זלל\"ה, שעל כן נקראים ימי תשובה, שמשיבין הימים ומתקנים אותו, וכן שבת תשובה, אף שנקרא כן ע\"ש הפטורת שובה ישראל, מ\"מ עוד טעם יש בו, כי על ידו יכולין להשיב כל שבתות ד', וכל זמן שאין משיבין הימים אין נגאלים, והיינו מה היום אינו חוזר אף הם אינם חוזרין, היינו כשלא יעשו תשובה ולא יחזרו הימים, אכן כשיחזרו בתשובה ויהי' היום בבחי' מאפיל ומאיר, ויתוקנו הימים ויחזרו, אז גם עשרת השבטים יחזרו, ולפ\"ז אין פלוגתא בין ר\"ע ור\"א, ואו\"א דא\"ח עכדה\"ק."},{"passage_id":"devurim_43b51340_p38","passage_content":"ונקדים עוד מה שהקשה המהרש\"א ז\"ל בסנהדרין (ל\"ז נרא) עמ\"ש שם הנהו בריוני דהוה בשיבבותי' דר זירא, דהוה מקרב להו, כי היכי דניהדרו בתיובתא, כי נח נפשי' דר' זירא, אמרי עד האידנא הוה ר' זירא בעי עלן רחמי, השתא מאן בעי עלן רחמי, הרהרו בלבייהו ועבדו תיובתא, והקשה המהרש\"א ז\"ל מזה יש להשיב, במה שאמר משה הן בעודנו עמכם ממרים הייתם עם ד' ואף כי אחרי מותי, וזה א' מעשרה ק\"ו שבתורה, הא איכא למפרך, דיאמרו עד האידנא, הוה משה בעי רחמי עלן, השתא מאן בעי רחמי עלן, ויהרהרו בתשובה כעובדא דר זירא הנ\"ל, יעיי\"ש מה שתירץ."},{"passage_id":"devurim_43b51340_p39","passage_content":"ולדרכנו הנ\"ל שכל הנשמות והגלגולים שבכל הדורות עמדו שם בגופם ודיבר משה אל כולם, וראה בחוש מדרגתם העתיד, שלאחר הסתלקותו לא יהיו עוד בבחי' זו, ושבחייו היו מושפעים יותר מכח צדקתו, ע\"כ ראה שהק\"ו אמת, ואף שלפי הסברא יש לו פרכא כקושית המהרש\"א, אבל משרע\"ה ראה בחוש שהק\"ו אמת, וכמ\"ש ק\"ז הישמח משה זלל\"ה דחכם עדיף מנביא להשיג אפי' מילתא דתליא בבחירה, וע\"כ אמר כי אנכי ידעתי וכו'."},{"passage_id":"devurim_43b51340_p40","passage_content":"ומעתה ע\"ז ירמוז הכתוב אתם נצבים היום, כי משרע\"ה דיבר זאת אל כל הדורות, ואף לדורינו השפל בעיקבתא דמשיחא, וראה בחוש מצבם ומדריגתם, וע\"כ זירזם על התשובה וניחמם, כפרש\"י הרבה הכעסתם למקום ולא עשה אתכם כלי', וע\"י תשובה אפשר לתקן הכל, להחזיר הימים. ולחדש ימינו כקדם, ועי\"ז יהי' לכם תקומה וגאולת עולם. וע\"כ אמר אתם נצבים היום שיהי' לכם תקומה כמו שדרשו בתנחומא ע\"ז, ובית צדיקים יעמוד, שיהי' לכם עמידה עולמית, וכ\"ז יהי' ע\"י היום, שתחזרו הימים למקומם, וע\"כ פרש\"י ז\"ל וכן הוא בתנחומא, דמלת היום לדרוש בא, מה היום קיים והוא מאפיל ומאיר, אף אתם כשאפלה לכם עתיד להאיר לכם אור עולם."},{"passage_id":"devurim_43b51340_p41","passage_content":"ועתה נבאר דברי התנחומא הנ\"ל (בקושיא ד'), זש\"ה הפוך רשעים ואינם ובית צדיקים יעמוד, עפ\"י דברי הגמ' (תענית כ\"ה נרא) ר' אליעזר בן פדת דחיקא לי' מילתא טובא וכו', חלש לבי' ונים וכו', כי אתער א\"ל לרבנן וכו', דא\"ל הקב\"ה ניחא לך דאפכי' לעלמא מרישא, אפשר דמתילדת בשעתא דמזוני עכ\"ד הגמ', וכתב המהרש\"א ז\"ל, בספרים שלפניו הי' הגירסא דאחריב לעלמא ואינו נכון עיי\"ש, ויותר נכון הגירסא דאפכי' לעלמא, ופירושו עולמו של ר\"א, ולבראו שנית, ואולי שכוונו כאן על גלגול הנשמות עכדה\"ק."},{"passage_id":"devurim_43b51340_p42","passage_content":"עכ\"פ מבואר דגלגול נשמות נקרא בשם הפיכה, ויתבארו דברי המדרש הנ\"ל שראה משרע\"ה לפניו, כל הדורות וכל גלגולי נשמות עד סוף כל הדורות, וראה הבירור שעתיד להיות לפני ביאת משיח, שיתבררו הרשעים, והצדיקים ישארו חיים וקיימים, ע\"כ דורש המדרש זש\"ה הפוך רשעים ואינם, שהרשעים אף שיהיו מגולגלים שזהו בחי' הפיכה כנ\"ל, אם לא יתקנו מעשיהם, סוף שיאבדו מן העולם, כמ\"ש בכתבי האריז\"ל פעמים ושלש עם גבר, שהקב\"ה מנסם אולי ישיבו עיי\"ש, אבל בית צדיקים יעמוד, יהי' לכם תקומה, ואף שלפעמים יבואו בגלגול לטובת הדור, או אפי' מגולגלים לתקן חטאם, אבל ע\"י תשובה מתקנים הכל, ויחזרו הימים כמקדם, ויהי' להם קיום נצחי, כמאה\"כ אתם נצבים היום, שזירזם על התשובה כנ\"ל, ועי\"ז יהי' ובית צדיקים יעמוד."},{"passage_id":"devurim_43b51340_p43","passage_content":"והנה קורין בפ' נצבים בשבת שלפני ר\"ה, עפ\"י מ\"ש התוס' במס' מגילה (ל\"א נרב) הטעם שלא להסמיך הקללות לר\"ה, ע\"כ מפסיקין בפרשה שלא תהא מדברת בקללות עכ\"ל התוס', ולדרכנו יש בו עוד דברי תנחומין, כי ע\"י התשובה יהי' לנו תקומה, והקללות והיסורין מציבין אתכם ומקיימין אתכם לפניו כהיום הזה שהוא מאפיל ומאיר כך עתיד להאיר לכם, ופרשה זו יש בה התעוררות גדול לתשובה, כי כולנו היינו שם באותו מעמד ונכנסנו בברית, ומשרע\"ה הזהיר כולנו, כמ\"ש וידבר את הדברים האלה אל כל ישראל, וע\"כ דבר בעתו מה טוב, לקרות פרשה זו לפני ר\"ה, שיהא הקריאה מעורר בצירוף הזמן, שהוא מסוגל לזה, ובצירוף שניהם נזכה להתעורר לשוב בתשובה שלמה לפניו ית', ולתקן כל מעשינו, ויקויים בנו הבטחת משרע\"ה אתם נצבים היום, שיהי' לנו תקומה וקיום נצחי, והקללות יתהפכו לטובה ולברכה, ותכלה שנה וקללותי', ותחל שנה וברכותי' אמן."}]},{"dvar_torah_id":"devurim_17d04244","title":"תפילה וזמן: חובת ישראל","summary":"במדרש רבה נדונה הלכת תפילת השחר עד חצות, והקשר לפ' נצבים. הכתוב מדבר על השפעת השמיעה על הלב, וההבנה כי עונש השוגג כעונש המזיד. משה רבינו מדגיש את חובת כל אחד להתפלל, ולא לסמוך על אחרים, כי הנסתרות לד' אלקינו.","contents":[{"passage_id":"devurim_17d04244_p1","passage_content":"באופן אחר אפ\"ל הדקדוקים הנ\"ל, בהעיר עוד במ\"ד במדרש רבה (ריש פרשה זו) הלכה אדם מישראל שלא התפלל תפלת השחר או תפלת המוסף וכו', כיצד הוא צריך לעשות, כך שנו חכמים תפלת השחר עד חצות, תפלת המנחה עד הערב וכו', והולך ומונה זמני התפלות כולן עיי\"ש, וצ\"ב קישור הלכה זו לפ' נצבים."},{"passage_id":"devurim_17d04244_p2","passage_content":"ב) להלן בפרשה והי' בשמעו את דברי האלה הזאת והתברך בלבבו לאמר שלו' יהי' לי, כי בשרירות לבי אלך, למען ספות הרוה את הצמאה, יל\"ד דמשמעות הכתוב מורה, דע\"י שמיעתו דברי האלה יתברך בלבבו וכו', ואדרבה השמיעה מחייבתו לחדול, ולירא מפני עונש האלה."},{"passage_id":"devurim_17d04244_p3","passage_content":"ג) מ\"ש הכתוב כי בשרירות לבי אלך מושלל הבנה, שסתם הכתוב ולא ביאר מהו, דהרי כלל הכתוב הכל, כמ\"ש הרא\"ם ז\"ל, דפן יש בכם הראשון מדבר בע\"ז, והשני בקבלת הברית, ומה הוסיף עוד במאמר כי בשרירות לבי אלך, דנראה לכאורה כבחי' חדשה, ולא פי' מהו."},{"passage_id":"devurim_17d04244_p4","passage_content":"ד) עוד יל\"ד דוהתברך בלבבו ב' לבבות משמע, בשרירות לבי אלך, לב אחד."},{"passage_id":"devurim_17d04244_p5","passage_content":"ה) למען ספות הרוה את הצמאה, פרש\"י ז\"ל עפ\"י התרגום, שאוסיף לו פורעניות על מה שעשה בשוגג וכו', ואצרפם אל המזיד ואפרע ממנו הכל וכו', וצ\"ב וכי כך הוא המידה, לענוש על השוגג כמזיד, וכבר ביארנו בזה, ועוד לאלקי מילין."},{"passage_id":"devurim_17d04244_p6","passage_content":"ו) וילך משה וידבר את כל הדברים האלה אל כל ישראל, כל המפרשים נדחקו בהליכה זו, כי לא פורש להיכן הלך, ויונתן תרגם למשכן בית אולפנא, וצ\"ב מה צורך להודיע זאת, ובכל פעם שדיבר אל ישראל משם דיבר, ויספיק הכתוב לומר, וידבר את כל הדברים האלה וגו', וילך למ\"ל."},{"passage_id":"devurim_17d04244_p7","passage_content":"ז) בן מאה ועשרים שנה אנכי היום, לא אוכל עוד לצאת ולבוא וגו', במס' סוטה (י\"ג ע\"ב) מאי לצאת ולבוא, אילימא לצאת ולבוא ממש, והכתיב לא כהתה עינו ולא נס לחה וגו', אלא לצאת ולבוא בדברי תורה, מלמד שנסתמו ממנו מעיינות החכמה, ויש להבין איך אפשר לומר כן, והלא ידוע דכל הצדיקים, גדלה מעלתם בשעת פטירתם, ומשיגים יותר, ממה שהשיגו כל ימי חייהם, ובספה\"ק"},{"passage_id":"devurim_17d04244_p8","passage_content":"אגרא דכלה פ' זו האריך בזה עיי\"ש (הו\"ד להלן) וא\"א להאמר בחי' זו, לגבי משרע\"ה כפשוטן של דברים, והרמב\"ן ז\"ל כתב שהי' זה בדרך נס, שלא ידאגו לתת גדולה ליהושע בפניו, עכ\"ד, וגם זה צ\"ב דצורך הנס למה, ולא יתכן לפרש הדברים כפשוטן."},{"passage_id":"devurim_17d04244_p9","passage_content":"ח) אאמו\"ר זלל\"ה בקדושת יו\"ט הביא מדרש, לא אוכל עוד לצאת ולבוא, הה\"ד ולא קם נביא עוד בישראל כמשה ע\"כ, וצ\"ב."},{"passage_id":"devurim_17d04244_p10","passage_content":"ט) להלן בפ' הנך שכב עם אבותיך וקם העם הזה וזנה אחרי אלהי נכר הארץ, בגמ' סנהדרין (דף צ' ע\"א) שאלו רומיים את ר' יהושע בן חנניא, מנין שהקב\"ה מחי' מתים, ויודע מה שעתיד להיות, אמר להו תרווייהו מן המקרא הזה, שנא' ויאמר ד' אל משה הנך שוכב עם אבותיך וקם העם הזה וזנה, (פרש\"י הנך שוכב עם אבותיך וקם, הרי תחיית המתים, העם הזה וזנה, הרי מה שעתיד להיות עכ\"ל רש\"י), ודלמא וקם העם הזה וזנה, אמר להו נקוט מיהא פלגא בידייכו, דיודע מה שעתיד להיות, עכ\"ד הגמ', וצ\"ב איך נתפשר בניקל כ\"כ על החצי, ושניהם מעיקרי האמונה, גם מ\"ש נקוט מיהא פלגא, ואין זה החצי, והם ב' ענינים נפרדים, והול\"ל נקוט מיהא חדא, וכן הקשה במהרש\"א."},{"passage_id":"devurim_17d04244_p11","passage_content":"י) עוד הקשו המפרשים, דהאיך אפ\"ל דמאמר וקם קאי על שלפניו, הנך שוכב עם אבותיך וקם, דא\"כ העם הזה וזנה וגו', אין לו ביאור, גם הא דיודע הקב\"ה מה שעתיד להיות, לא הי\"ל ללמוד מפסוק זה דוקא, וכמה פעמים נזכר בתוה\"ק, שהזהירם הקב\"ה שעתידים לחטוא."},{"passage_id":"devurim_17d04244_p12","passage_content":"יא) להלן בפ' הן בעודני חי עמכם היום, ממרים הייתם עם ד', ואף כי אחרי מותי, המהרש\"א ז\"ל בסנהדרין (ל\"ז נרא) הקשה, ממ\"ש בגמ' שם הנהו בריוני דהוה בשיבבותי' דר' זירא וכו', כי נח נפשי' דר' זירא, אמרו עד האידנא הוי ר' זירא בעי עלן רחמי, השתא מאן בעי עלן רחמי, הרהרו בלבייהו ועבדו תשובה, והקשה המהרש\"א ז\"ל, דא\"כ נסתר הק\"ו, הן בעודני חי עמכם וגו' ואף כי אחרי מותי, דאפשר שיהרהרו בתשובה, כעובדא דר' זירא."},{"passage_id":"devurim_17d04244_p13","passage_content":"יב) גם צ\"ב מ\"ש ממרים הייתם עם ד', והול\"ל נגד ד', מהו עם ד'."},{"passage_id":"devurim_17d04244_p14","passage_content":"ולבאר כל הענין נתחיל בביאור דברי המדרש (בקושיא א') הלכה אדם מישראל וכו', כך שנו חכמים תפלת השחר עד חצות וכו', ומני ואזיל זמני התפלות כולן, וצ\"ב קישור הלכה זו לכאן, והנה בפ' תפלת השחר (ברכות כ\"ו ע\"ב) תניא מפני מה אמרו תפלת השחר עד חצות, שהרי תמיד של שחר קרב והולך עד הערב וכו', עיי\"ש בגמ' שזמני כל התפלות, הם מכוונים כנגד תמידין וקרבנות, ואתי' כמ\"ד תפלות כנגד תמידין תקנום, ואף למ\"ד תפלות אבות תקנום, אסמכינהו רבנן אקרבנות עכ\"ד הגמ', והרמב\"ם ז\"ל סתם כדברי שניהם, דתפלות אבות תקנום, וכנגד תמידין תקנום, ואולי שהאבות תקנוהו כנגד תמידין, ועכ\"פ זמני התפלות הם מכוונים כנגד תמידין כמבואר בגמ' בפירוש."},{"passage_id":"devurim_17d04244_p15","passage_content":"ולכאורה כמו שהשוו רז\"ל זמני התפלות לזמני התמידין, להיות בחינתן שוה, וכנגד תמידים תקנום, מדוע לא השוו אותם לגמרי, וכמו בתמידין וקרבנות הצבור, רק כהן א' הוא המקריב, והוא שליחא דרחמנא ושליחא דידן, להוציא את כל ישראל, ואה\"נ שכל ישראל הי\"ל חלק בהם, שנקנים משקלי הצבור, אבל סוכ\"ס צוותה התוה\"ק, שכהן א' בלבד יקריב בעד כל ישראל, ומדוע לא תקנו חז\"ל ג\"כ בתפלה, להשוותו לתמידים לגמרי, וכמו שחייבו בזמני התפלות לעשותם דוגמת התמידים ממש, ובאמת בתפלה מחויב כל א' להתפלל לעצמו, ואף היחיד, והש\"ץ אינו רק להוציא את שאינו בקי, אבל לכתחילה מחויב כל א' לעצמו, ואין א' מוציא את כולם, וצריך הסבר."},{"passage_id":"devurim_17d04244_p16","passage_content":"ונראה לבאר הענין, עפימ\"ש הח\"ס זלל\"ה, עה\"פ אתם נצבים היום וגו' ראשיכם זקניכם וגו' כל איש ישראל, ולא סגי בראשיכם וזקנים וכו', אך הטעם פן יש בכם שורש פורה וכו', ואפשר גדול השבט הוא השורש הפורה, והרי אלו הי' קרח ודתן ואבירם וזמרי בן סלוא קיימים, הלא היו נשיאים קרואי העדה, והמה שנואים למקום, וחוטבי עצים טובים מהם, הנסתרות לד' אלקינו וכו', ע\"כ אתם כולכם לפני ד' אלקיכם דייקא, כי לפניו גלוי מי הגדול ומי הקטן עכ\"ל הח\"ס זלל\"ה."},{"passage_id":"devurim_17d04244_p17","passage_content":"ובזה יתבאר לעניננו, דבתמידין וקרבנות צבור א\"א בענין אחר, דמצות התורה את הכבש הא' תעשה בבקר ואת הכבש השני תעשה בין הערבים, וא\"א שתיעשה רק ע\"י אחד, ע\"כ בהכרח היו צריכים לסמוך עליו, ואעפ\"כ מצינו שהיו משביעים את הכהן גדול בעבודת יוכ\"פ, שלא ישנה מכל מה שאמרו לו, שמא יש בלבו צד מינות, הרי שהי' מקום לחשדא, ולא הי' בירור גמור שיכולין לסמוך עליו."},{"passage_id":"devurim_17d04244_p18","passage_content":"וכבר פירשתי לתרץ קושית ר\"ע איגר זלל\"ה בשם הפרי חדש דמאי מהני השבועה, הרי לפי שיטת הצדוקים, המצוה כך הוא, שיניח הקטורת מבחוץ, והוי נשבע לבטל את המצוה לשיטתם, ולא חלה השבועה, ופרשתי דהכוונה במ\"ש שמא יש בלבו צד מינות, דלא מיירי במין מוחלט, דלזה בודאי לא יועיל השבועה, רק החשש שמא אמונתו רופפת, ונוטה לצד מינות, וכמ\"ש הרמב\"ם ז\"ל (בה' עבודת יוכ\"פ פ\"א ה\"ז) שמא כהן זה נוטה לצד אפיקורסות, ובכגון דא איכא למיחש, שמא יתגבר עליו השטן בשעת העבודה, להסיתו לעשות כמעשה הצדוקים, ולאיש כזה עדיין מועיל השבועה."},{"passage_id":"devurim_17d04244_p19","passage_content":"עכ\"פ לא היה בירור גמור שיכולין לסמוך עליו, אבל א\"א בענין אחר, אבל בתפלה אף שכנגד תמידין תקנום, בחרו רז\"ל בתקנתם, שכל א' בעצמו מחוייב להתפלל, ולא יהי' אחד נבחר להוציא את כולם, דמי יודע אם הנבחר ראוי לסמוך עליו, והנסתרות לד' אלקינו, ואה\"נ שגם בתמידין הי' ראוי להיות כן, רק היכא דאפשר אפשר, היכא דלא אפשר לא אפשר, ואין דנין אפשר משאי אפשר."},{"passage_id":"devurim_17d04244_p20","passage_content":"ובזה יבואר קישור הלכה זו דזמני התפלות, לפ' זו אתם נצבים היום כלכם וגו' ראשיכם זקניכם וגו' כל איש ישראל, וכמ\"ש הח\"ס זלל\"ה, דלא סגי בראשיכם זקניכם, כי הנסתרות לד' אלקינו, ואולי המה שנואים למקום, וע\"כ הסמיכו במדרש הלכה זו דכ\"א מחוייב להתפלל, ואף דכנגד תמידין תקנום, ואף זמני התפלה תקנו כנגד זמני התמידין כמבואר במדרש, מ\"מ כיון דאינו בירור גמור, אם הנבחר ראוי לכך, ואפשר בענין אחר, כל א' מחוייב לעצמו, ואין א' מוציא את כולם, וא\"ש הקישור."},{"passage_id":"devurim_17d04244_p21","passage_content":"ובחי' זו אפשר לרמוז, גם בדברי המדרש הנ\"ל (בדרוש הקדום) אתם נצבים וגו' זש\"ה הפוך רשעים ואינם ובית צדיקים יעמוד, דהרשעים עושים הפכיות בתוה\"ק, ומהפכים דברי אלקים חיים לדעתם הנכזבת, וכל המינות ואפיקורסות תולים בתוה\"ק, ע\"י ראיות של דופי, וא\"צ להסביר דבר זה, שרואין אותו בחוש בעוה\"ר, וז\"ש הפוך רשעים ואינם, וכמאן דליתנייהו דמי וא\"א לסמוך על תורתם ותפלתם, להיותם שליחי צבור, ורק בית צדיקים יעמוד, והנסתרות לד' אלקינו, ומה\"ט אתם נצבים היום כלכם וגו', ראשיכם זקניכם וגו' כל איש ישראל, כבחי' שכתב הח\"ס זלל\"ה."},{"passage_id":"devurim_17d04244_p22","passage_content":"וז\"פ הכתוב והי' בשמעו את דברי האלה הזאת והתברך בלבבו לאמר שלום יהי' לי (עיין קושיא ב') שאחר שאמר הכתוב אשר לבבו פונה היום וגו' ללכת לעבוד את אלהי הגוים וגו', עכשיו מיירי הכתוב בדרגא יותר גרוע, שגם הע\"ז והמינות יתלה בתוה\"ק, וכמ\"ש בנועם מגדים לפרש מ\"ש רז\"ל לא חרבה ירושלים, אלא על שהעמידו דבריהם על ד\"ת, ר\"ל שגם מעשיהם לא טובים היו תולים בתוה\"ק, כאלו מצות התורה כך הוא, ע\"י פשטים שאינם אמת עייש\"ד."},{"passage_id":"devurim_17d04244_p23","passage_content":"וז\"פ והי' בשמעו את דברי האלה הזאת והתברך בלבבו וגו', שע\"י שמיעתו יתקלקל עוד, ויהי' תוצאת השמיעה, היפך אזהרת התוה\"ק ולילך לעבוד ע\"ז, והאיך יהי' זה, עז\"א כי בשרירות לבי אלך, שיהפך דברי אלקים חיים כפי רצון לבו ותאותו, ולא מיירי כאן בעשיית מעשה הרע שכבר אמור ללכת לעבוד את אלהי הגוים, וכאן יאמר הכתוב שאזהרת התורה עצמה יהפכם אחרי שרירות לבו, ומתחילה רוצה ללמוד כן ברצון לבבו, ואח\"כ אינו רואה עוד פשט זולתו, ואז כבר הוא שוגג, דהרי הוא לתמותו סובר שכן הוא דרך התורה, ואעפ\"כ נענש גם על השוגג, שהרי הוא בעצמו וברצונו הביא עצמו לידי כך."},{"passage_id":"devurim_17d04244_p24","passage_content":"וזהו פי' הכתוב למען ספות הרוה את הצמאה, וכפרש\"י שאוסיף לו פורעניות על מה שעשה בשוגג וכו' ואצרפם אל המזיד, דאם הולכים ר\"ל בזה הדרך, אז לבסוף אינו רואה זולתו, וסובר שכן הוא האמת, ודרך התוה\"ק יתחייב כן, וכבר הוא שוגג, וע\"כ התחיל הכתוב לומר והתברך בלבבו ב' לבבות, שבתחלה עדיין רואה לעצמו ב' דרכים, אבל כשנתרגל בזה הדרך, אינו רואה עוד זולתו ואין לו רק לב א', ולז\"א כי בשרירות \"לבי\" אלך, וע\"כ לא יאבה ד' סלוח לו ויתחייב גם על השוגג כמזיד, שהוא גרם לעצמו, מפני שהלך בדרך זה ברצון לבבו."},{"passage_id":"devurim_17d04244_p25","passage_content":"ובזה יתבאר הכתוב הן בעודני חי עמכם ממרים הייתה עם ד' וגו' (עיין קושיא י\"א) ולדרכנו משרע\"ה הוכיח את ישראל על בחי' זו, שכבר בימיו קלקלו כן, ומחלוקת קרח הי' עד\"ז, שחלקו על משרע\"ה ועל נבואתו מפי הקב\"ה, וכל ראיותיהם הביאו מדברי התורה, ע\"י שסילפו דרך התורה לדעתה ולרצונם, (עיין בחי' פ' קרח הארכנו בזה), ולז\"א ממרים הייתם \"עם ד'\" ולא אמר נגד ד' כקושיתנו הנ\"ל, שעם דברי ד' בעצמם המרו, להפכם נגד רצון הבוי\"ת והפכו, וא\"כ כ\"ש אחרי מותי, כי מי יוכיח לברר טעותם, ומשרע\"ה הי' מקור התורה והנבואה, ואעפ\"כ סילפו דרך התורה בימיו, ומה יהי' אחרי מותו, ויפה כח הק\"ו."},{"passage_id":"devurim_17d04244_p26","passage_content":"ול\"ק עוד קושית המהרש\"א ז\"ל, מהנהו בריוני דהוי בשיבבותי' דר' זירא, דהתם מיירי מתשובה על גופי עבירות במעשה ר\"ל, שעשו הנהו בריוני לתאות לבבם, וע\"י הסתלקות דר' זירא הירך לבבם וחזרו בתשובה, כמבואר בגמ' שם, אבל כאן מיירי מבחי' אחרת, שמעקמים ומסלפים דברי התוה\"ק, ומעמידים כל תועבותם בפסוקי התורה, וא\"כ כ\"ש וק\"ו אחרי מותי, ועכשיו בעוה\"ר בדורות האחרונים, נסתם כל חזון, ואבדה חכמת חכמים ובינת נבונים תסתתר, ורבים נתעים ר\"ל מדרך התוה\"ק, וצריכים לסייעתא דשמיא מרובים, להתחזק בדרך התוה\"ק האמיתי."},{"passage_id":"devurim_17d04244_p27","passage_content":"ובזה יל\"פ מאמר רז\"ל שנסתמו ממנו מעיינות החכמה, ורמב\"ן ז\"ל פי' שהי' בדרך נס, ולכאורה קשה הלא בו ביום כתב י\"ג ספרי תורות, ומסרה לישראל, וכל התורה כולה נשארה בידינו מקבלה זאת, והקב\"ה אומר ומשה כותב, ואיך אפ\"ל שנסתמו ממנו מעיינות החכמה (עיין קושיא ז') אמנם הפי' הוא שמעיינות החכמה נסתמו ממנו, והי' הכל בנבואה מפי ד', שהקב\"ה אומר ומשה כותב, דחכמה ונבואה הם שני השגים נפרדים, וחכמה הוא מה שנמסר לחכמינו ז\"ל, לפלפל בדעת התורה, זה בונה וזה סותר, במ\"ט פנים טהור ומ\"ט פנים טמא, ובי\"ג מדות שהתורה נדרשת בהן, ולכוין אל האמת בסייעתא דשמיא, ולהכריע בספיקי הלכות בדעת תורה ומבחי' זו הי' מעיינות החכמה שהי\"ל למשרע\"ה ונבואה הוא מבחי' אחרת לגמרי, שהכל הוא מהקב\"ה, והקב\"ה אומר ומשה כותב, וזהו ודאי נשאר לו עד לבסוף."},{"passage_id":"devurim_17d04244_p28","passage_content":"והנה כבר פרשתי (עיין בחי' פ' קרח), דלכאורה איך הרהיבו בנפשם לחלוק על משרע\"ה, והרי נבואת משרע\"ה לא הי' מקום להסתפק באמיתתו, כמ\"ש הרמב\"ם ז\"ל (בפ\"ח מה' יסוה\"ת) שכל ישראל עדים על נבואתו שהוא אמת, ובעינינו ראינוה ובאזנינו שמענוה וכו', ואין מקום להרהר ח\"ו (עיי\"ש שהאריך), אמנם מחלקותם הי' ע\"ד זה, דכיון שיש מ\"ט פנים טהור ומ\"ט פנים טמא, וניתן ההכרעה לחכמי הדור, ע\"כ אמרו שמשרע\"ה הכריע כן מדעתו בחכמת התורה, וניתן גם להם הרשות, להכריע בדעת תורה היפך דעתו ר\"ל, ולזה א\"ל משרע\"ה בזאת תדעו, כי ד' שלחני לעשות את כל המעשים האלה כי לא מלבי, ר\"ל שהכל מד' וברוח נבואה, ולא מלבי בהכרעת דעתי ובחכמת התורה, ומעתה אין כאן מקום לחלוק (עיין בחי' פ' קרח באריכות)."},{"passage_id":"devurim_17d04244_p29","passage_content":"ובזה יתפרש לעניננו, דהנה משה רבינו ע\"ה הי' מקור החכמה והתבונה, ונתעצם בעצם התוה\"ק, וכל מה שתלמיד ותיק עתיד לחדש נמסרה למשרע\"ה בסיני, אמנם ביום הסתלקותו שכתב הי\"ג ספרי תורות ומסרם לישראל, נסתמו ממנו מעיינות החכמה (בדרך נס כמ\"ש הרמב\"ן ז\"ל) והי' הכל בנבואה מפי ד' ית' אליו, והקב\"ה אומר ומשה כותב, כדי שלא יהי' מקום לבע\"ד לחלוק, ולומר גדלה חכמתי, ואכריע בדעת תורה להיפך ח\"ו, אבל על נבואתו אין מקום לחלוק, דהכל יודעים וכבר העידה תורה, ולא קם נביא בישראל עוד כמשה, ולטעם זה הי' רצון הבוי\"ת, לסלק ממנו מעיינות החכמה ביום ההוא, והי' הכל בבחי' נבואה."},{"passage_id":"devurim_17d04244_p30","passage_content":"ובזה יתבאר דברי המדרש הנ\"ל (קושיא ח') כמין חומר לא אוכל עוד לצאת ולבוא הה\"ד ולא קם נביא עוד בישראל כמשה, עפי\"מ שדרשו חז\"ל, לא אוכל עוד לצאת ולבוא מלמד שנסתמו ממנו מעיינות החכמה, ובא המדרש לתרץ איך יתכן זאת, ומדוע הי' רצון הבוי\"ת כן, הה\"ד ולא קם נביא וגו' כמשה, ואין מקום על נבואתו לחלוק, ע\"כ רצה הבוי\"ת שיהי' כתיבת ומסירת התורה בבחי' זו, ונסתמו מעיינות החכמה ממנו, כדי שלא יהי' מקום לבע\"ד לחלוק."},{"passage_id":"devurim_17d04244_p31","passage_content":"ועתה נבוא לבאר במאמר הכתוב הנך שוכב עם אבותיך וקם וגו', ודברי הגמ' סנהדרין (עיין קושיא ט') דהנה האוהחה\"ק הקשה וקם העם הזה וזנה וגו', וכי קימה היא לו, והלא ירידה והשפלה היא לו, הזונה אחרי אלהי נכר, ואולי שיכוין לומר ע\"ד אומרו וישמן ישורון ויבעט, והוא אומר וקם העם, פי' היתה לו קימה בעולם, בירושת הארץ ועושר וכבוד וישמן, ומזה יצא לו שיבעט, וזנה אחרי אלהי נכר הארץ וכו' עכ\"ל הקדוש, והכלי יקר פי' שלשון וקם הוא מלשון כאשר יקום איש על רעהו ורצחו נפש וכו', שיקומו על משרע\"ה, ולא יתנו לו מנוחה בקבר עייש\"ד."},{"passage_id":"devurim_17d04244_p32","passage_content":"ובעוה\"ר כ\"ז נתקיימה בימינו, שרשעי הדורות היתה להם תקומה גדולה בעושר וכבוד והצלחה, ולכאורה למה עשה ד' ככה, רק דעון הדור גרם לכל זה, כמו שאני רגיל לחזור על דברי הראב\"ע ז\"ל, מ\"ש בנביא השקר כי מנסה ד' אלקיכם אתכם, ופי' הוא ז\"ל בעבור שעזבו ולא המיתו עכ\"ד, וזהו נסיון האחרון וגדול שבכולם והנה כל הנסיונות מה שתיארו חז\"ל, איך שיהי' מצב הדור בעיקבתא דמשיחא, אפשר להבין גם עפ\"י שכל הפשוט שיהי' כן, דלא אכשר דרא, והדורות מתמעטין, ונתרוקנים מתורה וחכמה, אבל נסיון זה האחרון, שיהי' להם הצלחה גדולה כ\"כ, וקם העם הזה וזנה, שיהי' להם תקומה, ועי\"ז יבצעו זממם וזנה וכו', דבר זה אין השכל מחייבו ואין זה כ\"א בעון הדור, ומי יוכל לעמוד באלה, ואיך יוכל הדור להתקיים, בנסיונות קשים ומרים כאלה."},{"passage_id":"devurim_17d04244_p33","passage_content":"אמנם נחמה גדולה הוא לנו, שכאשר הגענו לנסיון האחרון הזה, אשר חרפו אויביך ד', אז בודאי עקבות משיחך קרובים, ומזומנים לבוא, כמבואר במד\"ר (שה\"ש פ\"ב) א\"ר ינאי אם תראה דור אחר דור מחרף ומגדף, צפה לרגלי מלך המשיח, הה\"ד (תהלים פ\"ט) אשר חרפו אויביך ד' אשר חרפו עקבות משיחך, מה כתיב בתרי' ברוך ד' לעולם אמן ואמן עכ\"ד המדרש, וע\"כ צריך להתחזק ולעמוד בנסיון, שלא להתפעל מהצלחתם, וכל הנסיונות האלה הם צורך הגאולה, והנה מבואר במדרש רבה (סו\"פ עקב) כשיבוא אלי' הנביא לבשר הגאולה, יבוא משרע\"ה עמו, ושניהם באין כאחת עיי\"ש, ומשרע\"ה יקום בתחי' ויבואו עמו דור המדבר, ולפי\"ז אף אם נימא דמאמר וקם קאי אלמטה, וקם העם הזה וזנה כקושית הרומיים, ופשוטו של מקרא מוכיח כן, דאל\"כ העם הזה וזנה אין לו ביאור כנ\"ל, אבל מ\"מ נשמע מינה ג\"כ תחיית המתים, וקאי ג\"כ אלמעלה הנך שוכב עם אבותיך וקם, שמשרע\"ה יקום בתחילה ויגאל את ישראל, כדאיתא בזוה\"ק שמשרע\"ה בעצמו יהיה המלך המשיח."},{"passage_id":"devurim_17d04244_p34","passage_content":"וזה אשר השיב ר' יהושע בן חנניא לרומיים, נקוט מיהא פלגא בידייכו, דהמשכיל ומתבונן בנסיון זה וקם העם הזה וגו', שיש להם הצלחה ותקומה גדולה למעלה מן השכל, מזה עצמו ישפוט שקאי וקם גם למעלה, ומשרע\"ה יקום בתחי' מיד ויגאל את ישראל דא\"א בענין אחר, וזהו סימן על זה, וע\"כ אמר נקוט מיהא פלגא וכו', שזה החצי מוכרח שיגרור אחריו חצי האחר, וא\"א זולתו, וסרו כל הקשיות בענין."},{"passage_id":"devurim_17d04244_p35","passage_content":"והבוכ\"ע ירחם על עמו ישראל, ועכשיו אנו עומדים בימים האחרונים של ימי הסליחות קרובים אל ימים הקדושים ר\"ה ויוכ\"פ, ולא הכננו לעצמינו כלום, הי תורה והי מצוה דמגני עלן, ונחזור למה שהתחלנו אתם נצבים וגו' ורז\"ל דרשו אין עמידה אלא תפלה, והיום הזה ר\"ה כמבואר בזוה\"ק, ואמה\"כ טפכם ונשיכם, וגו' כל איש ישראל, וכל אחד יעתיר ויתפלל בעד עצמו, ולא סגי בראשיכם זקניכם, ובעוה\"ר עכשיו אין לנו על מי לסמוך, דהנסתרות לד' אלקינו, ושום אדם לא ידע מי הוא החשוב לפני הבוי\"ת, וכבחי' הנ\"ל בשם הח\"ס זלל\"ה, וכעי\"ז כתב ק\"ז הייטב לב זלה\"ה באופן אחר קצת, וצריך כל אחד לייחד לבו ומחשבתו להקב\"ה, והקב\"ה ירחם שנזכה לומר דיבורים אמיתיים לפני הקב\"ה, בימי הסליחות והרחמים, וצריכין לסייעתא דשמיא, ובאמת הוא מלובש בטבע, אבל הכל הוא נסי נסים, שיהודי יוכל לומר דיבורי אמת לפני הקב\"ה, בזה העולם הגשמי והנפילה הגדולה שקרה לנו וקם העם הזה וגו', ואיזה פנים יש לנו."},{"passage_id":"devurim_17d04244_p36","passage_content":"והבוב\"ע יעזור באלו ימים המעטים לפני ר\"ה שנזכה לעשות קצת הכנה, ויהי' לנו השפעה מהקב\"ה ע\"ז גופא, כי לא ממעשינו שלא הכינו עצמינו לזה, ונזכה שיהי' לנו עכ\"פ קצת התעוררות תשובה בלב, ולקשר לבבנו אליו ית' וכל ישראל ינצלו מכל צרה וצוקה, דבעוה\"ר אין אדם יודע מה מעותד עוד לבוא ח\"ו, והבוכ\"ע יעזור שנזכה להכתב לטובה בזה השנה, וצריך כל אחד בפרטיות ישועה שלימה, והעיקר הוא בכלליות שצריכין לישועה שכבר כלו כל הקיצין, ונזכה לראות בישועת ישראל וביאת משיח צדקנו ב\"ב, ולא נדחה מחמת רוב העונות ופשעים בעוה\"ר ונזכה שהשי\"ת יקרב לבבנו אליו ית', ובמהרה נוושע בישועה שלימה בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו בב\"א."},{"passage_id":"devurim_17d04244_p37","passage_content":"R"},{"passage_id":"devurim_17d04244_p38","passage_content":"שבה שובה"}]},{"dvar_torah_id":"devurim_befff9ff","title":"האזינו השמים ואדברה","summary":"במדרש נדרש הקשר בין שמיעת התורה לרפואה, והצדיקים המוסיפים ומגרעים על דברי ה'. משה רבינו הטה אזנו לשמוע תורה, והשמים והארץ נשתתקו. יש להבין את משמעות הרפואה בשבת והקשר בין חקי הטבע למצות התורה.","contents":[{"passage_id":"devurim_befff9ff_p1","passage_content":"האזינו השמים ואדברה ותשמע הארץ אמרי פי, יל\"ד למה אמר אצל השמים ואדברה לשון עתיד, ואצל הארץ אמר אמרי פי המורה על הווה."},{"passage_id":"devurim_befff9ff_p2","passage_content":"ב) במד\"ר הלכה אדם מישראל שהי' חושש באזנו, מהו שיהא מותר לרפאותו בשבת, כך שנו חכמים כל שספק נפשות דוחה את השבת, וזו מכת האוזן, אם סכנה היא מרפאים אותה בשבת, רבנן אמרי מבקש אתה שלא לחוש באזנך וכו', הטה אזנך לתורה וכו', ר' לוי אמר רמ\"ח אברים שבאדם ע\"י האוזן כולם חיים, שנא' שמעו ותחי' נפשכם וכו', ומהיכן את למד ממשה רבינו, שע\"י שהטה אזנו לתורה וכו', נשתתקו עליונים ותחתונים והאזינו דבריו, מנין ממ\"ש האזינו השמים וכו' עכ\"ד המדרש, ראוי להבין קישור הלכה זו לכאן, ולמה הסמיכוהו במדרש לפסוק האזינו השמים."},{"passage_id":"devurim_befff9ff_p3","passage_content":"ג) יש להבין מה שאמרו מבקש אתה שלא לחוש באזניך וכו', הטה אזנך לתורה וכו', דנראה לכאורה כסותר מאמרו הקודם. מ\"ש בתחלה דמותר לרפאותו ע\"י חלול שבת, ועכשיו נותן עצה לרפאותו ע\"י שמיעת התורה, וא\"כ אפשר אף בלי חלול שבת."},{"passage_id":"devurim_befff9ff_p4","passage_content":"ד) איך הביא ראי' ממשרע\"ה, שע\"י שהטה אזנו לשמוע ש\"ת, נשתתקו השמים וארץ והאזינו דבריו, ומי ידמה אליו לשלימותו, וכי זו בלבד היתה בו, והלא הוא הי' שלם בכל מדותיו ובכל אבריו, ואיך אפשר להעריך אליו, ולהביא ראי' שכמו\"כ יועילו מעשינו."},{"passage_id":"devurim_befff9ff_p5","passage_content":"ה) להלן במדרש זש\"ה ידעתי כי כל אשר יעשה האלקים הוא יהי' לעולם, עליו אין להוסיף וגו' (קהלת ג') כך ברא הקב\"ה את עולמו, יום שיהא יום, ולילה שיהא לילה, בא יעקב ועשה את היום לילה, ששקע לו הקב\"ה את השמש שלא בעונתה וכו', בא יהושע ועשה הלילה יום וכו', כך ברא הקב\"ה שיהא הים ים, ושתהא היבשה יבשה, בא משה ועשה את הים יבשה וכו', בא אלישע ועשה את היבשה ים וכו', הרי שהצדיקים גורעים ומוסיפין על דבריו של הקב\"ה, כדי שיהיו הבריות יראין מלפניו, וזהו והאלקים עשה שיראו מלפניו עכ\"ד המדרש. ולכאורה הוא סתירה מני' ובי', דמתחלה הביא הפסוק, כי כל אשר יעשה אלקים עליו אין להוסיף וגו', ואח\"כ מביא הרבה ראיות, דצדיקים גורעין ומוסיפין על מעשיו ית'."},{"passage_id":"devurim_befff9ff_p6","passage_content":"ואפ\"ל עפ\"י מ\"ש ק\"ז הישמח משה זלל\"ה (בפ' תזריע), בהקדם מ\"ש הבית שמואל, לפרש מאמר חז\"ל, מפני מה אמרה תורה בדד ישב וכו', הוא הבדיל בין איש לאשתו וכו', לפיכך אמרה תורה בדד ישב, ותו\"ד דחכמי הרופאים אמרו, דצרעת בא מתגבורת מרה שחורה, ורפואתו שילך בין בני אדם, וזה פי' הגמ', מפני מה אמרה תורה בדד ישב, ויתרפא שלא כדרך הטבע, והלא אין השי\"ת רוצה בשנוי טבע, וע\"ז תירצו בגמ' הוא הבדיל בין איש לאשתו, ע\"כ תשובתו לפי משקל חטאו שישב בדד, ואף שהוא שלא כדרך הטבע, לפיכך אמרה תורה בדד ישב, וכיון שנכתב בתורה, ותורה קדמה לבריאה, לפיכך דרך הטבע הוא כך."},{"passage_id":"devurim_befff9ff_p7","passage_content":"וכמ\"ש הרמב\"ם ז\"ל, דע\"י שהתנה הקב\"ה עם הים לפני בריאת העולם, שיקרע לפני ישראל, אין זה שנוי הטבע, דתחלת ברייתו הי' באופן זה, וזה טבעו שנברא בו, כמו\"כ מה שאמרה תורה והוא קדמה לעולם, א\"כ כל הנבראים שבעולם נבראו על תנאי זה, שישתנו וישתעבדו לחקי התורה, ואין זה שנוי הטבע דתחלת בריאתם כך הי' עכ\"ד."},{"passage_id":"devurim_befff9ff_p8","passage_content":"ובזה פי' ק\"ז זלל\"ה מ\"ש רז\"ל בפסחים (נ\"ד) התורה קדמה לעולם, וישראל קדמו לעולם, דר\"ל דחקי הטבע לא שלטה בהם, וכן מ\"ש בב\"ר (פרשה ה' ס\"ה) תנאין התנה הקב\"ה עם כל מעשה בראשית וכו', צוויתי את השמים והארץ שישתקו לפני משה, שנא' האזינו השמים וגו', צוויתי את השמש ואת הירח שיעמדו לפני יהושע וכו', צוויתי את האור שלא תזיק לחמו\"ע וכו', ג\"כ על דרך זה, דהתנה הקב\"ה עמהם לפני בריאתם, והושם בטבעם, שישתנו לצורך ישראל, ולפי חקי התורה, ואין זה בגדר שנוי הטבע אצלם, עכ\"ד הישמח משה זלל\"ה."},{"passage_id":"devurim_befff9ff_p9","passage_content":"וא\"ש דברי המדרש, האזינו השמים ואדברה וגו', שנשתתקו השמים והארץ עפ\"י דיבורו של משה רבינו, זש\"ה כי כל אשר יעשה אלקים עליו אין להוסיף וממנו אין לגרוע, אבל הצדיקים גורעין ומוסיפין על דבריו של הקב\"ה, כמו שמבאר המדרש להלן, ואין שנוי במעשה האלקים ובטבע הנבראים, דזה הי' מתנאי בריאתם, והושם כן בטבעם, שישתנו לצורך ישראל, ולפי חקי התורה ורצון הצדיקים, וזה מבואר בפסוק הנ\"ל, והאלקים עשה שייראו מלפניו, ר\"ל שהשי\"ת עשה ובראן על דעת כך, ועל תנאי זה, שישתנו וישתעבדו חקי הטבע, לרצון הצדיקים ודיבורם, כדי שיראו בני אדם כח התורה, וכח היראה ומעלתה, ויראו מלפניו יתברך."},{"passage_id":"devurim_befff9ff_p10","passage_content":"וכתב בילקוט ראובני בשם ס' התמונה, דמה שהעמיד יהושע את השמש והירח, הי' מכחו של משרע\"ה, שהשתיק את השמים ואת הארץ, ע\"י השגתו הגדולה במדות העליונות, ובכח השגה זו פעל והושע ג\"כ, עכ\"ד, ואפשר שרמז משה רבינו כאן, גם על העמדת חמה דיהושע, וע\"כ אמר האזינו השמים ואדברה לעתיד, דבכח השם הקדוש שהשיג, יהי' העמדת החמה גם לעתיד, ותשמע הארץ אמרי פי אמר בלשון הווה, המורה על עכשיו, שנשתתקו השמים וארץ עפ\"י דבורו."},{"passage_id":"devurim_befff9ff_p11","passage_content":"ועתה נבוא לביאור דברי המדרש הנ\"ל (בקושיא ב') ונקדים מה שאמרו רז\"ל במס' ב\"ק (פ\"ה ע\"א) תניא דבי ר' ישמעאל אומר, ורפא ירפא מכאן שניתן רשות לרופא לרפאות, ובתוס' שה הקשו, וא\"ת והא מרפא לחודיה שמעינן לי' (ר\"ל ולמה כתבה תורה כפל לשון) וי\"ל דהוה אמינא הני מילי מכה בידי אדם, אבל חולי הבא בידי שמים, כשמרפא נראה כסותר גזירת המלך, קמ\"ל דשרי עכ\"ד, ובתוס' ר\"י החסיד על מס' ברכות, הקשו דכולא קרא ורפא ירפא מיותר, דהרי חיובא איכא על הרופא לרפאות, מקרא דלא תעמוד על דם רעך, ותירצו בתירוצם הראשון כמ\"ש בתוס' הנ\"ל דהו\"א ה\"מ מכה בידי אדם, אבל ביד\"ש נראה כסותר גזירת המלך, קמ\"ל דשרי. ועוד י\"ל דהו\"א כיון דמצוה הוא, אינו רשאי ליקח שכר, דמה אני בחנם אף אתם בחנם, קמ\"ל קרא ורפא ירפא דמותר ליקח שכר בטלה וטירחא עכ\"ד, וכמ\"ש התרגום ושכר אסיא ישלם, וכן מבואר בשו\"ע ולא הזקיקו הכתוב לרפאות בחינם."},{"passage_id":"devurim_befff9ff_p12","passage_content":"ואפשר שהתירה התוה\"ק ליקח שכר רפואה משום דאסיא דמגן מגן שוי' (ב\"ק פ\"ה ע\"א) וספק פיקוח נפש הוא, עכ\"פ לדברי ר\"י החסיד הנ\"ל, הדרא קרא לחיובא ומצוה, משום לא תעמוד על דם רעך, ואע\"ג דתנא דבי ר\"י לא קאמר. אלא מכאן שנתנה רשות וכו', להורות בא דאין בו איסור משום סותר גזירת המלך, ולאידך תירוצא דמותר ליקח שכר, אבל בעצם הרפואה יש בו חיובא דמצוה, משום לא תעמוד על דם רעך."},{"passage_id":"devurim_befff9ff_p13","passage_content":"ואולם דבר זה במחלוקת הוא שנוי' בין הראשונים, והרמב\"ן ז\"ל בס' תורת האדם וכן בפירושו עה\"ת (בפ' בחקתי) כתב על אמרם ז\"ל מכאן שנתנה רשות לרופא לרפאות, לא אמרו שנתנה רשות לחולה להתרפאות, דאין דרך השלימים כן, והדורש השם לא ידרוש ברופאים, ומה חלק לרופאים בבית עושי רצון ד' וכו', וכן מצינו באסא מלך יהודה שגינהו הכתוב (ד\"ה ב' ט\"ז), וגם בחליו לא דרש את ד' כי אם ברופאים, ואלו הי' דבר הרופאים נהגו בהם, מה טעם שיזכיר הרופאים, הלא אין האשם רק בעבור שלא דרש השם וכו', וכך אמרו בגמ' כל כ\"ב שנין דמלך רבה בי רב יוסף אפר אומנא לביתי' לא קרא וכו', אלא שאם החולה בא להתרפאות, ואינו מאלו השלמים אשר חלקם בחיי עולם, אין לרופא לאסור עצמו ברפואתו, שנתנה לו התורה רשות עייש\"ד, אבל הרמב\"ם כתב דמצוה נמי איכא, וכמו שמצווה האדם לעשות פעולות להחיות גופו, במאכלו ומשקהו ומלבושיו וכל צרכי גופו, וכל זה נכלל בצווי וברכתיך בכל אשר תעשה, כמו\"כ הדבר הזה, דמצוה עליו לעסוק ברפואות ולהחיות את נפשו, עכת\"ד, וכ\"כ הרא\"ש בפ\"ד דנדרים (דף מ\"א ע\"ב) דמצוה נמי איכא, עיי\"ש."},{"passage_id":"devurim_befff9ff_p14","passage_content":"והטור והב\"י (ביו\"ד סי' של\"ו) כתבו ג\"כ דמצוה הוא, ובכלל פיקוח נפש הוא, והזריז הרי זה משובח, וכתב הב\"י הואיל והתירה תורה לחלל שבת ברפואות, ש\"מ פיקוח נפש הן, ופיקוח נפש מצוה רבה הוא עייש\"ד, ולכאורה יש להבין איך יועיל רפואה לחולי בידי שמים, והלא זה נראה כשנוי הטבע, גם מדוע רמיא עלי' מצוה וחיובא, והלא נראה כסותר גזירת המלך, כטענת הרמב\"ן ז\"ל, דהקב\"ה מוחץ והוא מרפא וה\"ז כשנוי ברצונו ית' ושנוי בטבע."},{"passage_id":"devurim_befff9ff_p15","passage_content":"ולדרכנו יובן שפיר, דכיון שכתבה תורה ורפא ירפא, והתורה קדמה לעולם, וזה הי' מתנאי הבריאה שישתעבדו חקי הטבע למצות התורה, הושמה בטבע הבריאה שיועיל הרפואה עפ\"י הטבע, וזה רצונו ית' לשנות החולי ע\"י רפואות, כמאמרו ית' ורפא ירפא."},{"passage_id":"devurim_befff9ff_p16","passage_content":"וא\"ש מה שהסמיכו הלכה זו לפסוק האזינו, דנשתתקו השמים והארץ למאמרו של משה, והלא כל מה שעשה אלקים עליו אין להוסיף וגו', והתירוץ מבואר במדרש דהצדיקים גורעין ומוסיפין על דבריו של הקב\"ה, וזה הי' מתנאי הבריאה כמבואר בב\"ר הנ\"ל, שטבעי הנבראים ישתעבדו לחקי התורה, ולצדיקים שומרי התורה, וע\"כ הסמיכו הלכה זו דמותר לחלל שבת על מכת האוזן, משום ספק פיקוח נפשות, וגם זה בכח מצות התורה, שאמרה ורפא ירפא, דאל\"ה לא הי' אפשר לשנות הטבע, ולא הי' מהני רפואתו נגד הטבע, ואין כאן היתר דפיקוח נפש ולא הי' מותר לחלל שבת ברפואתו, נמצא דמה דמהני רפואתו ומותר לחלל שבת משום פיקוח נפש, כ\"ז נשמע מהאזינו השמים, וע\"כ הסמיכו הלכה זו לכאן."},{"passage_id":"devurim_befff9ff_p17","passage_content":"ועפ\"י הנ\"ל אפשר לפרש דברי המדרש הים ראה וינוס מה ראה ברייתא דר' ישמעאל ראה, והוא פלא, אך דמצינו בר' פנחס בן יאיר (חולין ז') שפגע בגינאי נהרא, וא\"ל חלוק לי מימך, א\"ל אני הולך לעשות רצון קונו וכו', ופרש\"י כל הנחלים הולכים אל הים בגזירת מלך, וכמו\"כ הים לא רצתה ליבקע ולהעשות יבשה, כי לא רצתה להשתנות מטבעה אשר שם בה יוצר בראשית, כי כן ברא הקב\"ה עולמו שיהא הים ים ויבשה יבשה כמבואר במדרש הנ\"ל."},{"passage_id":"devurim_befff9ff_p18","passage_content":"אמנם כאשר ראתה ברייתא דר' ישמעאל, דתנא דבי ר' ישמעאל ורפא ירפא מכאן שנתנה רשות לרופא לרפאות, וכמ\"ש התוס' דמכפל הכתוב שמעינן, דאפי' בחולי ביד\"ש נתנה רשות לרפאות, ולכאורה איך מועיל רפואה בחולי ביד\"ש, הלא הוא כשנוי בחקי הטבע, אלא ע\"כ דכיון שאמרה תורה ורפא ירפא, חקי הטבע משועבדים לדברי התוה\"ק, וא\"כ ק\"ו הוא, ומה רופא זה שבא רק ברשות התורה, יש בכחו לשנות הטבע, כ\"ש משרע\"ה שהי' עצם התורה, וכל ישראל כאן שהלכו לקבלת התורה, והם קדמו לעולם, והתורה קדמה לעולם, אינו דין שישתעבדו חקי הטבע להם וכח הק\"ו הוא ג\"כ ברייתא דר' ישמעאל, וזה ראה הים וינוס, וא\"ש דברי המדרש."},{"passage_id":"devurim_befff9ff_p19","passage_content":"וא\"ש מה שאמרו במדרש אחר הלכה הנ\"ל, רבנין אמרי מבקש אתה שלא לחוש באזניך וכו', הטה אזנך לתורה וכו', ואין זה סותר מאמרו הקודם כקושיתנו, ואדרבה זה נשמע ממ\"ש לעיל, ויש לו קישור להלכה הנ\"ל, דאיפשטא הלכתא דמותר לחלל שבת משום ספק נפשות, ואיך יועיל רפואתו לשנות פקוח נפש, ועכ\"ח בכח התורה, וזה נשמע מהאזינו השמים כנ\"ל וא\"כ רדו הוא דתורה בעצמו מהני לרפאות, ומה הרופא ע\"י שבא בכח צווי התורה, יש בכחו לשנות הטבע, מכ\"ש התורה בעצמו, וע\"כ הטה אזנך לתורה ואתה מתרפא. אבל לפי שלאו כל אדם זוכה למידה זו, להשלים עצמו בשמיעת התורה, ע\"כ התירה התוה\"ק לרפאות גם ברפואה טבעית, ולחלל שבת משום פיקוח נפש."},{"passage_id":"devurim_befff9ff_p20","passage_content":"ומה שתלוי בשמיעת האוזן דוקא, כמ\"ש מבקש אתה שלא לחוש בא' מאיבריך, הטה אזנך לתורה וכו', ורמ\"ח איברים שבאדם ע\"י האוזן כולן חיים וכו', יובן עפ\"י מ\"ש בש\"ך עה\"ת (בפ' עקב) לפרש הפסוק והי' עקב תשמעון, דשכר מצוה בהאי עלמא ליכא, ועל עשי' ושמירת המצות א\"א לקבל שכר בעוה\"ז, רק על השמיעה לבדה יקבל שכרה בעוה\"ז, כמ\"ש עקב אשר שמעת בקולי (בראשית כ\"ב) וכמ\"ש עקב אשר שמע אברהם בקולי (בראשית כ\"ו) וכמו\"כ והי' עקב תשמעון תקבל שכר על השמיעה לבד, עכ\"ד."},{"passage_id":"devurim_befff9ff_p21","passage_content":"ואולי כי השמיעה הוא כמו הכנה למצות עשי', וידוע דעל הכנת המצוה איכא שכר בהאי עלמא, וא\"ש מ\"ש במדרש דע\"י האוזן כולן חיים, ומרפא לכל רמ\"ח איבריך, כי א\"א לקבל שכר בעוה\"ז רק על השמיעה כנ\"ל, וא\"ש מה שהביא המדרש ראי' ממשרע\"ה, שע\"י שהטה אזנו לתורה זכה לכל אלה, אע\"פ שמשרע\"ה הי' שלם בכל איבריו ובכל מדותיו, וא\"כ אין ראי' שבשביל שמיעת האוזן זכה לכל אלה, אבל לפי הנ\"ל א\"ש דעל כולן א\"א לקבל בעוה\"ז, רק על שמיעת האוזן וא\"ש ראייתם."},{"passage_id":"devurim_befff9ff_p22","passage_content":"ועפי\"ז אפ\"ל דברי המד\"ר בפ' וירא (פר נ\"ג ס\"ח) צחוק עשה לי אלקים, א\"ר לוי הוסיפו על המאורות, נאמר כאן עשי' עשה לי אלקים, ונאמר להלן ויעש אלקים את שני המאורות עכ\"ד המדרש, והוא פלא דמה ענין הוסיפו על המאורות לכאן, ואפ\"ל עפ\"י דברי הגה\"ק ארי' דבי עילאה זלל\"ה (בקונטרס עטרת זקנים) לתרץ קושית התוס' במנחות (ל' ע\"א), וכן הקשה הרא\"ש בפרק ערבי פסחים (סי' י\"ג) על מ\"ש רב שר שלום גאון, שתקנו לומר צדוק הדין בשבת במנחה, על שנפטר משרע\"ה באותה שעה, הלא מבואר במד\"ר וילך, בו ביום כתב י\"ג ס\"ת, ובשבת האיך הי' כותב, גם האיך כתב באותו היום בן מאה ועשרים שנה אנכי היום, ודרשו רז\"ל היום מלאו ימי ושנותי, ועכ\"ח שכתב כן בע\"ש ונפטר בע\"ש, ועוד דמוכח בסדר עולם דבע\"ש נפטר, ע\"כ קושיתם ז\"ל, ותוכן תירוצו דז' באדר באותה שנה הי' בע\"ש כדמשמע בסדר עולם, ומשרע\"ה נפטר בשבת, אבל ע\"י שהשתיק משרע\"ה חמה ולבנה, בשעה שאמר האזינו השמים, ועמדה החמה ל\"ו שעות, נחשב ליומא אריכתא, וכאלו מת בז' באדר אע\"פ שמת בשבת (עיין בחידושינו לחג השבועות מבואר תירוצו באריכות ולא נאריך כאן), עכ\"פ משה רבינו הוסיף על המאורות, וזה הי' בכח התורה, כי חקי הטבע והבריאה משועבדים אלי', כנ\"ל, וע\"כ כאשר נולד יצחק ובאה מדת הדין לעולם, וע\"כ צריך שיצורף אלי' כח התורה, דאל\"ה אין קיום לעולם, רק כשיש דין למטה אין דין למעלה, ונמצא כשירדה מדת הדין, ירדה כח התורה להכריע הכף מאזנים, שיהא קיום לעולם, וע\"כ הוסיפו על המאורות, דכאן נתנה הכח להוסיף על המאורות בכח התורה."}]},{"dvar_torah_id":"devurim_e8838a50","title":"חובת שמירת שבת וחשיבות הכנת המצווה","summary":"ההלכה מחייבת לחלל שבת על פיקוח נפש, גם על חיי שעה. דרשת ר' שמעון בן מנסיא מדגימה את מעלת שמירת שבת אחת כאלו שמר כל השבתות. השמיעה וההכנה למצווה נחשבות חשובות, והן מביאות לתועלת לעתיד.","contents":[{"passage_id":"devurim_e8838a50_p1","passage_content":"באופן אחר אפ\"ל הדקדוקים הנ\"ל ודברי המדרש הלכה אדם מישראל שהר חושש באזנו וכו', והדקדוקים כבר נפרטו לעיל בדרוש הקדום."},{"passage_id":"devurim_e8838a50_p2","passage_content":"ואפ\"ל דהנה מקור ההלכה דמחללין שבת על פיקוח נפש נלמד במס' יומא (דף פ\"ה ע\"ב) והרבה לימודים בגמ' שם, ר\"א יליף לי' ק\"ו ממילה, ר\"ש בן מנסיא יליף לי' מקרא דכתיב ושמרו בנ\"י את השבת לעשות את השבת, אמרה תורה חלל שבת א' כדי שישמור שבתות הרבה, א\"ר יהודה אמר שמואל אי הואי התם, הו\"א דידי עדיפא מדידהו, וחי בהם ולא שימות בהם, אמר רבא לכולהו אית להו פירכא בר מדשמואל וכו'."},{"passage_id":"devurim_e8838a50_p3","passage_content":"והנה לענין הלכה לא סבירא לן כילפותא דר\"ש בן מנסיא, דפסקינן הלכתא דמחללין שבת אפי' על חיי שעה, ואילו לדרשת ר' שמעון בן מנסיא, לא הותרה לחלל שבת בפיק\"נ, אלא בתנאי שישמור עוד שבתות, וכמ\"ש האוהחה\"ק (בפ' כי תשא) עה\"פ ושמרו בנ\"י את השבת וגו' דלא הותרה לחלל את השבת בפיק\"נ, אלא באדם שישנו בגדר לעשות את השבת, אבל בחיי שעה לא, ועיין במפרשים שהקשו עליו, דלאו הלכתא הכי, ודבריו פליאים המה וצ\"ב ולא נאריך כאן בזה."},{"passage_id":"devurim_e8838a50_p4","passage_content":"אמנם אע\"ג דלא פסקינן הלכתא כר\"ש בן מנסיא כנ\"ל, אבל דרשא דר\"ש ב\"מ, חלל שבת א' כדי שישמור שבתות הרבה דרשא אמיתית הוא, וסמכינן עלה מיהא להחמיר, אבל לא להקל, והרי זה דומה למ\"ש הפוסקים, דאף דלא דרשינן טעמא דקרא להקל, לפי שאין יכולת בנו להשיג טעם עליון ית', וחקר אלקי מי ימצא, ושמא העיקר כאידך טעמא, אבל להחמיר, לכ\"ע דרשינן טעמא דקרא, דכולהו הטעמים שאמרו חז\"ל אמיתיים הם, וצריך לחשוש להם להחמיר עכ\"פ, וכמו\"כ בדרשת דר\"ש בן מנסיא לא פסקינן כוותי' להקל, למנוע מלחלל על פיקו\"נ של חיי שעה, אבל להחמיר מיהא צריך לחשוש עלי', דדרשא אמיתית הוא, ואלו ואלו דא\"ח ככל פלוגתת חז\"ל, ולהלן נבאר בזה."},{"passage_id":"devurim_e8838a50_p5","passage_content":"ונקדים דברי הילקוט פ' תשא (רמז שצ\"א) ר' נתן אומר מנין אתה אומר, כל מי שמשמר את השבת כתקנה, מעלין עליו כאלו שמר כל השבתות, מיום שברא הקב\"ה עולמו עד שיחיו המתים, שנא' ושמרו בנ\"י את השבת לעשות את השבת לדורותם, עכ\"ד המדרש ולכאורה צריך הסבר, דאיך יהי' נחשב שמירת שבת א', כאלו שמר כל השבתות של כל ימות עולם, ויובן עפי\"ד ק\"ז היש\"מ זלל\"ה (בפ' כי תשא), עה\"פ כי אות היא וגו' ושמרתם את השבת כי קודש היא לכם, עפימ\"ש השלה\"ק, כי ס' רבוא נשמות לישראל, וס' רבוא שבתות, שי\"ן אלפים בשית אלפי שנין, ושי\"ן אלפים ביום שכולו שבת דהוא אלף השביעי, וכל נשמה נחצבה משבת א', והיינו שאמרז\"ל, שאמר הקב\"ה לשבת, כנסת ישראל יהי' בן זוגך, והיינו כי קדש היא לכם, לכם דייקא, וידוע דס' רבוא אותיות לתורה, וכל נשמה יש לה אות אחת, ויובן מזה דכל שבת ג\"כ נחצב מאות אחת, וכל שבת ושבת, הוא ממש איזה אות בתורה, וז\"ש כי אות היא עכ\"ד ק\"ז זלל\"ה."},{"passage_id":"devurim_e8838a50_p6","passage_content":"ובזה יובנו דברי הילקוט הנ\"ל, דכמו שאמחז\"ל מנחות (דף ל' נרא), בס\"ת אם הגיה בו אפי' אות א', מעלה עליו כאילו כתבו כולו, כמו\"כ המשמר שבת א', ששורש מחצבה מאות א' שבתורה, ה\"ה כאלו שמר כל שבתות ימות עולם, שבצירוף כולם, נשלם ס' רבוא אותיות תורה שלימה והבן."},{"passage_id":"devurim_e8838a50_p7","passage_content":"ולפי\"ז א\"ש ילפותא דר'ש בן מנסיא, אפי' לדידן דס\"ל דמחללינן אפי' על חיי שעה, ובאמדוהו לשעות נמי מחללין עליו את השבת, אע\"ג דלא ישמור שבתות הרבה, אולם לפי\"ד הילקוט ע\"י שישמור ויקיים אפי' מקצת שבת באמדוהו לשעות, הו\"ל כאלו שמר שבתות הרבה, וכמו אם הגיה אפי' אות א' בס\"ת, הו\"ל כאלו כתבו כולו, וא\"ש דרשת ר\"ש בן מנסיא אפי' לדידן, והגם דאין למדין ממנה לענין הלכתא ולא פסקינן כוותי', דכפי הכלל הנמסר בידינו, לא ניתן לדחות ל\"ת שבתורה, אלא בעידנא דקא מיעקר לאו קא מקיים עשה, ואלו לדרשת ר\"ש בן מנסיא, מותר לחלל שבת ולדחותה בקום ועשה כדי לקיים שבתות דלעתיד, ואין שיטת הלכה כן, דלאו בעידנא הוא ולא ניתן לדחות מטעם קיום שבתות דלעתיד, ואנן דמחללינן על ספק פיקו\"נ, מטעמא אחרינא אתינן עלי', דאמרה תורה וחי בהם ולא שימות בהם, ולא בשביל קיום שבתות דלעתיד."},{"passage_id":"devurim_e8838a50_p8","passage_content":"ואפשר לומר טעם דלא נמסר בידינו כח הכרעה זו, לדחות ל\"ת, משום קיום מ\"ע שלא בעידנא, הגם שישנם מצות שגדולים בערכם לדחות ל\"ת, אפי' שלא בעידנא ואפי' בשביל קיומם דלעתיד, וכדס\"ל לר\"ש בן מנסיא במ\"ע של שמירת שבת, שיש בכוחה לדחות אפי' שלא בעידנא, ולפי\"ד הילקוט הנ\"ל הו\"ל כבעידנא, דמקצת של אותה שבת, הו\"ל כאלו שמר מיד שבתות הרבה כנ\"ל, אולם לפי שאין אנו משיגים ערכם של המצות, וכמ\"ש הרמב\"ם ז\"ל, דערכן של המצות רק אלקים הבין דרכה, ע\"כ לא פלוג רבנן, ובכל המצות לא ניתן לידחות רק בעידנא, ולא נמסר בידינו הכרעת הלכה זו, להכריע בה מדעתנו, ועכ\"פ דרשא דר\"ש בן מנסיא אמיתית הוא, ונלמד מינה עכ\"פ לחומרא, גודל מעלת הכנת המצוה, עד שהותרה תוה\"ק לעבור בקום ועשה, בשביל לאפשר קיום מצות של שמירת שבתות הרבה לעתיד."},{"passage_id":"devurim_e8838a50_p9","passage_content":"ובזה יובן קישור הלכה זו לכאן, דכעין בחי' זו נרמז במאמר הכתוב, האזינו השמים וגו' דאמרז\"ל במדרש, שהשתיק משה רבינו השמים והארץ מלומר שירה, עד שידבר דברי תוכחותיו לישראל, ותכלית הדבורים האלו היו על לעתיד, ולא לצורך השעה, כי דיבר אל דור באי הארץ, שהיו כולם כשרים וצדיקים, אבל השיג משרע\"ה גודל התיקון והשלימות, שיהי' עי\"ז לישראל בדורות העתידים, וצוה לדחות מפני' שירת השמים והארץ מיד, בשביל התועלת של קיום המצות דלעתיד, וזהו נרמז בפסוק האזינו השמים, ששיתק השמים מיד, בשביל ואדברה לשון עתיד, שתועלת הדיבורים יהי' על לעתיד."},{"passage_id":"devurim_e8838a50_p10","passage_content":"ואפשר ירמוז הכתוב עוד, דבחי' העתיד וחשיבותה, אינו מושג כ\"א בשמים ולעליונים, וע\"כ אמר האזינו השמים ואדברה לשון עתיד, כי הם יאזינו וישיגו בתועלת העתיד שבדיבורים אלו, אבל ותשמע הארץ אמרי פי, והוא לשון הוה, ר\"ל ששומעים רק הדברים כאמירתן, ומה שנשמע מפה לאוזן מיד, ואין יודעים להעריך חשיבות תכלית העתיד, אבל קמי שמיא גליא, ומשה רבינו ע\"ה ג\"כ השיגה, וע\"כ השתיק השמים והארץ מלומר שירה מיד, בשביל גודל התועלת של כל ישראל לעתיד, ומה\"ט מצד עצם ההלכה, אמרה תורה לחלל שבת מיד, בשביל קיום ושמירת שבתות דלעתיד, אלא דלא נמסר הלכה זו בידינו מטעם הנ\"ל."},{"passage_id":"devurim_e8838a50_p11","passage_content":"ובזה יובן ג\"כ המשך דברי המדרש, ר' לוי אמר רמ\"ח איברים שבאדם, ע\"י האוזן כולם חיים שנא' שמעו ותחי נפשכם, ומהיכן את למד ממשה רבינו, שנשתתקו השמים והארץ והעליונים ותחתונים, והאזינו דבריו, מנין ממ\"ש האזינו השמים וגו', דלכאורה ראוי להבין איך ע\"י האוזן כולם חיים, ולמה ע\"י האוזן ובשכר השמיעה דוקא, ולא בשכר שאר מצות מעשיות, הנעשים בא' מרמ\"ח איברים שבאדם, ויובן עפ\"י מ\"ש בש\"ך עה\"ת (פ' עקב), והי' עקב תשמעון וגו', אם יש לך שכר בעוה\"ז, הוא על השמיעה לבד, כמ\"ש עה\"פ יען אשר עשית את הדבר הזה, שא\"ל הקב\"ה, על העשי' אין לה לא ערך ולא שכר, כי שכר מצוה בהאי עלמא ליכא, כי ברך אברכך והרבה ארבה את זרעך עקב אשר שמעת בקולי, כלומר אם יש לך שכר בעוה\"ז, הוא רק על ששמעת בקולי וכו' עיי\"ש."},{"passage_id":"devurim_e8838a50_p12","passage_content":"וז\"ש במדרש דע\"י האוזן ובשכר השמיעה, כל רמ\"ח איבריך חיים ומתרפאים, דשכרה משתלמת בעוה\"ז, ועוד נשמע מזה גודל החשיבות של הכנת המצוה, דהשמיעה אינה אלא הכנה, וגורם לקיום מצות המעשיות, ואעפ\"כ גדולה הוא בערכה, שע\"י האוזן לבד, ובשכר השמיעה לבד, כל רמ\"ח אבריך חיים ומתרפאים, ולא מצינו כן בשאר איברים, ובשאר מצות מעשיות, וקמי שמיא גליא ערכם של המצות, וערך וחשיבות הכנות המצוה, שכוחה גדול מאוד, כפי מה שגילו לנו חז\"ל במדרש כאן."},{"passage_id":"devurim_e8838a50_p13","passage_content":"ובזה יובן שייכות וקישור כל דברי המדרש, הלכה אדם מישראל שהי' חושש באזנו וכו', כך שנו חכמים כל ספק נפשות דוחה את השבת וכו', רבנן אמרי מבקש אתה שלא לחשוש באזנך וכו', הט אזנך לד\"ת וכו', ולכאורה למה לא הביאו במדרש לימוד ע\"ז, דספק נפשות דוחה את השבת, דבגמ' יליף לי' מקראי כר\"ש בן מנסיא הנ\"ל, או מק\"ו ממילה כר\"א, וכאן אסמכוהו אדברי אגדה אלו, דמחללין את השבת על ספק פיקו\"נ, ואפשר דטעמא דר\"ש בן מנסיא באו ללמדנו, דהא גופא טעמא בעי, למה הותרה התוה\"ק לחלל שבת, בשביל קיום מצות דלעתיד כנ\"ל, ע\"כ אמר דע\"י האוזן כולם חיים, ואם מבקש אתה שלא לחשוש באזנך, הטה אזנך לתורה, דהכנת המצוה והשמיעה הוא הגורם לקיום המעשה דלעתיד, וגדולה ערכה מאוד, עד שבזכותה כל אבריך חיים ומתרפאים, והיינו טעמא דר\"ש בן מנסיא, דאמרה תורה חלל שבת א' כדי שישמור שבתות הרבה, וספק פיקוח נפש דוחה שבת כנ\"ל, ומהיכן את למד ממשה רבינו, שנשתתקו השמים והארץ ועליונים ותחתונים והאזינו לדבריו, אע\"פ שהי' התועלת בהם רק על לעתיד כנ\"ל, אבל ההכנה אל קיום העתיד, גדולה מאוד בערכה, מנין ממ\"ש האזינו השמים ואדברה לעתיד כנ\"ל וא\"ש קישור כל דברי המדרש."}]},{"dvar_torah_id":"devurim_6fa39dc2","title":"היתר רפואה בשבת וסוד קיום התורה","summary":"במדרש נאמר כי כל ספק נפשות דוחה את השבת, והוכח ממעשה משה רבינו שהטה אזנו לתורה. עמדו השמש והלבנה, ונמצא כי כתיבת התורה הייתה פיקוח נפש, שהרי קיום העולם תלוי בקבלת התורה. לכן הותרה הכתיבה בשבת.","contents":[{"passage_id":"devurim_6fa39dc2_p1","passage_content":"באופן אחר יתבאר דברי המדרש הנ\"ל, הלכה אדם מישראל שהי' חושש באזנו, מהו שיהא מותר לרפאותו בשבת, כך שנו חכמים, כל שספק נפשות דוחה את השבת וכו', ומהיכן את למד ממשרע\"ה, שע\"י שהטה אזנו לתורה, בשעה שבא לפתוח בדברי תורה, נשתתקו העליונים ותחתונים והאזינו דבריו, מנין ממה שקרינו בענין האזינו השמים ואדברה וגו' עכ\"ד המדרש, וצ\"ב קישור דברי המדרש לפ' האזינו, ועוד דקדוקים בדברי המדרש, וכבר נפרטו לעיל בדרוש הקדום."},{"passage_id":"devurim_6fa39dc2_p2","passage_content":"ואפ\"ל בהקדם דברי הארי' דבי עילאה זלה\"ה (הו\"ד בספה\"ק אילה שלוחה בסופו) לתרץ קושית התוס' מנחות (דף ל' ע\"א) וקושית הרא\"ש בערבי פסחים (סי' י\"ג) על מ\"ש רב שר שלום גאון, דע\"כ נהגו לומר צדוק הדין בשבת במנחה, על שנפטר משה רבינו באותו שעה, והקשו ע\"ז דהא כתיב בן מאה ועשרים שנה אנכי היום, ודרשינן (במס' ר\"ה י\"א) היום מלאו ימי ושנותי, ואם נימא דבשבת מת, ע\"כ כתב היום מע\"ש, ויש לתמוה דכתב על העתיד וכו', והרא\"ש הוסיף להקשות ממ\"ש במד\"ר פ' וילך, בו ביום שנסתלק משה כתב י\"ג ס\"ת, ובשבת האיך הי' כותב, וע\"ק דמוכח בסדר עולם, דז' באדר שבאותה שנה ערב שבת הי' עיי\"ש, ע\"כ קושיתם ז\"ל."},{"passage_id":"devurim_6fa39dc2_p3","passage_content":"וכתב לתרץ בשם ספר א\"י עפימ\"ד בב\"ר (פל\"ב ס\"ט) ונח בן שש מאות שנה והמבול הי' מים וגו', ר\"י ור' נחמי', ר' יהודה אומר שנת המבול אינה עולה מן המנין, פרש\"י למנין שנותיו של נח, דכתיב ונח בן ת\"ר שנה והמבול הי' מים וגו', ויהי באחת ושש מאות שנה חרבו המים, וכחיב ויחי נח אחר המבול שלש מאות וחמשים שנה, נמצא כל ימי נח תשע מאות ונ\"א שנה, וכתיב ויהי כל ימי נח אשר חי תשע מאות וחמשים, אלמא דאין שנת המבול עולה למנין שנותיו, עכ\"ל רש\"י ז\"ל, ור' נחמי' ס\"ל אעפ\"י שאין עולה מן המנין, עולה הוא בתקופות ומזלות."},{"passage_id":"devurim_6fa39dc2_p4","passage_content":"וכתב היפ\"ת לפרש דברי ר' נחמי', דאין עולה למנין שנות נח, אבל עולה הוא למנין התקופות, ונחשבת לשנה א' מהמחזור, למנין שנות העולם עכ\"ל, מבואר מזה דאם אינו משמש מדת יום ולילה, כמו בימי המבול, אף אם יעמוד השמש כמה ימים וחדשים, אינו נחשב למנין שנות האדם, אבל למנין שנות העולם, לחשבון תקופות ומזלות, נחשב כל יום בפ\"ע, לדעת ר' נחמי'."},{"passage_id":"devurim_6fa39dc2_p5","passage_content":"לפי\"ז י\"ל, דבאמת הי' ז' באדר שבאותה שנה ערב שבת, כדמוכח בסדר עולם, ונפטר משרע\"ה בשבת במנחה כמ\"ש התוס', מ\"מ כיון שאמר משרע\"ה באותו היום, האזינו השמים והשתיק החמה והלבנה, ועמדה החמה, ולא שקעה באותו היום כלל, וכדאיתא בילקוט האזינו השמים, הי' השמים ושמי השמים דוממין, ואם תמה אתה וכו', צא וראה מה נאמר ביהושע, שנא' שמש בגבעון דום וגו', ואיתא במדרש שהוא א' מחמשה ימים שהי' לישראל, שעמדה חמה ל\"ו שעות ולא שקעה, ומשו\"ה לגבי שנותיו של משה, הי' נחשב שבת וע\"ש ליום א', ולא מלאו ימיו ושנותיו בערב שבת אלא בשבת, כי מה שנתעכב השמש, לא נחשב אצלו להוספה ויתרון בחשבון ימיו, רק ליום א' יחשב, ונחשב לו שמת בז' באדר."},{"passage_id":"devurim_6fa39dc2_p6","passage_content":"ומתורץ קושית התוס', מ\"ש היום מלאו ימי ושנותי, אע\"פ שכתבה בע\"ש, דלגבי דידי' שבת וע\"ש, כיומא חדא אריכתא נינהו, וגם קושית הרא\"ש מיושב, דהא דאמחז\"ל דכתב י\"ג ס\"ת ביום מיתתו, זה הי' בע\"ש, שהוא ז' אדר לכל העולם כולו, ואע\"פ שמת בשבת, אבל לגבי דידי' כיומא חדא נינהו, וגם שבת נחשב לז' אדר, ושפיר כתבם ביום מיתתו ובז' אדר. אבל לחשבון שני העולם הי' נחשב ליום אחר, כמ\"ש בשנת המבול לר' נחמי', כי למנין חשבון העולם, נחשב תמיד היום לכ\"ד שעות, ואף אם לא שקעה החמה, חשבינן לשקיעת החמה, בעת שראוי' לשקוע, וראי' לדבר משבת בראשית שלא שקעה החמה ל\"ו שעות, ואעפ\"כ נחשב לשבת."},{"passage_id":"devurim_6fa39dc2_p7","passage_content":"ולפי\"ז ל\"ק מידי, דשפיר אנו אומרים צדקתך בשבת במנחה, דלחשבון שנות עולם הי' אז שבת, אלא לגבי שנותיו של משה, הי' כמ\"ש, עכ\"ל הארי' דבי עילאה בשם ס' א\"י."},{"passage_id":"devurim_6fa39dc2_p8","passage_content":"אמנם גוף הענין עדיין צריך הסבר, דממנ\"פ אם נחשבו לחשבון שנותיו של משה, השני ימים כיומא אריכתא, לפי שלא שקעה חמה, איך יתחשב כיום אחר, והיתה שבת לכל העולם כולו, והוא תרתי דסתרי. וגם דברי היפ\"ת, שמשם שאב מקורו, ג\"כ צריכים ביאור, דממנ\"פ, כיון דלא שמשה מדת יום ולילה בשנת המבול, וע\"כ לא נחשבו לשנות חיי נח, מדוע יחשב לשנות העולם, וחוץ מזה יקשה סתירת המדרשים, דבב\"ר (פי\"א כרב) מבואר, שלא שקעה החמה בשבת בראשית עד מוצ\"ש, ואעפ\"כ נחשב ליום שבת, ולא כיום שעבר, ומפדר\"א (פרק נ\"ב) מבואר להיפך דהעמיד יהושע את החמה כדי שלא יחללו ישראל את השבת, אלמא דנחשב כיום שעבר. והכי איתא בפרקי דר אליעזר (פרק נ\"ב) בשעה שעשה יהושע מלחמה עם המלכים, ערב שבת הי', וראה שלא יחללו ישראל את השבת, מה עשה פשט ידו לאור השמש וירח, ועמד כל אחד במקומו עכ\"ל, מבואר דעמידת השמש מלזוז מתנועתו, יחשב עמידתו כיום שעבר, דאל\"ה לא פעל יהושע כלום, במה שהעמיד את השמש, דאעפ\"כ חל קדושת השבת, ובחי' להגדש\"פ (עמוד קפ\"ה) כתבנו בזה הסבר נכון לחלק בין דברי המדרשים (ולא נאריך כאן עיי\"ש תקחנו משם)."},{"passage_id":"devurim_6fa39dc2_p9","passage_content":"ולעניננו נ\"ל, שמה שהקשו ממד\"ר (פ' וילך), בו ביום שנסתלק משה כתב י\"ג ס\"ת, ובשבת האיך הי' כותב, לכאורה אפ\"ל שאין כאן אפי' התחלת קושיא, דבודאי שלא הי' כתיבת משרע\"ה כתיבה גשמית, גם א\"א בדרך הטבע לכתוב י\"ג ס\"ת ביום א', אלא ודאי שהי' בדרך נס או בהשבעת הקולמוס, ומאן יימר לן שכתיבה כזו אסורה בשבת, וע\"ד שכתבו רש\"י ז\"ל ותוס' סוכה (מ\"א ע\"א) דהגם שאין בנין בית המקדש דוחה יו\"ט, הני מילי בנין הבנוי בידי אדם, אבל מקדש העתיד שאנו מצפין, בנוי ומשוכלל יגלה ויבא מן השמים עכ\"ל."},{"passage_id":"devurim_6fa39dc2_p10","passage_content":"שוב ראיתי בחת\"ס זלל\"ה (פ' ויקהל) שכתב בשם אחרונים לתרץ קושית הרא\"ש הנ\"ל, שנכתבו הס\"ת מעצמם ע\"י השבעה וכדומה, ע\"כ הותר בשבת, והביא החת\"ס ז\"ל ראי', דהרי אין הקמת המשכן דוחה שבת, ובשבעת ימי המלואים שבת בכלל, והוקם המשכן בכל יום, ואמרז\"ל הובא ברש\"י פ' פקודי עה\"פ ויביאו את המשכן, אמר משה לפני הקב\"ה איך אפשר הקמתו ע\"י אדם, א\"ל עסוק אתה בידך, נראה כמקימו, והוא נזקף וקם מאליו וכו' ממדרש רבי תנחומא עכ\"ל, וע\"כ מוכח דע\"י שהקב\"ה הקימו הותר בשבת, אעפ\"י שנראה כאלו משה הקימו עכ\"ד החת\"ס זלל\"ה."},{"passage_id":"devurim_6fa39dc2_p11","passage_content":"ועוד אפ\"ל שהרי הכתיבה היתה עפ\"י הדיבור, כאמרז\"ל שכל דיבור ודיבור הי' הקב\"ה אומר ומשה אומר וכותב, וא\"כ אין כאן אפי' התחלת קושיא, וכמ\"ש בגמ' חולין (ה' נרא) עה\"פ (מלכים א' י\"ז) והעורבים מביאים לו לחם ובשר בבקר ולחם ובשר בערב, וא\"ר יהודה אמר רב מבי טבחי דאחאב, ותירצו על פי הדיבור שאני, ובלא\"ה נביא מותר לעבור על ד\"ת בהוראת שעה ולמגדר מילתא, וכמ\"ש הרמב\"ם ז\"ל (בפ\"ט מה' יסודי התורה ה\"ג) אם יאמר לנו הנביא, שנודע לנו שהוא נביא, לעבור על אחת מכל מצות האמורות בתורה וכו' לפי שעה מצוה לשמוע לו וכו', והוא שיהי' הדבר לפי שעה, כגון אלי' בהר הכרמל וכו', עכ\"ד הרמב\"ם ז\"ל."},{"passage_id":"devurim_6fa39dc2_p12","passage_content":"ומכ\"ש כאן שהי' עפ\"י הדיבור ממש, ועל כל דיבור ודיבור הי' הקב\"ה אומר ומשה כותב ואומר, גם הי' הכרח בדבר שמשרע\"ה בעצמו יכתוב וישלים התורה לפני הסתלקותו דייקא, ועוד נבאר בזה להלן, ואולי הי' היום הזה מסוגל יותר, ואת הכל עשה ד' יפה בעתו, ולהלן נעתיק דברי האגרא דכלה (פ' נצבים) דמדריגת משה באותו היום, הי' מדריגה היותר גדולה מכל ימי חייו, ומה שלא הי' יכול להשיג כל ימי חייו, השיג ביום ההוא, ונקרא ביום ההוא איש האלהים עכ\"ד ז\"ל, עכ\"פ אין לך מיגדר מילתא גדולה מזו, וקיום כל התורה כולה וקיום העולם תלוי' בזה, ובכה\"ג הותרה עפ\"י נביא לעבור בהוראת שעה, ומכ\"ש עפ\"י הדיבור ממש, ואין כאן אפי' התחלת קושיא."},{"passage_id":"devurim_6fa39dc2_p13","passage_content":"ואפ\"ל עוד טעם פשוט, שהותרה כתיבת הס\"ת אפי' בשבת, מטעם פקוח נפש שדוחה את השבת, דהנה התוה\"ק הוא חיות כל הנבראים וחיות כל ישראל, כמ\"ש כי הם חיינו, וחיות כל העולמות תלוי' בקבלת התורה, כמ\"ש רז\"ל שא\"ל הקב\"ה לישראל, אם מקבלים אתם את התורה מוטב, ואם לאו שם תהא קבורתכם, וכבר הקשו המפרשים דמה מהני הכפי', גם למה הי' צורך בכפי', הלא כבר קבלוה מרצונם, ואמרו נעשה ונשמע, ואפשר דאין זה בדרך עונש וכפי', אבל דרך הטבע ותנאי הבריאה כך הי', דהותנה הקב\"ה עם מעשה בראשית, שאם לא יקבלו ישראל את התורה יחזרו לתהו ובהו, וממילא שם תהא קבורתכם, וכך הושמה בטבע הבריאה מתחילה."},{"passage_id":"devurim_6fa39dc2_p14","passage_content":"והנה ס\"ת שחסר בה אפי' אות א' פסולה, ואין לה קדושת ס\"ת כלל, ואם לא הי' משרע\"ה משלים את התורה לא הי' קיום לכל הנבראים בעולם, והי' חוזר הכל לתהו ובהו, הגם שכתבו התוס' בע\"ז (ג' נרא) על מ\"ש בגמ' שם שמים וארץ נוגעים בעדותן הן, וא\"ת והרי ראי' גדולה שקיימו, שהרי שמים וארץ קיימים הם וכו', ותירצו וי\"ל שהם קיימים ממה שקבלו, כדאמר אם ישראל מקבלים עכ\"ד, מבואר מדבריהם דקבלה לחוד סגי לקיום העולם, אמנם אם לא הי' נשלם התורה, לא הי' הקבלה כלום, שהרי הקבלה הוא רק על תורה השלימה, ואם לאו אינה קבלה כלל, ומעתה היתה כתיבת הס\"ת והשלמתה פיקוח נפש גדול, שתלוי' בזה חיות כל הנבראים, ואין לך פקוח נפש גדולה מזו, ודוחה את השבת בל\"ס."},{"passage_id":"devurim_6fa39dc2_p15","passage_content":"ומעתה ל\"ק עוד קושית התוס' והרא\"ש, דבאמת ז' באדר של אותה שנה היתה בערב שבת, כמ\"ש בסדר עולם, אבל לפי שהשתיק משרע\"ה חמה ולבנה, בשעה שאמר שירת האזינו, ועמדה חמה ל\"ו שעות כמבואר במדרש, וכתב הרמב\"ן ז\"ל (סו\"פ וילך) כי אחר שגמר השירה וילמדה את בנ\"י וכו', כתבה בס' התורה וכו', ועמד ובירך אותם וזאת הברכה וכו', ויכתוב אותה בסוף הספר וכו', ונתנו הספר שלם מצד ארון הברית וכו' עכ\"ל, ואולי כשהשלים התורה כבר הי' שבת, ואעפ\"כ הותר לו מטעם פיקוח נפש, אבל לגבי שנותיו של משה הי' ז' אדר גם בשבת, לפי שעמדה חמה בעבורו, לא עלה לו יום זה במנין הימים כלל, דהי' ההכרח שיסתלק בז' אדר דייקא, שהקב\"ה ממלא שנותיהם של צדיקים מיום ליום, ויום זה שניתוסף לו לא נחשב לו במנין הימים כלל, אבל לכל העולם כולו, וגם לדידי' שבת הי', ואעפ\"כ הותרה הכתיבה מטעם פקו\"נ, ול\"ק קושיתנו הנ\"ל משבת בראשית, שעמדה חמה ל\"ו שעות, ואעפ\"כ נחשב ליום השבת, דכמו\"כ כאן נסתלק משרע\"ה בשבת, וע\"כ אומרים צדקתך צדק בשבת, ואעפ\"כ הותרה הכתיבה מטעם פקוח נפש."},{"passage_id":"devurim_6fa39dc2_p16","passage_content":"ומעתה יבואר שפיר קישור דברי המדרש הנ\"ל, הלכה אדם מישראל שהי' חושש באזנו, מהו שיהא מותר לרפאותו בשבת, כך שנו חכמים כל שספק נפשות דוחה את השבת וכו', הטה אזנך לתורה ואת נוחל חיים, מנין שנא' הטו אזנכם ולכו אלי' שמעו ותחי נפשכם (ישעי' רה) רמ\"ח איברים שבאדם הזה, ע\"י האוזן כולן חיים, מניין שנא' שמעו ותחי נפשכם, ומהיכן את למד, ממשרע\"ה שע\"י שהטה אזנו לתורה וכו' נשתתקו העליונים ותחתונים והאזינו דבריו, מנין ממה שקרינו בענין האזינו השמים ואדברה עכ\"ד המדרש, ולדרכנו כל דברי המדרש מקושרים היטב מתחלתו ועד סופן, שהשתיק משרע\"ה עליונים ותחתונים כשאמר שירת האזינו, ועמדה חמה ולא שקעה עד יום מחר, נמצא כשהשלים ספר התורה, כבר הי' שבת והותרה לו מטעם פקו\"נ כאשר ביארנו לעיל, ולזה מביא המדרש ראי', הטה אזנך לתורה ואת נוחל חיים, ורמ\"ח איברים שבאדם ע\"י האוזן כולן חיים שנא' שמעו ותחי נפשכם, ולכן הותרה מטעם פקו\"נ, שכל חיותנו תלוי' בתורה, ושפיר נלמד מכאן הלכה זו, כל ספק נפשות דוחה את השבת."},{"passage_id":"devurim_6fa39dc2_p17","passage_content":"ואפ\"ל עוד הערה בדברי המדרש הנ\"ל, עפי\"ד המדרש (הובא לעיל בדרוש הקדום) זש\"ה ידעתי כי כל אשר יעשה האלקים הוא יהי' לעולם, עליו אין להוסיף וגו' כך ברא הקב\"ה את עולמו, יום שיהא יום, לילה שיהא לילה, בא יעקב ועשה את היום לילה וכו', בא יהושע ועשה הלילה יום וכו', הרי שהצדיקים גורעים ומוסיפין על דבריו של הקב\"ה וכו', ולכאורה ה\"ז סתירה מני' ובי', דמתחלה הביא הפסוק, כי כל אשר יעשה אלקים עליו אין להוסיף וגו', ואח\"כ מביא הרבה ראיות, דצדיקים גורעים ומוסיפין על מעשיו ית', וכבר פירשנו בזה (עיין לעיל)."},{"passage_id":"devurim_6fa39dc2_p18","passage_content":"ואפ\"ל עוד עפי\"ד האוהחה\"ק (פ' נח) עה\"פ כל רמש אשר הוא חי לכם לאכלה, וז\"ל, יש לדעת למה לא הותר הבשר לאדם אלא לנח, ונראה כי נח משלו נתנו לו, שבאמצעותו מצא הקב\"ה לקיים את המין, וזולתו לא הי' מקיים מן הרמש בלא אדם, ובזה זכה הוא עכ\"ל, כמו\"כ לעניננו שלולא קבלת התורה הי' חוזר העולם לתהו ובהו, ומשרע\"ה על ידו היתה השפעת התורה לישראל, ונמצא שבזכותו ובאמצעותו נתקיים העולם, וע\"כ זכה בה ונעשה כשותף, ובידו לשנות הנבראים כרצונו, וז\"פ המדרש האזינו השמים ואדברה שנשתתקו העליונים ותחתונים כשאמר שירה, ועמדה החמה ולא שקעה, ולכאורה איך אפשר זאת, הלא כל מה שיעשה האלקים, הוא יהי' לעולם עליו אין להוסיף, ע\"כ תירצו במדרש שחיות כל הנבראים תלוים בתוה\"ק, ומשה ע\"י שהטה אזנו לתורה נשתתקו העליונים ותחתונים, שבאמצעותו נתקיים העולם, וזכה בה כדין שותף, ומה שעשה עשוי לשנות בהם כרצונו, ועד\"ז יעקב ויהושע ואלישע שנזכרו במדרש הנ\"ל הי\"ל הכח לשנות במע\"ב מדין שותף, והשי\"ת יזכנו לעשות תשובה שלימה בימים אלו, ונזכה להשפעת קדושה, ונהי' דבוקים בדרך התורה והאמת, ונזכה לשנת גאולה וישועה בהתגלות כבוד שמים עלינו בב\"א."}]},{"dvar_torah_id":"devurim_3487ec58","title":"האזינו השמים ואדברה","summary":"בדרשה זו נדונה מתן תורה מן השמים, והקשר בין פשטות לפנימיות התורה. המדרש מסביר את ההבדל בין דיבור קשה לאמירה רכה, ומדגיש את חשיבות פיקוח נפש בשבת. התורה כוללת גם גשמיים וגם רוחניים, והחיים הנצחיים נלמדים מתוך הכתוב 'וחי בהם'.","contents":[{"passage_id":"devurim_3487ec58_p1","passage_content":"האזינו השמים ואדברה ותשמע הארץ אמרי פי. יל\"ד בשנותו את טעמו מעתיד להווה, ואדברה מורה על העתיד, ואמרי פי על הווה. ותו ואדברה דיבור קשה, ואמרי פי אמירה רכה."},{"passage_id":"devurim_3487ec58_p2","passage_content":"ב) במדרש ילקוט האזינו השמים על שם שניתנה תורה מן השמים, שנאמר אתם ראיתם כי מן השמים וגו', ותשמע הארץ שעליה עמדו ישראל, ואמרו כל אשר דבר ה' נעשה ונשמע, ע\"כ. ולכאורה הוא פלא, דמי אינו יודע שהתורה ניתנה מן השמים, ומה צורך להשמיעני דבר זה, גם אינו מובן הטעם מה צורך לומר האזינו השמים דהרי עכשיו תורה לא בשמים הוא, וכמ\"ש לא בשמים הוא."},{"passage_id":"devurim_3487ec58_p3","passage_content":"ג) במד\"ר הלכה אדם מישראל שהיה חושש באזנו, מהו שיהא מותר לרפאותו בשבת, כך שנו חכמים כל שספק נפשות דוחה את השבת, וזו מכת האוזן אם סכנה היא מרפאים אותה בשבת, רבנן אמרי וכו' אמר הקב\"ה אם הטית אזנך לתורה, כשתבא לפתוח בדברי תורה, הכל משתתקים לפניך וכו', ומהיכן את למד ממשה רבינו וכו', מנין ממה שקרינו האזינו השמים ואדברה וגו', ע\"כ. יש להבין קישור הלכה זו לכאן."},{"passage_id":"devurim_3487ec58_p4","passage_content":"ונל\"פ בהקדם דברי הגמ' (יומא פ\"ה ע\"א) מנין לפקוח נפש שדוחה את השבת וכו', והרבה ילפותות נאמרו בגמ' שם, ולבסוף א\"ר יהודה אמר שמואל אי הואי התם, הוה אמינא דידי עדיפא מדידהו, וחי בהם ולא שימות בהם. אמר רבא לכולהו אית להו פירכא, בר מדשמואל דלית ליה פירכא וכו', אמר רבינא וכו' טבא חדא פלפלתא חריפא ממלא צנא דקרי, ע\"כ. עכ\"פ לפי המסקנא עיקר הלימוד דפיקוח נפש דוחה שבת מהפסוק וחי בהם, דכולהו אחריני אית להו פירכא. ועי' פירש\"י שם."},{"passage_id":"devurim_3487ec58_p5","passage_content":"אולם לכאורה גם לזה יש פירכא, ממה דאיתא בגמרא (חולין קמ\"ב ע\"א) תניא דבי רבי יעקב אומר, אין לך כל מצוה ומצוה שמתן שכרה בצדה, שאין תחיית המתים תלוי' בה, בכבוד אב ואם כתיב (דברים ה') למען יאריכון ימיך ולמען ייטב לך, בשילוח הקן כתיב למען ייטב לך והארכת ימים, הרי שאמר לו אביו עלה לבירה והבא לי גוזלות, ועלה ושלח את האם ולקח את הבנים, ובחזרתו נפל ומת, היכן אריכות ימיו של זה והיכן טובתו של זה, אלא למען יאריכון ימיך לעולם שכולו ארוך, ולמען ייטב לך לעולם שכולו טוב וכו', עכ\"ד הגמ'. נמצאת למד דמה שכתוב והארכת ימים, יתפרש הכונה על ימים של עוה\"ב, יום שכולו ארוך, א\"כ כמו\"כ הכתוב וחי בהם, יתפרש על חיים נצחיים, ואינו מוכרח דרשתם ז\"ל וחי בהם ולא שימות בהם על חיים של עוה\"ז, א\"כ לא נשמע מינה ולא מידי על פיקוח נפש שדוחה שבת, וכמ\"ש השלה\"ק דכל התפלות שמתפללין בימים נוראים זכרנו לחיים, כתבנו לחיים וכו' הכוונה על חיים נצחיים, וכמו\"כ הפסוק וחי בהם יתפרש עד\"ז."},{"passage_id":"devurim_3487ec58_p6","passage_content":"ויתבאר הענין בהקדם מה שחקרו הראשונים לשאול, מדוע לא נתפרשו בתורה כי אם יעודים הגשמיים ושכר העוה\"ז, ויעודים רוחניים אשר הוא תכלית האחרון, והאושר הקנוי אל הנפש לא התבארו בתורה לדעת כל החכמים. והשלה\"ק בקונטרס בית אחרון הביא בזה ג' טעמים, דעת הרמב\"ם ז\"ל ודעת הרמב\"ן ז\"ל ודעת הר\"ן ז\"ל בדרשותיו. והקשה על כולם עיי\"ש. סוף דבר כתב דעת עצמו עפ\"י הקדמה נפלאה, כי כל השמות והתיבות שבתורה ובלה\"ק, הם למעלה בשרשם במקום קודש עליון, וזהו שמם העצם, ואח\"כ כשיורד ומשתלשל ממקום קודש הזה, נקרא זה ההשתלשלות בשם הזה בלשון מושאל, עיי\"ש שהאריך בביאורו, ובזה מבואר חקירת הראשונים הנ\"ל, למה לא נזכרו היעודים הרוחניים בתורה, כי הוזכרו והוזכרו, ואדרבה הם נזכרו בעצם ולא בשאלה, למשל ונתתי גשמיכם בעתם וכו' אלו טפות מימות היורדות, אין שמם גשם בעצם, רק כח ההשפעה שהי' למעלה למעלה בשרשה נקרא גשם, ואח\"כ יורד וכו' ובכל העולמות נקרא גשם בשאלה, אבל הוא ממדריגה למדריגה וכו' וכן ענין כל הבטחות שבתורה, נמצא מבואר שאדרבה שכר הרוחני נזכר בעצם, ובעוד אנחנו גשמיים, מתבארים לנו התיבות גשמיים לפי עניננו, ע\"כ מקצת לשונו עייש\"ד באריכות."},{"passage_id":"devurim_3487ec58_p7","passage_content":"עכ\"פ בתוה\"ק נכלל הכל יעודים הגשמיים שכר עוה\"ז, ושכר הנפש בעולם הנשמות, אלא דפשוטו של מקרא, ה\"ה תיק להתלבש אור התורה באותיות גשמיות, ועפ\"י הלבושים ההם, מורים התיבות על דברים גשמיים ושכר עוה\"ז, והפנימיות שבהם מורים על ענינים רוחניים, וזה שמם העצם. והנה העיקר הוא הפנימיות, וכמ\"ש רב כהנא (שבת ס\"ג ע\"א) כד הוינא בר תמנא סרי שנין, והוה גמירנא ליה לכולי הש\"ס, ולא הוה ידענא דאין מקרא יוצא מידי פשוטו, א\"כ מ\"ש וחי בהם, אף שהכוונה בעיקר על חיים נצחיים בפנימיות התורה, אבל גם הפשטות אמת והתכוין הכתוב גם על חיי העוה\"ז."},{"passage_id":"devurim_3487ec58_p8","passage_content":"ולפי\"ז אתי שפיר, דהנה ע\"י שהתורה ניתנה מן השמים, מוכרח לומר שיש בתורה ענינים פנימיים, דהרי מטעם זה רצו המלאכים לקבל את התוה\"ק, דאם אין בה רק לבושים גשמיים, איך היו רוצין לקבלה הרי לא יצוייר אצלם לא אכילה ושתיה וכו', אלא ע\"כ שכוונתם היה על פנימיות התורה, וממה שאמרו כל ישראל כולם במעמד הנבחר נעשה ונשמע, ראי' שיש בה גם פשטיות, דהרי גם הפשוטי עם שלא הבינו פנימיות התורה ג\"כ אמרו לקבלה, כמ\"ש ויענו כל העם יחדיו ויאמרו כל אשר דבר ה' נעשה וגו' וכן כתוב כה תאמר לבית יעקב ותגיד לבני ישראל וגו', בית יעקב אלו הפשוטי עם, להם יאמר אמירה רכה, ובני ישראל אלו בני עלי', להם ידבר דברים קשים כגידים, דהבני עלי' השיגו גם פנימיות התורה, וראו שקשה להשיגה, ע\"כ הי' להם הדברים קשים כגידים, אבל פשטות התורה להפשוטי עם היה אמירה רכה."},{"passage_id":"devurim_3487ec58_p9","passage_content":"עכ\"פ יהיה איך שיהיה התורה נתנה גם להפשוטי עם, וכמ\"ש ויענו \"כל\" העם יחדיו, וכולם אמרו נעשה ונשמע, והבני עלי' אף שהשיגו פנימיות התורה, מ\"מ קבלו על עצמם גם פשטיות התורה, דאם נאמר שלא קבלו רק הפנימיות, והפשוטי עם רק הפשטיות, א\"כ איך נאמר ויענו כל העם יחדיו וגו' הרי אינן שוין, ועכ\"ח שבפשטות התורה התאחדו כולם, אף בני עלי' שהשיגו בפנימיות התורה, אעפ\"כ גם פשטיות התורה קבלו על עצמם, דהרי אין מקרא יוצא מידי פשוטו, והתוה\"ק נלמד אף בפשטות."},{"passage_id":"devurim_3487ec58_p10","passage_content":"ובזה נבוא אל הענין, ואפשר דהמדרש רוצה ליישב מדוע אצל השמים נאמרה דיבור קשות, ואצל הארץ אמירה רכה, ואמר האזינו השמים ע\"ש שניתנה תורה מן השמים, שנאמר אתם ראיתם כי מן השמים וגו', וכיון שניתנה מן השמים ההכרח לומר שיש בה גם פנימיות התורה, דמהאי טעמא נתאוו לה המלאכים כנ\"ל, מעתה מלת השמים ירמוז על בני עלי' שהם משיגים פנימיות התורה, ומשום הכי אמר אצל השמים ואדברה, לשון קשות, דלהשיג פנימיות התורה קשה מאד. ותשמע הארץ שעליו עמדו ישראל ואמרו כל אשר דבר ה' נעשה ונשמע, דמזה נשמע שגם הפשוטי עם קבלו את פשטיות התורה כנ\"ל, ע\"כ נאמר אצל הארץ אמרי פי, אמירה רכה, דפשטות התורה הוא אמירה רכה."},{"passage_id":"devurim_3487ec58_p11","passage_content":"וא\"ש אומרו ואדברה לשון עתיד ואמרי פי לשון הווה, דהנה פנימיות התורה הוא נצחיית ונשאר לעולמי עד, וכל מה שמעמיקים בה משיגים יותר, עד אין חקר ואין קץ, ע\"כ אמר ואדברה לשון עתיד, שזה ישאר לעתיד והוא נצחי, מה שאין כן פשטיות המורים על גשמיים לא יתקיימו לעולם, דהרי לדבר גשמי יש לה סוף וקץ, ע\"כ אמר אמרי פי לשון הווה או עבר, מפני שאינו נצחיית."},{"passage_id":"devurim_3487ec58_p12","passage_content":"עכ\"פ היוצא לנו מזה, דמכאן נשמע שבתוה\"ק מונח הכל, פשטיות התורה ופנימיות התורה, יעודים גשמיים ורוחניים, ולהכי שפיר נלמד ממ\"ש וחי בהם, ולא שימות בהם, שפיקוח נפש דוחה שבת, דאף שלפי הפנימיות שבתורה כוונת הכתוב וחי בהם על חיים הנצחיים, אבל אין מקרא יוצא מידי פשוטו, ונשמע מינה גם חיי עוה\"ז, שהכל מרומז בה, וא\"ש קישור הלכה זו החושש באזנו מהו שיהא מותר לרפאותו בשבת, לפסוק האזינו השמים ואדברה ותשמע הארץ אמרי פי, דהשמים ירמוז על פנימיות התורה, והארץ על פשטיות התורה והכל נרמז בה, ובכן נשמע שפקוח נפש דוחה שבת, ממ\"ש וחי בהם ולא שומות בהם."},{"passage_id":"devurim_3487ec58_p13","passage_content":"ולפי\"ז מה שאנו מתפללין בכל התפלות על חיים, זכרנו לחיים וכו', אף שעיקר בקשתינו על חיים נצחיים, אבל צריכין גם לחיי העוה\"ז, לכן הכוונה גם בפשטות על חיי עולם הזה. ויעזור השי\"ת שנזכה לחיי העוה\"ז ולחיי העוה\"ב, וננצל מכל צרה וצוקה, ונזכה לשנת גאולה וישועה, ולראות באור פני מלך חיים בקדושה ובטהרה, ובמהרה נזכה לראות בישועת כל ישראל ושמחתן, ובהתרוממות קרן התורה וישראל, ובהתגלות כבוד שמים עלינו בב\"א."},{"passage_id":"devurim_3487ec58_p14","passage_content":"R"}]}]
