[{"dvar_torah_id":"devurim_4ae7c2d7","title":"תוכחת משה לכל ישראל","summary":"משה רבינו כנס את כל ישראל להוכיחם על חטאיהם, כדי למנוע טענות. הוא ביקש לתקן פגמים קודמים, והדגיש את חשיבות התשובה מאהבה. ברכותיו לא היו מוגבלות, אלא נבעו מעבודתו ומרוב אהבתו לישראל.","contents":[{"passage_id":"devurim_4ae7c2d7_p1","passage_content":"אלה הדברים אשר דבר משה אל כל ישראל וכו' יל\"ד דידוע דבכ\"מ שנאמר אלה ממעט ופוסל הקודמין, ומה פוסל הכתוב כאן באמרו אלה הדברים."},{"passage_id":"devurim_4ae7c2d7_p2","passage_content":"ב) גם צ\"ב אמרו אל כל ישראל, והלא כל התורה דיבר משה אל כל ישראל, ומה היתה כוונת הכתוב לפרט כאן, שהדיבור נאמר לכל ישראל."},{"passage_id":"devurim_4ae7c2d7_p3","passage_content":"ג) אל כל ישראל, פרש\"י אילו הוכיח מקצתן, היו אלו שבשוק אומרים, אתם הייתם שומעין מבן עמרם, ולא השיבותם דבר וכו', אילו היינו שם היינו משיבין אותו, לכך כנסם כולם, וא\"ל הרי כולכם כאן, כל מי שיש לו תשובה ישיב, עכ\"ל, ראוי להבין כי בודאי משה רבינו לא לאהבת הניצחון כנסם כולן, רק כל רצונו הי', שיקבלו תוכחתו וישובו על חטאם, וכל כוונתו היתה לש\"ש, וא\"כ מה הרויח במה שכנסם כולם, וממנ\"פ אם יש להם טענה צודקת וניצחת, בלא\"ה לא יקבלו תוכחתו, ואם אין בפיהם מענה להשיב, א\"כ מה לו ולאמירתם, והי' יכול להוכיח גם את מקצתן ואלו שבשוק לא יערערו בלא\"ה על תוכחתו, אחרי שאין להם תשובה נכונה."},{"passage_id":"devurim_4ae7c2d7_p4","passage_content":"ד) במדרש ילקוט אשר דבר משה אל כל ישראל, אילו הוכיח מקצתן היו אלו שבשוק אומרים, כך הייתם שומעין מבן עמרם ולא הייתם משיבין דבר, אילו היינו שם היינו משיבין וכו', דבר אחר אל כל ישראל מלמד שכנסם משה מגדולם ועד קטנם, וא\"ל הריני מוכיחם, כל מי שיש לו תשובה יבוא ויאמר עכ\"ד המדרש, וכתב בזית רענן לכאורה היינו קמייתא, ומאי איכא בין ב' המימרות, מיהו י\"ל דללישנא קמא לא א\"ל משה כלום, אבל ללישנא בתרא א\"ל משה כל מי שיש לו תשובה יבוא ויאמר עכ\"ד הזי\"ר, ראוי להבין דסוף סוף לדברי שניהם כנס משה רבינו את כולם לכוונה אחת, שאם יש להם תשובה יאמרו, וא\"כ מנפק\"מ אם א\"ל בפירוש או לא, ולא מסתבר למימר שזה יהי' כל הפלוגתא שביניהם."},{"passage_id":"devurim_4ae7c2d7_p5","passage_content":"ה) במדרש ילקוט ויהי בארבעים שנה מלמד שלא הוכיחן אלא סמוך למיתה וכו', ומפני ד' דברים אין מוכיחין את האדם אלא סמוך למיתה, כדי שלא יהא מוכיחו וחוזר ומוכיחו וכו', וצ\"ב דאדרבה מן החיוב להוכיח, ולחזור ולהוכיח אם לא יקבל, שהרי אמרה תורה הוכח תוכיח, ודרז\"ל אפי' מאה פעמים."},{"passage_id":"devurim_4ae7c2d7_p6","passage_content":"ו) עוד איתא בילקוט אלה הדברים אשר דבר משה, זש\"ה אומר לרשע צדיק אתה יקבוהו עמים, וכתוב א' אומר ולמוכיחים ינעם, אלא כל מי שיודע שחבירו רשע, ומחניף לו ואומר לו צדיק אתה, ראוי שיבואו עליו כל הקללות שבתורה וכו', אבל מי שמוכיח חברו שיחזור בו נוטל ברכות, שנא' ולמוכיחים ינעם, אותו המתוכח אם קבל עליו וחוזר בו אף הוא מקבל ברכות, שנא' ועליהם תבוא ברכות טוב, עליו תבוא אין כתיב כאן אלא עליהם המוכיח והמתוכח, לכך הוכיח משה את דורו, ומפני שקבלו ממנו קבלו ברכות, שנא' ה' אלקיכם הרבה אתכם וכו' ויברך אתכם וכו' עכ\"ד המדרש. יל\"ד במ\"ש אבל מי שמוכיח חבירו שיחזור בו נוטל ברכות וכו', לכך הוכיח משה את דורו וכו', אתמהה כי בודאי לא הי' כוונת משה ע\"מ לקבל פרס."},{"passage_id":"devurim_4ae7c2d7_p7","passage_content":"ז) ה' אלקי אבותיכם יסף עליכם ככם אלף פעמים ויברך אתכם כאשר דבר לכם, פרש\"י מהו שוב ויברך אתכם וכו', אלא אמרו לו משה אתה נותן קצבה לברכתינו, כבר הבטיח הקב\"ה את אברהם אם יוכל איש למנות וכו', אמר להם משה זו משלי, אבל הוא יברך אתכם כאשר דבר לכם ע\"כ, ראוי להבין אחרי שיברכם ה' בלי קצבה, למה ברכם עוד משה בברכתו, הרי בכלל מאתים מנה, גם מדוע ברכם משה בסכום אלף פעמים לא פחות ולא יותר, ובודאי שיש איזה כוונה במנין האלף, גם צ\"ב מ\"ש משה זו משלי הוא, הלא גם ברכתו של משה מהקב\"ה הוא, שהכל שלו."},{"passage_id":"devurim_4ae7c2d7_p8","passage_content":"ח) במד\"ר איתא אמר ראב\"י להביט בברכתו של משה, יש בה מסוף העולם עד סופו, מה כתיב אלף פעמים, אלף פעם אין כתיב כאן אלא אלף פעמים ע\"כ, לכאורה קשה טובא איך נלמד להם מהפסוק שבברכתו של משה יש בה מסוף העולם עד סופו, הלא בכתוב אינו מבואר רק כמה אלפים לפי דרשתם ז\"ל, אבל שיהא בה מסוף העולם ועד סופו מנין להם לחז\"ל כן, גם יש להבין דא\"כ מה היתה טענתם למרע\"ה, באמרם אתה נותן קצבה לברכתינו הלא נתן להם ברכה בלי קצבה, מסוף העולם עד סופו."},{"passage_id":"devurim_4ae7c2d7_p9","passage_content":"ט) גם יל\"ד דפתח קרא בל' יחיד אלף, וסיים בל' רבים פעמים, ואם כוונת הכתוב לדרשת חז\"ל הנ\"ל, שברכם משה רבינו בהרבה אלפים, היל\"ל אלפים או הרבה אלפים."},{"passage_id":"devurim_4ae7c2d7_p10","passage_content":"י) במדרש (הובא ביש\"מ) ה' אלקיכם הרבה אתכם וגו', זש\"ה אשתחוה אל היכל קדשך ביראתך ע\"כ וצ\"ב."},{"passage_id":"devurim_4ae7c2d7_p11","passage_content":"ואפשר לתרץ כל הנ\"ל בהקדם דברי רשיז\"ל (פ' ואתחנן) עה\"פ לאהביו ולשומרי מצותיו לאלף דור, ולהלן הוא אומר (דברים ה') לאלפים, ותירץ כאן שהוא סמוך אצל לשומרי מצותי העושין מיראה, הוא אומר לאלף, ולהלן שהוא סמוך אצל לאוהבי העושין מאהבה, ששכרם יותר גדול הוא אומר לאלפים עכ\"ל. וכתב האוהחה\"ק כי בודאי שעושה מאהבה אין קץ לשכר מעשיו וכו', ויש בין אוהב לאוהב כפלי כפלים, אלא קטן שבאוהבים כפלים כגדול שביראים עכ\"ל, עכ\"פ מבואר דהקטן שבמדריגת אהבה שכרו אלפים דור, והגדול שבמדריגת יראה שכרו אלף דור. ונקדים עוד קושית המפרשים איך אפשר לברכה זו שתתקיים הלא שיתא אלפי שנין הוי עלמא, ובכולן לא תמצא אף אלף דור, ומכ\"ש כמה אלפים ע\"כ קושייתם, ובפשטות אפ\"ל שהקב\"ה יתן לנו ברכה כפולה ומכופלת, עד ששכר הרבה דורות ינתן לדור א'."},{"passage_id":"devurim_4ae7c2d7_p12","passage_content":"והנה משרע\"ה העניו מכל אדם, לא החשיב את עבודתו, אלא כפי הפחות שבעבודות והיינו העובד מיראה, ולפי\"ז שכרו אלף דור, ומרוב אהבתו לבנ\"י, רצה ליתן להם כל הברכות שמגיעין אליו חלף שכר עבודתו, ולכן ברכם בברכה זו, יוסף עליכם ככם אלף פעמים, דברכה זו מגיע לו חלף עבודתו, לפי מדת ענותנותו, ועתה יובן מה שברכם בברכת האלף דווקא, כי זהו שכרו המגיע לו, וגם יובן משא\"ל זו משלי, הגם שהכל הוא מהקב\"ה, אבל הכוונה שזה מגיע לי חלף עבודתי, ויש בכוחי למסרה לכם."},{"passage_id":"devurim_4ae7c2d7_p13","passage_content":"עוד נקדים מה שפירשתי בדברי רשיז\"ל (פ' חיי), עה\"פ ויהיו חיי שרה מאה שנה ועשרים שנה ושבע שנה, פרשיז\"ל בן ק' כבת כ' וכו', שני חיי שרה כולן שוין לטובה, לכאורה קשה דכבר נלמד שכולן שוין לטובה מההיקש, שנא' שנה בכל כלל וכלל, לומר לך בת ק' כבת כ' וכו', וא\"כ למה כתבה תורה עוד שני חיי שרה לדרוש שכולן שוין לטובה, ואפ\"ל דהנה הצדיקים בזקנותם, משיגים יותר ועובדים עבודתם בבחינה יותר גבוה, ובכל יום משיגים יותר בדרכי עבודת השי\"ת, וא\"כ איך אפשר שיהיו כולן שוין, והתירוץ הוא דצדיקים בעבודתם הרמה, מתקנים ומעלים את שנות הנעורים, כידוע דרך הצדיקים שבכל יום עושים תשובה, ומצטערים על שלא עבדו את הבוי\"ת בהשגה זו, ובכל פעם שתגדל השגתם, מתחרטים על שלא עבדו הבוי\"ת עד הנה בהשגה זו, וע\"י תשובה מאהבה שעושים, מעלים כל אותן העבודות הקודמים אל המדריגה העליונה שעומדים בה כעת בהשגתם הגדולה, דהרי מצינו בדרז\"ל דאפי' זדונות ועבירות יתהפכו לזכיות ע\"י תשובה מאהבה, ומכ\"ש שיש בכח תשובה מאהבה להעלות אותן המצות, וע\"ז כתבה תורה רבוי יתירא שני חיי שרה דכולן שוין לטובה, שהעלתה שרה אמנו כל אותן השנים למדריגה עליונה של עת זקנותה וזה לא היה נשמע מהיקשא דבת ק' כבת כ' לחטא."},{"passage_id":"devurim_4ae7c2d7_p14","passage_content":"והנה מרע\"ה מרוב ענותנותו לא הי' חושב את עבודתו אלא למדריגת יראה, ולכן ברכם בברכת האלף, כמ\"ש יוסף עליכם ככם אלף פעמים, כי זה המגיע לו בשכר עבודתו כנ\"ל, אבל הי' עומד ומצפה, שיגיע עוד למדריגת עובד מאהבה, וגם שיזכה לתקן גם כל אותן השנים שעברו, ויעלה גם אותן למדריגת אהבה, שיהיו כולן שוין לטובה, כ\"ז חשב לפי גודל ענותנותו, והנה אז כשיזכה למדריגת אהבה יהי' שכרו לכה\"פ אלפיים דור, או אם יזכה למדריגה גדולה של אהבה יהי' שכרו כמה אלפים כדברי האוה\"ח הק' הנ\"ל, ומרוב אהבתו לישראל, הי' רצונו ליתן להם כל הברכות שלו, ואף מה שעתיד להשיג אם יתגדל עבודתו, ומעתה יובן מ\"ש להם אלף פעמים, שהתחיל בל' יחיד אלף וסיים בל' רבים פעמים, ולדרכנו א\"ש כי ברכם עתה במה שבידו, ומה שזכה אלי' כבר והוא ברכת האלף, דזהו שכר העובד מיראה, אבל סיים בברכתו פעמים ר\"ל הרבה אלפים, שהי' עומד ומצפה שיתגדל בחי' עבודתו, ואז יתן להם גם שכר הניתוסף לו, ויזכו להרבה אלפים."},{"passage_id":"devurim_4ae7c2d7_p15","passage_content":"ויובן ג\"כ מ\"ש ז\"ל במדרש להביט בברכתו של משה, יש בה מסוף העולם ועד סופו, ולכאורה איך נשמע זאת מברכותיו כקושיתנו הנ\"ל, ולדרכינו יובן דהרי לכך אמר אלף פעמים, מפני שברכם בשכר שעתיד להשיג אם יתגדל מדריגת עבודתו, כפי אשר הי' מצפה אלי', והנה אמרו רז\"ל אפילו בשביל צדיק א' העולם מתקיים שנאמר וצדיק יסוד עולם, נמצא דזכות הצדיק יש בה מסוף העולם ועד סופו, ומרע\"ה ודאי הי' מצפה שיגיע למדריגת צדיק, וכיון דיש הוכחה בקרא במ\"ש אלף פעמים שמסר להם מרע\"ה כל זכותו מה שהשיג כבר, וגם מה שעתיד להשיג, א\"כ א\"ש מ\"ש רז\"ל להביט בברכתו של משה יש בה מסוף העולם עד סופו, שבודאי הי' מתאוה להשיג גם מדריגת צדיק, ואף כח ושכר מדריגה זו מסר להם בברכותיו, שהיא מגעת מסוף העולם ועד סופו כדברי חז\"ל."},{"passage_id":"devurim_4ae7c2d7_p16","passage_content":"והשתא ל\"ק קושיתנו הנ\"ל דהרי אין קצבה לברכותיו כיון שיש בה מסוף העולם ועד סופו (עיין קושיא י\"א), ולדרכינו א\"ש דמה שברכם עתה בברכת האלף, הוא מה שבידו והשיג כבר, וברכה זו יש לה קצבה, ומה שיש בברכותיו מסוף העולם ועד סופו, ברכה זו הי' תקותו שיזכה אלי' ויתננה להם אח\"כ, וזו היתה טענתם של ישראל במ\"ש אתה נותן קצבה לברכותינו וא\"ש, ומתורץ ג\"כ קושיא הנ\"ל דהלא בכלל מאתיים מנה, ומה צורך בברכותיו אחרי שיברכם ה', אבל לדרכינו יונח, דברכה זו שברכן משלו, היא ודאית שכבר מגיע אליו כן כפי עבודתו, אבל ברכת ה' יחול עליהן כפי זכותן ורק אם יזכו אלי', וא\"ש שהי' צורך לברכם גם משלו."},{"passage_id":"devurim_4ae7c2d7_p17","passage_content":"ולדרכנו אפ\"ל ביאור המדרש הנ\"ל המובא ביש\"מ, זש\"ה אשתחוה אל היכל קדשך וגו', דלפי דרכינו למדנו מברכותיו של משה, שמפני כך ברכם בברכת האלף, מפני שלא החשיב א\"ע אלא כעובד מיראה, ונתן להם כל שכרו המגיע אליו, זש\"ה אשתחוה אל היכל קדשך ביראתך, שגם דוד החשיב א\"ע רק כעובד מיראה, וכן הוא דרך הצדיקים ובזה יובן ג\"כ ברכת מרע\"ה והבן."},{"passage_id":"devurim_4ae7c2d7_p18","passage_content":"והנה איתא בש\"ך עה\"ת, שבאמת היו ישראל יכולין להשיב למרע\"ה, כלום עשינו כל אלו החטאים שאתה מוכיחנו, והרי אותו הדור שעשו את כל זאת כבר מתו, ומרע\"ה דיבר לבניהם בסוף מ' שנה, ולא הי' אף א' מאותו הדור קיים, וכן איתא במד\"ר (פ\"א סי\"ג) אר\"א יכולין היו ישראל לומר לו, רבינו משה אנו יש בנו אחד מכל הדברים שאתה מוכיחנו וקבלנו תוכחותיך, אלא שתקו לפיכך הוא אומר יוסף עליכם ככם, צדיקים כיוצא בכם, מקבלים תוכחות ושותקים עכ\"ד המדרש, ולכאורה יש להבין אחרי שהם לא חטאו כלום, ואותו הדור שחטאו כבר מתו, א\"כ באמת למה הוכיחן משרע\"ה בחטאים אלה שלא עשו ותירץ בש\"ך עה\"ת דכל אלו שמתו במדבר באו בגלגול עוה\"פ, ונתקנו ע\"י בניהם, ואותו הדור שדיבר משה אליהם התוכחות, הם היו גלגולי נשמות מאותן שעשו אלו החטאים והם ידעו בעצמן ושתקו עכת\"ד, וכיו\"ב כתב האוהחה\"ק שכלל במאמר אל כל ישראל, גם לאותן שכבר מתו, שבתוכחותיו דבר אל הראשונים ואל האחרונים, ע\"ד אומרו אביך הראשון חטא עכ\"ד, ולפי\"ז הוכיחן משרע\"ה לתקן מה שפגמו בעבירות שעשו בגלגול הקדום, וגם לתקן פגם הנשאר מחטא אדם הראשון, וכמ\"ש האוהחה\"ק אביך הראשון חטא כי עדיין לא נשלם התיקון בזה."},{"passage_id":"devurim_4ae7c2d7_p19","passage_content":"ואפשר שזהו מאה\"כ אלה הדברים אלה פוסל את הראשונים, שפסל כל אלו התיקונים שעשו עד הנה, והוכיחן לתקן פגמים אלו בשלימות, או אפשר לומר אלה פוסל את הראשונים, כי זהו תכלית התוכחה לפסול המעשים הקודמים, ולעזוב דרך החטא כי עיקר התשובה הוא להכיר במעשיו הלא טובים, ולעזוב אותם עזיבה עולמית, ולכן כשהוכיחם פסל את מעשיהם הראשונים."},{"passage_id":"devurim_4ae7c2d7_p20","passage_content":"והנה מה שכנס מרע\"ה את כל ישראל, והוכיח את כולן כאחד, אפ\"ל בפשטות כיון דלא הוי כולהו בכלל החטא, דאף בדור הקדום לא עשו כל ישראל את כל אלו החטאים רק מקצתן, ואלו הוכיח את מקצתן, היו יכולין לטעון טענת אמת, אנו אין בנו מכל אלה החטאים, שהרי לא כולם חטאו, אבל עתה שכנס את כל ישראל כאחד, ובכללן היו גם אלו שחטאו בערבה ובחצירות וכו', ואף שהם בעצמם לא חטאו אבל היו גלגולי נשמות מאותו הדור שחטאו כדברי הש\"ך הנ\"ל, עכ\"פ אחר שכנס את כל ישראל כאחד, לא הי' להם עוד טענה לדחות דברי תוכחתו, דהרי עכ\"פ היו ביניהם החוטאים, מקצתן בחטא זה ומקצתן בחטא אחר, והם השיגו וידעו סיבת גלגוליהם כדברי הש\"ך הנ\"ל."}]},{"dvar_torah_id":"devurim_b0fd2459","title":"","summary":"","contents":[{"passage_id":"devurim_b0fd2459_p1","passage_content":"עוד אפ\"ל טעם על שכנס מרע\"ה את כולן לפניו, דאילו הוכיח מקצתן, לא היו אותן שבשוק מקבלים תוכחתו, דבאמת הרי הם לא חטאו, אלא שהוכיחן מרע\"ה לתקן פגמי נפשם מה שחטאו בגלגולם הקודם כנ\"ל, ואפשר שמקצתן לא היו מקבלים תוכחתו, כי לא היו כולן במדריגה זו, שירגישו בפגם הנפש, ולהשיג הצורך בתקון זה, אחרי שהם לא עשו חטאים אלו בפועל, אמנם ע\"י שכנסם כולן לפניו, וע\"י קדושתו הרמה של משרע\"ה ניתוספה בהם כח קדושה, והרגישו בפגם ההוא, ובהצורך לתקן את זה, וע\"ד שפירשו בספה\"ק מאמר הגמ' לגבי משה יראה מילתא זוטרתא הוא, דהיינו אותו הדור שהיו עם מרע\"ה ובחבורתו, הזריח עליהם מאור קדושתו של מרע\"ה, ואצלם יראה מילתא זוטרתא הוא, וכמו\"כ כאן ע\"י שכנסם כולן לפניו, ניתוספה בהם קדושה והרגישו בפגמי נפשם, ועי\"ז קבלו את תוכחתו. ובזה מתורץ מה שהקשינו לעיל בדברי רש\"י ז\"ל אלו הוכיח מקצתן, היו אלו שבשוק אומרים וכו', לכך כנסם כולן וכו', ולכאורה קשה ממנ\"פ אם יש להם טענה צודקת בלא\"ה לא יקבלו תוכחתו, אבל לדברינו א\"ש דע\"י קדושת מרע\"ה שכנסם כולן בחבורתו, עי\"ז ניתוספה בהם קדושה וקבלו תוכחתו, ובלא\"ה אולי לא היו מקבלים, וזה שפרש\"י אלו שבשוק לא היו מקבלים תוכחתו, ולדרכנו נבין ב' הפירושים שבילקוט הנ\"ל ומאי ביניהם, דלפי' הא' לא אמר להם כל מי שיש לו תשובה יבוא ויאמר, ואפ\"ל דאה\"נ שלא קבלו תוכחתו בלב שלם, אחרי שבאמת הי' להם טענה צודקת, שהם לא עשו אלו העונות בפועל, אלא שלא ערערו כנגדו מצד הנימוס והד\"א, או לצד יראתם ממרע\"ה, ולפירוש הב' שא\"ל מרע\"ה כל מי שיש לו תשובה יבוא ויאמר, ואעפי\"כ לא הי' בהם אף א' שהשיב, אלא שתקו כולם, זהו ראי' שקבלו תוכחתו בלב שלם, כמ\"ש במדרש שא\"ל משרע\"ה צדיקים כיו\"ב, מקבלים תוכחות ושותקים, שהבין מרע\"ה בדעתם שקבלו את תוכחותיו בלב שלם."}]},{"dvar_torah_id":"devurim_9741e3d2","title":"תוכחת משה וברכות לישראל","summary":"משה רבינו כנס את כל ישראל להוכיחם, מתוך אהבה ורצון להעניק להם ברכות רבות. תוכחתו נועדה לתקן פגמים ולזכות את כל הדור, אף שלא כולם חטאו, והדברים נאמרו ברמז מתוך כבוד לישראל.","contents":[{"passage_id":"devurim_9741e3d2_p1","passage_content":"עוד אפ\"ל שלכך כנס משה את כל ישראל, עפי\"מ שבארנו לעיל, דמרוב אהבתו לישראל, רצה ליתן להם כל שכרו המגיע לו בשכר מצותיו, והנה מבואר בילקוט הנ\"ל דמי שמוכיח את חבירו נוטל ברכות, והברכות האלו שיקבל משרע\"ה עבור התוכחה, רצה ליתנם ג\"כ לישראל, אבל מפני שהי' רצונו להגדיל את שכרם שיקבלו ברכות הרבה, לכך כנס את כל ישראל, וכולן יקבלו את תוכחתו וחוץ ממה שיקבלו שכרן עבור קבלת התוכחה, עוד יתן להם כל הברכות שישיג משרע\"ה עבור זה, ומעתה יהיו ברכותיו מרובים כי יהי' בידו זכות תוכחת כל ישראל, וכ\"ז התכוין לטובת בנ\"י, שכל ישראל ישיגו את אלו הברכות, וכדי שישיגו ברכות הרבה והבן."},{"passage_id":"devurim_9741e3d2_p2","passage_content":"ומעתה מבוארים היטב דברי הילקוט הנ\"ל, אלה הדברים וכו', זש\"ה ולמוכיחים ינעם וכו', כל המוכיח חבירו שיחזור בו נוטל ברכות וכו', המוכיח והמתוכח וסיום המדרש לכן הוכיח משה את דורו, ולכאורה וכי הי' טעמו של מרע\"ה בשביל קבלת השכר בתמי' ולהנ\"ל א\"ש קישור דברי המדרש, אלה הדברים וכו' אל כל ישראל, שלכן כנס משרע\"ה את כל ישראל להוכיחן כולם אף שלא היו כולם בכלל החטא זש\"ה ולמוכיחים ינעם וכו' כל המוכיח חבירו נוטל ברכות, ומרע\"ה רצה ליתן לבנ\"י אלו הברכות ולהרבות בברכות, לכך כנס לכל ישראל, וזה פירוש לכן הוכיח משה את דורו ר\"ל כל הדור וכל ישראל, אע\"פ שלא כולם היו בכלל החטא כנ\"ל."},{"passage_id":"devurim_9741e3d2_p3","passage_content":"ומה שהקשינו לעיל בדברי רש\"י ז\"ל שהוכיחן משרע\"ה סמוך למיתה כדי שלא יהא מוכיחן וחוזר ומוכיחן, ולכאורה הרי אמרה תורה הוכח תוכיח, ודרז\"ל אפי' ק' פעמים, אמנם חיוב זה הוא רק בשעת מעשה ולאפרושי מאיסורא, אבל כאן שהוכיחן על מה שעשו בגלגול הקדום כנ\"ל בש\"ך, וכדי לתקן פגמי נפשיהם מחטא אדה\"ר כדברי האוהחה\"ק הנ\"ל, ע\"כ בכגון הא לא הי' מן החיוב להוכיחן כ\"פ, ולכן לא הוכיחן רק סמוך למיתה."},{"passage_id":"devurim_9741e3d2_p4","passage_content":"ובזה אפשר להבין דברי רשיז\"ל בתחלת הפרשה, שכתב לפיכך סתם את הדברים, והזכירם רק ברמז מפני כבודן של ישראל ע\"כ, והקשה הגו\"א אע\"ג דמעשה העגל ומרגלים כתיב לקמן, והזכירן בפירוש ולא ברמז, ומדוע לא חש גם שם לכבודן ישראל, ותירץ התם שאני שאינו מזכיר אלא אחד אחד, ואינו מזכיר כל החטאים יחד, ואין צדיק בארץ אשר יעשה טוב ולא יחטא, ע\"כ אין זה לפחיתות כבודם כ\"כ, אבל כאן שהזכיר כל החטאים שחטאו וכו', מפני כבודן של ישראל אינו מזכירן אלא ברמז עכ\"ד. ולכאורה אין תירוצו מספיק כ\"כ, כי אחר שכתבן משה רבינו במשנה תורה, א\"כ נכללו כל החטאים ונזכרו כהדדי, ואין זה לכבודן של ישראל, ולדרכינו אפ\"ל, מפני שדיבר מרע\"ה כאן לכל ישראל, גם לאותן שמתו כבר כדברי האוהחה\"ק הנ\"ל, וכבר תיקנו החטאים האלו במקצת, בגילגולם הקדום, אלא שפסל את התיקונים הקודמים כנ\"ל, והוכיחן שיתקנו פגמי נפשם בשלימות, לכן חש על כבודם יותר והוכיחן רק ברמז, אבל מה שנצטרפו כל החטאים יחד אחר שכתבן בספר, אין זה לפחיתות כבודם כ\"כ אחרי שלא נאמרה כן בפניהם."}]},{"dvar_torah_id":"devurim_87e1414e","title":"תוכחות משה לישראל על העבר והעתיד","summary":"משה רבינו מוכיח את ישראל על חטאיהם בעבר, ומבאר את הסיבות לכך. הוא מדגיש את חשיבות הבחירה החופשית של ישראל, ואת הקושי במציאת הלכה ברורה בדורות מאוחרים, כאשר השפעות חיצוניות מערבבות את התורה.","contents":[{"passage_id":"devurim_87e1414e_p1","passage_content":"אלה הדברים אשר דבר משה אל כל ישראל וגו', במדרש איתא אמר להם משה לישראל, איני מוכיח אתכם על מה שאתם עתידים לעשות, אלא על מה שעשיתם לשעבר, במדבר בערבה מול סוף עכ\"ד המדרש, וצ\"ב דמה\"ת שיוכיחם על העתיד לעשות, דעדיין תליא בבחירתם, גם דכל הרמזים כבר היו, א\"כ מבואר בכתוב שעל העבר הי' מוכיחם ומה קמ\"ל."},{"passage_id":"devurim_87e1414e_p2","passage_content":"ב) ודי זהב, פרש\"י ז\"ל הוכיחן על העגל שעשו בשביל רוב זהב שהי' להם וכו', יל\"ד שהרי חטא העגל קדם בזמן לפני שילוח מרגלים ומחלקותו של קרח, שהי' מיד אחר מ\"ת, ומדוע בסדר המקרא נכתב באחרונה, והרי קיי\"ל דבחד ענינא מאי דמוקדם מוקדם ומאי דמאוחר מאוחר, וא\"א לומר בחד ענינא אין מוקדם ומאוחר בתורה דאל\"כ כלל ופרט היכי דרשינן לי', דלמא פרט וכלל הוא, כדאמרי' בגמ' (פסחים ו' ע\"ב) וכאן דחד ענינא הוא, הו\"ל להקדים חטא העגל."},{"passage_id":"devurim_87e1414e_p3","passage_content":"ג) בספרי (הובא ברש\"י ז\"ל) לפי שהן דברי תוכחות, ומנה כאן כל המקומות שהכעיסו לפני המקום, לפיכך סתם את הדברים, והזכירם ברמז מפני כבודן של ישראל, והקשו המפרשים מדוע לא חש כמו\"כ לכבודן של ישראל בפרשיות הבאות, ומצינו שהזכיר חטאם של ישראל בפירוש ובאר היטב, באמור להם ממרים הייתם וגו', ובחורב הקצפתם וגו', וכבר בארנו בזה ועוד לאלקי מילין."},{"passage_id":"devurim_87e1414e_p4","passage_content":"ד) הבו לכם אנשים חכמים ונבונים וידועים לשבטיכם, פרש\"י הבו לכם הזמינו עצמכם לדבר, וכן פרש\"י בכ\"מ דכל לשון הבה הזמנה לדבר הוא, וראוי להבין מה צורך להזמנת העם, בדבר מניית הדיינים, גם צ\"ב במ\"ש רש\"י ז\"ל וידועים לשבטיכם שהם ניכרים לכם, שאם בא לפני מעוטף בטליתו איני יודע מי הוא, ומאיזה שבט הוא ואם הגון הוא, אבל אתם מכירין בו שאתם גדלתם אותו, לכך נאמר וידועים לשבטיכם, והוא פליאה נשגבה, דהרי משרע\"ה הי' יודע ומכיר פנימיותו של כאו\"א ברוה\"ק, כמ\"ש רש\"י ז\"ל (פ' יתרו) עה\"פ ואתה תחזה מכל העם אנשי חיל יראי אלקים וגו' פרש\"י ואתה תחזה ברוח הקודש שעליך, ואיך יעלה על הדעת שהי' צריך בזה לסיוע העם, שהם יכירו וידעו מהותו יותר ממנו, גם שכל ספיקותיו הי' נמלך ושואל מפי הגבורה, כמ\"ש רש\"י ז\"ל (פ' בהעלותך) עה\"פ עמדו ואשמעה מה יצוה ד' לכם, אשרי ילוד אשה שכך מובטח וכו', וקמי שמיא גליא כל תעלומות, ומה צורך לו לידיעת העם שהם עלולים לטעות."},{"passage_id":"devurim_87e1414e_p5","passage_content":"ולבאר הענין נקדים דברי הגמ' (שבת קל\"ח ע\"ב) ת\"ר כשנכנסו רבותינו לכרם ביבנה, אמרו עתידה תורה שתשתכח מישראל, שנא' הנה ימים באים נאם ד' וגו', ישוטטו לבקש דבר ד' ולא ימצאו, דבר ד' זו הלכה, דבר ד' זה הקץ, דבר ד' זו נבואה, תניא רשב\"י אומר, ח\"ו שתשתכח תורה מישראל, שנא' כי לא תשכח מפי זרעו, אלא מה אני מקיים ישוטטו לבקש דבר ד' ולא ימצאו, שלא ימצאו הלכה ברורה ומשנה ברורה במקום אחד עכ\"ד הגמ', ויל\"ד מ\"ש דבר ד' זה הקץ, ומדוע תלה העלמתו בימים הבאים, שעתידה תורה שתשתכח, וישוטטו לבקש דבר ד' ולא ימצאו, הלא הקץ הי' סתום וחתום מאז ומעולם, כמבואר בדניאל סתום וחתום הדברים, ויעאע\"ה ביקש לגלות את הקץ ונסתלקה ממנו שכינה, ומבואר בזוה\"ק שאמר הקב\"ה לליבא גליתי לפומא לא גליתי."},{"passage_id":"devurim_87e1414e_p6","passage_content":"גם צ\"ב בדברי רשב\"י מ\"ש, ח\"ו שתשתכח תורה מישראל וכו', אלא שלא ימצאו הלכה ברורה וכו', והרי ג\"ז שכחת התורה, דעיקר התורה ללמוד ע\"מ לעשות, ואם לא ימצאו הלכה ברורה, לא ידעו לקיים מצות המעשיות, גם קשה אם לא תשתכח התורה, מדוע לא ימצאו הלכה ברורה ורש\"י פי' שלא ימצאו הלכה ברורה בטעמים, שלא יהא בה מחלוקת עכ\"ל, וצ\"ב דהלא מאז ומעולם הי' מחלוקת בין חכמי התורה בבירור ההלכה, ואמרז\"ל (חגיגה ג' ע\"ב) בעלי אסופות אלו ת\"ח, שיושבין אסופות אסופות ועוסקין בתורה, הללו מטמאין והללו מטהרין, הללו אוסרין והללו מתירין וכו', שמא יאמר אדם האיך אני לומד תורה מעתה, ת\"ל כולם נתנו מרועה אחד, א-ל אחד נתנן, פרנס אחד אמרן, מפי אדון כל המעשים ברוך הוא וכו', אף אתה עשה אזנך כאפרכסת וקנה לך לב מבין, לשמוע את דברי מטמאין ודברי מטהרין וכו', א\"כ כבר דרשו רז\"ל מקרא, דאף דורות הראשונים הי' להם מחלוקת בהלכה, ואעפ\"כ אם תשים אזנך כאפרכסת, לשמוע דברי חכמים, תקנה לך לב מבין לברר ההלכה, ומה נשתנו בזה דור העתיד שלא ימצאו הלכה ברורה מפני המחלוקת, גם צ\"ב הלשון שלא ימצאו הלכה ברורה במקום אחד משמע דבשני מקומות ימצאו הלכה ברורה, ומה ענין שינוי המקום לבירור ההלכה, ורש\"י פי' הלכה ברורה בטעמים, שלא יהא בה מחלוקת, וצ\"ב הכוונה במ\"ש בטעמים, ודבר ידוע דלפעמים סיבת המחלוקת תליא בהבדל הטעמים, ומה צורך לבאר זה, וסגי שיאמר שלא ימצאו הלכה ברורה, ואין נפק\"מ אם יהי' המחלוקת בטעמים או בקבלה."},{"passage_id":"devurim_87e1414e_p7","passage_content":"ונקריב עוד לבאר דברי הגמ' חגיגה הנ\"ל, הללו מטמאין והללו מטהרין הללו אוסרין וכו' שמא יאמר אדם האיך אני לומד תורה מעתה, ת\"ל כולם נתנו מרועה אחד, א-ל אחד נתנן ופרנס א' אמרן וכו', וצ\"ב דאדרבה ה\"ז מכביד את הספק כיון שכולם ממקום קדוש יהלכון, ואלו ואלו דברי אלקים חיים, מנין ידע האדם להכריע באיזה מהם יבחר, ואין בזה תירוץ על התחלת המאמר, שמא יאמר אדם האיך אני לומד תורה מעתה, אמנם האמת הברור שבודאי יש דרך בכל מחלוקת בהלכה, להגיע אל האמת ולמצוא הלכה ברורה, ע\"י כללא דאחרי רבים להטות, או כללים אחרים המקובלים בידינו מרז\"ל, ועי\"ז באים צדדי החולקים לידי השוואה, כאמרז\"ל את והב בסופה, וכמו שהי' בימי חכמי הש\"ס ובכל דורות ישראל, אולם תנאי יש בדבר, שיהיו כל הדיעות כולן מרועה אחד ניתנו, כמ\"ש בגמ' רועה א' א-ל אחד פרנס אחד מפי אדון כל המעשים, ושינוי הלשונות ירמוז שכל הבחינות שיש בהענין, לא יהי' מצורף בהן שום השפעה צדדית מאיזה צד שהוא, אלא כל הדיעות באים רק מהשפעת התוה\"ק, שהוא השפעת אלקית, לא זולת כלל וכלל, ואז מצטרפין כל הדיעות ויוצא מהם הלכה ברורה, כי כולם ממקור אחד באים, לכוין רצון הבורא ב\"ה לאמיתה של תורה, משא\"כ בדור פרוץ, וחכמי התורה המה תשושי כח, ויראת העם עליהם, אין כל הדיעות ממקור אחד ופרנס א', אלא ערבוביא גדולה יש בהם, מדעות כל הצבור ומפלגות שונות, המשפיעים על העם ועל המנהיגים, ועל מצב דור כזה, דרש רשב\"י הנה ימים באים ישוטטו לבקש דבר ד' ולא ימצאו, שלא ימצאו הלכה ברורה במקום אחד, ר\"ל שלא יבואו הדיעות ממקום אחד, שהוא הרועה אחד ופרנס אחד, אלא מהשפעת הרבים התועים מדרך האמת, ומי יורה דיעה ומי יבין שמועה."},{"passage_id":"devurim_87e1414e_p8","passage_content":"ומ\"ש רשב\"י ח\"ו שתשתכח תורה מישראל וכו' אלא שלא ימצאו הלכה ברורה וכו', ולכאורה הכי יש שכחת התורה גדולה מזו, ואם לא ימצאו הלכה ברורה, איכה ידעו את המעשה אשר יעשון, ועיקר התורה למצותי' ניתנה, אמנם כבר הורו לנו רז\"ל עצה טובה איך להתנהג בדור כזה, והוא מ\"ש רש\"י ז\"ל בשה\"ש, עה\"פ אם לא תדעי לך היפה בנשים צאי לך בעקבי הצאן, פרש\"י זו היא תשובת הרועה, אם לא תדעי לך להיכן תלכי וכו', שחדל הרועה מלהנהיג אותך, צאי לך בעקבי הצאן, הסתכלי בפסיעות דרך שהלכו הצאן, והעקביים ניכרים וכו', התבונני בדרכי אבותיך הראשונים, שקבלו תורתו ושמרו משמרתי ומצותי, ולכי בדרכיהם עכ\"ל רש\"י ז\"ל, וז\"ש רשב\"י ח\"ו שתשתכח תורה מישראל, שנאמר כי לא תשכח מפי זרעו, וזה הבטחה לנו מהבוי\"ת, שכ\"ז שנתייחס לזרעם ונילך בעקבותיהם, לא תשתכח התורה מישראל לעולם, אבל ההולך ללמוד דרך התורה מאותו הדור שא\"א למצוא בו הלכה ברורה, ודאי בא לידי שכחת התורה."},{"passage_id":"devurim_87e1414e_p9","passage_content":"ומ\"ש רש\"י ז\"ל שלא ימצאו הלכה ברורה בטעמים שלא יהא בה מחלוקת, אפ\"ל שהוסיף מלת בטעמים, דהנה יש עצה למצוא דרך האמת בהלכה, ע\"י שנסתכל בעקבות הראשונים ונלך בדרכיהם, אמנם גם על זה יש התנגדות היצר, וע\"י שלוחיו המסיתים תולה מציאות ההלכה בטעמים, ועי\"ז מוצא מקום לחלק בין הנושאים, לומר שנשתנו הטעמים, וטעם שהי' נוהג בימיהם אינו נוהג בזמננו, ושוב חזרה המבוכה למקומה, ולא ימצאו הלכה ברורה בטעמים, דלא יכלו לכוין הלכה ברורה בטעמים של אמת, ויתלו ההלכה בטעמים בדויות, לומר לא הרי זה כהרי זה, ופרשתי אמרם ז\"ל אם הרב דומה למלאך ד' צבאות יבקשו תורה מפיהו, ואם לאו אל יבקשו תורה מפיהו, עפימ\"ש ז\"ל אם הראשונים כמלאכים אנו כבני אדם, ואם הרב דומה להם, שרוצה להתדמות למעשיהם ולילך בעקבותיהם אזי יבקשו תורה מפיהו, ואם לאו שאינו רוצה להיות דומה להם, אלא אומר נשתנו העתים ונשתנו הטעמים, אז אל יבקשו תורה מפיהו."},{"passage_id":"devurim_87e1414e_p10","passage_content":"ומ\"ש רז\"ל שלא ימצאו דבר ד' זו הקץ, אין כוונתם על התגלות זמן הקץ, שדבר זה לא ידעו מעולם, אולם מעולם בכל דורות ישראל ידעו חומר האיסור של דחיקת הקץ, ועד היכן הדברים מגיעים, להיות נשמר מקץ של שקר בכל אופן ואופן, גם ידעו הסימנים הברורים, כמ\"ש הרמב\"ם בהלכותיו, שא\"א לגאולה בלתי אם יקדים אליה התשובה, גם א\"א להיות הגאולה מבלי שיקדים אליהו הנביא לבוא ולבשר, ועוד סימנים ברורים המבוארים בדברי רז\"ל, וזה ודאי שא\"א בלא תורה, וכל פעולה שהוא ע\"י מסיתים ומדיחים ובעקירת התורה ר\"ל, ודאי שזה מרחיק את הקץ, ולזה מתאונן הנביא ואמר הנה ימים באים וגו' ישוטטו לבקש דבר ד' ולא ימצאו, ודרשו רז\"ל דבר ד' זו הקץ, שגם בזה יהיו נבוכים, ע\"י שיהי' סמיות העינים גדול כ\"כ, שימצאו יהודים המאמינים בבורא עולם ובתוה\"ק, ויטעו ג\"כ בענין הקץ, אוי לדור שכך עלתה בימינו."},{"passage_id":"devurim_87e1414e_p11","passage_content":"וכתב בספה\"ק אגרא דכלה (פ' בא) לפרש דברי המדרש, החודש הזה לכם ראש חדשים, הה\"ד (שה\"ש ב') קול דודי הנה זה בא וכו', מיד גילו הצדיקים את ראשיהם שהי' מכוסה, שנא' הנצנים נראו בארץ וכו', וז\"ל בכל דור יש גדולים עד למאוד, ויכולים לפעול פעולות נוראות נסים ונפלאות, רק אם הדור אינו ראוי, הצדיקים הללו מדריגתם מכוסה ואין יודע מהם, כמ\"ש רז\"ל יצאה בת קול יש בכם אחד ראוי שתשרה עליו שכינה כמשה רבינו, אלא שאין דורו זכאי לכך, ובהגיע תור הגאולה אותן הצדיקים שהיו ראשיהם מכוסה, מתגלים ונראים עיי\"ש שפי' הכתוב עפ\"י דרכו, וכמו\"כ יש בכל דור חכמי התורה אמיתיים, היודעים לכוין ההלכה לאמיתה של תורה, ומן השמים מסכימים להוראתם, ובדורות הראשונים היו ידועים לכל, ועל ידם נתבררה ההלכה ועשו כמעשיהם, אולם בדור שאין זכאי, האור והחושך משתמשים בערבוביא, והסמיות עינים גדלה מאוד, והחכמים האמיתיים מדריגתם מכוסה, ואין יודע ומכיר האמת עם מי, ושאינם ראויים מתלבשים באצטלא דרבנן שאינה הולמתם, ועי\"ז א\"א למצוא הלכה ברורה, כי אין יודעין על מי לסמוך, ומי ראוי לצרף דעתו למנין הרוב, שיהי' דעת תורה אמיתית מרועה אחד א-ל אחד ופרנס אחד, מהשפעה אלקית בלבד בלי תערובת ונגיעת השפעה אחרת."},{"passage_id":"devurim_87e1414e_p12","passage_content":"ובזה יל\"פ דברי רשיז\"ל, הבו לכם אנשים חכמים ונבונים וידועים לשבטיכם, הבו לכם הזמינו עצמכם לדבר, וידועים לשבטיכם שהם ניכרים לכם וכו', דצריך לזה דור ראוי וזכאי, שיהיו מנהיגי ישראל האמיתיים ניכרים וידועים, ולא יתדמו אל המתעטף בטלית שאינו שלו, כי הוא הראוי לסמוך על הנהגתו והוראתו, וע\"כ פי' הבו לכם הזמינו עצמכם לדבר, כי זה תליא בהזמנת הדור והכשר מעשיהם כנ\"ל, ומ\"ש משרע\"ה שאם בא לפני מעוטף בטליתו איני יודע מי הוא וכו', ואם הגון הוא, ולכאורה איך יתכן שמשרע\"ה לא ידע, וישראל ידעו יותר ממני, והרי ידע הכל ברוה\"ק, אמנם השפעת הנבואה על הנביאים בא רק בשביל ישראל, כמ\"ש רש\"י ז\"ל (דברים ב') עה\"פ ויהי כאשר תמו כל אנשי המלחמה וגו' וידבר ד' אלי לאמר, ללמדך שכל ל\"ח שנה שהיו ישראל נזופים, לא נתייחד עמו הדבור וכו', ללמדך שאין השכינה שורה על הנביאים אלא בשביל ישראל, ומבואר כן במדרשי חז\"ל בכ\"מ, ומעתה אם אין הדור ראוי לכך, ונעלמה מהם ידיעה זו ע\"צ העונש, לא יתגלה אף לנביאים, שאין השכינה שורה עליהם אלא בשביל ישראל, ולז\"א להם משרע\"ה הזמינו עצמכם לדבר, ותכשרו מעשיכם, שיהיו מנהיגי ישראל ידועים לכם, דאל\"כ לא תוכלו לסמוך גם על נבואתי, ויתעלם גם ממני, ואם בא לפני מעוטף בטליתו איני יודע מי הוא, או אפשר דמפני שהוא ע\"צ העונש להדור, אף משרע\"ה לא יוכל לגלות להם אף שידע, זולת אם יכשרו מעשיהם ויהיו ראויים לכך, ולז\"א הבו לכם הזמינו עצמכם לדבר."},{"passage_id":"devurim_87e1414e_p13","passage_content":"ובדרך אגב נ\"ל לבאר פסוקי אפטרתא דפ' זו, בענין שופטי ומנהיגי ישראל שמתאונן הנביא, שריך סוררים וחברי גנבים, כולו אוהב שוחד ורודף שלמונים וגו', לכן נאם האדון ד' צבאות אביר ישראל, הוי אנחם מצרי ואנקמה מאויבי, ואשיבה ידי עליך, ואצרוף כבור סיגיך, ואסירה כל בדיליך, ואשיבה שופטיך כבראשונה ויועציך כבתחילה אחרי כן יקרא לך עיר הצדק קריה נאמנה, ויש מפרשים שזו נבואה על חורבן בית ראשון, אמנם נראה מדברי הגמ' שזו נבואה על לעתיד ימות המשיח, דאיתא בגמ' (שבת קל\"ט ע\"א) אין הקב\"ה משרה שכינתו על ישראל, עד שיכלו שופטים ושוטרים רעים מישראל, שנאמר ואשיבה שופטיך כבראשונה וגו', ובסנהדרין (צ\"ח ע\"א) אין בן דוד בא עד שיכלו כל שופטים ושוטרים מישראל שנא' ואשיבה שופטיך וגו', מבואר דקרא נדרש על ימות המשיח."},{"passage_id":"devurim_87e1414e_p14","passage_content":"אמנם יל\"ד בשינוי הלשונות בב' מאמרים אלו, דבגמ' שבת איתא עד שיכלו שופטים ושוטרים רעים מישראל, ובגמ' דסנהדרין עד שיכלו \"כל\" שופטים ושוטרים מישראל, דמשמע שלא ישארו מהשופטים והשוטרים של אותו זמן כלל, אלא שיחזיר השי\"ת לנו השופטים הראשונים הצדיקים, כמו שדרשו מהפסוק ואשיבה שופטיך כבראשונה, ובאמת מהפסוק אין לנו הכרח, דאפשר לפרש ואשיבה שופטיך כבראשונה, שהשופטים של אותו זמן יתעלו במדריגתם וצדקתם כמו השופטים הראשונים, ואפשר דמ\"ש כל שופטים וכו', כל לאו דוקא דרובו ככולו, ואותם שיבחנו להיות כשרים וראויים ישארו, ועוד יתעלו במדריגתם להיות כראשונים, וז\"פ ואשיבה שופטיך כבראשונה, ואותן שאינם ראויים יכלו, ובמקומם ישיב הקב\"ה השופטים הראשונים."},{"passage_id":"devurim_87e1414e_p15","passage_content":"וק\"ז הישמח משה זלה\"ה דקדק על מ\"ש ויועציך כבתחלה, הלא אין צריך ליועצים, רק בעת שמתנהג בטבע, אז תשועה ברוב יועץ, משא\"כ כשהקב\"ה השגחתו ויכלתו בלי כסוי טבע, אין מבוא לחכמה וכו', וא\"כ לעתיד שיתגלה כבוד ד' לעין כל, מה צורך ליועצים, וכן קשה מאוד על תפלתינו בשמ\"ע, ויועצינו כבתחלה, דהלא בקשה זו על העתיד ולמה זה, ע\"כ קושיתו עיי\"ש שתי' עפ\"י דרכו, ולי נראה לתרץ עפ\"י פשוטו, דאיתא בגמ' (מגילה י\"ז ע\"ב) וכיון שנתקבצו גליות, נעשה דין ברשעים, שנאמר ואשיבה שופטיך כבראשונה, וכיון שנעשה דין מן הרשעים, כלו הפושעים וכולל זדים עמהם וכו', וכיון שכלו הפושעים מתרוממת קרן הצדיקים וכו', והיכן מתרוממת קרנם בירושלים, ועפי\"ז סידרו חז\"ל י\"ח ברכות בשמ\"ע על סדר הזה עיי\"ש, מבואר שבעת שישיב הקב\"ה שופטינו כבראשונה, עדיין יהיו הרשעים והזדים בעולם, ואח\"כ נעשה דין ברשעים ע\"י השופטים הצדיקים ויכלו הפושעים, וא\"ש בקשתינו על היועצים, דכ\"ז שיש מינים וזדים בעולם, צריכים אנו ליועצים צדיקים, איך להנצל מרשת המינות."},{"passage_id":"devurim_87e1414e_p16","passage_content":"עוד יל\"ד בסדר הכתוב, ואצרוף כבור סיגיך ואסירה כל בדיליך ואשיבה שופטיך כבראשונה, ולפי סדר הגמ' יהי' מקודם שיבת השופטים, ואח\"כ נעשה דין ברשעים ויכלו הפושעים, ואפ\"ל דהנה לפי סדר הגמ' יהי' בנין ירושלים באחרונה אחר התרוממות קרן הצדיקים, וקבוץ גליות יוקדם הרבה כמבואר, ולהיכן יתקבצו הגליות, אם לא יהי' עוד ירושלים בנוי', אמנם נראה מהפסוקים ומדברי רז\"ל, שיתקבצו ישראל אל מדבר העמים, כמו שהי' בצאתם ממצרים (והראב\"ד סו\"פ ב' דעדיות האריך לבאר ענין זה עיי\"ש), ושם יהי' הבירור ומי שיזכה יתקרב, ומי שאינו ראוי ח\"ו ידחה, ושיבת השופטים וכליון הפושעים וזדים הכל יהי' שם, ואח\"כ והי' בנין ירושלים, וכן נראה ממטבע הברכה שתקנו חז\"ל בשמ\"ע מקבץ נדחי עמו ישראל, ולא אמרו לא\"י או לירושלים, מפני שהקבוץ גליות יהי' למדבר העמים ולא לא\"י, ואחר שיכלו הפושעים יהיה בנין ירושלים ולא קודם לכן."},{"passage_id":"devurim_87e1414e_p17","passage_content":"ולפי\"ז אפ\"ל דמ\"ש הכתוב ואצרוף כבור סיגיך ואסירה כל בדיליך, אין הכוונה בו על כליון הפושעים והזדים, דזה יהי' אחר ואשיבה שופטיך כמבואר בגמ', אולם הכוונה בו על אותן הראוים להתברר ולהתקרב אל הקדושה, יסיר הקב\"ה מקרבם הסיגים, ויצרף אותם כמצרף הכסף, להסיר הבדיל שהוא העופרת וישאר כסף נקי וטהור, וכמ\"ש רז\"ל שאליהו עתיד לקרב את הרחוקים, ולהחזיר כל ישראל לתשובה, ואותן שאינם מזרע ישראל, אלא שנתערבו בבנ\"י ע\"י הערב רב, כמ\"ש בזוה\"ק (בראשית כ\"ה ע\"א) חמש מינין אינון בערב רב, ואינון נפילים גבורים ענקים רפאים עמלקים, ועלייהו אתמר תמחה את זכר עמלק, ומלחמה לד' בעמלק מדר דור, כל אלו יתרחקו וידחו עולמית, אלא שמקודם יתקיים ואשיבה שופטיך כבראשונה וגו', ואח\"כ יכלו הפושעים והזדים עמהם, ובזה יובן סדר הכתובים בהתאם לדרשת רז\"ל."},{"passage_id":"devurim_87e1414e_p18","passage_content":"ונקדים עוד דברי האוהחה\"ק (בר\"פ זו) וז\"ל ורמז עוד באמרו אל כל ישראל, פי' לא לישראל שהיו נמצאים נגלים שם בדור ההוא לבד היו הדברים, אלא לכל ישראל אשר שם היו ואשר עתידין להיות, כי תורה שם משה בדבריו עליונים אלו על כל ישראל, לקיים כל דבר הכתוב בדברים אלה עכל\"ק, ובאמת שמאמר אלה הדברים אשר דבר משה אל כל ישראל, קאי על כל משנה תורה עד סופו, ובשירת האזינו מפורש בדברי הרמב\"ן ז\"ל שהיא כוללת כל העתידות עד סוף כל הדורות, וכך הזכירו בספרי, גדולה שירה זו שיש בה עכשיו, ויש בה לשעבר, ויש בה לעתיד לבא, ויש בה בעוה\"ז ויש בה לעוה\"ב, א\"כ כל התוכחות שאמר משרע\"ה, יש בהם רמז תוכחה עד סוף כל הדורות."},{"passage_id":"devurim_87e1414e_p19","passage_content":"ועד\"ז יתבאר במאמר ודי זהב, שפרש\"י ז\"ל הוכיחן על העגל שעשו בשביל רוב זהב שהי' להם וכו', ולא נזכר בפירוש חטא העגל בפסוק, מפני שיש בו רמז תוכחה גם לדורות האחרונים, שבעוה\"ר רוב פירצות הדור באים בשביל רוב זהב, ובסיבת תאוות הממון שמסמא את העינים מלראות דרך האמת, וא\"ש שנחשב באחרונה, אף שחטא העגל קדמה לשילוח המרגלים ומחלקותו של קורח כקושייתנו לעיל, אמנם מפני שתוכחה זו נוהגת עד סוף כל הדורות, וגם בעיקבתא דמשיחא עדיין עגל הזהב מרקד בינינו, ע\"כ הזכירו באחרונה, ומה\"ט הזכיר משרע\"ה כל החטאים אלו רק ברמז, מפני שיש רמז בדבריו גם לעתיד עד סוף כל הדורות, ועדיין תליא בבחירתן של ישראל, ע\"כ לא יתכן להזכירם בפירוש, ובהכרח הזכירם ברמז, ונכלל בהם העבר והעתיד שניהם כאחד, ולהלן בפרשיות הבאות שהזכיר החטאים בפירוש אולי שם סובבים דבורי תוכחתו לאותו הדור בלבד, מה שכבר עשו, ע\"כ הזכירם בפירוש."},{"passage_id":"devurim_87e1414e_p20","passage_content":"והנה אותו הדור היו דור דיעה, והשיגו שנרמז בדברי משרע\"ה תוכחה עד סוף כל הדורות, ע\"כ הוצרך משרע\"ה לומר להם, איני מוכיח אתכם על מה שעתידים לעשות, אלא על מה שעשיתם כבר, במדבר בערבה מול סוף, ר\"ל דאף שירמזו דברי תוכחתי לדורות הבאים, וכוונתי בזה בשביל דורות ישראל העתידים, שאף המה ימצאו תוכחה בדברים אלו, אבל אתכם אני מוכיח על מה שעשיתם כבר, וגם זה רמוז באלה הדברים, וא\"ש דברי המדרש הנ\"ל (בקושיא א')."}]},{"dvar_torah_id":"devurim_58bfa2b2","title":"הקדמת משה לתורה וללשונות","summary":"דקדוקי הכתוב ב'אלה הדברים' מורים על פיסול הראשונים, וההבנה כי משה באר את התורה בשבעים לשון היא הכנה לעתיד. המדרש מדגיש את חשיבות התוכחה וההבדל בין דברי משה לבלעם, והצורך בהעתקת התורה לאומות כדי למנוע פתחון פה.","contents":[{"passage_id":"devurim_58bfa2b2_p1","passage_content":"אלה הדברים אשר דבר משה אל כל ישראל וגו', דקדקו המפרשים דכ\"מ שנא' אלה פוסל את הראשונים, ומה פסל כאן באומרו אלה, ובספרי הקשו כן וכי לא נתנבא משה אלא אלו הדברים בלבד, והרי כתב כל התורה שנאמר ויכתוב משה את התורה הזאת, ומה ת\"ל אלה הדברים עכ\"ד הספרי, גם אלה הדברים מיותר דהול\"ל וידבר משה אל בנ\"י כדרך הכתוב בכ\"מ, וממילא ידעינן שאלה הם הדברים אשר דבר משה, ומה צורך להקדמה זו, גם אל כל ישראל ל\"ל, והרי כל התורה דיבר משה אל כל ישראל."},{"passage_id":"devurim_58bfa2b2_p2","passage_content":"ב) גם יל\"ד שהתחיל הכתוב אלה הדברים אשר דבר משה וגו', מבלי שיודיע לנו זמן הדיבור אימת היתה, ואח\"כ גמר אומר ויהי בארבעים שנה בעשתי עשר חדש בא' לחדש דבר משה וגו' אחרי הכותו וגו' בעבר הירדן בארץ מואב הואיל משה וגו', הרי ציין סימן מקום וזמן בפרטיות, ולכאורה הו\"ל להתחיל ויהי בארבעים שנה וגו' דבר משה אל בני ישראל וגו' והכל בכלל, ומ\"ט חילקם הכתוב לתרי בבות, כאלו הי' אלה הדברים אשר דבר משה ענין בפ\"ע, ואח\"כ מתחיל ענין חדש ויהי בארבעים שנה וגו'."},{"passage_id":"devurim_58bfa2b2_p3","passage_content":"ג) במד\"ר (ר\"פ זו) אלה הדברים, הלכה אדם מישראל מהו שיהא מותר לו לכתוב כדת בכל לשון וכו', כך שנו חכמים אין בין ספרים לתפילין ומזוזות, אלא שהספרים נכתבין בכל לשון, ר\"ג אומר אף הספרים לא התירו שיכתבו אלא יונית וכו', אמר הקב\"ה ראה לשונה של תורה מה חביבה שמרפא את הלשון, מנין שכן כתיב (משלי ט\"ו) מרפא לשון עץ חיים, ואין עץ חיים אלא תורה וכו', ר\"ל אמר מה לנו ללמוד ממקום אחר, נלמוד ממקומו, הרי משה עד שלא זכה לתורה, כתיב בו לא איש דברים אנכי, כיון שזכה לתורה נתרפא לשונו והתחיל לדבר דברים, מנין ממה שקרינו בענין אלה הדברים אשר דבר משה עכ\"ד המדרש, וצ\"ב קישור הלכה זו לכאן, גם איך יתקשר עם המאמר שלאחריו, ראה לשונה של תורה מה חביבה שמרפא את הלשון, גם יל\"ד שהביא ראי' שנתרפא לשונו של משרע\"ה מפסוק זה אלה הדברים וגו', והרי כל התורה דיבר משה אל כל ישראל, וכמו\"כ איכא למילף דבר זה מכל התורה, ומה עדיפא ראי' זו ללמוד מכאן דייקא."},{"passage_id":"devurim_58bfa2b2_p4","passage_content":"ד) במד\"ר ד\"א אלה הדברים זש\"ה (משלי כ\"ח) מוכיח אדם אחרי, חן ימצא ממחליק לשון וכו', מוכיח זה משה, אדם אלו ישראל וכו', מהו אחרי אמר הקב\"ה בשביל להביאן אחרי, חן ימצא זה משה וכו', ממחליק לשון זה בלעם שהחליק בנבואותיו וגבה לבם ונפלו בשיטים עכ\"ד המדרש, וצ\"ב דאף לפי דרשתם ז\"ל מלת אחרי מיותר, ויספיק שיאמר הכתוב מוכיח אדם חן ימצא, וכמה פעמים נזכר תוכחה בתוה\"ק, ולא אמר אחרי, ומובן מאליו שתכלית התוכחה להביאן אחרי הקב\"ה."},{"passage_id":"devurim_58bfa2b2_p5","passage_content":"ה) גם צ\"ב ממחליק לשון זה בלעם, שהחליק בנבואותיו וגבה לבם ונפלו בשיטים, והלא כל פ' בלעם הוא חלק מתוה\"ק, ונבואה אמיתית על לעתיד, והשי\"ת שם בפיו כל מה שידבר, ואיך יובן שזה גרם כשלון לישראל לתעות מדרך ד', גם צ\"ב מה שדרשו ז\"ל חן ימצא זה משה ממחליק לשון זה בלעם, וכי זהו שבחו של משרע\"ה שדבריו ימצאו חן יותר מדברי בלעם, ואינם בגדר הדמיון כלל, עד שיצטרך להבדיל ביניהם."},{"passage_id":"devurim_58bfa2b2_p6","passage_content":"ו) במסורה הובא בבעה\"ט, הואיל משה באר את התורה הזאת, ואידך כי הואיל ד' לעשות אתכם לו לעם, הואיל הלך אחר צו ע\"כ וצ\"ב."},{"passage_id":"devurim_58bfa2b2_p7","passage_content":"ז) הואיל משה באר את התורה הזאת, פרש\"י התחיל כמו הנה נא הואלתי עכ\"ל, ולכאורה צ\"ב ענין התחלה זו, והלא מני אז שהוריד התורה לישראל אחר מ\"ת, הי' תמיד מפרשה ומלמדה לישראל, כאמרז\"ל כיצד סדר משנה וכו', ומה טיבה של התחלה זו, גם מה ענינה אל דברי תוכחה שהתחיל בה וצ\"ב הקישור, והרמב\"ן ז\"ל פי' טעם הואיל משה, שרצה לבאר להם את התורה, והזכיר כן להודיעם כי מעצמו ראה לעשות כן, ולא צוהו השם בזה וכו' עכ\"ל, גם התוכחות נראה מדברי רש\"י ז\"ל שמשה מפי עצמו אמרן, שהרי כתב ממי למד מיעקב שלא הוכיח את בניו אלא סמוך למיתה, ואם נאמר שנצטוה מפי הקב\"ה להוכיח את ישראל, אין מקום לשאלה זו ממי למד, אמנם הקשה הרא\"ם ז\"ל שהרי מפורש בכתוב ככל אשר צוה ד' אותו אליהם. הרי שנצטוה על ככה מפי הגבורה, וכבר ביארנו בזה ועוד לאלקי מילין."},{"passage_id":"devurim_58bfa2b2_p8","passage_content":"ונבוא אל הביאור לפרש דברי המדרש שהתחלנו בו, הלכה אדם מישראל מהו שיהא מותר לכתוב ס\"ת בכל לשון וכו', ונקדים דברי הגמ' (סוטה ל\"ה ע\"ב) ג' מיני אבנים היו, אחד שהקים משה בעבר הירדן בארץ מואב, שנא' בעבר הירדן בארץ מואב הואיל משה באר את התורה הזאת וגו', ולהלן הוא אומר וכתבת עליהן את התורה הזאת וגו', ואתיא באר באר, ואחד שהקים יהושע בתוך הירדן וכו', וא' שהקים בגלגל וכו', ת\"ר כיצד כתבו ישראל את התורה (פרש\"י על המזבח בהר עיבל) ר' יהודה אומר ע\"ג אבנים כתבוה, שנא' וכתבת על האבנים את כל דברי התורה הזאת וגו', ואח\"כ סדו אותן בסיד, א\"ל ר' שמעון לדבריך האיך למדו אומות של אותו הזמן תורה (פרש\"י הלא לא נצטוו לכותבה בשבעים לשון, אלא לבא וללמדה כל הרוצה, שלא יהא פ\"פ לאותם האומות, לומר לא הי' לנו מהיכן ללומדה), אמר לו בינה יתירה נתן בהם הקב\"ה, ושיגרו נוטירין שלהם וקילפו את הסיד והשיאוה, ועל דבר זה נתחתם גזר דינם לבאר שחת, שהי' להם ללמד ולא למדו עכ\"ד הגמ', והתוס' כתבו בשם הירושלמי דמעשה נסים הי', שנתן הקב\"ה בינה בלב כל אומה ואומה, והשיאו את התורה שהי' כתובה בע' לשון, הרי מפורש להדיא שהטעם שכתב משרע\"ה את התורה בע' לשון על האבנים שבהר עיבל, מפני אומה\"ע שילמדו ממנו, ולא יהי' להם פתחון פה."},{"passage_id":"devurim_58bfa2b2_p9","passage_content":"והנה כאן פרש\"י בעבר הירדן בארץ מואב הואיל משה באר את התורה הזאת וגו', בשבעים לשון פירשה להם, והרא\"ם כתב דיליף לי' מגז\"ש באר באר מהאמור בהר עיבל, ולכאורה צ\"ב לאיזה צורך ביאר משה את התורה בעבר הירדן לשבעים לשון, והרי לימדה לבנ\"י לבד, כמשה\"כ אלה הדברים אשר דבר משה אל כל ישראל, ומה צורך להם לע' לשון, ויספיק להם הלימוד בלה\"ק כמו שלמדם עד הנה."},{"passage_id":"devurim_58bfa2b2_p10","passage_content":"ובלבוש כתב שעד עכשיו ביאר להם הכל בלה\"ק, ועכשיו התחיל לבאר אותה להם בלשונות אחרים, כי חשש אולי אינם כולם בעלי לשון הקודש ולא הבינוהו כולם, דודאי עם רב כזה שהם יותר מס' רבוא, יש בהם בעלי לשונות הרבה, לכך אמר רש\"י בשבעים לשון וכו' דהי מנייהו מפקת, שמא מאותו לשון שישאר שלא לפרש יש בהם, והם לא יבונהו עכ\"ד, אמנם קשה דלפי דבריו גם באבנים דהר עיבל, הי' ר' יהודה יכול לפרש דלצורך ישראל כתבוה בע' לשון ולא יקשה עליו קושית ר' שמעון לדבריך האיך למדו אומות של אותו הזמן תורה, דמאן יימר שהי' להם ללמוד, דלמא כל עיקר לצורך ישראל העתיקוה לע' לשון, וכמו שביאר להם משרע\"ה התורה בעבר הירדן לע' לשון."},{"passage_id":"devurim_58bfa2b2_p11","passage_content":"ועוד קשה דאם בשביל ישראל היה צורך לבאר התורה בע' לשון, מפני שהי' בהם בעלי לשונות אחרים ולא הבינו את התורה בלה\"ק, הי' לו לבאר להם התורה בע' לשון מיד אחר מתן תורה, כדי שיוכלו לעסוק בתורה גם אותן שאינם בעלי לה\"ק, דמבואר במכילתא (פ' בשלח) דהטעם שנתעכבו ישראל במדבר, כדי שיהא התורה נבללת בגופן, דלא ניתנה תורה אלא לאוכלי המן, ומדוע המתין משרע\"ה עד א' בשבט בסוף מ' שנה, שלא נשארו עוד כ\"א ל\"ו יום עד מיתת משרע\"ה, כמ\"ש במדרש אלה בגי' ל\"ו, ואיך למדו ישראל תורה עד עכשיו, גם לא מסתבר שידעו ישראל שבעים לשון, שהרי יצאו ממצרים למדבר ומי למדם לשונות ואף אם ת\"ל שהי' ביניהם שלא ידעו לה\"ק כ\"א לשון העמים, אבל לא הי' צורך בכל הע' לשון, דלא שייך לומר הי מנייהו מפקת, כיון שהי' הכל עפ\"י ציווי ה', כמשה\"כ ככל אשר צוה ד' אותו אליהם, וידע משרע\"ה ברוה\"ק מה הם הלשונות אשר צריך לבאר להם, וא\"א לומר כדברי הלבוש דמשום ספיקא דהי מנייהו מפקת הוצרך לבאר להם בע' לשון, דספיקא קמי שמיא ליכא, והדרא קושיא לדוכתי' מה צורך הי' לבאר להם התורה בע' לשון."},{"passage_id":"devurim_58bfa2b2_p12","passage_content":"גם צ\"ב מ\"ש בגמ' שם שכתבו את התורה ע\"ג האבנים, ואח\"כ סדו אותן בסיד, ובינה יתירה נתן הקב\"ה בלב האומות וקילפו את הסיד והשיאוה, ובירושלמי כתבו דמעשה נסים הי', לכאורה מדוע הי' צורך לנס, כיון שבלא\"ה הי' הצורך שיקלפו את הסיד, כדי שלא יהא להם פתחון פה לומר לא הי' לנו מהיכן ללומדה, א\"כ מה צורך הי' לסודם בסיד ואח\"כ לקלפו ע\"י בינה יתירה ובדרך נס, האמנם מי יבוא בסוד ד' ומאוד עמקו מחשבותיו ית', מ\"מ צריך טעם לקרבו אל השכל קצת."},{"passage_id":"devurim_58bfa2b2_p13","passage_content":"ונל\"פ כי באמת לא למדו ישראל בע' לשון, ומה שהעתיק משרע\"ה את התורה בע' לשון לא בשבילם הי', שהרי מצינו ביוסף הצדיק שהי' מופלג בחכמה על כל השבטים, וכל מה שלמד יע\"א משם ועבר מסר לו, ובת\"א ארי בר חכים הוא לי', ואעפ\"כ לא ידע בע' לשון, ואמרז\"ל בגמ' סוטה (ל\"ו ע\"ב) בא גבריאל ולימדו שבעים לשון, לא הוה קגמר, (ר\"ל שלא השיגן אף אחר שלמדו גבריאל) הוסיף לו אות א' משמו של הקב\"ה ולמד, שנא' עדות ביהוסף שמו וגו', וסמיך לי' שפת לא ידעתי אשמע עכ\"ד הגמ', ופירשתי מדוע הוסיף לו הקב\"ה אות ה' דייקא, גם לא מצינו שנקרא בתורה להלאה בשם יהוסף, ומדוע באברהם שהוסיף לו הקב\"ה אות ה' על שמו, נקרא משם ואילך בשם החדש ולא אהדרי' קרא לקראו בשם אברם, וביעקב דאהדרי' קרא מ\"מ נקרא גם בשם ישראל, ומדוע ביוסף לא נקרא בשם זה עוד כלל וטעמא בעי."},{"passage_id":"devurim_58bfa2b2_p14","passage_content":"ואפ\"ל עפימ\"ש רז\"ל מנחות (כ\"ט ע\"ב) מפני מה נברא העוה\"ז בה\"י מפני שדומה לאכסדרה, שכל הרוצה לצאת יצא פרש\"י שכל הרוצה לצאת לתרבות רעה יוצא, שניתנה הבחירה, ומ\"ט תליא כרעי', דאי הדר בתשובה מעיילי לי' וכו' עיי\"ש, והנה לימוד לשונות העמים הוא סיבה הגורמת לצאת מהשפעת הקדושה לתרבות רעה ר\"ל, דהמשתמש בהם ולומדם, נשפע מדעותיהם הנובע מכח ע\"ז, ואפשר דע\"כ הוסיפו לו אות ה\"י דייקא ללמדו ע' לשון, כי באות ה' כלול כח יניקת ע' האומות, שאם ירצו לצאת מניחין אותם, ובזה נתנו לו מכח ע' אומות שיוכל להשיג לשונם, ומה\"ט לא נקרא עוד בשם זה, כי לא השתמש בזה רק לפי שעה ולצורך."},{"passage_id":"devurim_58bfa2b2_p15","passage_content":"ופירשתי במאמה\"כ הנמצא כזה איש אשר רוח אלקים בו שדקדק האוהחה\"ק דהול\"ל הנמצא איש אשר רוח אלקים בו כזה, ועו\"ק מנין ידע להחליט שלא נמצא כזה, והרי הי' יע\"א שהי' רוח אלקים בו, ולא ידע בו פרעה באותה שעה, וכמו\"כ אפשר שיש עוד במציאות, ואפ\"ל הכוונה שאף אם נמצא עוד בעולם איש אשר רוח אלקים בו זולתו, אבל שיהי' כזה מלומד בתכסיסי מלוכה, ויודע בע' לשון וגם רוח אלקים בו, זה בודאי לא נמצא, כי להשיג ידיעת לשונות העמים א\"א, רק ע\"י לימוד בספריהם המלאים מינות וע\"ז, ולא ימלט שלא יהי' נשפע מדיעותיהם, ואין במציאות שיהי' עוד רוח אלקים בו, ויוסף השיג ידיעת הלשון בדרך נס, ע\"י שלמדו גבריאל והוסיף לו הקב\"ה אות ה' ולא נמצא כן באחר זולתו."},{"passage_id":"devurim_58bfa2b2_p16","passage_content":"עכ\"פ נראה דבר ברור שלא למדו דור המדבר לשונות העמים, ולא הוצרך העתקת התורה לע' לשון בשבילם, כ\"א בשביל האומה\"ע שלא יהא להם פ\"פ, כמבואר בגמ' סוטה הנ\"ל, דמה\"ט כתבוהו להם על האבנים בהר עיבל, ומה שהוצרך משרע\"ה עכשיו בארץ מואב לבאר את התורה בע' לשון, ולא יספיק להם כתיבתו בהר עיבל, אפ\"ל דלא הי' ראוי לזה כ\"א משרע\"ה בלבד, ולא הי' אפשר להיעשות ע\"י זולתו."},{"passage_id":"devurim_58bfa2b2_p17","passage_content":"דהנה המעתיק פי' המשניות להרמב\"ם, כתב בהקדמתו לס' זרעים וז\"ל, חכמי כל אומה הסכימו, כי אין לאדם להעתיק ספר עד ידע ג' דברים, סוד הלשון אשר יעתיק מגבולי', וסוד הלשון אשר הוא מעתיק אליה, וסוד החכמה אשר הוא מפרש מליה, הכוונה בזה דנוסף על ידיעת ב' הלשונות צריך שידע המעתיק בעומק החכמה שהוא מפרש מליה, כי בהעתק מלשון אל לשון, רוב פעמים לא ימצא המלות מקבילות ומתאימות בב' הלשונות כאחד, ואם לא ישיג בעומק החכמה ההיא, לפעמים יאבד המכוון בחילוף הלשונות, כאשר יורק מלשון אל לשון, והאריך בזה הר\"י אבן תיבון בהעתקתו לס' חובת הלבבות עיי\"ש, וידוע מפי הנסיון כי עפ\"י רוב, העתקות כאלה לא נמלטו משגיאות, וחלו בהם שינויים בהכרח."},{"passage_id":"devurim_58bfa2b2_p18","passage_content":"ועכ\"פ ברור בהחלט שאם רוצים להעתיק התורה מלה\"ק ללשון העמים, מוכרח שישיג המעתיק לשון התורה ועומק חכמתה על בורי', והנה מי יוכל להתפאר באלה, ואף הראשונים והתנאים ואמוראים מחולקים בכ\"מ בהבנת הכתובים, זה אומר בכה וזה אומר בכה, ואלו ואלו דברי אלקים חיים כפי המקובל להם בתורה שבעל פה איש מפי איש עד משרע\"ה, אמנם לאומה\"ע לא ניתנה תושבע\"פ, והעתיקו להם רק תורה שבכתב, ואין מקרא יוצא מידי פשוטו, וכיון שרצה הבוי\"ת ליתן להם הבחירה, שיהיה בידם ללמוד ולא ימצאו פתחון פה, בהכרח שינתן להם העתקה אמיתית ושלימה, ולא הי' במציאות בעולם מי שיכול להעתיק התוה\"ק לע' לשון לאמיתו זולת משרע\"ה."},{"passage_id":"devurim_58bfa2b2_p19","passage_content":"ומעתה אפ\"ל שמה שבאר משרע\"ה בעבר הירדן את התורה לע' לשון, הי' הכנה על העתיד, דכשיעברו ישראל את הירדן, יצטוו להעתיק להם התורה בע' לשון על האבנים בגלגל, ואין מי שיהי' בכח השגתו להעתיקו לאמיתה של תורה כמשרע\"ה, שנתעצם בעצמות התוה\"ק יותר מכל הנבראים שבעולם, ואין מי שישיג חכמת התורה ולשון התורה כמוהו, ובפרט מי שיודע בע' לשון כבר נאבד ממנו דעת אמיתי בחכמת התורה, ע\"י שנשפע מדעת ע\"ז שמקושר בלשונם, ואפשר שגם משרע\"ה לא ידע בע' לשון עד אותה שעה, אלא שלצורך השעה למדוהו מן השמים, כמו שלמד גבריאל ליוסף הצדיק, ממילא לא הי' אפשר שתיעשה ע\"י זולתו בעברם את הירדן, ולכן הואיל משה באר את התורה הזאת בע' לשון בסוף הארבעים לפני מותו, כדי שימצא ביד ישראל העתקה אמיתית שיצטרכו אליה בעברם את הירדן."},{"passage_id":"devurim_58bfa2b2_p20","passage_content":"והנה בתוס' שם (סוטה ל\"ה ע\"ב) ד\"ה ועל דבר זה נתחתם גז\"ד לבאר שחת, הקשו וא\"ת תיפוק ליה דבשעת מתן תורה החזירה הקב\"ה על כל אומה ולשון ולא קבלוה, וי\"ל דעונש זה גדול הוא, שלאחר שהיתה כתובה בידם ולא רצו ללמוד, ומיהו תימה והאמר בפ\"ק דע\"ז (דף ב' ע\"ב) דעדיין יש להן פתחון פה שיאמרו כלום כפית עלינו הר כגיגית כישראל, וכל זמן שיש להם פתחון פה. איך נתחתם גזר דינם, ע\"כ קושיתם ולא תירצו כלום, ונ\"ל דל\"ק, וטענת אומה\"ע אינה טענה, דאיתא בתנחומא (פ' נח ס\"ג) דהכפי' הי' רק על תושבע\"פ, אבל תורה שבכתב קבלו ישראל מיד, ואמרו נעשה ונשמע, משא\"כ האומה\"ע נתחתם גזר דינם על שלא רצו לקבל תורה שבכתב, דתושבע\"פ מעיקרא לא רצה הקב\"ה לגלות להם, כדרשתם ז\"ל (ילקוט הושע ח') עה\"פ אכתוב לכם רובי תורתי כמו זר נחשבו, ומעתה אין להם פתחון פה, כלום כפית עלינו הר כגיגית כישראל, דתושב\"כ קבלו ישראל בלי כפי' והבן."},{"passage_id":"devurim_58bfa2b2_p21","passage_content":"ובסוף מגילת תענית אמרז\"ל, בח' בטבת נכתבה התורה יונית בימי תלמי המלך, (כדאיתא במגילה ט' ע\"א) והחושך בא לעולם ג' ימים, ובמס' סופרים אמרו, אותו היום שהעתיקו את התורה יונית, הי' קשה להם לישראל כיום שנעשה בו העגל, וכתב החת\"ס זלה\"ה (דרשות חת\"ס דרוש לח' טבת דף ע' ע\"ד) בשנתבונן מ\"ט לחושך ג' ימים וכו', הלא מצינו ביוסיפון שהי' עי\"ז קידוש השם, ותלמי המלך כיבד את ישראל על זה ושיבח התורה, עיי\"ש שהסביר טעמו עפ\"י משל, ותו\"ד כי באותיות הקדושים של התורה נרמזו תורה שבע\"פ וסודות התורה, על כל קוץ וקוץ תלי תלים של הלכות, ובהעתיק את התורה ללשון העמים, נשאר רק פשוטו, ונאבדו הרמזים וסודות הגנוזים בגווי', עכ\"ד, ובאמת אם נעשית העתקה זו ע\"י עכו\"ם ורשעי ארץ, לא נשאר אף פשוטו, כי הם מכניסים פשטים זרים בפירושי התורה, ומסלפין דברי אלקים חיים לפי דעתם המסולפת, וכתבו המפרשים שמה\"ט לא נזכר שם קודש במגלת אסתר, מפני שהאומות העתיקוה בספריהם, ואלמלי הי' כתובים בו שמות הקדושים, היו מכנים אותו לע\"ז ר\"ל."},{"passage_id":"devurim_58bfa2b2_p22","passage_content":"והנה בגמ' סוטה הנ\"ל אמרז\"ל, דבינה יתירה נתן בהם הקב\"ה, ושיגרו נוטירין שלהם, וקלפוה מע\"ג אבנים והשיאוה וכו', ואעפ\"כ לא קבלוה, ואפשר דבינה יתירה שנתן להם הקב\"ה, תלוהו ג\"כ בכח הע\"ז, דבאמת כל הדעת שלהם נובע ממקור הסט\"א וע\"ז, ופרשתי מ\"ש רש\"י ז\"ל (בפ' משפטים) ואפי' ידעת בדין שהם דנין כדיני התורה, אל תביאהו בערכאות שלהם, שהמביא דיני ישראל לפני עכו\"ם מחלל את השם ומייקר שם האלילים וכו', ולכאורה הרי אמרז\"ל אם יאמר לך אדם יש חכמה בגוים תאמין, שנא' והאבדתי חכמים מאדום וגו', וא\"כ אם דנים את הדין בשיקול הדעת כפי שכלם, וגם מתאים לדיני התורה, מה בכך ואיך מייקר בזה שם האלילים, אמנם אף דהדעת הוא עיקר גדול, כאמרז\"ל דעה קנית מה חסרת דעה חסרת מה קנית, מ\"מ צריך לידע שורש הדעת מאין מקורו, ובישראל כח הדעת שלהם מהבוכ\"ע החונן לאדם דעת, ובעכו\"ם מקור הדעת שלהם נובע מהסט\"א וע\"ז, וע\"כ אם סומכין על דעתם ושכלם האנושי, שהוא ג\"כ מכח הע\"ז, מייקרים בזה שם אלילים."},{"passage_id":"devurim_58bfa2b2_p23","passage_content":"וזה משפט המסורה הואיל משה באר את התורה הזאת, ר\"ל בשבעים לשון כפרש\"י ז\"ל, ולמה הי' צורך לזה, לזה אמר כי הואיל ד' לעשות אתכם לו לעם, שהבוי\"ת בחר בישראל ונתן להם התורה, וכדי שלא יהי' לאומה\"ע פתחון פה לומר, אילו ניתנה בלשוננו, גם אנו למדנוה וקיימנוה, ע\"כ הי' הצורך להעתיק להם התורה בע' לשון, כדי שיהי' להם בחירה, ואעפ\"כ לא שמרוה, ועל דבר זה נתחתם גזר דינם, וז\"א הואיל הלך אחר צו, אין צו אלא ע\"ז, שהלכו בדרכי ע\"ז, ופירשו את התורה בדעת ע\"ז, ומעתה אין להם עוד פתחון פה, ולכן הואיל ד' לעשות אתכם לו לעם, ומה\"ט הואיל משה באר את התורה הזאת."},{"passage_id":"devurim_58bfa2b2_p24","passage_content":"נחזור לעניננו דהעתקת התורה ללשון העמים, הי' אך ורק בשביל האומות ולא לצורך ישראל, ואף זו היתה הוראת שעה בלבד, שלא ימצאו אומה\"ע פתחון פה כמבואר בגמ', והראי' שכל מ' שנה שהיו ישראל במדבר, ועסקו בתורה לא העתיק להם משרע\"ה התורה בע' לשון, כ\"א בסוף הארבעים לפני מותו, כדי שיהא מוכנת להם העתקה אמיתית, שיצטרכו אלי' בעברם את הירדן כנ\"ל, ובזה יש לתרץ קושיתנו הנ\"ל מה צורך הי' לנס לסוד את הכתב שע\"ג האבנים בסיד, ואח\"כ נתן הקב\"ה באומה\"ע בינה יתירה וקילפוה והשיאוה, אם כל עיקר כתיבתן ע\"ג האבנים, הי' בשביל שילמדוה אומה\"ע ולא יהי' להם פ\"פ, לא הי\"ל לסוד את הכתב כלל, ולא יהי' צורך לנס."},{"passage_id":"devurim_58bfa2b2_p25","passage_content":"ואפשר דאילולי כן הי' למדין גם ישראל לעשות כן, ללמוד את התורה בלשונות העמים, והרי זה גורם נזק רב בנפש הישראלי, וכמו שפירשנו במאמה\"כ הנמצא כזה איש אשר רוח אלקים בו, שהמשתמש בלשונות העמים, אין במציאות שיהי' עוד רוח אלקים בו זולתי בדרך נס, וע\"כ אחרי שכתבו את התורה בע' לשון ע\"ג האבנים, סדו את הכתב בסיד מיד, כדי שידעו שלא ניתן ללמדה לבני ישראל, ונתן הקב\"ה בינה יתירה באומה\"ע וקילפו את הסיד, שאך בשבילם נעשה בהוראת שעה שלא יהי' להם פ\"פ."},{"passage_id":"devurim_58bfa2b2_p26","passage_content":"ויתבאר לנו מאמה\"כ בעבר הירדן בארץ מואב הואיל משה באר את התורה הזאת, ופרש\"י ז\"ל הואיל התחיל, (עיין לעיל קושיא ז') ולדרכנו הכוונה עפי\"ד רש\"י ז\"ל שביאר התורה לשבעים לשון, וא\"כ יש מקום לדון, שלימדה ג\"כ לישראל בע' לשון מפני שהי' בהם בעלי לשונות אחרים שלא הבינו בלה\"ק, ולפי\"ז יתכן לחשוב שכבר עשה כן בתחלת הארבעים שנה מיד אחר מ\"ת, שהרי למד עמהם תורה כל השנים הללו, וזה הי' טעם עכבתן במדבר, כדי שיהי' התורה נבללת בגופן כדאיתא במכילתא, ואין אדם עומד ע\"ד רבו עד מ' שנה, וא\"כ הי\"ל להעתיק את התורה בע' לשון מיד אחר מ\"ת, לזה שלל הכתוב לומר בעבר הירדן בארץ מואב הואיל משה באר את התורה הזאת, דזאת הבאר דדרשינן בגז\"ש שהעתיקה לע' לשון, רק עכשיו התחיל בה, בעבר הירדן בארץ מואב, שהי' סמוך למיתתו, ולא הי' אפשר לאחרו עוד יותר שהיה צורך להכינה, שיצטרכו ישראל לכותבה ע\"ג האבנים בעברם את הירדן בשביל האומה\"ע, ולא הי' במציאות לעשות העתקה זו ע\"י אחר זולתו, ע\"כ לצד ההכרח ועפ\"י ציווי ד', עשאה בסוף הארבעים ולא קודם לכן, וזהו טעם הכתוב הואיל התחיל ומתורץ קושיא ז' הנ\"ל."},{"passage_id":"devurim_58bfa2b2_p27","passage_content":"ובזה יובן מה שהתחיל הכתוב אלה הדברים אשר דבר משה אל כל ישראל, ואח\"כ הפסיק הענין ויהי בארבעים שנה וגו' בעבר הירדן בארץ מואב הואיל משה באר וגו' (עיין לעיל קושיא ב') ואפשר דמיד בבואו לארץ מואב התחיל לבאר את התורה בע' לשון בשביל האומה\"ע, ואח\"כ דיבר אל בנ\"י אלה הדברים דברי תוכחה, ונרמז כן בפסוק אחרי הכותו את סיחון וגו' בעבר הירדן בארץ מואב הואיל משה, ר\"ל שהתחיל בה מיד, אלא שלא רצה הכתוב להתחיל בזה, שהי' רק בשביל האומות ולצד ההכרח לצורך שעה, ע\"כ התחיל לומר אלה הדברים אשר דבר משה אל כל ישראל, שלישראל דיבר באלה הדברים ממש ובלשון התורה, ואלה פוסל את הראשונים מה שהעתיק את התורה לע' לשון שהי' רק בשביל האומה\"ע והוראת שעה בלבד, אבל כשהתחיל לדבר לבני ישראל דיבר להם בלשון התורה ופסל את הראשונים."},{"passage_id":"devurim_58bfa2b2_p28","passage_content":"ובזה יבואר קישור דברי המדרש הנ\"ל (בקושיא ד') אלה הדברים הלכה אדם מישראל מהו שיהא מותר לו לכתוב ס\"ת בכל לשון וכו', ראה לשונה של תורה מרפא וכו', מנין ממה שקרינו בענין אלה הדברים, והדקדוקים כבר נפרטו לעיל, דאיך יתקשר שאלת הלכה זו למאמר הכתוב אלה הדברים, גם איך יתקשר עם המאמר שלאחריו, ראה לשונה של תורה מרפא, ומה צורך לראי' זו מפ' אלה הדברים, וכמו\"כ איכא למילף ממה שדיבר כל התורה לישראל, ואפ\"ל דהנה הפי' הפשוט עד שלא זכה לתורה כתיב בו לא איש דברים אנכי, ר\"ל שהי' כבד פה וכבד לשון ע\"י מעשה דגחלת כמבואר בילקוט שמות (רמז קס\"ו) כיון שזכה לתורה נתרפא לשונו והתחיל לדבר דברים, שכבדות הפה והלשון אזלה ונתרפא ממנו."},{"passage_id":"devurim_58bfa2b2_p29","passage_content":"אמנם בתנחומא (ר\"פ זו) מבואר כוונה אחרת בזה, וז\"ל בא וראה כשאמר הקב\"ה למשה לך ואשלחך אל פרעה, א\"ל משה בייא (לשון צעקה) אתה מעביר עלי, לא איש דברים אנכי, א\"ל שבעים לשון עומדין בפלטרין של פרעה, שאם יבא אדם ממקום אחר מדברים עמו בלשונו, ואני הולך בשליחותך והם בודקין אותי וכו', אין שוחקין עלי לומר ראו שליח של מי שברא העולם, ואת כל הלשונות אינו יודע לשמוע ולהשיב, הוי בייא לא איש דברים אנכי, הן אני ערל שפתים, אמר לו הקב\"ה והרי אדה\"ר שלא למדו ברי', מנין הי' יודע שבעים לשון וכו', בסוף ארבעים שנה שיצאו ישראל ממצרים התחיל מפרש התורה בשבעים לשון שנא' הואיל משה באר את התורה הזאת, הפה שאמר לא איש דברים אנכי, אמר אלה הדברים עכ\"ד המדרש, מבואר שנרפא לשונו ע\"י שלמדו הקב\"ה לדבר בע' לשון, ובתחילה שאמר לא איש דברים אנכי, התכוין שאינו יודע בע' לשון וישחקו עליו ויהי' חילול השם, ואפשר דתרווייהו איתנייהו ונכלל במאמר לא איש דברים אנכי שהי' כבד פה וגם לא ידע בע' לשון, ואח\"כ נתרפא בשתיהם."},{"passage_id":"devurim_58bfa2b2_p30","passage_content":"ומעתה יתבאר היטב דברי המדרש הנ\"ל, דממה שלמד תורה עם ישראל כל הארבעים שנה אין ראי' שנתרפא לשונו, שלישראל דיבר רק בלשון התורה וזה ידע מעולם, גם ישראל הבינו לשונו היטב ולא נזכר כבדות פה לגבי ישראל בשום מקום, ועוד דהרי שכינה מדברת מתוך גרונו בשעה שדיבר לישראל, ולא שייך כבדות פה כלל, שהרי הי' הדיבור בכח אלקי ולא תליא במהות הלשון כלל, משא\"כ עכשיו שהעתיק את התורה לע' לשון בשביל האומה\"ע, וודאי שלא הי' הדיבור בבחי' שכינה מדברת מתוך גרונו, שאין כבוד השכינה להשתלשל בתוך לשונות העמים, ואיתא במדרש (תנחומא פ' יתרו סי' י\"א) קול גדול ולא יסף, הקול נחלק לשבעה קולות ומשם לשבעים לשון, הרי שבעשרת הדברות שנחלק לע' לשון וכל האומות שמעו, לא זכו האומה\"ע לשמוע עצם קולו ית' כביכול, רק נעתק בכח אלקי בהשתלשלות כמה דרגין לע' לשון, וכמו\"כ במשרע\"ה בשעה שהעתיק התורה לע' לשון, לא היה הדיבור בבחי' שכינה מדברת מתוך גרונו, אלא דיבורו של עצמי, וע\"כ יש מכאן ראי' שנתרפא לשונו בתרווייהו, שידע בע' לשון, וגם הכבדות פה אזלה ממנו, שאף בדיבורו של עצמו ידע לדבר והבינו גם האומה\"ע לשונו."},{"passage_id":"devurim_58bfa2b2_p31","passage_content":"וז\"פ דברי המדרש אלה הדברים שפירושו פסל את הראשונים, מה שדיבר עד עכשיו בע' לשון, ומכאן שלא הותר לכתוב את התורה בכל לשון, שמשרע\"ה עשה כן רק בהוראת שעה ואח\"כ פסל את הראשונים, וע\"כ הסמיכו שאלת הלכה זו מהו שיהא מותר לכתוב את התורה בכל לשון, וסיימו דלא התירו לכתוב כ\"א יונית וכו' ראה לשונה של תורה מרפא מנין ממה שקרינו בענין אלה הדברים, ר\"ל ממה שקרינו בענין אלה דברים, נלמד דאין לכתוב ס\"ת בכל לשון, דכוונת אלה לפסול את הראשונים, ונלמד שהתורה מרפא את הלשון ממה שהעתיק את התורה בע' לשון כנ\"ל."},{"passage_id":"devurim_58bfa2b2_p32","passage_content":"והנה השבעים לשונות כולם שורשם ממקור עליון, כדאיתא בתנחומא הנ\"ל, שאמר הקב\"ה והרי אדה\"ר שלא למדו ברי', מנין הי' יודע שבעים לשון שנא' ויקרא להם שמות וגו', שם לכל בהמה אין כתיב כאן, אלא שמות (שהשיג כל השמות בע' לשון) שהשפיע לו הקב\"ה דעת להשיג ידיעת הלשונות כולם, ובפרקי דר\"א (פכ\"ד בענין דור הפלגה) איתא, ירד הקב\"ה וע' מלאכים הסובבים כסא כבודו, ובלבל את לשונם לע' לשון וכו', ומנה מלאך על כל לשון ולשון, ובגמ' (סוטה ל\"ו ע\"ב) שבא גבריאל ולמדו ליוסף שבעים לשון, וביארנו בדברינו לעיל דיש להם אחיזה באות ה', דכל הרוצה לצאת יצא, ואי הדר בתשובה מעיילי לי' עיי\"ש, ועכ\"פ יש להם שורש בקדושה, אמנם אותו לשון הטמא שבדו הציונים, שאינה מלשון התורה, ששינו וסילפו הכל, וגם אינה מע' לשון, ברור שהוא משורש הסט\"א ואין לו שום אחיזה בקדושה, והע' לשון שרשם מאות ה\"י דאי בעי להדרי בתשובה, אבל בזה כל באיה לא ישובון."},{"passage_id":"devurim_58bfa2b2_p33","passage_content":"ואפ\"ל עוד במ\"ש אלה הדברים פוסל את הראשונים, דהנה משרע\"ה דיבר כאן דברי תוכחה לישראל, ומנה כל המקומות שהכעיסו לפני המקום ית\"ש, וזה יוכל לגרום ח\"ו קטרוג על ישראל, ע\"כ ביאר את התורה בע' לשון בשביל האומה\"ע, שלא ימצאו פ\"פ לומר לא הי' מהיכן ללמדה, ועל דבר זה נתחתם גזר דינם לבאר שחת שהי' להם ללמד ולא למדו, וזה יהי' לימוד זכות על ישראל, וע\"ד מ\"ש בספה\"ק קדושת לוי החליפם באומה אחרת, ותראה שהם גרועים יותר, ולזה הואיל משה באר את התורה בע' לשון, וקמי שמיא גליא שלא ירצו ללמוד ולקיים את התורה, וז\"א אלה הדברים פוסל את הראשונים הכוונה על אוה\"ע, שהם היו אומות הראשונים, דבנ\"י נתקרבו רק במעמד הנבחר, כמשה\"כ היום הזה נהייתה לעם לד' אלקיך, ומשפחות האומות התהוו ועמדו מימות אדה\"ר, וממ\"ש אלה הדברים אשר דיבר משה אל כל ישראל, פסל בזה כל אומות הראשונים, שישראל קיבלו את התוה\"ק וקיבלו דברי תוכחה שהוכיחן משרע\"ה, משא\"כ אומה\"ע נחתם גזר דינם ע\"י שהואיל משה באר את התורה הזאת, וא\"ש הקישור."},{"passage_id":"devurim_58bfa2b2_p34","passage_content":"ועתה נבוא לבאר דברי המדרש הנ\"ל בקושיא ד' אלה הדברים זש\"ה מוכיח אדם אחרי וגו' מוכיח אדם זה משה וכו', ממחליק לשון זה בלעם וכו' (והדקדוקים כבר נפרטו לעיל) הנה רש\"י (במשלי כ\"ח) עה\"פ מוכיח אדם אחרי, מביא מדרש תנחומא, מוכיח אדם אחרי זה משה שהוכיח את ישראל אחר הקב\"ה וכו', ממחליק לשון זה בלעם, האומר לישראל דברים מתוקנים מה טובו אהליך יעקב, משה מכריז השמרו לכם פן יפתה לבבכם, ובלעם מכריז ומחניף עשו תאותכם ואינו מקפיד, לא איש אל ויכזב באומות, אבל בכם אומר ולא יעשה וכו', ובעלי התוס' כאן הביאו מדרש זה בתוס' קצת, בלעם השונא אמר מה טובו אהליך יעקב משכנותיך ישראל וגו', ועשו כל תאות לבבכם, כי לאומות עושה כל הרעה שגזר עליהם, שנא' לא איש אל ויכזב, אבל בכם שאתם בניו, אם גזר רעה, ההוא אמר ולא יעשה ודבר ולא יקימנה וכו' עכ\"ד המדרש, ובזה יתבאר דלשון הברכות הושמו בפיו מד', ומאתו ית' לא תצא הרעות, וא\"א שזה יגרום כשלון לבני ישראל, אך בלעם השונא ברשעתו סילף דברי ד' וזייף פירושן, דההוא אמר ולא יעשה וגו' פי' הפשוט והמקובל לפרשו בלשון בתמי', עוד דרשו רז\"ל בתנחומא (פ' בלק סי' י\"ג) ההוא אמר ולא יעשה, כשהוא אומר להביא עליהם רעות, שאם עושין תשובה מבטלן, אבל בלעם הרשע הי' מפרשה בניחותא שאף אם יחטאו לא יתקיים הרעה אשר גזר, ומפני שירדה נבואה זו על ידו, חשבו ישראל שנאמן הוא גם על פירושה, וזה התעה אותם ונפלו בשיטים, אבל הברכות עצמן הם נבואה אמיתית ומעצם התורה, וא\"א שיגרמו כשלון ח\"ו."},{"passage_id":"devurim_58bfa2b2_p35","passage_content":"ולדרכנו אפ\"ל במאמה\"כ (בפ' בלק) שא\"ל הקב\"ה קום לך אתם וגו', ואח\"כ כתיב ויחר אף ד' כי הולך הוא, ולכאורה נראה כסתירה וחזרה והשתנות מרצון הקודם, ולא יתכן זה אצל הבוית\"ש, אמנם כשנתבונן בהתכת הכתובים, נראה ששינה בלעם התנאי שא\"ל ד', כי הקב\"ה א\"ל קום לך אתם \"ואך\" את הדבר אשר אדבר אתו תעשה, מלת אך ממעט כל דבר זולתו, וכן אמר לו המלאך בשליחות השי\"ת \"ואפס\" את הדבר אשר אדבר אליך אותו תדבר, הרי מיעט כל הדיבורים זולתו, אמנם בלעם אמר הדבר אשר ישים אלקים בפי אותו אדבר, ולהלן אותו אשמור לדבר, הנה הבטיח שיאמר דברי ד', אבל לא מיעט שלא יוסיף עליהם גם דברי עצמו, שזה לא קיבל ע\"ע לגודל רשעתו, והראי' ממ\"ש איעצך אשר יעשה העם הזה לעמך וגו', שנתן לו עצה להכשילם בבנות מואב הרי הוסיף כאן דברי עצמו, ולא ציית לדברי ד' שא\"ל אך את הדבר אשר אדבר אליך וגו', ומיעט כל הדיבורים זולתם."},{"passage_id":"devurim_58bfa2b2_p36","passage_content":"וז\"פ ויחר אף ד' כי הולך הוא, כי האדם אינו עומד רק הולך תמיד מדרגא לדרגא, או למעלה או ח\"ו להיפך, ובלעם מעת שגמר בדעתו שלא יקיים התנאי שא\"ל השי\"ת, הי' הולך ומוסיף ברשעתו תמיד, ומעתה א\"ש שאין כאן חזרה ולא השתנות ברצון ד', אלא שמעיקרא הסכים הקב\"ה להליכתו על תנאי \"אך\" את הדבר אשר אדבר אליך אותו תעשה, שלא ידבר אף דיבור קל, לא טוב ולא רע זולת דברי ד', אבל הקב\"ה ראה כי הולך הוא ומתגדל ברשעתו, ואין בדעתו לשמור התנאי, ע\"כ ויחר אף אלקים כי הולך הוא, ואעפ\"כ לא עיכב בידו, וחז\"ל דרשו מכאן דבדרך שאדם רוצה לילך מוליכין אותו ואין מונעין הבחירה מבנ\"א, ועכ\"פ גרם הכשלון הי' ע\"י שסילף דברי ה' ונבואה אמיתית, לפרש בו פשטים של דופי ושקר, ומה\"ט אמרז\"ל הלומד תורה לתלמיד שאינו הגון כזורק אבן למרקוליס, וכתב הרמב\"ם ז\"ל שאלו מכבין נרה של תורה ומרבין מחלוקת בישראל, ע\"י שמסלפין אורחות חיים בדעתם המסולפת, וההתחלה הי' אצל בלעם שסילף דברי ד' שנאמרו לו בנבואה, ועל ידו נפלו ישראל בשיטים."},{"passage_id":"devurim_58bfa2b2_p37","passage_content":"ובזה יובן דברי המדרש מוכיח אדם אחרי זה משה וכו', חן ימצא ממחליק לשון זה בלעם וכו', לכאורה מהו הרבותא בזה שימצא חן יותר ממחליק לשון זה בלעם, גם צ\"ב הלשון חן ימצא, דלשון מציאה הוא דבר הבא בהיסח הדעת יוצא מדרך הטבעי והרגיל, ומדוע יהיה מציאת החן בדרך זה, ואפ\"ל עפימ\"ש רש\"י ז\"ל (במשלי כ\"ח) מוכיח אדם וגו' על עבירות שבידו ומפרישו מהם, אחרי חן ימצא, לאחר זמן חן ימצא בעיניו יותר ממחליק לשון, מצינו בב\"ר כל מקום שנאמר אחרי אינו אלא מופלג עכ\"ל רש\"י ז\"ל, נראה ביאורו עפי\"ד רז\"ל (כתובות ק\"ה ע\"ב) האי צורבא מרבנן דמרחמין לי' בני מתא, לאו משום דמעלי טפי, אלא משום דלא מוכח להו במילי דשמיא, וכן הוא דרך העולם לשנוא את המוכיח, ולאהוב את המחניף, ודבריו מתקבלין יותר על לב הבריות, אמנם זהו רק לפי שעה, אבל אחר זמן ניכרים דברי אמת, והמוכיח ימצא חן והמחניף יתגנה, כי שקרא לא קאי, וז\"פ מוכיח אדם, אחרי חן ימצא, כל מקום שנאמר אחרי מופלג כפרש\"י ז\"ל, שלאח\"ז ימצא חן, וזה בבחי' מציאה הבאה בהיסח הדעת שלא חשב עלי' שהמחניף עושה פעולה שימצאו דבריו חן, משא\"כ המוכיח הרי עשה ההיפך ממציאת החן, אבל הקב\"ה עוזר לו שבמשך הזמן יתקבלו דבריו וימצאו חן."}]},{"dvar_torah_id":"devurim_bf9c63ac","title":"תוכחת משה והכוח בתשובה","summary":"משה רבנו מוכיח את ישראל על חטאיהם, אך מדגיש את כוח התשובה, במיוחד בעקבות חטא העגל. הוכחה זו נועדה לחזק את לבבם שלא יתייאשו, כי תשובתם תתקבל בזכות מעשה העגל, אשר פתח פתח לבעלי תשובה לדורות.","contents":[{"passage_id":"devurim_bf9c63ac_p1","passage_content":"אלה הדברים אשר דבר משה וגו' פרש\"י בשם הספרי, לפי שהן דברי תוכחות, ומנה כאן כל המקומות שהכעיסו לפני המקום וכו', לפיכך סתם את הדברים והזכירם ברמז מפני כבודן של ישראל, הקשה האלשיך הקדוש מדוע לא חש משרע\"ה כמו כן לכבודן של ישראל בפרשיות הבאות, שמצינו שהזכיר שם חטאם של ישראל בפירוש באר היטב, באמור להם ממרים הייתם את ד', ובחורב הקצפתם וגו', ומה נשתנה מהכא להתם."},{"passage_id":"devurim_bf9c63ac_p2","passage_content":"ב) ודי זהב פרש\"י מדרז\"ל הוכיחן על העגל שעשו בשביל רוב זהב שהי' להם וכו', דקדק האלשיך הקדוש מדוע הזכיר משרע\"ה ודי זהב באחרונה, ולפי סדר המעשה קדמה למרגלים ומחלוקתו של קרח, וטעמא בעי שהזכירו באחרונה, ובתרגום יונתן פי' ודי זהב מאני קודשא דחפיתון דהבא סנינא, וכפר לכון על חובת עגל דהבא, וצ\"ב דלפי\"ד אין אלו דברי תוכחה אלא דברי נחמה ולמה הזכירן כאן, גם למה הזכיר כפרה זו דוקא."},{"passage_id":"devurim_bf9c63ac_p3","passage_content":"ואפ\"ל בהקדם מ\"ש בספה\"ק עבודת ישראל פ' בלק בשם הקדושת לוי זלל\"ה עה\"פ וביום פקדי ופקדתי עליהם את חטאתם אשר עשו את העגל, דלכאורה קשה, הנה אבינו אב הרחמן הסולח ומוחל ומעביר אשמתנו בכל שנה ושנה, סלקא דעתיך שיכתוב בתורתו דבר קשה כזה, שיזכור לעולם חטא העגל, אפי' אחר שעשו ישראל תשובה, וגם יקשה ממ\"ש חז\"ל במס' ברכות (דף ל\"ב ע\"ב) א\"ר אושעי' גם אלה תשכחנה זה מעשה עגל, ואנכי לא אשכחך זה מעשה סיני, הרי דהבטיח הבוי\"ת שלא יזכר להם עון העגל, עיי\"ש שפי' לדרכו דמשה\"כ וביום פקדי פקדתי וגו', פקידה זו לטובה היא להגדיל מעלתם בקבלת התורה, דע\"י מעשה העגל נתברר שיש בהם עדיין נטי' לרעה, ושלא עשו את הטוב מושרש בטבע להם מקדושת אבותיהם, רק בעצם בחירתם בחרו בזה עייש\"ד באריכות, והנה ראויים הדברים למי שאמרם, אמנם עדיין יקשה ממ\"ש חז\"ל במס' סנהדרין (דף ק\"ב) בדרשת הפסוק וביום פקדי וגו' א\"ר יצחק אין לך כל פורעניות וכו' שאין בה הכרע ליטרא של עגל הראשון, הרי ממשמעות דבריהם נראה שע\"צ הפורעניות והעונש, יזכר ויפקד עון העגל, והדרא קושיא לדוכתי'."},{"passage_id":"devurim_bf9c63ac_p4","passage_content":"אמנם יתבאר בהקדם דברי הגמ' ע\"ז (דף ד' ע\"ב), א\"ר יהושע בן לוי לא עשו ישראל את העגל, אלא ליתן פתחון פה לבעלי תשובה וכו', פרש\"י גבורים ושליטים ביצרם היו, ולא הי' ראוי להתגבר יצרם עליהן, אלא גזירת מלך היתה לשלוט בם, כדי ליתן פתחון פה לבעלי תשובה, שאם יאמר החוטא לא אשוב שלא יקבלני, אומרים לו צא ולמד ממעשה העגל, שכפרו ונתקבלו בתשובה עכ\"ל רש\"י ז\"ל, ואפ\"ל עוד בכוונת דבריהם ז\"ל עפימ\"ש ק\"ז הייטב לב זלל\"ה בשם המפרשים, בביאור הכתוב (ישעי' י\"ב ג') ושאבתם מים בששון ממעיני הישועה, שהנס והישועה שעשה הבוי\"ת לאבות הקדושים, ולצדיקים בדורות הראשונים, עי\"ז נעשה ונפתח צנור, ומעיין ישועה לדורות ישראל עד עולם, והמשילו בזה למלך בשר ודם, שהלך עם עבדיו במדבר שממה, ונצמא למים מאד, ורצו עבדיו להביא לו מים ממרחק, אמר להם לי יש סיפק בידי להמציא מים מרחוק, ע\"י שיש לי כמה עבדים ורוכבי סוסים, אבל מה יעשה אדם אחר, שילך אחרי בדרך הזה, ויצמא למים ויסתכן, ע\"כ צוה לעבדיו, שיכרו לו מעיין באר מים חיים, כדי שיהיו מים מצויים לכל עובר, וכמו\"כ האבות הקדושים והצדיקים, בכוחם וזכותם הגדולה, הכינו מעיין ישועה לדורות ישראל אחריהם, מה שלא הי' בכוחינו וזכותינו להשיג זולתם, כי בעוה\"ר כח הקטרוג חזקה לנגדנו, ואין בכוח מעשינו להכריע נגדם ולהחלישם, אבל כיון שכבר נזדמן ככה לאבותינו, והם בכוחם וזכותם הגדול זכו לנס, בזה פתחו צנור ושביל ומעיין ישועה, לבניהם עד עולם, ובחי' זו מבוארת בזוה\"ק פ' תולדות וז\"ל, קוב\"ה אתרעי בצלותהון דצדיקיא וכו', בגין דיתרבי ויתוסף רבות קודשא לכל מאן דאצטריך, ע\"י צלותהון דצדיקיא עיי\"ש."},{"passage_id":"devurim_bf9c63ac_p5","passage_content":"וכמו\"כ אפ\"ל בענין חטא העגל, דע\"י שנזדמן ונסתבב לדור המדבר דור דיעה חטא העגל, ועשו תשובה הגונה ומעולה על חטאם, כמבואר בפסוקים ובדברי חז\"ל, ובכח זכותם הגדול, וע\"י הפצרות ותפלות משרע\"ה, נתקבלה תשובתם ונמחל עונם, ובזה פתחו צנור ודרך, לדופקי בתשובה בכל דורות ישראל, שיתקבל תשובתם, ואלולי כן הי' דבר קשה לבחי' תשובתנו שתתקבל, דכח הקטרוג חזקה מאוד, והמדות העליונים כולם התנגדו לבחי' התשובה שתתקבל, כמבואר בירושלמי (מכות פ\"ב ה\"ו) שאלו לחכמה חוטא מהו עונשו, א\"ל חטאים תרדוף רעה וכו', עד שאלו להקב\"ה, א\"ל יעשה תשובה ויתכפר לו, ואין בחינת תשובתינו מעולה וראוי' כ\"כ, ואין בכוחה לדחות כח המקטרג, אמנם משרע\"ה בכוחו וזכותו הגדול התגבר עליהם, ובצירוף זכות הדור הגדול דור דיעה, ותשובתם הגדולה, נפתח צנור ושער לכל דופקי בתשובה שיתקבל תשובתם והבן."},{"passage_id":"devurim_bf9c63ac_p6","passage_content":"ובזה יבואר לדרכנו דברי הגמ' סנהדרין הנ\"ל, א\"ר יצחק אין לך כל פורעניות שאין בה הכרע ליטרא של עגל הראשון, עפימ\"ש בספה\"ק תולדות, דחטא העגל נכלל בכח כל החטאים, ובכולם יש בהם חלק מחטא העגל, שנמשך בחי' החטא מן הכח הרע והארם, ששרשו ויסודו מחטא העגל עייש\"ד, ורגיל אני לפרש מאמר הכתוב אל תזכור לנו עונות הראשונים, שהעון הראשון הוא השורש המר, והאחרונות הם תולדה ממנו, בבחי' עבירה גוררת עבירה, אבל מקור ההשחתה הוא מעון הראשון, והוא הגורם גם לאחריני, דהכל הולך אחר המקור וההתחלה, ועד\"ז פירשתי דברי חז\"ל, הרהורי עבירה קשים מעבירה, דלכאורה איך אפ\"ל שקשים ממעשה העבירה עצמה, והלא בודאי שאין עונש המחשבה כעונש המעשה, אולם לפי שהרהורי העבירה המה יסוד ושורש הרע, והמה הגורמים ומכריחים למעשה, ע\"כ ברוחניות הפגם גדול ומזיק לנפש, יותר מהעבירה עצמה."},{"passage_id":"devurim_bf9c63ac_p7","passage_content":"ומעתה נבין אמרם ז\"ל, אין לך כל פורעניות, שאין בה הכרע ליטרא של עגל הראשון, ושורת הדין נותנת כן, לפי ששורש כל החטאים נמשך מחטא העגל, וחטא העגל נכלל בהם בכח, אבל פקידה זו ע\"צ הטובה והחסד הוא, דע\"י שכבר נתקבל בחי' התשובה על חטא העגל, בכח תפלתו של משרע\"ה, ובזכות הדור הגדול ההוא, ע\"כ ראוי שיתקבל בחי' התשובה על כל החטאים שכולם הם מאותו השורש, והוא הגורם לכולם, ובזה יבואר ג\"כ כוונת הכתוב, וביום פקדי ופקדתי עליהם חטאתם, ופקידה זו ע\"צ הטובה והחסד, שיתקבל בחי' התשובה עליהם כנ\"ל."},{"passage_id":"devurim_bf9c63ac_p8","passage_content":"ובזה יומתק לנו להבין אמרם ז\"ל במס' ע\"ז הנ\"ל, לא עשו ישראל את העגל אלא ליתן פתחון פה לבעלי תשובה וכו', וכדי להורות תשובה לרבים וליחיד, וכפרש\"י ז\"ל שאם יפחד החוטא לומר שמא לא יקבלוני בתשובה, יתחזק לבבו ממעשה העגל, שנתקבלו בתשובה, ועי\"ז השער פתוחה לכל דופקי בתשובה, שכולם הם מאותו השורש כנ\"ל."},{"passage_id":"devurim_bf9c63ac_p9","passage_content":"נחזור לענין הפרשה דמשרע\"ה הוכיח את ישראל בשנת הארבעים על כל מה שעשו במדבר וכו', ותכלית התוכחה לעוררם אל התשובה, אך פן יפול לבבם מרוב הפחד, בהזכירו לפניהם כל החטאים האלה, ופן יתייאשו לאמר, מי יודע אם יתקבל תשובתנו עוד, ע\"כ כדי ליתן פ\"פ לבעלי תשובה, ולחזק את לבבם, הזכיר להם מעשה העגל באחרונה, שהוא שורש כל החטאים, ושורש כח התשובה נמשך משם, כנ\"ל, וא\"ש דברי התרגום יונתן ב\"ע, שפי' ודי זהב מאני קודשא וכו', וכפר על חובת עיגל דהבא, דמשם נשמע כח התשובה, דאל\"ה האיך היו כלי המקדש של זהב מכפרים על עון העגל, והרי אין קטיגור נעשה סניגור, אמנם באמת שורש חטא העגל לכפרה ניתנה, וליתן פ\"פ לבעלי תשובה, דלא היו ישראל ראויין לאותו מעשה, אלא נסתבבה להם, כדי לפתוח פתח לדופקי בתשובה, ומעתה א\"ש דמכפר ולא מקרי קטיגור, אלא שבעבודת פנים הקפידה תורה, שלא יכנס הכוה\"ג לפני ולפנים בבגדי זהב, אולי לטעם דסביביו נשערה מאוד, או לאיזה טעם אחר לא נודע לנו, אבל בדרך כלל, הזכרת העגל יש בו פקידה לטובה, דמשם נשמע כח התשובה, ועיקרה הי' להקים עולה של תשובה, וע\"כ הותרה הזהב בעבודת חוץ ובכלי המקדש, ולא עוד אלא שמכפרת, כמו שמצינו בכלי המקדש, ולא מקרי קטיגור כלל, ולטעם זה הזכיר משרע\"ה ודי זהב וע\"ד שפי' בתרגום יונתן הנ\"ל מאני קודשא, לחזר לבבם בזה דמהני תשובה."},{"passage_id":"devurim_bf9c63ac_p10","passage_content":"ובזה יתבאר לנו כוונת דברי רש\"י ז\"ל בר\"פ שמיני עה\"פ קח לך עגל וגו' להודיע שמכפר להם הקב\"ה ע\"י עגל זה, על מעשה העגל אשר עשה עכ\"ל, ועיין במזרחי שתמה בדברי רש\"י ז\"ל ואמר לא ידעתי, האיך הודיע זה עיי\"ש, ולדרכנו א\"ש דאל\"ה למה צוה הקב\"ה ליקח עגל דוקא לכפרה, והלא אין קטיגור נעשה סניגור, וע\"כ ממה שצוהו ית' קח לך עגל וגו', היתה בזה הודעה אליו, שכיפר לו מעשה העגל, ואין בו הזכרת קטיגור כלל, אדרבה יש בו פקידה לטובה, להודיע שמהני תשובה כנ\"ל."},{"passage_id":"devurim_bf9c63ac_p11","passage_content":"ומעתה יתורץ ג\"כ קושיא הראשונה, דמתחילה הזכיר משרע\"ה כל החטאים רק ברמז, מפני כבודן של ישראל כמ\"ש רש\"י ז\"ל בשם הספרי, אבל אחר שאמר ודי זהב, דמשם נשמע דמהני תשובה ונמחק החטא לגמרי, וע\"י תשובה מאהבה נתהפך לזכיות כאמרם ז\"ל, ע\"כ בפרשיות הבאות לא הסתיר חטאם והזכירם בפירוש, דאותו הדור עשו תשובה מעולה על חטאם, גם לא היו ראויים לכך אלא להורות תשובה, ואין בהזכרת חטאם חשש קטיגור, אדרבה יש בו פקידה לטובה לדורות ישראל, להודיע כוחה של תשובה כנ\"ל וא\"ש."},{"passage_id":"devurim_bf9c63ac_p12","passage_content":"עוד אל\"פ מ\"ש ודי זהב באחרונה, ודברי התרגום יונתן בזה כנ\"ל, עפימ\"ש בספה\"ק שחטא הגדול מכל החטאים הוא איחור התשובה, והביאו משל בזה, לאחד שהי' בידו פקדון מרגליות יקרה מבית המלך, ולא שמרה כראוי ונאבדה ממנו, אבל עוד הי' עצה ותרופה, לחפש אחרי' בכל היכולת ולהחזירה אל המלך, אבל הוא הסיח דעתו מלחזור אחרי', מובן שחטא האחרון קשה מן הראשון, שגם אחר שפשע לא שם לבו לתקן אולתו, והנמשל מובן, וכמו\"כ משרע\"ה אחר שהוכיחן ברמז על כל מה שעשו, חזר להוכיחם על התשובה שלא יאחרו אותה, ולטעם זה הזכיר ודי זהב באחרונה דמשם נשמע דתשובה מהני כדברי התרגום יונתן כנ\"ל."}]},{"dvar_torah_id":"devurim_de9b80a8","title":"","summary":"","contents":[{"passage_id":"devurim_de9b80a8_p1","passage_content":"אלה הדברים אשר דבר משה אל כל ישראל וגו', דקדקו המפרשים דהול\"ל וידבר משה אל כל ישראל, כאשר הזכיר הכתוב בכל מקום ורש\"י פי' אלה הדברים לפי שהן דברי תוכחות וכו', וכתב הגו\"א זלל\"ה דרש\"י ז\"ל בא לתרץ קושיא הנ\"ל, דלכך כתב אלה הדברים לפי שהן דברי תוכחות, וכ\"מ שנאמר דברים הוא דברי תוכחה עיי\"ש, ואפ\"ל עוד דבלשון זה אלה הדברים נרמז ג\"כ דברי תוכחה וכעין שאר התוכחות שבפסוק שהזכירם משרע\"ה רק ברמז כדברי רשיז\"ל, ויובן עפימ\"ש אאמו\"ר זלל\"ה בקדושת יו\"ט (פ' ויקהל) לפרש הפסוק אלה הדברים אשר צוה ד' לעשות אותם ששת ימים תעשה מלאכה וגו', עפ\"י הידוע שכל הל\"ט מלאכות הנמצא בכל מלאכת עבודה, כולם נתהוו מהל\"ט קללות שנתקללו אדם וחו' וכו', וע\"כ החיוב בששת ימי המעשה, לברר ענפי הקדושה מכל דבר ודבר ע\"י הל\"ט מלאכות, ועי\"ז אנו ממתיקין את הקללות מעט מעט וכו', ובעת שיהי' התקון השלם ברצות השם, לא יהיו צריכין עוד לשום מלאכה, והנה למדו חז\"ל במס' שבת (דף צ\"ז) מפסוק אלה הדברים ל\"ט מלאכות, אלה בגימטרי' ל\"ו, דברים ב' הדברים ג' הרי ל\"ט עיי\"ש, ואל\"פ הפסוק אלה הדברים דהיינו ל\"ט, אשר צוה ד' לעשות אותם כדי להשלים הבירור, אבל לעתיד וביום השביעי יהי' לכם קודש שבת שבתון, ר\"ל שבת דלעתיד אז לא תעשה כל מלאכה, דיתוקן הכל בתכלית השלימות, ולא תצטרך לשום מלאכה עייש\"ד באריכות, וכמו\"כ אפשר שנרמז גם כאן דברי תוכחה באמרו אלה הדברים, וירמוז לל\"ט קללות ול\"ט ענפי הבירור, אשר יתוקן ויושלם ע\"י הל\"ט מלאכות, דאלו לא חטאו ישראל, היו באין לארץ ישראל והי' התקון השלם מיד כמבואר בדבריהם ז\"ל, ומה שהצרכתם לל\"ט מלאכות הנרמז באלה הדברים, הוא רק מפני שהכעסתם לפניו ית' בכל אותן הדברים שרמז עליהם להלן."}]},{"dvar_torah_id":"devurim_5a777430","title":"פנחס ואליהו: המלצה על ישראל","summary":"במדרש נלמד כי פנחס הוא אליהו, המשלב חסד ותוכחה. משה רבנו הוכיח את ישראל אך גם התפלל עליהם, וכך פנחס קנא קנאת ד' מבלי לעורר דינים. הוא מהווה דוגמה לרועה ישראל האמיתי, הממליץ זכות על עמו.","contents":[{"passage_id":"devurim_5a777430_p1","passage_content":"במדרש (הובא בס' עיר דוד) הרוצה לידע שפנחס זה אליהו, יראה מאלה הדברים, ע\"כ והוא פליאה, ויתבאר בהקדם דברי ק\"ז הייטב לב זללה\"ה, לפרש המדרש אלה הדברים זש\"ה מוכיח אדם אחרי, אמר הקב\"ה כביכול משה הוכיחני אחר ישראל, והוכיח את ישראל אחרי, לישראל אמר אתם חטאתם וגו', להקב\"ה אמר למה ד' יחרה אפך בעמך, וביאור הדברים כי בעת שמרצים דברי תוכחה לישראל להזכיר חטאם ולהוכיחם על פניהם, יש לחוש פן יתעורר עליהם הקטרוג והמדה\"ד ח\"ו ע\"י הזכרת עונותיהם, ע\"כ משרע\"ה באותה שעה התפלל עליהם, ועורר רחמים שלא יענשו בעונותיהם, וזשה\"כ אלה הדברים דברי תוכחה אשר דבר משה אל כל ישראל דייקא, אבל אל השי\"ת אמר דברי מליצות בעדם להצדיקם, וזהו דרך רועי ישראל הצדיקים, ופי' בזה פסוקי תוכחה שבפ' חזון ישעיה, שהם תוכחה לישראל והמלצת זכות לפני הבוי\"ת עיי\"ש, וכעי\"ז פי' בספה\"ק מאור ושמש אלה הדברים אשר דבר משה \"אל כל ישראל\" פירוש עבור כל ישראל, מלשון אל חמיה ואל הלקח ארון האלקים, ר\"ל שבדברים אלו הי' ממליץ זכות עבורם עיי\"ש."},{"passage_id":"devurim_5a777430_p2","passage_content":"ונקדים עוד מ\"ש בספה\"ק קדושת לוי (פ' פנחס), דהנה אמרו ז\"ל פנחס זה אליהו (ונמצא הוא מבני בניו של לאה), ובתוס' הביאו בשם תנא דבי אליהו שהיו חולקים ממי בא אליהו, אם מרחל אם מלאה, ובא אליהו ואמר להם שאני מבני בניו של רחל עכ\"ד התוס', ונראה דאלו ואלו דברי אלקים חיים, דהכלל הוא שאם רואה אדם ח\"ו בנ\"א שעוברין עבירה, וכועס תיכף עליהם ומקנא קנאת ד' צבאות, אזי ח\"ו מעורר דינין על ישראל, אבל פנחס אע\"פ שקנא קנאת ד' צבאות, אעפ\"כ לא הי' מעורר עליהם דינין ח\"ו, רק חסדים גדולים ומכפר על בני ישראל, והוא הי' המליץ על ישראל, כדאיתא בגמ' שבא וחבטן בקרקע ואמר לפניו רבש\"ע על אלו יפלו כ\"ד אלף מישראל, ופי' בזה מאמר הכתוב פנחס בן אלעזר וגו' השיב את חמתי מעל בני ישראל, בקנאו את קנאתי, ואעפ\"כ הי' בתוכם, והי' מעורר עליהם חסדים וכו', ובזה תבין דאלו ואלו דברי אלקים חיים, דבאמת פנחס זה אליהו ומבני בניו של לאה, ומ\"ש בתנד\"א שאמר להם שהוא מב\"ב של רחל, עיי\"ש כי זהו לשון התדנב\"א, שבא אליהם ואמר להם זה שאני אליהו, אני מב\"ב של רחל, ר\"ל כי בשעה שקנא קנאת ד' צבאות בא אליו נשמה מרחל, כי ברחל כתיב ותקנא רחל באחותה וזהו מידתה, וז\"ש שם אמר להם \"זה שאני אליהו\", שיש לי נשמה יתירה שאני נקרא אליהו, אני בא מב\"ב של רחל, זה הנשמה הוא מרחל, עכדה\"ק עיי\"ש שביאר הענין גם בדרך הסוד, וע\"כ זכה להיות המבשר גאולתא בסוף יומיא, לפי שהי' כלול מב' הבחינות גם יחד, וכן דרך רועי ישראל האמיתיים, כמו שמצינו במשרע\"ה בפ' אלה הדברים, ובזה יבואר רמז הפליאה, הרוצה לידע שפנחס זה אלי' יראה מאלה הדברים, שכולל ג\"כ ב' הבחינות הפכיים, ועד\"ז יתאמת אמרם ז\"ל פנחס זה אלי', ואלו ואלו דברי אלקים חיים כדברי הקדושת לוי זלל\"ה והבן."}]},{"dvar_torah_id":"devurim_77ca2ab1","title":"תוכחת משה וגדולת החטא","summary":"משה רבנו הוכיח את ישראל על חטאיהם לאחר שהוכיח את הקב\"ה. הוא הגדיל את חטאם בעיניהם כדי שיתעוררו לתשובה שלמה. דבריו פוסלים את תוכחותיו הקודמות, ומדגישים את חשיבות ההכרה בחטא כדי להשיג סליחה מהקב\"ה.","contents":[{"passage_id":"devurim_77ca2ab1_p1","passage_content":"אלה הדברים אשר דבר משה אל כל ישראל וגו', יל\"ד דכ\"מ שנאמר אלה פוסל את הראשונים, ומה בא לפסול כאן, וכל התורה כולה אמרם משרע\"ה מפי הגבורה."},{"passage_id":"devurim_77ca2ab1_p2","passage_content":"ב) במד\"'ר זש\"ה מוכיח אדם אחרי, חן ימצא ממחליק לשון וכו', מהו אחרי, אמר הקב\"ה כביכול משה הוכיחני אחר ישראל, והוכיח לישראל אחרי, לישראל אמר אתם חטאתם חטאה גדולה וגו', להקב\"ה אמר למה ד' יחרה אפך בעמך וכו', עכ\"ד המדרש, יל\"ד דהלא אינו נזכר בכתוב אחרי כ\"א פעם אחד, ואיך דרשו רז\"ל מזה ב' דרשות, משה הוכיחני אחר ישראל והוכיח לישראל אחרי, וממשמעות הלשון אחרי, לא משתמע אלא חדא, ואידך מנ\"ל."},{"passage_id":"devurim_77ca2ab1_p3","passage_content":"ונל\"פ עפי\"ד הרמב\"ן ז\"ל (בפ' תשא) עה\"פ למה ד' יחרה אפך בעמך, שהביא דעת הראב\"ע ז\"ל, כי משה לא התפלל בעד ישראל, כ\"ז שהיתה ע\"ז ביניהם, אבל כאשר אמר לו השם הרף ממני ואשמידם, התבונן כי הדבר תלוי בו, וירד וביער העגל, ושב להתפלל בארבעים יום, וזאת התפלה למה ד' יחרה אפך בעמך, היתה ראוי' להכתב אחר וישב משה אל ד', אלא שאין מוקדם ומאוחר בתורה עכ\"ד הראב\"ע, ואין דעתי כן, בעבור שהתפלה שעשה בשובו, הוא אשר יספר אנא חטא העם הזה חטאה גדולה, ואם הכל תפלה אחת שעשה בארבעים יום אחרי שובו להר, למה יחלק אותה ויזכיר כאן מקצתה, ואחר הירידה יזכיר המקצת האחר, אבל הן ב' תפלות, ולכן נראה כי כאשר א\"ל ד' הניחה לי ויחר אפי בהם, מיד חלה פני השם ולא אחר כלל, כי הי' ירא פן יצא הקצף מלפני ד' ויחל הנגף לכלותם כרגע, ומיד אמר למה ד' יחרה אפך בעמך, וכן מצאתי באלה שמות רבה, אמר משה אם מניח אני את ישראל וארד לי, איך לישראל תקומה בעולם, אבל איני זז מכאן עד שאבקש עליהם רחמים, מיד התחיל משה ללמד עליהם סניגוריא וכו', והנה התפלל עליהם, וניחם השם על הרעה אשר דבר להרוג אותם ולכלותם, לא שנתרצה להם רק שאמר נחמתי לא אעשה כלה, וכיון שהי' לו פנאי, ירד משה ושרף את העגל והרג עובדיו, ואח\"כ אמר לעם אעלה אל ד' אולי אכפרה בעד חטאתכם, שימחול לכם, עכ\"ד הרמב\"ן ז\"ל, מבואר מדברי המדרש ודברי הרמב\"ן ז\"ל דמה שהוכיח משרע\"ה את ישראל אחרי הקב\"ה, באמרו אתם חטאתם חטאה גדולה וגו', הי' אחר שהוכיח כביכול להקב\"ה ואמר למה ד' יחרה אפך בעמך, כי הי' ירא להמתין פן יצא הקצף ח\"ו, ומיד התפלל אל ד', ואחר ששרף העגל אמר לעם אתם חטאתם וגו', ובזה א\"ש דברי המדרש הנ\"ל מהו אחרי, אמר הקב\"ה כביכול משה הוכיחני אחר ישראל והוכיח לישראל אחרי, ותרווייהו משתמע מהאי קרא, דהכי דריש מוכיח אדם אלו ישראל, אחרי ר\"ל שהוכיחם משה, אחר שהוכיח כביכול ית' בשבילם, וכמבואר בדברי הרמב\"ן ז\"ל."},{"passage_id":"devurim_77ca2ab1_p4","passage_content":"ועפי\"ז יתבאר אומרו אלה הדברים פוסל את הראשונים, עפימ\"ש אאמו\"ר זלה\"ה (בקדושת יו\"ט פ' דברים) דמשרע\"ה כיון כאן בתוכחתו וכו', עפימ\"ש חכמי המוסר, שעמוד גדול בדרכי התשובה, לידע את גודל הפגם אשר פגם בחטאו וכו', ואל יקל בעיניו חטאו, לומר מה עשיתי, ולמה יחרה ד' בי, כי עי\"ז לא יהי' התשובה בלב שלם, ולכן צריך השב אשר ישוב, להגדיל חטאו מאוד בעיניו, כדי לשבר את לבו בקרבו, על החטא והפגם שעשה עד לב השמים ועד בכלל, שפגם באורות עליונים כידוע, ואז יהי' תשובתו רצוי' ומקובלת וכו', ולזה הוצרך משרע\"ה רעיא מהימנא לומר לישראל אתם חטאתם חטאה גדולה, אף שאמר להקב\"ה למה ד' יחרה אפך בעמך, כי הוצרך להגדיל החטא והמרי בעיני ישראל עכדה\"ק, והנה בהוכיח את ישראל אתם חטאתם חטאה גדולה, אלמלא הי' מודיע להם שלגבי הקב\"ה הקטין מדת חטאם ולימד עליהם זכות, אז לא הי' נגמר כוונת משרע\"ה, להגדיל בחי' החטא בעינם כדי שתהי' התשובה בלב שלם, וע\"כ מוכרח להעלים מהם מה שעלה בידו להקטין מדת חטאם לפני הבוית\"ש, וז\"פ אלה הדברים אשר דבר משה אל כל ישראל, כוונת אלה לפסול את הראשונים, כדרך הכתוב בכ\"מ, ואף כאן פסל דברי תוכחתו הקודמים שאמר להבוי\"ת למה ד' יחרה אפך בעמך, ובינו לבין קונו הקטין מדת חטאם של ישראל, אבל בעת שהוכיח את ישראל פסל טענה הקודמת בפניהם, והגדיל חטאם, כדי שתהי' תשובתם רצוי' ומקובלת לפני הבוית\"ש."},{"passage_id":"devurim_77ca2ab1_p5","passage_content":"או אפ\"ל אלה הדברים אשר דבר משה וגו' אלה פוסל את הראשונים, שרמז להם משרע\"ה בדברי תוכחתו, שתכלית השב אל ד' שיפסול מעשיו הקודמים, וידע כי עדיין לא השלים חובתו לה', וכן דרך עובדי ד' שפוסלים תמיד מעשיהם הראשונים, וזה הוכיח משרע\"ה את ישראל באמרו אלה, שיהיו בבחי' אלה פוסל את הראשונים, והם הם הדברים אשר דבר משה אל כל ישראל."}]},{"dvar_torah_id":"devurim_31d6f9e9","title":"","summary":"","contents":[{"passage_id":"devurim_31d6f9e9_p1","passage_content":"אלה הדברים אשר דבר משה אל כל ישראל, פרשיז\"ל לפי שהן דברי תוכחות, ומנה כאן כל המקומות שהכעיסו לפני המקום בהן, לפיכך סתם את הדברים והזכירם ברמז, מפני כבודן של ישראל, הקשו המפרשים הרי מצינו בפרשיות הבאות, שהזכיר משרע\"ה חטאם של ישראל בפירוש ובאר הטב, באמור להם ממרים הייתם וגו', ובחורב הקצפתם וגו', ומדוע לא חש גם שם לכבודן של ישראל, וביותר קשה ממה שפרש\"י עה\"פ הואיל משה באר את התורה הזאת, בשבעים לשון פירשה להם, וכן מבואר בגמ' (סוטה ל\"ה ע\"ב) דהאבנים שהקים משה בארץ מואב, וכתב עליהם את התורה בע' לשון, כדי שיבואו האומות ויעתיקוה, שלא יהי' להם פתחון פה עיי\"ש, ואיך לא חשו על כבודן של ישראל בפני האומה\"ע, והרי כתב הרמב\"ם ז\"ל (בפ' המשניות פ\"ק דע\"ז), דהטעם שאסרו חכמים להשכיר מרחץ לעכו\"ם מפני שנקראת על שמו של ישראל, ויאמרו העכו\"ם רחצנו במרחץ של פלוני בשבת, ויש חילול השם עיי\"ש, וא\"כ מדוע נתפרסם חטאם של ישראל בתורה ונתפרש בע' לשון, ואין זה לכבודן של ישראל בפני האומות."}]},{"dvar_torah_id":"devurim_1311c86c","title":"שאלות על משנה תורה ומקור סמכותה","summary":"שאלות על משנה תורה ומקור סמכותה","contents":[{"passage_id":"devurim_1311c86c_p1","passage_content":"גם קשה דמצינו בגמ' (מגילה ט' ע\"א) מעשה בתלמי המלך, שכינס ע\"ב זקנים והכניסן בע\"ב בתים וכו', וא\"ל כתבו לי תורת משה וכו', נתן הקב\"ה בלב כאו\"א עצה, והסכימו כולם לדעת אחת, וכתבו אלקים ברא בראשית וכו' יעיי\"ש, עוד כמה דברים ששינו מפני לעז האומות, ולכאורה מדוע לא שינו ג\"כ ברצון הבוי\"ת, להעלים חטאם של ישראל, כדי למנוע חילול השם, שיאמרו העכו\"ם ישראל עוברין על התורה, וכמו ששינו שאר דברים היה להם לשנות גם את זאת."},{"passage_id":"devurim_1311c86c_p2","passage_content":"ב) בעבר הירדן בארץ מואב הואיל משה באר את התורה הזאת וגו', כתב הרמב\"ן ז\"ל טעם הואיל משה שרצה לבאר להם את התורה, והזכיר כן להודיעם, כי מעצמו ראה לעשות כן, ולא צוהו השם בזה וכו' עכ\"ל, וכן משמע גם מדברי רש\"י ז\"ל מ\"ש עה\"פ ויהי בארבעים שנה וגו', מלמד שלא הוכיחן אלא סמוך למיתה, ממי למד מיעקב, שלא הוכיח את בניו אלא סמוך למיתה וכו', ואם נאמר שנצטוה מפי הקב\"ה להוכיח את ישראל, אין מקום לשאלה זו ממי למד וכו', הרי מבואר כדברי הרמב\"ן ז\"ל כי מעצמו ראה לעשות כן, וכ\"כ גם הראב\"ן (הובא בהגהות מהר\"ב רנשבורג יבמות ד' ע\"א) דר יהודה דורש סמוכים דוקא במשנה תורה, ולא בכל התורה, וטעמא משום דכל התורה מפי הגבורה נאמרה, ואין מוקדם ומאוחר, אבל משה שסידר משנה תורה פרשה אאר פרשה, ולא סידר אלא להדרש עכ\"ל, מבואר ג\"כ דס\"ל דמשנה תורה משה מפי עצמו סידרם, וכ\"כ האוהחה\"ק ר\"פ זו, כי אלה הדברים אשר דבר משה הם דברי עצמו עיי\"ש, אמנם הנחה זו מבהיל את הרעיון, דאיך יתכן לומר על חלק בתורה שמשה רבינו מעצמו ראה לעשות כן, והלא נצטוינו להאמין, שכל התורה נכתב בציווי הקב\"ה אליו, כאמרז\"ל (ב\"ב ט\"ו ע\"א) הקב\"ה אומר ומשה אומר וכותב, והאומר אפי' על אות א' שבתורה, שמשה מפי עצמו כתבו ה\"ז מין וכופר, ואיך אפ\"ל על כל המשנה תורה, שמשרע\"ה אמרם מבלי שנצטוה עלי' מהשי\"ת."},{"passage_id":"devurim_1311c86c_p3","passage_content":"ואפשר לתרץ קושיא זו עפ\"י פשטות, דמ\"ש הרמב\"ן ז\"ל דמעצמו ראה לעשות כן, ולא צוהו השם בזה, כוונתו רק על האמירה לישראל, שכל אלה המצות שבמשנה תורה כבר נצטוה מפי הקב\"ה עליהם, ועכשיו במשנה תורה חזר ושנאן ולמדם לבני ישראל, ומעצמו ראה לעשות כן, אבל בשעה שכתבן משה רבינו בתורה, כתבם עפ\"י ד' כשאר כל התורה שהקב\"ה אומר ומשה כותב ואומר ול\"ק מידי."}]},{"dvar_torah_id":"devurim_9bffe912","title":"כבוד ישראל וחטאיהם במאמר משה","summary":"במאמר זה נבאר מדוע משה לא הזכיר חטאי ישראל בפירוש בפסוק ראשון, אלא ברמז, כדי לשמור על כבודם. כאשר המנהיגים מוכיחים את העוברי עבירה, זהו כבוד שמים. בפסוק ראשון השכינה מדברת מתוך גרונו, ולכן החטאים נזכרים רק ברמז.","contents":[{"passage_id":"devurim_9bffe912_p1","passage_content":"עוד אפ\"ל בכוונת דברי הרמב\"ן ז\"ל עפימ\"ש רז\"ל בספרי (הובא ברש\"י ז\"ל ר\"פ מטות) משה נתנבא בכה אמר ד' והנביאים נתנבאו בכה אמר ד', מוסיף עליהם משה שנתנבא בזה הדבר, וביארו המפרשים ז\"ל, דזה הדבר השכינה מדברת מתוך גרונו, והוי כמו דיבורו של הקב\"ה כביכול בעצמו, משא\"כ כה הוי רק שליח, והם דברי עצמו בשליחות השי\"ת, ועד\"ז אפ\"ל בכוונת הרמב\"ן ז\"ל, במ\"ש שמעצמו עשה כן, ר\"ל שמשנה תורה אמרם לישראל בבחי' כה שהם דברי עצמו, ושאר כל התורה אמר בבחי' זה הדבר, ושכינה מדברת מתוך גרונו, והוי דיבורו של הקב\"ה בעצמו, אמנם פסוק ראשון אלה הדברים וגו' נשתנה מכלל משנה התורה ונאמרה בבחי' זה הדבר, וכ\"כ ההפלאה ז\"ל בס' פנים יפות עה\"ת (פר' זו) דאלה הדברים הוי כמו זה הדבר, ששכינה מדברת מתוך גרונו, וכ\"כ ק\"ז הישמח משה זלה\"ה (פ' יתרו) בפסוק אלה הדברים אשר תדבר אל בנ\"י עיי\"ש."},{"passage_id":"devurim_9bffe912_p2","passage_content":"ומעתה נבאר מדוע בפסוק ראשון הזכיר להם משרע\"ה חטאם רק ברמז, ובפרשיות הבאות הזכירן בפירוש, דהנה המפרשים הקשו על שיטת הרמב\"ם ז\"ל בפ\"ק דע\"ז הנ\"ל, דאוסר שכירות מרחץ בקבלנות מטעם מראית עין של עכו\"ם, דיש חילול השם, ויקשה עליו מגמ' מפורשת (מו\"ק י\"ב ע\"א) אמר שמואל מקבלי קבולת בתוך התחום אסור, חוץ לתחום מותר, וכו', לא אמרן אלא בשבתות ובימים טובים, דלא שכיחי אינשי דאזלי ואתי, אבל בחולו של מועד דשכיחי אינשי דאזלי ואתי להתם אסור עכ\"ד הגמ', ואי נימא דחששו חכמים גם למראית עין של עכו\"ם מפני חילול השם, א\"כ אין נפק\"מ בין שבתות ויו\"ט לחוה\"מ, ואף בשבת אית לן למיסר משום מראית העין של עכו\"ם, שאינו חושש לתחומין ואזל להתם, ותירצו דשיטת הרמב\"ם ז\"ל דמה שיראה העכו\"ם ישראל מחלל שבת אין כ\"כ חילול השם בדבר, כי גם באומות להבדיל נמצאים יחידים רבים, שאינם שומרים דת, אבל כשעושה כן בעיר ועיני ישראל רואים ומחשים, וגם המנהיגים אינם מוחים, בזה יש חילול ש\"ש, ולכן בשבתות ויו\"ט חוץ לתחום דלא אזלי ישראל להתם, ליכא חילול השם של גוים, משא\"כ תוך התחום, ובחולו של מועד אף חוץ לתחום נאסר משום מראית העין וחילול השם עכ\"ד."},{"passage_id":"devurim_9bffe912_p3","passage_content":"מבואר מזה שאם האומה\"ע רואין בישראל שעוברים על התורה ר\"ל, ליכא חילול השם, רק כ\"ז שאין המנהיגים מוחין ומוכיחים אותם על פניהם, אבל כשיש תוכחה ומענישים העוברי עבירה, אדרבה זהו כבודן של ישראל בעיני האומות, ובזה א\"ש מה שהעתיק משרע\"ה משנה תורה לע' לשון, וכל האומות ראו חטאם של ישראל מפורש באר היטב, ולא חשש משה למנוע מזה בשביל כבודן של ישראל, דאדרבה זהו כבודן של ישראל שהמנהיגים מוכיחין על עון הדור, ואינם מחניפין להם לחפות על כבודם, והרי זה כבוד שמים ולא חלול ש\"ש."},{"passage_id":"devurim_9bffe912_p4","passage_content":"אך כל זה כשהמנהיגים שבישראל מזכירים חטאם בשביל להוכיחם שיחזרו בתשובה, אז יש בה משום כבוד שמים וכבודן של ישראל, משא\"כ אם הקב\"ה יזכיר עונם אין זה לכבודם ח\"ו, וכמ\"ש רז\"ל לענין בושת (כתובות מ' ע\"א) הכל לפי המבייש והמתבייש, וע\"כ בפסוק ראשון אלה הדברים שהשכינה מדברת מגרונו, והם דברי השי\"ת כביכול בעצמו, כנ\"ל בשם ההפלאה ז\"ל, לא נזכרו החטאים רק ברמז בשביל כבודן של ישראל, אבל בכל משנה תורה שאמרן משרע\"ה בבחי' כה שהוא דברי עצמו, א\"ש שפירש חטאם ולא נמנע מפני כבודן, דאדרבה זהו כבודן שמוכיחין אותם מנהיגיהם כנ\"ל, ומה שמצינו גם בד' סדרים הקודמים שהזכיר עונם בפירוש, אפ\"ל עפימ\"ש ק\"ז הישמח משה זלה\"ה (פ' יתרו) לפרש הכתוב כה תאמר לבית יעקב וגו', כי משרע\"ה השתמש בב' הבחינות כפי הצורך, לפעמים בבחי' כה כגון לפשוטי העם, ולבני עלי' בבחי' זה הדבר עיי\"ש, וכמו\"כ לעניננו אפ\"ל שבעת הזכיר חטאם של ישראל, דיבר אליהם בבחי' כה, משא\"כ כאן במאמר אלה הדברים שהוא בבחי' זה הדבר, ע\"כ הזכיר החטאים רק ברמז."},{"passage_id":"devurim_9bffe912_p5","passage_content":"אפ\"ל עוד עפימ\"ש בספה\"ק דברי חיים זלה\"ה (פ' נח) וז\"ל שמעתי מאדמו\"ר החכם לה\"ה, שאין שום קטרוג חטא יכול לבוא לפני כסא הכבוד מחמת קדושתו, ואמר בשם הספרי מוסר, שבעולם שמכריזין החטא, טובלין אותו העולם כמה וכמה טבילות, ולכן בודאי שלא יכנוס החטא לפני בורא כ\"ע אשר טהור עינים וגו', ולכן אינו נכנס מהקטרוג רק שורש הקדושה אשר נמצא בעבירה, שבכל דבר בעולם יש בו איזה ניצוץ קדושה, ובעבירות החיות שבהם הוא שעי'\"ז יכול לעשות תשובה וגדולים בעלי תשובה, ולכן נכנס הקטרוג פלוני עשה דבר שיש בו תיקון תשובה כך וכך וכו' עיי\"ש, ובזה א\"ש שבפסוק ראשון אלה הדברים שנאמרה בבחי' זה הדבר ושכינה מדברת מתוך גרונו, ע\"כ לא הזכיר החטאים בפירוש, דלפניו ית' לא יבוא חנף, והזכירן רק ברמז, וירמוז ג\"כ על בחי' התשובה שבו כי באמת עשו ישראל תשובה שלימה על כל אלה, וכמ\"ש בתרגום יונתן ודי זהב, דדכר לכון זכות אבהתהון צדקיא, ומשכן זמנא וארון קיימא, ומאני קודשא דחפיתון דהבא סנינא, וכפר לון על חובת עגל דהבא עכ\"ל, הרי מבואר שרמז על בחי' התשובה שהוא תקון לחטא זה, כי החטא עצמו אין מזכירין לפניו ית', ועד\"ז באידך בערבה מול סוף בין פארן ובין תופל ולבן וחצירות, על כל אלה עשו ישראל תשובה גם מעיקרא כוונו לש\"ש כאשר ביארנו כל אחד במקומו, אלא שטעות נזדמנה לידם, ועכ\"פ נרמז בהזכרת המקומות ההם, גם שורש הקדושה אשר בעבירה, והחטא עצמו א\"א להזכיר לפניו ית' ע\"כ הזכירן ברמז, משא\"כ בפרשיות הבאות שכל משנה תורה אמר משרע\"ה בבחי' כה אמר ד', והם דברי עצמו בשליחות ד', ע\"כ הזכירן שם בפירוש."}]},{"dvar_torah_id":"devurim_c4cc07c5","title":"תוכחת משה לישראל והבחנות החטאים","summary":"משה רבינו מוכיח את ישראל על חטאיהם, אך יש הבחנה בין החוטאים לבין אלו שלא חטאו. התוכחה נועדה להעלות את כולם לתשובה עילאה, גם אם חלקם לא חטאו בעצם, אלא לא מיחו בעוברי עבירה. רמזים ניתנים לכבודם.","contents":[{"passage_id":"devurim_c4cc07c5_p1","passage_content":"עוד אפ\"ל לתרץ קושית המפרשים ז\"ל, מדוע בפרשיות הבאות הזכיר חטאם בפירוש, וכאן הטמינן ברמז, בהקדם לפרש דברי רש\"י ז\"ל אילו הוכיח מקצתן היו אלו שבשוק אומרים, אתם הייתם שומעין מבן עמרם ולא השיבותם דבר וכו', אילו היינו שם היינו משיבין אותו, לכך כנסם כולם, וא\"ל הרי כולכם כאן, כל מי שיש לו תשובה ישיב עכ\"ל, ומאמר זה נמצא גם במדרש עה\"פ אשר דבר משה אל כל ישראל, מלמד שכנסם משה מגדולם ועד קטנם, ואמר להם הריני מוכיחם כל מי שיש לו תשובה יבא ויאמר עכ\"ד המדרש, מבואר שלא הי' בידם להשיב תשובה ניצחת, דאל\"כ מה הועיל משרע\"ה באמירתו אליהם ובמה שכנסם כולם, הרי אם יש להם להשיב על דבריו בלא\"ה לא יקבלו תוכחתו, אמנם להלן בדברי המדרש מבואר להיפך, שדרשו רז\"ל עה\"פ ד' אלקיכם יוסף עליכם ככם וגו', א\"ר אליעזר יכולין היו ישראל לומר לו, רבינו משה אנו יש בנו אחד מכל הדברים שאתה מוכיחנו, וקבלנו תוכחותיך, אלא שתקו, לפיכך הוא אומר ככם צדיקים כיוצא בכם, מקבלים תוכחות ושותקים עכ\"ד המדרש, והוא לכאורה סתירה, גם אם לא הי' בהם אף אחד מכל הדברים שהוכיחן משרע\"ה, א\"כ למה הוכיחן בדברים שלא עשו, ואין בהם אשמה."},{"passage_id":"devurim_c4cc07c5_p2","passage_content":"והנה קושיא זו הקשה גם באוהחה\"ק, וז\"ל שמצינו שהוכיח את ישראל על מה שהמרו על ים בים סוף, ויאמר האומר והלא אותם שהמרו על ים סוף, כבר מתו ונשלמו בט\"ו באב של שנת הארבעים קודם מאמר זה של משה, וא\"כ אלה הצאן מה עשו שמוכיחם, לזה אמר אשר דבר משה, פי' אם היו הדברים מפי ד', אין מקום לדבר להם קשות, אבל משה הוא המדבר, ויכול לייסר גם אותם שהיו אז פחות מבן כ' שנה שלא נגזר גזירה (עליהם שימותו), כי בי\"ד של מטה מענישין מבן י\"ג, וכנגד אותן שהיו בן י\"ג בים סוף הוא שדבר משה קשות, ולהלן כתב עוד, אפשר שכלל במאמר אל כל ישראל גם לאותן שכבר מתו, שבתוכחותיו דבר על הראשונים ועל האחרונים, ע\"ד אומרו אביך הראשון חטא עכ\"ל, ובש\"ך עה\"ת תירץ דכל אלו שמתו במדבר חזרו ובאו בגלגול עוה\"פ, ואותו הדור שדבר משה אליהם התוכחות, הם היו גלגולי נשמות מאותן שעשו אלו החטאים, והם ידעו בעצמן ושתקו עכ\"ד."},{"passage_id":"devurim_c4cc07c5_p3","passage_content":"ואפ\"ל דכולהו איתנייהו וכל אלו החלוקות היו בישראל, ומשרע\"ה הוכיח כל א' ואחד לפי בחינתו, דאותן שהיו בן י\"ג בים סוף ולא מתו בכלל הגזירה, עליהם דיבר משה קשות, כי הם בעצמם היו החוטאים, ומה שחזר משרע\"ה והזכיר החטאים בפירוש בפרשיות הבאות, שנא' ובחורב הקצפתם וגו' ממרים הייתם וגו', אליהם יסובב מלתו, ולא חש לכבודן להזכירן רק ברמז, מאחר שהם בעצמם היו החוטאים, ואולי לא יתבוננו ברמיזתו ולא יתעוררו אל התשובה, ע\"כ הזכירם בפירוש ודיבר אליהם קשות."},{"passage_id":"devurim_c4cc07c5_p4","passage_content":"אמנם היו גם בישראל מאותן שלא חטאו כלל, ואף בגלגולם הקדום לא הי' להם חלק בכל אלו החטאים, כי לא כל ישראל חטאו במרגלים ועגל ואידך, אלא על שלא מיחו בעוברי עבירה ע\"כ הוצרכו לתיקון, ואף אותן שחטאו ומתו ונתגלגלו, כבר עשו תשובה בגלגולם הקדום ונתכפר להם, כמבואר בפסוקים ובדברי רז\"ל, אלא שבעולם העליון מדקדקים אף על פגם דק וקל, מה שלא נחשב לפגם בעולם שלמטה הימנו, ומזה הטעם עושים תקון ביום היאהרצייט לעילוי נשמת הנפטר, אף שלאחר י\"ב חודש כבר נזדכך ונשלם ענשו, אבל בכל פעם שנתעלה הנשמה לעולם גבוה יותר, מדקדקים עמו יותר, וצריך תקון אף על הפגמים שלא היו מדקדקים עמו בעולם שלמטה הימנו וכמו\"כ אותו הדור שחזרו בגלגוליהם, אף שלא הי' עצם החטא קיים, וכבר נתכפר להם, מ\"מ הוצרכו לתיקון לפי ערך מדריגתם, גם אפשר שרצה משרע\"ה להעלותם למדריגת תשובה עליונה."},{"passage_id":"devurim_c4cc07c5_p5","passage_content":"ומ\"ש רז\"ל במדרש יכולין היו ישראל לומר רבינו משה, אנו יש בנו אחד מכל הדברים שאתה מוכיחנו, הכוונה על החלק מישראל שלא הי' בהם מעצם החטא וכבר נתכפר להם, אלא שהוכיחם משרע\"ה להעלותם לבחי' תשובה עילאה, והם ידעו בעצמן ושתקו, ואליהם דיבר משה ברמז, ולא הזכיר החטאים בפירוש מפני כבודם, שכבר היו מנוקים מן החטא ונתכפר להם, גם דלבני עלי' יספיק הרמז בלבד, אמנם לאותן שחטאו בפועל דיבר קשות והזכיר עונם."},{"passage_id":"devurim_c4cc07c5_p6","passage_content":"ובזה יובן מה שכנסם משרע\"ה כולם, ואילו הוכיח מקצתן היו אלו שבשוק אומרים, אילו היינו שם היינו משיבין אותו, דבאמת אותן שחטאו לא היו להם מה להשיב, אבל מפני שדברי תוכחתו בפסוק זה שהזכיר החטאים ברמז, הי' סובב אל אלה שהיו מנוקים מן העון, אלא שרצה להעלותם לבחי' תשובה עילאה, וע\"כ הוצרכו לשמוע דברי תוכחה אלו יוצא מפי קודש משרע\"ה, ואילו לא כנסם כולם היו אותן שבשוק אומרים, אילו היינו שם היינו משיבין אותו, ואף שהיו שומעים כל דברי תוכחתו מפי אותן שהיו שם, לא היתה מתקבלת על לבם, כמו אילו היו שומעים מפי משרע\"ה בעצמו, וע\"כ היו חושבין אילו היינו שם היינו משיבין לו, וכבר הבאנו לעיל מדברי הפנים יפות, דאלה הדברים הוי כמו זה הדבר, ושכינה מדברת מתוך גרונו, נמצא ששמעו דברי השי\"ת כביכול בעצמו, ובודאי עשו פעולת הדיבורים רושם, להעלותם לבחי' תשובה עילאה, ומה\"ט כנסם משרע\"ה כולם והבן."}]},{"dvar_torah_id":"devurim_6e313e53","title":"תשובה מאהבה והכבוד לישראל","summary":"משה רבנו רמז לחטאים כדי להעלות את ישראל לתשובה עילאה מאהבה. לאחר שעשו תשובה, הוזכרו החטאים בפירוש, כי אז נעשו זכיות. תוכחתו התקבלה, והכבוד לישראל מחייב להעלים חטאים עד לתשובה מאהבה.","contents":[{"passage_id":"devurim_6e313e53_p1","passage_content":"באופן אחר אפשר לתרץ קושית המפרשים הנ\"ל, מדוע הזכיר משרע\"ה כאן חטאם רק ברמז, ולהלן בפ' הבאות הזכירם בפירוש, ומדוע לא חש לכבודם גם שם, ויתבאר עפיד\"ק הקדושת לוי זלה\"ה (פ' האזינו), לפרש אמרם ז\"ל, ולקחתם לכם ביום הראשון, וכי ראשון הוא וכו', אלא ראשון לחשבון עונות, ותו\"ד כי ידוע מאחז\"ל שע\"י תשובה מיראה הזדונות נהפכו לשגגות, וע\"י תשובה מאהבה הזדונות נהפכו לזכיות, וע\"כ בחג הזה שאנו באים לחסות בצל ד', ע\"י מצות ומע\"ט מאהבת השי\"ת, אז מונה העונות לידע כמה מצות יהי' חילוף העונות, משא\"כ עד סוכות דהוא מיראה, אזי לא ימנה כלל, שעדיין הם שגגות, וזה פירוש ראשון לחשבון עונות עיי\"ש."},{"passage_id":"devurim_6e313e53_p2","passage_content":"והנה כבר ביארנו בדברינו לעיל, שלא הי' תוכחה זו לאפרושי מאיסורא, שכבר היו ישראל מנוקים מעונות אלו ונתכפר להם, אלא שהוכיחם משרע\"ה כדי להעלותם לבחי' תשובה עילאה ומאהבה, וקבלו ישראל תוכחתו, כמפורש במד\"ר, א\"ל הקב\"ה למשה, הואיל וקיבלו ישראל תוכחתי, צריך אתה לברכן מיד חזר וברכן וכו', ובזה א\"ש שבפסוק ראשון הזכיר החטאים רק ברמז, דטרם שעשו תשובה מאהבה, לא נכנסו העונות בחשבון הזכיות, וטוב להעלימם, ואף שכבר עשו תשובה ונתהפכו לשגגות, מ\"מ גם השגגות אינם לכבודן של ישראל להזכירן, וע\"כ הזכירם רק ברמז, אבל אחר שעשו תשובה מאהבה ונעשו זכיות, מכאן ואילך הזכירם בפירוש וזהו כבודם."}]},{"dvar_torah_id":"devurim_6a09f661","title":"","summary":"","contents":[{"passage_id":"devurim_6a09f661_p1","passage_content":"אלה הדברים אשר דבר משה אל כל ישראל, פרש\"י אלו הוכיח מקצתן היו אלו שבשוק אומרים, אתם הייתם שומעים מבן עמרם, ולא השיבותם דבר וכו', לכך כנסם כולם וכו', ולכאורה צ\"ב דמשמע דלולא טעם זה לא הי' מוכיח את כולם, ומהיכי תיתי לומר כן, ומה נשתנו אלו מאלו, גם צ\"ב מ\"ש היו אלו שבשוק אומרים וכו' לא השיבותם דבר, ומה הי' להם להשיב על אמיתת דבריו של אדוננו משרע\"ה, ואפ\"ל עפימ\"ש ק\"ז זלל\"ה בתפלה למשה, לפרש הפסוק טוב מעט לצדיק מהמון רשעים רבים דהצדיק ממעיט את עצמו בקום עליו המון רשעים רבים עייש\"ד, ובחי' כעין זו מבוארת בספה\"ק, שלפעמים הצדיק מתמעט ממדריגתו לפי שעה, ע\"י חטא העם שעושה רושם בהצדיק, והנה שורש כל החטאים הי' מן הערב רב, ולכאורה הי' מן הסברא, שלא יוכיח משרע\"ה אלא ישראל ולא הערב רב, כמ\"ש שלמה המ\"עה, אל תוכח לץ פן ישנאך הוכח לחכם ויאהבך, אבל אילו הי' משרע\"ה עושה כן, היו אלו שבשוק היינו הערב רב אומרים, אלו היינו שם היינו משיבים אותו, טול קורה מבין עיניך, כמ\"ש לעיל דחטאם של העם עושה רושם בהמנהיג, ואולי בטענתם ותלונתם היו מחלישים כח התוכחה גם אצל בנ\"י, אמנם משרע\"ה לא חש לזה וכנסם כולם, ואמר כל מי שיש לו תשובה ישוב, ובלא\"ה לא יתכן תשובה זו לגבי משרע\"ה, שהי' מזוכך בתכלית הזיכוך ובלי שום פגם כלל."}]},{"dvar_torah_id":"devurim_adbc876a","title":"ברכות בלעם והכוח הרע שבדיבור","summary":"בלעם, המוכיח את ישראל, הטמין בדיבוריו רוע, אף שדיבר ברוח הקודש. משה, לעומתו, הוכיח את ישראל בחן. ברכותיו של בלעם חזרו לקללה, אך נמתקו על ידי קריאת התורה, והקדושה שורה על הדיבורים.","contents":[{"passage_id":"devurim_adbc876a_p1","passage_content":"אלה הדברים אשר דבר משה אל כל ישראל בעבר הירדן וגו', במד\"ר זש\"ה מוכיח אדם אחרי, חן ימצא ממחליק לשון, מוכיח אדם זה משה, שהוכיח את ישראל וכו', ממחליק לשון זה בלעם, שדבר להם חלקלקות, ואמר מה טובו אוהליך יעקב, משל דמשה ודבלעם למה הדבר דומה, לבן מלך שיש לו ב' שרים, א' אוהבו וא' שונאו וכו', והשונא אומר עשה כל תאות לבך, כי המלך אביך ואינך ירא משום דבר וכו', כך בלעם השונא אומר להם מה טובו אהליך יעקב וכו', עשו כל תאות לבבכם, כי לאומות עושה כל הרעה שגזר עליהם, אבל בכם שאתם בניו, אם גזר רעה ההוא אמר ולא יעשה וכו', וצ\"ב הלא כל ברכותיו נאמרו לו בבחי' נבואה מאת ד', כמ\"ש וישם ד' דבר בפי בלעם, שוב אל בלק וכה תדבר, ולא הי' יכול לדבר כ\"א דיבורים, שהושמו בפיו מר, כמ\"ש את אשר ישים ד' בפי אותו אדבר, גם כי דבריו המה חלק התורה וחזר וכתבם משרע\"ה בתורה, והאיך אמר עשו כל תאות לבבכם והמה לא דברי ד' (וכבר ביארנו בזה ועוד לאלקי מילין)."},{"passage_id":"devurim_adbc876a_p2","passage_content":"ונל\"פ דהנה הרמב\"ם ז\"ל (בה' יסוה\"ת פ\"ו ה\"ח), נתן טעם דאפיקורס שכתב ס\"ת וכו' מצוה לשרפו, כדי שלא להניח שם לאפיקורסים ולא למעשיהם, ובס' חסידים כתב טעם, שהמין ע\"י מעשה כתיבתו נותן בו מארס המינות, ואע\"פ שכותב ממש דברים ככתבן, כמו שניתנו מסיני ואינו משנה שום דבר, מ\"מ מטמין בו כח מינות עיי\"ש, וכעין שכתב בספה\"ק אגרא דכלה (פ' שופטים) קבלה מרבותינו כח הפועל בנפעל, ממילא ממונו ורכושו של אדם, שהאדם מסגלו ע\"י מעשיו, הנה יש בממון ורכוש ההוא כח הפועל, ע\"כ נאסר לנו לפרוט מתיבת המוכסין, כיון שכח הפועל יש בממון ההוא, והאדם הכשר יקחנו לעצמו, הנה יגרום לנפשו פעולת זרות, כפי כח הפועל הנפשיי מבעלים הראשונים עכלה\"ק, ואם בממון וחפץ גשמי כך, עאכו\"כ בקדושת ס\"ת, שכל דבר שקדושתה גדולה, תאבים יותר כוחות הסט\"א להתדבק בה כידוע, ועד\"ז אפ\"ל לענין דברי בלעם בברכותיו, אף שאמר אותן הדיבורים בעצמן שנתן ד' בפיו, מ\"מ לצד גודל רשעתו ודביקותו בכוחות הטומאה, הטמין בהם כח נפשיי וארס הרע אשר בקרבו, ולזה הי' פעולת הדבורים להטעות את ישראל, ולומר עשו כל תאות לבבכם וכו', ואפשר שלא אמר כן בפירוש, אבל הי' משמעות דבריו כן, לצד כח הפועל הרע אשר טמון בהם."},{"passage_id":"devurim_adbc876a_p3","passage_content":"ואפ\"ל עוד בכוונת דברי המדרש הנ\"ל, בהקדם דברי הגמ' (סנהדרין ק\"ה ע\"ב), א\"ר יוחנן מברכתו של אותו רשע, אתה למד מה הי' בלבו וכו', (פרש\"י דכתיב ויהפוך ד' אלקיך לך את הקללה לברכה, הוא הי' רוצה לקללם בכך שלא יהיו בתי כנסיות, ולא נתן לו רשות ואמר מה טובו אהליך יעקב), א\"ר אבא בר כהנא, כולם חזרו לקללה, חוץ מבתי כנסיות ובתי מדרשות, שנא' ויהפוך ד' אלקיך לך את הקללה לברכה וגו', קללה ולא קללות עכ\"ד הגמ', ופירשתי עפי\"ד הה\"ק מוה\"ר מענדלע זלה\"ה בס' דברי מנחם, שהקשה דהלא באמת היו ברכותיו רק מן השפה ולחוץ, ולבו בל עמו, וא\"כ איך יכולים ברכות כאלה לשרות ולחול על המתברך וכו', דאנן קיי\"ל שהמברך את חבירו, צריך ליתן חיות ושכל טוב לתוך הדיבורים, היינו שיתן את דעתו ורצונו וכל חפצו באהבה עזה, ועי\"ז יכולה הברכה להתקיים ולחול על המתברך, משא\"כ מי שמברך בפיו ולבו בל עמו וכו', אך התירוץ הנכון הוא, שבשעה שאנו קוראים בתורה אותן הברכות, או כשאנו לומדים ועוסקים בהם, צריכים אנו להמתיק את כל הדיבורים האלה, וליתן בהם שכל טוב וחיות של שפע ברכות, ועי\"ז החיות הם יכולים לשרות על ישראל וכו' עכלה\"ק."},{"passage_id":"devurim_adbc876a_p4","passage_content":"ועפי\"ז אל\"פ דברי הגמ' הנ\"ל כולם חזרו לקללה, שברכותיו לא הועילו כלום להתברך על ידם, מפני שנאמרו בכוונה רעה, ובלבו הי' לקללם, וע\"כ חזרו לקללה כפי שורש כוונתו בהדיבורים, אלא שע\"י הקריאה והלימוד ימתקו הדיבורים ויתהפכו לברכה, ולזה אמר חוץ מבתי כנסיות ובתי מדרשות שזה לבד נתקיימה, ועי\"ז יתהפכו כולם לברכה, עכ\"פ באותה שעה היו ברכותיו לרועץ ולקלקלה, אלא שאח\"כ נתקנו כנ\"ל."},{"passage_id":"devurim_adbc876a_p5","passage_content":"ואפ\"ל עוד, דהנה כל התורה הי' הקב\"ה אומר, ומשה אומר וכותב, וע\"כ אף שלצד עצם כוונתו הרע, לא היו ראויים הדיבורים לחול ולשרות בהם הברכה, ומה\"ט חזרו לקללה, אבל אח\"כ כשכתב משרע\"ה פ' זו בתורה, נמתקו הדיבורים ונתהפכו לברכות, ע\"י שהקב\"ה הי' אומר ומשה אומר וכותב, והנה לחד מ\"ד תורה מגילה ניתנה, ר\"ל שנכתב כל פרשה בפ\"ע ע\"י משרע\"ה, כפי סדר המאורע ומיד כשנצטוה עליה, ולחד מ\"ד ס\"ל תורה חתומה ניתנה, שכתבה משרע\"ה כולה בסוף מ' שנה, ומסרה לישראל ביחד, ואיך שיהי' נוכל לחלק, דמ\"ש רז\"ל כולם חזרו לקללה, הכוונה משעה שאמרם בלעם עד שכתבם משרע\"ה בתורה, אבל אח\"כ נתהפכו לברכות ונמתקו, ולזה המשילו רז\"ל במדרש את בלעם לשונא, שאמר מה טובו אהליך יעקב וגו' עשו כל תאות לבבכם וכו', שלצד כוונתו הרעה היתה פעולת דבריו להטעות את ישראל, אלא שאח\"כ נמתקו הדיבורים ושרתה עליהם קדושה כנ\"ל."},{"passage_id":"devurim_adbc876a_p6","passage_content":"ואפ\"ל עוד בדברי המדרש הנ\"ל, בהקדם לבאר הכתוב מוכיח אדם אחרי חן ימצא וגו', עפי\"ד ק\"ז זלה\"ה בתפלה למשה (סי' מ') לפרש הכתוב בשרתי צדק בקהל רב וגו', כי הרוצה להצדיק עצמו יכול עשוהו, כי לב יודע מרת נפשו, ויודע מה שקלקל ויוכל לתקן, אבל מי שהוא רוצה לעמוד בתוך קהל ועדה להצדיקם, מאין הוא יודע מה שקלקל כ\"א ולהסיר המכשלה, ע\"כ זאת העצה היעוצה שלא ידבר רק מה שישים אלקים בפיו, כי הוא יתן אומר המבשרות צבא רב, והוא יודע מה שקלקל כ\"א, ויתן לתוך פיו מה שצריך, וה\"פ בשרתי צדק בקהל רב דייקא, והוא יוצא מגדר האפשרות כמעט, דמאין לו לידע קלקולם, לכך הנה שפתי לא אכלא, ומה שישים אלקים בפי אותו אשמור לדבר, וד' אתה ידעת, איזה תקון אשר צריכין, ומזמין ושולח דברים אשר ראוי לפי שעה עכלה\"ק, וז\"פ הכתוב לדרכנו מוכיח אדם אחרי חן ימצא, אין חן אלא רוה\"ק, כמ\"ש במכילתא (פ' בא) עה\"פ וד' נתן את חן העם וגו', ר\"א אומר רוה\"ק שרתה עליהם וכו', אין חן אלא רוה\"ק שנא' ושפכתי על בית דוד רוח חן, וכמו\"כ המוכיח את ישראל, הובטח מהקב\"ה שישרה עליו בחי' רוה\"ק באותה שעה, דלולי זאת אין בגדר האפשרות לידע ולכוין צורך התקון לכ\"א כנ\"ל, וז\"א מוכיח אדם זה משה, שהוכיח את ישראל, וכל דיבוריו ברוה\"ק נאמרו."},{"passage_id":"devurim_adbc876a_p7","passage_content":"והנה כתב האוהחה\"ק (בפ' בלק) עה\"פ וישם ד' דבר בפי בלעם, וז\"ל כי לפי שרצה ד' לגלות עתידות, ודברים נפלאים מהטובות אשר יגיעו לישראל, ורצה שיתגלו על יד בלעם נביא האומות, לפרסם מעלת עם קדושו לפני כל האומות וכו', ולפי שאדם זה הוא אדם מובהק בכיעור ותיעוב ושיקוץ, לא תנוח עליו הרוח הקדושה המגדת עתידות וכו', לזה נתחכם ד' לעשות תיקון לדבר קדושה, לבל תעבור במבוי מטונף, ועשה מחיצה בין כח המדבר והדיבור עצמו ובין פי חזיר, והוא מאמר וישם ד' דבר אחד בפי בלעם, הציע כח א' שיכול להתמצע בין שניהם, ובזה נעשה פי בלעם גבול בפ\"ע והדבר מפסיק לגבול כח המדבר והדיבור, ואז כה תדבר, רוח הקודש היא תדבר, ורז\"ל בזוהר אמרו כי תיבת כה תרמוז לבחי' קדושה עכדה\"ק."},{"passage_id":"devurim_adbc876a_p8","passage_content":"וז\"פ אמרם ז\"ל במדרש ממחליק לשון זה בלעם, ר\"ל שנעשה חלוקה ומחיצה בינו להדיבור, והרוה\"ק הי' מדבר מה טובו אהליך יעקב וגו', וכל אלה הברכות לא מפיו יצאו, ואפשר דאחר שסר רוה\"ק ממנו, הוסיף דברי עצמו והמה חזרו לקללה, כי הי' כוונתו לכך, ולזה המשילו רז\"ל את בלעם לשונא, שאמר עשו כל תאות לבבכם וכו', כי המה דברי עצמו, ובזה מבואר מ\"ש רז\"ל בגמ' (ברכות ז' ע\"א) מאי למען דעת צדקות ד', א\"ר אלעזר אמר להם הקב\"ה לישראל, דעו כמה צדקות עשיתי עמכם, שלא כעסתי בימי בלעם הרשע, שאלמלי כעסתי לא נשתייר משונאיהם של ישראל שריד ופליט, ובגמ' שם שהי' בלעם יודע לכוין אותה שעה שהקב\"ה כועס, וכמה זעמו רגע, וכתבו התוס' וא\"ת מה הי' יכול לומר בשעת רגע, יש לומר כלם, אי נמי מאחר שהי' מתחיל קללתו באותה שעה, היה מזיק אפי' לאח\"כ עכ\"ד התוס', ולכאורה הרי לא הי' יכול לדבר כ\"א את אשר ישים ד' בפיו, והאיך הי' אפ\"ל לומר כלם, או לקללם, אמנם נראה שלא מנע ה' הבחירה ממנו, מלהוסיף או לשנות דבר, כ\"א בהדיבורים שנאמרו ברוה\"ק, ורז\"ל אמרו בתנחומא וישם ד' דבר בפי בלעם, כאדם שנותן כלבוס (רסן) בפי בהמה ופוקמה להיכן שירצה, אבל אח\"כ הוסיף עוד דברי עצמו, ולא מנע ד' הבחירה ממנו, אלא שצדקה עשה ד' עם ישראל, שלא כעס באותן הימים, ולא הועיל קללתו כלום, והפכם ד' לברכה."}]},{"dvar_torah_id":"devurim_8ced2f0d","title":"עונש החוטאים והגאולה העתידה","summary":"במאמר זה נדונה השפעת שמירת התורה על קיום העולם, והקשר בין חטאי ישראל לדחיית הגאולה. נבואות בלעם והנביא ישעיהו מצביעות על כך שעזיבת ד' מביאה לנסיגה אחור, והגאולה תבוא במפתיע בזכות התשובה.","contents":[{"passage_id":"devurim_8ced2f0d_p1","passage_content":"עוד אפ\"ל ברמז אמרם ז\"ל בדברי המדרש הנ\"ל, בהקדם לפרש פסוקי הפטורת (פ' זו) הוי גוי חוטא עם כבד עון, זרע מרעים בנים משחיתים, עזבו את ד' נאצו את קדוש ישראל נזורו אחור, פרש\"י נזורו אחור נסוגו לאחוריהם מאצל המקום, וכן פי' הרד\"ק ז\"ל, וצ\"ב דכבר נכלל זה במאמרו הקודם עזבו את ד' נאצו את קדוש ישראל, ומה הוסיף הכוונה במ\"ש נזורו אחור, ונל\"פ בהקדם מה שפרשתי בדברי המדרש (פ' תזריע) אחור וקדם צרתני, זכה אומרים לו אתה קדמת לכל מעשה בראשית, לא זכה אומרים יתוש קדמך, ולכאורה איך תליא זה באם זכה או לא זכה, דלפי האמת נברא האדם אחר כל מעשה בראשית ואפי' יתוש קדמו, ואיך בזכה אומרים לו אתה קדמת וכו', ופרשתי עפי\"ד האוהחה\"ק (בפ' בראשית) עה\"פ כי בו שבת מכל מלאכתו, וז\"ל באמצע הדיבור מצינו כי גילה הדבר במ\"ש בעשרת הדברות, כי ששת ימים עשה ד' את השמים ואת הארץ וגו', כי בשעת הבריאה לא ברא ד' כח בעולם, זולת לעמוד ששת ימים וכו', ונתחכם ד' וברא יום א' וכו' ובו ביום חוזר ד' ומשפיע נפש לעולם, שיעור המקיים עוד ששה ימים, וכן על זה הדרך וזולת זה היום הי' העולם חרב בגמר ששת ימים וחוזר לתהו ובהו, ופי' בזה אמרם ז\"ל כל המקדש ואומר ויכלו, כאלו נעשה שותף להקב\"ה במעשה בראשית, כי מציאות השבת בעולם, הוא קיומו שמקיימים אותו וכו', ובאמצעותו מתקיים העולם, ואין לך שותף גדול מזה כדין וכהלכה, עיי\"ש שהרחיב הביאור."},{"passage_id":"devurim_8ced2f0d_p2","passage_content":"והנה כמו\"כ בשמירת כל המצות, נתקיים העולם ע\"י ישראל מקיימי התורה, ולולי כן הי' העולם חרב וחזרה לתהו ובהו, והכלל הוא דבכ\"מ הסיבה קדם להמסובב, וז\"פ דברי המדרש, זכה אומרים לו אתה קדמת לכל מעשה בראשית, שכולם מתקיימים רק ע\"י שמירת התורה והמצות, נמצא האדם קדם לכולם, שהוא סיבת המקיימם, ואם לא זכה אומרים לו יתוש קדמך, שכן נברא האדם בפועל מאוחר לכל מע\"ב, וז\"פ דברי הנביא הוי גוי חוטא עם כבד עון עזבו את ד' נאצו את קדוש ישראל נזורו אחור, ר\"ל ע\"י שעזבו את ד' ושמירת התורה ומצותי', נסוגו אחור לכל מעשה בראשית, ואומרים לו יתוש קדמך, ואין לאדם קדימה למע\"ב, רק אם מקיים העולם ע\"י שמירת התורה ומצותי', וזה אפ\"ל פי' הכתוב, השיבנו ד' אליך ונשובה חדש ימינו כקדם, דע\"י התשובה זוכין ישראל להיות מקיימי העולם, ויתחדש ימינו להחשב כקדם לכל מעשה בראשית."},{"passage_id":"devurim_8ced2f0d_p3","passage_content":"ואפ\"ל עוד רמז בדברי הנביא ישעי' הנ\"ל, בהקדם דברנו (בפ' בלק) לפרש הכתוב איעצך אשר יעשה העם הזה לעמך באחרית הימים, פרש\"י איעצך להכשילם, ואומר לך שהם עתידין להרע למואב באחרית הימים, ולפירושו נחלק הכתוב לשנים, שנתן לו עצה להכשילם, והודיעו מהעתידות אשר יעשה העם לעמך וגו', ולכאורה אינו מבואר בכתוב כ\"א הודעת העתידות, והיכן מרומז שנתן לו עצה להכשילם, ואם במ\"ש איעצך, אינו מפורש עצה זו מה הוא, גם אם הם ב' ענינים, הול\"ל ואשר יעשה העם הזה בוא\"ו המחלקת, ופרשתי דהמשך הכתוב אחד הוא, והעצה להכשילם מקושר עם מה שהודיע מהעתידות, עפימ\"ש ק\"ז הישמח משה זלה\"ה בפירושו על איכה, עה\"פ מלאו ימינו כי בא קצנו, דהרבה קצין יש, שהוא עת רצון והתעוררות לגאולה, אלא שנדחה בעוונות ישראל, אמנם כאשר יהי' הקץ של בעתה, לא ידחה משום דבר, ובא יבא בודאי, עיי\"ש שפי' בזה הכתוב הנ\"ל."},{"passage_id":"devurim_8ced2f0d_p4","passage_content":"והנה בלעם נתנבא על גאולה העתידה, וידע שהקץ של בעתה א\"א לדחותו, ובא יבא בודאי, אבל רצה להרחיקו ולאחרו כל כמה שאפשר, ועד\"ז פי' הכ' איעצך אשר יעשה העם הזה לעמך באחרית הימים, שאתן לך עצה, דמה שעתידין העם הזה להרע לעמך בגאולה העתידה ידחה לאחרית הימים, לקץ האחרון שא\"א להרחיקו עוד, וע\"ד שפי' רש\"י ז\"ל (בפ' ראה) עה\"פ אחרי דרך מבוא השמש, הרבה והלאה למרחוק, וזהו לשון אחרי, כ\"מ שנאמר אחרי מופלג הוא, ואף כאן פי' אחרית הימים, הרבה והלאה למרחוק, כמה שאפשר להרחיקו, וענין העצה מפורש בסמיכות הפרשה, ויחל העם לזנות וגו', אמר אלקיהם של אלו שונא זימה הוא וכו', ובעוה\"ר גם בימינו נתרבה הפריצות מאוד, וזה מעכב ודוחה את הגאולה, וכל אלו המסייעים לזה, הם מתלמידיו של בלעם הרשע, שהוא הי' המתחיל בעצה זו, וע\"ז נאנח הנביא ישעי' ואמר, הוי גוי חוטא בנים משחיתים עזבו את ד' נאצו את קדוש ישראל נזורו אחור, ר\"ל שבעונותם גורמים לאחר את הגאולה עד קץ האחרון של בעתה."},{"passage_id":"devurim_8ced2f0d_p5","passage_content":"וז\"פ הפסוק מוכיח אדם אחרי חן ימצא, שהמוכיח את ישראל אחרי, ר\"ל על שמאחרין ודוחין את הקץ בעונותיהם, חן ימצא עי\"ז יזכו לחנינה, ויבא הגאולה בהיסח הדעת ובחי' מציאה, וכמ\"ש הכתוב פתאום יבא אל היכלו האדון אשר אתם מבקשים, ממחליק לשון זה בלעם שהחליק בנבואותיו, ורצה להרחיק את הגאולה עד קץ האחרון, וממנו נקח לעבוד את ד' להתרחק מן הכיעור והדומה לו, כי הוא הגורם לדחות ולאחר את הגאולה ר\"ל."}]},{"dvar_torah_id":"devurim_7222bef3","title":"","summary":"","contents":[{"passage_id":"devurim_7222bef3_p1","passage_content":"באופן אחר אפשר לפרש דברי המדרש הנ\"ל עפי\"מ דאיתא במדרש ילקוט (דברים רמז תשצ\"ג) אוהבו של אדם אומר לו השמר בעצמך, אבל שונאו אומר לו אל תתירא כדי להפילו, משה אמר השמרו לכם פן יפתה לבבכם וחרה אף ה' בכם, דיין הוא אינו נושא פנים ולא יקח שוחד, משה הי' מוכיחן, אבל בלעם הרשע אמר להם אל תראו, עשו כל מה שאתם מבקשים, תרועת מלך בו, ההוא אמר ולא יעשה, וכששמעו מיד נפלו שנאמר וישב ישראל בשטים, ושלמה צווח נאמנים פצעי אוהב זה משה, ונעתרות נשיקות שונא זה בלעם הרשע עכ\"ד המדרש. ולכאורה צ\"ב אמאי נקרא שונא, בשביל שאמר דברי נבואתו מה שנתן ד' בפיו, ובודאי לא אמר בפירוש עשו כל מה שאתם מבקשים, אלא שהי' מקום בדבריו לטעות כן, ומה פשעו בזה, סו\"ס לא אמר רק את אשר ישים ד' בפיו, ונל\"פ דהנה תוכן דברי נבואתו הי' להפליג גדולתן של ישראל, ואהבתו ית' אליהם, ודביקותם בו ית', וכל אלה הם דברי ד' ונבואה אמיתית, אמנם אין ספק שהי' כלול בדברי ד' גם דבקותם של ישראל בתוה\"ק, ואהבת מצותיו ית', כי לא יצוייר דבקותם של ישראל בהקב\"ה ואהבתו ית' אליהם, כ\"א ע\"י דביקותם בתוה\"ק, ואזהרת השמרו לכם פן יפתה לבבכם וחרה אף ד' בכם, הי' ג\"כ כלול בדברי נבואתו, כי א\"א זבל\"ז, אלא שבלעם השונא החליק בנבואתו, ר\"ל חלקם לבי תרי, וגילה רק החלקים הערבים לאוזן השומען, והעלים האזהרות והעונשים הכלולים בו, וע\"כ הי' משמעות דבריו לומר, עשו כל מה שאתם מבקשים ולא תענשו, אבל משרע\"ה האוהב הזהירם גם על העונשים, השמרו לכם פן יפתה לבבכם וחרה אף ד', שא\"א שיתחזק עבותות האהבה, בין ישראל לאביהם שבשמים, כ\"א ע\"י שמירת התוה\"ק, והנה מדרך העולם לשנוא את המוכיח ולאהוב את המחניף, וכמאמרם ז\"ל (כתובות ק\"ה כרב) האי צורבא מרבנן דמרחמין לי' בני מתא, לאו משום דמעלי טפי, אלא משום דלא מוכח להו במילי דשמיא, אמנם כ\"ז רק לפי שעה, אבל אחר זמן נכרים דברי אמת, והמוכיח ימצא חן, והמחניף יתגנה, כי שקרא לא קאי, וכן כאן שהוכיח משרע\"ה את ישראל, והזכיר להם כל החטאים שעשו, עי\"ז הכירו באהבתו, ונתאהב אצלם יותר, וז\"פ דברי המדרש אלה הדברים אשר דבר משה אל כל ישראל, זש\"ה מוכיח אדם אחרי חן ימצא ממחליק לשון, כל מקום שנאמר אחרי מופלג, שלבסוף לאחר זמן חן ימצא, בבחי' מציאה ובהיסח הדעת, אף שאין זה טבע ברא לאהוב המוכיח, ולא עלה דעתו על כך, והדר מפרש מוכיח זה משה, אדם אלו ישראל, ממחליק לשון זה בלעם שהחליק בנבואותיו ורצה להחניפם כדי להטעותם, אבל דיבורים אלו לא ימצאו חן, אדרבה גרמו לו אבדון ושנאה."}]},{"dvar_torah_id":"devurim_5f20e7fb","title":"","summary":"","contents":[{"passage_id":"devurim_5f20e7fb_p1","passage_content":"דרשה בירושלים תשי\"ט"}]},{"dvar_torah_id":"devurim_b82c5667","title":"גירושין ושליחות: לקח מאדם הראשון","summary":"הדבר תורה עוסק בקשר בין חטא אדם הראשון לגירושין מארץ ישראל, ומדגיש את חובת השליחות של ישראל גם לאחר הגירוש. יש להבין את כוחות הלשון והשפעתם על המעשה, ואת תפקיד האדם לתקן את הניצוצות הקדושים בכל מקום בו הוא נמצא.","contents":[{"passage_id":"devurim_b82c5667_p1","passage_content":"ותקרבון אלי כלכם ותאמרו נשלחה אנשים לפנינו ויחפרו לנו את הארץ וישיבו אותנו דבר, פרש\"י בשם הספרי, וישיבו אותנו דבר באיזה לשון הם מדברים, ראוי להבין דמנפק\"מ להם בזה, ואין זה מתכסיסי המלחמה, לחקור על מהות הלשון כ\"א על מהות הגבורה."},{"passage_id":"devurim_b82c5667_p2","passage_content":"ב) וישיבו אתנו דבר ויאמרו טובה הארץ וגו' אמרז\"ל מי הם שאמרו טובתה יהושע וכלב, וכתב הרמב\"ן ז\"ל ואני תמה, א\"כ מה הטענה הזאת על ישראל, וראוי שיאמינו לעשרה יותר מן השנים עייש\"ד."},{"passage_id":"devurim_b82c5667_p3","passage_content":"ג) ערים גדולות ובצורות בשמים וגו', בגמ' חולין (דף צ' ע\"ב) אמר ר' אמי דברה תורה לשון הבאי, פרש\"י גוזמא, דכתיב ערים גדולות ובצורות בשמים, וצ\"ב דודאי לא יתכן לומר שדברה תורה דבר שאינו אמת במציאות, וראוי להבין פירוש הכתוב וכוונת דבריהם ז\"ל."},{"passage_id":"devurim_b82c5667_p4","passage_content":"ונבוא אל הביאור, ונקדים מ\"ד בפתיחתא דאיכה רבתי (ס\"ד) ר אבהו פתח והמה כאדם עברו ברית (הושע ר) זה אדם הראשון, אמר הקב\"ה אדה\"ר הכנסתי אותו לגן עדן, וצוויתיו ועבר על צוויי, ודנתי אותו בגירושין ובשילוחין וכו', אף בניו הכנסתי אותם לארץ ישראל וצויתים ועברו על צוויי, ודנתי אותם בגירושין ובשילוחין עכ\"ד המדרש, וצ\"ב כוונת דבריהם ז\"ל, ומה צורך בדמיון להדמותם לאדה\"ר, ומה יתרון המשל על הנמשל, גם כפל הלשונות בגירושין ובשילוחין צ\"ב הכוונה, וביפה ענף כתב דגירושין הוא קשה משילוחין, והביא ראי' מב\"ר (פכ\"א עיי\"ש) אבל א\"כ הי\"ל להקדים הקל תחלה כדרך רז\"ל בכ\"מ."},{"passage_id":"devurim_b82c5667_p5","passage_content":"ונראה לבאר דהנה חטא אדה\"ר נסתבב ע\"י הסתת ופיתוי הנחש בגן עדן, ולכאורה ראוי להבין איך ניתן רשות להנחש ליכנס בגן עדן, ותינח אדה\"ר קודם החטא, שהיתה מעלתו גדולה מאוד כמבואר במדרשי חז\"ל, אבל נחש הקדמוני שהי' מקור הטומאה והוא השטן והיצה\"ר, ובפרדר\"א (פי\"ג) אמרז\"ל שהי' הס\"מ רוכב עליו, ובב\"ר אמרו אפיקורס הי', עכ\"פ הי' מרכבה להס\"מ, ולאיזה תועלת הרשוהו ליכנס לג\"ע, וראיתי בפירוש הגר\"א ז\"ל עה\"ת, שאדה\"ר נצטוה לשמור על הגן, שלא יניח ליכנס בה מי שאינו ראוי אלי', כמ\"ש ויניחהו בג\"ע לעבדה ולשמרה, וזה הי' תחילת סיבת החטא, מה שפשע בשמירתו, והניח את הנחש ליכנס בה, ובסיבתה נתגרש מג\"ע אח\"כ עייש\"ד ז\"ל, ומעתה נבין מה שלא מנע השי\"ת את הנחש מליכנס לג\"ע, לפי שהי' בכלל הצווי שנצטוה אדה\"ר על השמירה, ע\"כ בהכרח שינתן לו הבחירה חפשית, אם לקיים מצותו ית' או לעבור ח\"ו, ולכן לא מנע השי\"ת כניסת הנחש, ותלה הדבר בבחירתו של אדה\"ר."},{"passage_id":"devurim_b82c5667_p6","passage_content":"אמנם הא גופא צ\"ב, דאיך יתכן שאדה\"ר יציר כפיו של הקב\"ה פשע בשמירה, והניח את הנחש ליכנס לג\"ע, ואפשר דלא נצטוה בפירוש למנוע כניסת הנחש, אלא נצטוה בדרך כלל על השמירה, וכוונת אדה\"ר היתה לטוב, שחשב מחשבות כי אם יכניס את הנחש מקור הטומאה למקום הקודש גן אלקים, ישפיע עליו גודל קדושת המקום, ויתהפך כולו לטוב, אבל באמת טעה בדמיונו, ולא די שלא תיקן בחינתו של הנחש, אלא אדרבה הנחש הסית ופיתה גם אותו, לעבור על ציוויו ית', עד שלבסוף נתגרשו שניהם ממקום הקודש."},{"passage_id":"devurim_b82c5667_p7","passage_content":"והנה מבואר בספה\"ק, דתכלית ביאתו של אדם לעוה\"ז למלאות תפקידו ושליחותו, מה שעליו לתקן כ\"א לפי בחינתו ושורש נשמתו, וכתבו בשם האריז\"ל דכל א' נמשך ומתגלגל לאותו מקום, ששם חלקי ניצוצות נשמתו, וזה שליחותו לתקן חלקי הניצוצות הקדושים ההם, ע\"י רבוי פעלים בתורה וקיום המצות, ועד\"ז אדם הראשון היתה שליחותו בגן עדן לעבדה ולשמרה, ולהרחיק הנזקין מליכנס במקום הקודש, ולהתרחק א\"ע מהתחברותם, ולולא שחטא הי' נשאר במקום הקודש בגן עדן, והי' יכול לתקן משם את כל העולם כולו, וע\"י שחטא נתגרש משם, ומעתה הי' ס\"ד לומר כיון שמקום השליחות נתייחד בג\"ע לעבדה ולשמרה, א\"כ אחר שנתגרש משם פסק ונתבטל ממנו חיוב השליחות, אמנם לא כן הוא, דגם אחר שנתגרש מג\"ע, נשאר עליו חיוב השליחות לשמור א\"ע מהנזקין והתחברותם ולהתרחק מעצת הנחש והיצה\"ר, ואולי אפ\"ל הרמז בכוונת דבריהם ז\"ל במ\"ש ודנתי אותן בגירושין ובשילוחין ר\"ל שנתגרש מג\"ע, וגם אח\"כ נידון בשילוחין, ומתחייב למלאות שליחותו ותפקידו, והקדים גירושין לשילוחין, להורות דגם אחר הגירושין מתחייב בשילוחין."},{"passage_id":"devurim_b82c5667_p8","passage_content":"וכבר פירשתי מאמר חז\"ל במס' סנהדרין (דף נ\"ט ע\"ב והוא באדר\"נ פ\"א) תניא ר\"ש בן מנסיא אומר, חבל על שמש גדול שאבד מן העולם, שאלמלא לא נתקלל הנחש, כל אחד ואחד מישראל היו מזדמנין לו ב' נחשים, א' משגרו לצפון וא' משגרו לדרום וכו', ואחר שחטא ונתקלל, נקצצו רגליו ונאבדה תועלתו, אמנם ראוי להבין דאם נענש הנחש בחטאו, אבל מדוע נמנעה התועלת ממנו לכל העולם, שאבדו משמש גדול, והי' יכול הנחש לקבל ענשו גם באופן אחר, מבלי שיאבד כשרוניו לשמש העולם, אמנם אין זה תימה, דאין זה בגדר עונש כלל, מה שנאבדה מהם תשמיש הנחש ליהנות ממנו, אדרבה חסד גדול עשה הקב\"ה עם בריותיו, במה שנלקה מסית זה, באופן שלא יוכלו אנשי העולם ליהנות משליחותו, דאם היו נהנים ממנו, היו מתחברים אליו, והי' מושך ח\"ו כל העולם אל הסט\"א ר\"ל, דאם נהנים ממנו נעשים משוחדים אליו בהכרח."},{"passage_id":"devurim_b82c5667_p9","passage_content":"וכמו\"כ ארץ ישראל, בחי' קדושתו הוא דוגמת הגן עדן, וכמו שנתגרש אדם מג\"ע, ולא הועיל תשובתו לבטל הגזירה, כי למעלת קדושת המקום הי' פגם החטא גדול מאוד, וכמו\"כ לטעם זה נידונו ישראל בגירושין מארץ ישראל עבור חטאם, וכמ\"ש הרמב\"ן ז\"ל (בפ' וירא) כי משפט סדום הי' למעלת ארץ ישראל, כי הוא מכלל נחלת ד', ואינה סובלת אנשי תועבות, ותקיא את הגוים העושים בה תועבות וכו', כי יש באומות רעים וחטאים מאוד, ולא עשה להם ככה, אבל למעלת הארץ הי' הכל, כי שם היכל ד' עכדה\"ק, אמנם אף שנידונו ישראל בעוה\"ר בגירושין, מ\"מ לא נפסק חיוב שליחותן, וכל בר ישראל בכל מקום שהוא, מתחייב למלאות שליחות ותפקידו, כפי המוטל עליו לפי בחי' נשמתו וצורך תיקונו, ולתקן המקום ההוא ברבוי פעלים בתורה ומצות, ולהרבות כבוד שמים בפעולותיו, הן בארצנו הקדושה להתגבר ולעמוד נגד הנסיונות הקשים ולהתרחק מהנזקין ואנשי רשע ומהתחברותם, והן בחו\"ל להרחיב גבול הקדושה, ולעשות פעלים להתחזק בקיום התורה והמצות, ואולי זה כוונת דבריהם ז\"ל, במה שהמשילו גירושין ושלוחין של ישראל, לגירושין ושלוחין של אדה\"ר מג\"ע, וכוונת הדמיון שבשניהם להורות, שגם אחר הגירושין לא נפסק חיוב השליחות והבן."},{"passage_id":"devurim_b82c5667_p10","passage_content":"והנה הגירושין הוא גזירה מהשי\"ת, שיהיו ישראל נפוצים בארבע כנפות הארץ, והוא מכלל השליחות לתקן הניצה\"ק במקומות פזוריהם, ולפרסם בכל העולם אמונתו ותורתו ית', עד אשר ירחם ד' ויקבצנו ברוב רחמיו וחסדיו, והשי\"ת בעצמו יקבצנו כמבואר בכתובים ובדרז\"ל, שא\"א שיהי' קבוץ גליות כ\"א ע\"י הבוי\"ת בעצמו, והמדמים בעצמם שאפשר לעשות קיבוץ גליות ע\"י פעולה אנושית, הוא כפירה בד' ובתורתו, כי הבוי\"ת הבטיח, שהוא בעצמו יקבצנו מגלותנו כמבואר בפסוקים, ובעוה\"ר בזמננו הכופרים מדמים בנפשם, לעשות קיבוץ גליות בעצמם, תיפח רוחם, ועוד ישנם גם יהודים שומרי תומ\"צ שמחזיקים אחריהם בכפירה הזאת, וזו קשה מכולם."},{"passage_id":"devurim_b82c5667_p11","passage_content":"ואפשר לפרש הפסוק (איכה ה') על זה דוה לבינו על אלה חשכו עינינו וגו', ויל\"ד דהתחיל בלשון יחיד על \"זה\" דוה לבינו, וסיים בלשון רבים על \"אלה\" חשכו עינינו, גם למה פלגינהו בתרתי, והי' אפשר לכלול כולם ביחד, ולומר על אלה דוה לבינו וחשכו עינינו, ומשמעות הלשון יורה דהם ב' בחינות שונות, ועל א' מהם דוה לבינו ועל השני חשכו עינינו ולא נתבארו כוונת הדברים מה הן."},{"passage_id":"devurim_b82c5667_p12","passage_content":"ואפ\"ל עפימ\"ש הח\"ס לפרש הפסוק (שה\"ש ב') אחזו לנו שועלים שועלים קטנים מחבלים כרמים וכרמינו סמדר, דהנה בכל העתים והזמנים קמו מסיתים להדיח את ישראל מאמונתו ית', וגם בזמנים הקדומים בימי חכמי הש\"ס, עמדו בייתוסים והצדוקים ודומיהם, אבל לעומתם נמצאו אז גם צדיקים אמיתיים, התנאים והאמוראים הקדושים וצדיקי הדורות, שעמדו והתגברו למולם, ולא הניחום לפרוץ כרם ד' צבאות, אבל עכשיו בעוה\"ר ישנם מסיתים ומדיחים רבים מאד מאד, אבל חסרה לנו כח התגברות של הצדיקים הקודמים שיעמדו למולם, וז\"ש אחזו לנו שועלים מחבלים כרמים, ר\"ל כי השועלים המחבלים מבצעים זממם להסית ולהדיח, ומחבלים כרם ד' צבאות בית ישראל, והסיבה לזה, וכרמינו סמדר, שהוא הפרי שלא נתבשל ולא נגמר כל צורכו, ואין אתנו גודר גדר ועומד בפרץ להתגבר למולם, כן אמר הח\"ס זלל\"ה בימיו, ואנן מה נעני בתרי' בדורנו השפל, שרבו המנהיגים לא טובים, ולא די שאינם מתגברים לעומת המסיתים ומדיחים, אלא עוד עומדים לימינם להצדיק מעשיהם."},{"passage_id":"devurim_b82c5667_p13","passage_content":"והנה לפני החורבן הזהירו הנביאים את ישראל, שאם לא ישובו ויעזבו דרכיהם הרעים, יבוא חורבן וגלות על ישראל, והתחננו אליהם שישובו מדרכם הרעה, אבל קמו לנגדם נביאי שקר, והתנבאו לשוא שלא תבוא הרעה על בית ישראל, והדיחו את ישראל מאחרי ד', ועשו בעצמם עבירות חמורות וחטאים גדולים, אשר צוה ד' שלא לעשותם, והוסיפו מצות אשר לא צוה ה' לעשותם, וכאשר שמעו ישראל בקולם, בא עליהם חורבן הנורא, והם היו בעוכרינו, וגרמו שיחרב בית אלקינו, ויגלו ישראל מארצם, והשועלים המחבלים של זמננו גרועים וקשים הרבה יותר, כי המה מהרסים ומחריבים את כל בית ישראל, וגורמים במעשיהם לחורבנות הרבה."},{"passage_id":"devurim_b82c5667_p14","passage_content":"ועל זה קונן ירמיהו על זה דוה לבינו הכוונה על חורבן בית אלקינו, והזכירו בלשון יחיד דשם חורבן א' הוא, על אלה חשכו עינינו, אמר אלה בלשון רבים, והכוונה על המסיתים ומדיחים, כי רבים המה ודרכיהם שונים ומשונים, והצד השוה שבכולם שמחשכין עיניהם של ישראל בדרכי הסתתם, ומפרש הכתוב על הר ציון ששמם ר\"ל חורבן ציון וירושלים, על זה דוה לבינו, ועוד חורבן קשה ממנו ששועלים הלכו בו, אלו השועלים המחבלים כרם ד' צבאות, ורבים המה המחריבים ומחשכים עיניהם של ישראל, ועל אלה חשכו עינינו, שמסמים עיניהם של ישראל להטותם מדרך האמת ר\"ל."},{"passage_id":"devurim_b82c5667_p15","passage_content":"ורגיל אני לפרש מאמר המשנה סוף פאה (פ\"ח מ\"ט) כל דיין שלוקח שוחד ומטה את הדין, אינו מת מן הזקנה עד שעיניו כהות, והקשה הגאון בית יצחק זלל\"ה הרי חזינן דלא מתקיים הכי, וישנם דיינים שלקחו שוחד ולא נתעוורו בזקנותם, ותירץ הוא ז\"ל דהכוונה שיתעוורו עיניו לעוה\"ב עייש\"ד, אולם דוחק לפרש כן בדברי המשנה, שאמרו אינו מת מן הזקנה, דמשמע שיקבל עונשו בעוה\"ז טרם ימות, ופרשתי הכוונה דכל מי שלוקח שוחד ומטה את הדין, סופו להיות עיניו כהות, ולא יוכל להשיג דרך האמת אפי' אם ירצה, ואף בנדון שלא יקבל שוחד יהיו דרכי האמת נעלמים מעיניו, ועד\"ז הכוונה אינו מת מן הזקנה עד שיהיו עיניו כהות, ולא יראה דרך ישכון אור ר\"ל."},{"passage_id":"devurim_b82c5667_p16","passage_content":"נחזור לעניננו לתרץ קושית הרמב\"ן ז\"ל (לעיל קושיא ב') דמה היתה אשמת ישראל במה ששמעו לקול המרגלים, שהיו כולם נשיאי ישראל ובעלי רוה\"ק, וראוי שיאמינו לעשרה יותר מן השנים ובפשטות נראה דל\"ק, דכיון שהיה משרע\"ה עמהם, והוא עמד נגד המרגלים ועצתם, ומשרע\"ה הוא עצם התורה, מעתה לא יועיל כלום דעת הרוב, במקום שהוא בניגוד לדעת התורה."},{"passage_id":"devurim_b82c5667_p17","passage_content":"ואפ\"ל עוד עפימ\"ש האוהחה\"ק בפ' שלח, דלפי שהיתה כוונת המשלחים רעה, תפעול פועל הרע בשליח, ויחזור להיות שלוחו של אדם כמותו, ויוליד בו תכונה רעה מה שלא היתה בו קודם וכו', ולזה הגם שהיו צדיקים בהתחלת עשות ההליכה לרגל, נולד בהם תכונה רעה מכח המשלחים ויעצו להדיח עכלה\"ק, ולפי\"ז יצדק טענת משרע\"ה בתוכחתו לישראל, דשורש החטא נסתבב ממה שהיתה תחילת השליחות בכוונה רעה, וזה גרמה אח\"כ להסב לב אנשים צדיקים, עד שיעצו להדיח, ודעת הרוב כגון דא אינה מכרעת כלל, כיון שהוא הכרחיות ונובעת מדעת המשלחים, בבחי' שליח של אדם כמותו כמ\"ש האוהחה\"ק זלל\"ה, ובעוה\"ר בדורנו היום אלו שועלים המחבלים כרם ד' צבאות רבים המה, ומקלם יגיד להם להתיר מה שאסרה תוה\"ק, אבל פשוט שאין דעת הרוב כגון דא מכרעת, במקום שהוא מתנגד לדעת תוה\"ק, גם כי דעתם מושפעת מדעת ההמון, ואין זה דעתם כלל, (עיין מה שהארכנו בזה בדברינו פ' חקת)."},{"passage_id":"devurim_b82c5667_p18","passage_content":"ואפ\"ל הערה לבאר דברי הספרי הנ\"ל, וישיבו אותנו דבר באיזה לשון הם מדברים, ולכאורה מנפק\"מ להם בזה (עיין קושיא א') ויתבאר עפי\"ד הזוה\"ק פ' נח (דף ע\"ה ע\"ב) בענין דור הפלגה, שהקשו ואי תימא לישנהון אמאי אתבלבל, אלא בגין דכלהון ממללין בלשון הקודש, האי לישנא קא עביד לון סיוע, בגין דבעובדא ובמילולא דפומא תליין מילין וכו', כיון דאיתחלף לישנהון לא אצלחו בעובדא, בגין דחילא דלעילא לא ידעי ולא אישתמודע בר בלה\"ק, וכד אתבלבל לישנא דלהון, אתחלש חיליהון ואתבר תוקפא דילהון וכו', מיד ויחדלו לבנות העיר, דהא איתבר חילייהו, ולא ידעי למיעבד מידי ברעותא דילהון עכלה\"ק, עוד שם בזוה\"ק להלן, (דף ע\"ו ע\"ב) חמי מאי כתיב, הן עם אחד ושפה אחת לכולם, בגין דאינון בלבא חד ורעותא חד וממללי בלה\"ק, ועתה לא יבצר מהם כל אשר יזמו לעשות, ולית מאן דימנע עובדא דילהון עכלה\"ק, מבואר בדברי הזוה\"ק, דכח הצלחתם של דור הפלגה הי' ע\"י שדברו בלה\"ק, ובדא עבדי סיועא בחילא דלעילא, וע\"י כוחות הסט\"א, וע\"כ בלבל השי\"ת לשונם, וניטל מהם ידיעת הלה\"ק, כדי לבטל זממם וכוחותם, (עיין בספרי ויואל משה מאמר לה\"ק סי' י\"ט שהארכנו בזה)."},{"passage_id":"devurim_b82c5667_p19","passage_content":"ומעתה נבין דברו הספרי הנ\"ל, שאמרו ישראל וישובו אותנו דבר, באיזה לשון הם מדברים, כי השיגו ישראל כח הלשון, ורצו לחקור ולהתוודע ע\"י המרגלים, על מהות לשונם של ז' האומות, כי אם מדברים בלה\"ק, אזי כח השפעתם גדול מאוד ומגיע בשמים, ע\"י שיש להם סיועא מחילא דלעילא, כמבואר בזוה\"ק הנ\"ל בענין דור הפלגה, והשיבו המרגלים, ערים גדולות ובצורות בשמים, כי כוחה גדול ומגיע בשמים, ע\"י כח הלשון שדברו בלה\"ק, כמ\"ש הרמב\"ן ז\"ל (פ' ויגש) עה\"פ כי פי המדבר אליכם, שהי' לה\"ק שפת כנען בימים ההם, ובכח הלשון קבלו השפעתם משרי הטומאה ומחילא דלעילא."},{"passage_id":"devurim_b82c5667_p20","passage_content":"ובאמת מ\"ש הכתוב בצורות בשמים, אינה ע\"ד גוזמא והפלגה, והאמת הי' כן, שהי' חוזקה בצורה ומגעת בשמים, לינק מהשפעת כוחות הטומאה, אלא שחז\"ל רצו להעלים ענין הזה, כמו שביארנו בכ\"מ שאין לדבר מהפלגת כוחות הטומאה והסט\"א כ\"א לצד ההכרח, כי הענין גורם למכשול וטעות, שיטעו הבריות לומר יש בהם ממש ח\"ו, וכבוד אלקים הסתר דבר, ע\"כ פירשוהו חז\"ל כי דיבר הכתוב בלשון הבאי ודרך גוזמא, לההביל כוחותם, ולהעלים הענין מפשוטי העם, ומתורץ קושיא הנ\"ל."},{"passage_id":"devurim_b82c5667_p21","passage_content":"ובעוה\"'ר הלשון הטמא המדובר בארצה\"ק, אף שרובו אינו לשון הקודש, כאשר ביררתי כי חלק גדול ממנו הם מילים לועזים וזרות, שאין להם שורש בלה\"ק, וחלק הוא מילים מורכבות שבדו מלבם, והרכיבו מעירוב לשונות, בכל זאת הוא מעצת היצה\"ר, שמשתמשים עכ\"פ בחלק לה\"ק, ועי\"ז יש להם אחיזה בכוחות הטומאה והסט\"א, כאשר עינינו רואות גודל התגברות כוחותם בלשון הזה, כי בארצות הגלות שהי' הכרח מצד הממשלה ללמוד בבתי הספר לשונות עמים, ומעולם לא נאסרה במנין, אעפ\"כ לא שמענו ולא ראינו במדינתנו, שמי שהוא ירצה להנהיג ללמוד גמרא ושאר לימודי קודש בלשון חול, ובאותה לשון הטמא שיש עלי' חרם מגדולי ארץ ישראל ומתקיפי קדמאי, רוצים להנהיג ללמד עם נערי ישראל גמרא וגופ\"ת בלשון הזה, להכניס בקרבם ארס הטומאה והכפירה, ולערב קודש בחול, ולהכניע כח הקדושה ר\"ל, ומזה תראו עד היכן הדברים מגיעין."}]},{"dvar_torah_id":"devurim_38493803","title":"הזהרה לעבור בגבול עשו","summary":"הכתוב מזהיר את ישראל שלא להתגרות בעשו, והציווי נוגע לדורות. בגלות אדום, יש לשמור על הגבול ולא לקחת ממשלה מעצמם, כי הגאולה קרובה, אך החטא דוחק את רגלי הגואל.","contents":[{"passage_id":"devurim_38493803_p1","passage_content":"ואת העם צו לאמר אתם עוברים בגבול אחיכם בני עשו וגו', אל תתגרו בם כי לא אתן לכם מארצם עד מדרך כף רגל וגו', יל\"ד בתיבת לאמר דמיותר, דכבר אמר ואת העם צו, הרי בזה נצטוה לאמר להם, ובילקוט דרשו מלת לאמר לדורות, אמר הקב\"ה לא לכם בלבד אני מצוה, אלא אתם לבניכם צוו לראשי דורות, שיהיו נוהגין בו כבוד, עד שיבוא היום שכתוב דרך כוכב מיעקב וגו', אולם ג\"ז צ\"ב דמדוע צורך בצווי זו דייקא, להזהיר לדורות יותר מבשאר מצות התורה, וכל התורה היא נצחיות ונוהגת עד סוף כל הדורות, זולת במצוה שמפורש בה שהיא לשעה, וא\"כ לאמר מיותר. גם צ\"ב מ\"ש אתם עוברים בגבול אחיכם בני עשו דמיותר, ועיקר הצווי אל תתגרו בם, ואין נפק\"מ אם הם עוברים על הגבול, או נמצאים ממרחק לגבול, בכל אופן נאסר להם לבוא לגבולם להתגרות עמהם."},{"passage_id":"devurim_38493803_p2","passage_content":"אמנם ירמזו הכתובים על אחרית הימים, בגלותנו האחרון שהוא גלות אדום, וכבר כלו כל הקצין ועדיין לא נושענו, ואין ספק שאחרי אורך הגלות, והצרות הנוראות ומחרידות שעברו עלינו, בודאי כבר הי' מוכן עת קץ גלותינו, וכבר הי' בן דוד בא, לולא החטא הנורא של העברה על השבועות, במה שלקחו מלוכה וממשלה מעצמם, שזה דוחק רגלי הגואל בעוה\"ר, ולזה הזהירה התוה\"ק מאוד, שכאשר אתם עוברים בגבול אחיכם בני עשו, דהיינו בסוף יומיא, כאשר המשילו חז\"ל אין מלכות נוגעת בחבירתא אפי' מלא נימא, וכבר הגיע סוף ממשלתו של עשו וקרובים אנו אל סוף גבולו כמלא נימא, עכשיו צריך שמירה יתירה, דהתגברות היצר גדולה מאוד, כידוע ונראה בחוש, ע\"כ הזהיר הכתוב ואת העם צו לאמר וגו', אמירה זו צווי לדורות כמו שדרשו בילקוט הנ\"ל, אמר הקב\"ה לא לכם בלבד אני מצוה, אלא אתם לבניכם צוו לראשי דורות וכו', אתם עוברים בגבול אחיכם בני עשו, כשתעמדו על גבול מלכות אדום, ותהיו קרובים אל הגאולה, ושמרתם מאוד תהיו נשמרים מאוד מאוד, שלא לעבור הגבול מעצמכם, ושלא ליקח ממשלה בעצמכם, כי לא אתן לכם מארצם עד מדרך כף רגל, כמו שדרשו ז\"ל עד שיבוא אותו היום שנאמר ועמדו רגליו ביום ההוא על הר הזתים."}]},{"dvar_torah_id":"devurim_91c205f5","title":"אזהרת לא תתגרו באדום לדורות","summary":"בפרשת חקת לא נזכרה אזהרה זו, כי משה וישראל לא היו צריכים לכך. אך בפ' דברים נדרשת אזהרה לדורות, כדי שלא יילחמו באדום עד ביאת המשיח, והציווי הוא גם על סבל שעבודם. יש להמתין לישועה ולא להילחם בלא רשות.","contents":[{"passage_id":"devurim_91c205f5_p1","passage_content":"ואפ\"ל עוד בענין הנ\"ל, דהנה בפ' חקת כבר נאמרה פרשה זו, וישלח משה מלאכים אל מלך אדום וגו', נעברה נא בארצך וגו', וימאן אדום נתן את ישראל עבור בגבולו, ויט ישראל מעליו, ולא הזכיר הכתוב שם, שנצטוו ישראל מפי הגבורה שלא לעבור גבולו, וכתב הרמב\"ן ז\"ל קיצר הכתוב בזה, כי מפי הגבורה נצטוו ונשמרתם מאוד אל תתגרו בם, כאשר פירש להם משה במשנה תורה וכו' עכ\"ל, ולכאורה צ\"ב מאי טעמא העלימהו הכתוב שם בפ' חקת, וגילהו כאן בפ' דברים, ויותר הי' ראוי שיכתב הצווי שם בשעת המעשה, כי שם עיקר מקומה."},{"passage_id":"devurim_91c205f5_p2","passage_content":"ב) עוד יל\"ד דהנה בתרגום יונתן שם, עה\"פ דרך המלך נלך וגו' פי' באורח מלכא דבשמיא ניזיל וכו', ולכאורה תמוה, מהו התועלת בהודעה זו לאדום, וכי בשביל זה ימצאו חן בעיניו, להניחם לעבור בארצו, ואדרבה מטבע הרע לשנוא את הטוב בתכלית השנאה וצ\"ב."},{"passage_id":"devurim_91c205f5_p3","passage_content":"ג) בילקוט ראובני הביא פסיקתא וז\"ל, רק אין דבר ברגלי אעבורה, רק אין דבר לא עסק קרבנות וכו', וצ\"ב לאיזה צורך הודיעו זאת לעשו, ומהו הכוונה בשליחות זו."},{"passage_id":"devurim_91c205f5_p4","passage_content":"ואפשר לתרץ קושיא הראשונה בפשטות, דע\"כ לא נכתבה בפ' חקת אזהרת הצווי דאל תתגרו בם, דמשה רבינו וישראל שבאותו הדור, לא הוצרכו לצוות על זה, דבלא\"ה לא היו עושין מלחמה כי אם עפ\"י צווי הבוי\"ת, וכיון שלא נצטוו מפי הגבורה לעשות מלחמה באדום, ימנעו ויחדלו מזה, ואין צורך להזהירם על ככה, וכמו שמצינו בלאו דאל תצר את מואב, שהקשו בגמ' ב\"ק (דף ל\"ח ע\"א) וכי מה עלה על דעתו של משה לעשות מלחמה שלא ברשות, כלומר וא\"כ אזהרה זו למה, ומה צורך בו, ותירצו בגמ' נשא משה ק\"ו בעצמו וכו', א\"ל הקב\"ה לא כשעלתה על דעתך עלתה על דעתי וכו', עכ\"פ מבואר דלולי הק\"ו לא הי' צורך באזהרה כלל, דבלא\"ה לא הי' משרע\"ה עושה מלחמה שלא ברשות, ובאמת הקשו בתוס' שם דבאדום דלא שייך לידרש רדו זו, א\"כ מה צורך באזהרה עיי\"ש, ואפשר לתרץ לדרכנו דאה\"נ למשרע\"ה ולישראל שבאותו הדור, לא היה צורך באזהרה, דבלא\"ה לא היו עושין מלחמה שלא ברשות, וא\"ש דלא נאמרה אזהרה זו בשעת מעשה בפ' חקת, וקיצר הכתוב לומר, וימאן אדום נתן את ישראל עבור בגבולו ויט ישראל מעליו, כי לא עלתה על דעתם לעשות מלחמה שלא ברשות, וכיון שלא הניחם לעבור, נטו מעליו מעצמם וא\"צ לצווי."},{"passage_id":"devurim_91c205f5_p5","passage_content":"אמנם הצווי שנאמר כאן בפ' דברים, זה הוא צווי לדורות, כמבואר בדברי הילקוט שהבאנו לעיל, לאמר לדורות, אמר הקב\"ה לא לכם בלבד אני מצוה, אלא אתם לבניכם צוו לראשי הדורות וכו', וע\"כ הי' צורך באזהרה זו, דלדורות באחרית הימים, לא יהיו ישראל בבחי' זו, שלא לעשות דבר שלא ברשות, ובעוה\"ר נסתם כל חזון ופסקה הנבואה, ואין מודיעין לנו מן השמים אם לעשות או לחדול, ע\"כ נכתבה אזהרה זו לדורות, שלא נלחם עמהם עד מדרך כף רגל, עד שיבוא אותו היום שנאמר ועמדו רגליו ביום ההוא על הר הזתים כדרשת רז\"ל וא\"ש."},{"passage_id":"devurim_91c205f5_p6","passage_content":"ומעתה נבין דברי התרגום יונתן הנ\"ל שפי' הפסוק בדרך המלך נלך, באורח מלכא דבשמיא נזיל וכו', והטעם בשליחות זו אל אדום, כי חשבו דאולי ימנע אדום ולא ירשה את ישראל לעבור בארצו, מסיבת פן יכבשו ממלכתו, בעברם דרך ארצו, כי הי' אז פחד ואימת ישראל על כל האומות, ע\"כ שלחו אליו כי לשוא מוראכם, דבלא\"ה לא נעשה מלחמה שלא ברשות, דבאורח מלכא דבשמיא נזיל, לא נסטי לימינא ולשמאלא, ולא ניתן לנו רשות להלחם באדום עד עת קץ, שנא' בו ועלו מושיעים לשפוט את הר עשו וכו', והיתה לד' המלוכה, ועד אותה שעה לא ניתן רשות ללחום באדום, וזו היתה שליחותם אל אדום, דעדיין לא הגיע אותו העת לכבוש את ארצך, ולא נעשה דבר בלתי רשות."},{"passage_id":"devurim_91c205f5_p7","passage_content":"אמנם ידוע דב' קצים יש, הקץ של בעתה שנסתם ונעלם מעין כל חי, וקוב\"ה כביכול מלבי' לפומי' לא גליא, ויש עוד זמן וקץ המוקדם, כאמרז\"ל זכו אחישנה, ואם יזכו ישראל לעשות תשובה שלימה, ולקיים התורה ומצותי' מיד נגאלין, ומעתה הי' עדיין מקום לבני אדום לחשוש, דאולי לפי מדריגתם הגדולה של ישראל באותו הדור, יזכו מיד אל הקץ של אחישנה, וינתן להם רשות לכבוש את ארץ אדום, ולטעם זה לא יניחום לעבור בארצם, ע\"כ להסיר החששא זו מלבבם, שלחו אליהם לאמר רק אין דבר וגו'."},{"passage_id":"devurim_91c205f5_p8","passage_content":"ויובן עפימ\"ש ק\"ז הישמח משה זלל\"ה (בפ' תצוה) בשם הקדמונים, דהב' מקדשות הראשונות, אף שנחרבו בעוה\"ר ולא זכינו בקיומם, אבל לא היתה פעולתם לריק ח\"ו, וצורך גדול בהם, לעשות הכנה אל קדושת המקדש דלעתיד, והטעם בזה מפני דאין בכח הארץ הגשומה הלזו, לקבל ולסבול נוגה אור קדושת ביהמ\"ק השלישי, אשר כוננה היוצר וכו', לולי הב' מקדשות הראשונות, ובכח קדושת העבודה מעשה הקרבנות וכו', אשר הי' שם כמה מאות שנה, קנתה הארץ גם היא, כח רוחני ואיכות קדושה נפלאה, עדי תוכל לסבול קדושת הבית השלישי וכו', עיי\"ש שהמתיק דבריו במשל, והגם שאמרז\"ל דאלו לא חטאו ישראל בעגל, היו נכנסים לא\"י מיד, ואלמלא הי' משרע\"ה נכנס עמהם, הי' התקון השלם והגאולה העתידה מיד, אמנם אלו הי' כן, לא הי' צורך והכרח אל ההכנה הנ\"ל, כי לפי כח קדושתם הנפלאה, הי' ביכולתם להמשיך אור קדושת המקדש דלעתיד, אבל לאחר החטא, חסרה בחי' שלימותם, והי' מן הצורך וההכרח, להקדים תיקונים ובירורים, ולעשות הכנה ע\"י קדושת העבודה כנ\"ל."},{"passage_id":"devurim_91c205f5_p9","passage_content":"וזה אפ\"ל בכוונת הפסיקתא הנ\"ל, ששלחו אל אדום לאמר רק אין דבר וגו' לא עסק קרבנות, שעדיין חסרה לנו השלימות וההכנה של עסק הקרבנות, וע\"כ אין לכם לחשוש שנכבוש את ארצכם, שעדיין לא הגיע הזמן ועת הקץ, ומבלי רשות הבוי\"ת ודאי לא נעשה דבר, ועכשיו בימינו אלה, כבר אנו קרובים ומוכנים אל הגאולה, ואלו לא סרו ישראל מדרך התוה\"ק ומצותי', ואלו לא עשו ישראל מלחמה שלא ברשות, ליטול מלוכה וממשלה לעצמם, בלי שום ספק כבר היינו נגאלים, אבל מעשה שטן הצליח בעוה\"ר, אוי נא לנו שכך עלתה בימינו, ולא די שלא נגאלנו, רק עוד נתוספו לנו צרות רבות ורעות, אשר לא שערום אבותינו, ולקינו בכפלים גלות הגוף וגלות הנפש, עד אשר כבר נואלנו מנשוא, וע\"ז ידוו כל הדווים, עד אשר ירחם ד' עלינו, וישלח ידו שנית לגאלנו גאולת עולם בב\"א."},{"passage_id":"devurim_91c205f5_p10","passage_content":"הנה כבר בררנו מדברי רז\"ל, דהלאו דאל תתגרו בם האמור באדום, הרי הוא מצוה לדורות, ונוהגת עד ביאת המשיח, שיתקיים ועלו מושיעים וגו' לשפוט את הר עשו וגו', וחוץ ממה שנצטוינו שלא להתגר בו מלחמה, ולא לכבוש מארצו מדרך כף רגל, נצטוינו עוד לסבול עול שעבודו של אדום, עד שיבוא מלך המשיח, ואף אם הם פורצים גדר תחלה להתגרות עמנו, אינם כמו המואבים שהותרו מטעם דהם פרצו גדר תחלה, כמבואר בב\"ר (סו\"פ ויצא), דהתם כל עיקרו שנאסר לנו ההתגרות והמלחמה עמהם בשביל להוציא ב' פרידות טובות, כמבואר דברי הזוה\"ק (פ' בלק) ובדרושינו פ' מטות עיי\"ש, וע\"כ אחר שבא דוד הותרו מטעם דהם פרצו גדר תחלה, אבל ההתגרות באדום נאסרה לדורות עד ביאת המשיח, ואף אם הם יתגרו בנו תחלה, מוכרחים אנו בגזירת א-ל עליון לסבול שעבודם."},{"passage_id":"devurim_91c205f5_p11","passage_content":"ומפורש כן בדברי רז\"ל דאיתא במד\"ר (פ' זו) רב לכם סוב את ההר הזה פנו לכם צפונה, א\"ר חייא אמר להם אם ראיתם אותו שמבקש להתגרות בכם אל תעמדו כנגדו, אלא הצפינו עצמכם ממנו עד שיעבור עולמו, הוי פנו לכם צפונה, אר\"י בר שלום אמרו לו ישראל, רבש\"ע אביו מברכו על חרבך תחי', ואתה מסכים עמו ואומר לנו הצפינו עצמכם מפניו ולהיכן נברח, אמר להן אם ראיתם שמזדווג לכם ברחו לתורה, ואין צפונה אלא תורה, שנא' יצפון לישרים תושי', ד\"א מהו צפונה, א\"ר יצחק אמר הקב\"ה המתינו עד עכשיו מלך המשיח לבא, ויקיים מה רב טובך אשר צפנת וגו', ולהלן במדרש אמרו ישראל לפני הקב\"ה, רבש\"ע עד מתי אנו משועבדים בידו, אמר להם עד שיבא אותו היום, שכתוב בו דרך כוכב מיעקב וקם שבט מישראל וכו', אמר הקב\"ה אותה שעה אני מופיע מלכותי, ואמלוך עליכם, שנא' ועלו מושיעים בהר ציון וגו' עכ\"ד המדרש."},{"passage_id":"devurim_91c205f5_p12","passage_content":"גם מפורש בש\"ס בכ\"מ דאין בין עוה\"ז לימות המשיח, אלא שעבוד מלכות בלבד, הרי מבואר דגזירת שעבוד מלכיות, קיימת עד ביאת המשיח, ופלא הוא לשון הרמב\"ם ז\"ל בה' תשובה (פ\"ט ה\"ב) ומפני זה נתאוו כל ישראל נביאיהם וחכמיהם לימות המשיח, כדי שינוחו ממלכיות שאינן מניחות להן לעסוק בתורה ובמצות כהוגן, וימצאו להם מרגוע, וירבו בחכמה כדי שיזכו לחיי העוה\"ב, לפי שבאותן הימים תרבה הדעת והחכמה והאמת וכו', מפני שאותו המלך שיעמוד מזרע דוד, בעל חכמה יהי' יותר משלמה, ונביא גדול הוא קרוב למשה רבינו, ולפיכך ילמד כל העם ויורה אותם דרך השם וכו', וכעי\"ז כתב (סוף ה' מלכים) וז\"ל לא נתאוו החכמים והנביאים ימות המשיח, לא כדי שישלטו על כל העולם, ולא כדי שירדו בעכו\"ם, ולא כדי שינשאו אותם העמים, ולא כדי לאכול ולשתות ולשמוח, אלא כדי שיהיו פנויין בתורה וחכמתה, ולא יהי' להם נוגש ומבטל, כדי שיזכו לחיי העוה\"ב, עכ\"ל."},{"passage_id":"devurim_91c205f5_p13","passage_content":"ולכאורה וכי מילתא זוטרתא הוא, כאבם וצערן של ישראל מיסורי הגלות והשעבוד, ומדוע לא ניחא לן למימר, שגם בשביל זה נתאוו החכמים והנביאים לימות המשיח, כדי שינוחו ישראל מיסורי הגוף, וכי ס\"ד שלא איכפת להו בצערן של ישראל, גם ראוי להבין דאין מדרכו של הרמב\"ם ז\"ל בס' היד, להאריך בפירושו המקראות, כ\"א במה שנוגע להלכה ולמעשה, אמנם דבר גדול בא ללמדנו בזה, שלא נטעה לחשוב, שאפשר להיות חרות משעבוד מלכיות בלי תורה ח\"ו, כמו שמדמין רשעי זמננו, שבמציאות להיות ממשלה לישראל שלא עפ\"י דרך התורה, וככל הגוים בית ישראל הס מלהזכיר, ע\"כ נזהר הרמב\"ם ז\"ל להוציא דיעה זו מלב כל ישראל, כי לא נתאוו נביאיהם וחכמיהם לימות המשיח כדי שישלטו על כל העולם ולא כדי שירדו בעכו\"ם, אלא בשביל שלא יהי' להם נוגש ומבטל, כדי שיהיו פנויים בתורה וחכמתה וישתלמו בעבדות ה', ובלא זה אין מציאות להיות חרות משעבוד מלכיות, ועכ\"פ מבורר בדברי רז\"ל שלא יופסק שעבוד מלכות עד ביאת המשיח."},{"passage_id":"devurim_91c205f5_p14","passage_content":"וכתב בספה\"ק אהבת יונתן (בהפטרת ואתחנן) שאף אם כל האומות יסכימו, שיהי' קבוץ ישראל לילך לירושלים, חלילה שתלך שמה, כי הקץ סתום, ואולי אין עתה הזמן אמיתי וכו', עד שתחפץ, ר\"ל עד שיגיע הזמן שימלא כל הארץ דיעה וכו', וזה הזמן האמיתי, וא\"א שיהי' התחלת קבוץ גלויות בלי תשובה ודעת, שישובו כולם לתורתו הקדושה שבכתב ושבע\"פ, עכ\"ד ז\"ל, הנה כתב כ\"ז לרווחא דמילתא, ולהפליג חומר הענין, שאף אם כל האומות יסכימו, חלילה לילך ולעלות בחומה, ובאמת אין מציאות לזה שיסכימו כל האומות, שכבר העידו חז\"ל אין בין העוה\"ז לימות המשיח אלא שעבוד מלכיות, ברור שא\"א להיות בענין אחר, והמהר\"ל מפראג זלה\"ה כתב, שאף אם יכריחו אותנו ליקח ממשלה קודם ביאת המשיח ג\"כ אסור, ומכ\"ש ליקח בזרוע דרך מלחמה, והרמב\"ם ז\"ל כתב בס' היד שאסור לישראל לערוך מלחמה בלי רשות סנהדרין, ועכשיו שאין לנו סנהדרין בזמה\"ז, אף לולי טעם של העברה על השבועות, הי' אסור לנו לכבוש הארץ דרך מלחמה, ונוסף לזה עוברים ר\"ל על השבועות, ואין עצה אחרת, אלא כמ\"ש רז\"ל במדרש פנו לכם לצפונה, ברחו לתורה דבר אחר המתינו על מלך המשיח, ושני הפירושים הא בהא תליין, שאם נברח לתורה, אז נדע ידיעה ברורה ודאית שצריך להמתין על מלך המשיח."},{"passage_id":"devurim_91c205f5_p15","passage_content":"ונוראים המה דברי הכלי יקר ז\"ל (בפ' זו) עה\"פ רב לכם סוב את ההר הזה, וז\"ל פסוק זה נוקב ויורד עד התהום, ויש בו רמז לשעה ולדורות וכו', כי ימים רבים לישראל, שיהיו נעים ונדים סביבו, ולא יתן לישראל כח עליהם עד מדרך כף רגל, עד שיבא מי שנאמר בו ועמדו רגליו ביום ההוא על הר הזתים וכו', ודרשו רז\"ל פנו לכם צפונה, אם הגיע שעתו של עשו הצפינו עצמכם, וענין הצפנה זו נראה לי, שאם ימצא איש הישראלי איזו הצלחה זעיר שם, אזי יטמינו ויצפינו הכל בפני עשו, כי אין לך אומה שמתקנאת בישראל כמו עשו, כי לדעתם הכל גזולה בידם מהם מן ברכת יע\"א, שלקח ברכותיו של עשו וכו', וכן יעקב צוה לבניו למה תתראו, פרש\"י בפני בני ישמעאל ועשו כאלו אתם שבעים, כי שניהם סוברים שיצחק גזל הצלחת ישמעאל, ויעקב גזל הצלחת עשו ע\"י השתדלות, ע\"כ צוה על עשו פנו לכם צפונה שלא יתקנא בכם, וזה היפך ממה שישראל עושין בדורות הללו בארצות אויביהם, כי מי שיש לו מנה, הוא מראה א\"ע במלבושי כבוד ובתים ספונים וחשובים, כאלו הי' לו כמה אלפים, ומגרים האומות בעצמם, ועוברים על מה שנאמר פנו לכם צפונה, ומנהג זה הוא ברבת בני עמינו, והוא המסבב את כל התלאה אשר מצאתנו, והמשכילים יבינו ויקחו מוסר עכלה\"ק."},{"passage_id":"devurim_91c205f5_p16","passage_content":"ובדורנו עכשיו נתקלקל עוד יותר, שלא די מה שמראים עצמם חשובים, בענין הממונות ובתים ספונים, נוסף לזה מראים עצמם גבורים ומושלים, ועורכים מלחמה לכבוש ארץ ישראל בזרוע, ובזה מעוררים קנאת בני עשו וישמעאל, ובל\"ס כי זה גרם לנו כל התלאה והצרות, וכבר היינו נגאלים בגאולה שלימה, לולי הסט\"א הזה, שהעביר את ישראל על דעתם ועל דעת קונם בעוה\"ר."},{"passage_id":"devurim_91c205f5_p17","passage_content":"וכתב הח\"ס זלה\"ה עה\"פ רב לכם שבת בהר הזה, פרש\"י ז\"ל בשם מדרש אגדה, הרבה גדולה לכם ושכר על ישיבתכם בהר הזה, עשיתם משכן מנורה וכלים, קבלתם תורה מניתם לכם סנהדרין וכו', ודקדק הח\"ס ז\"ל דמה נדרוש בפסוק הדומה לו להלן, רב לכם סוב את ההר, ואיזה מצות קיימו ישראל בהר שעיר, ופי' שהמצוה שקיימו שם, הוא מה שסבלו ולא לחמו עם בני עשו, והמתינו על ישועת השי\"ת, וכמ\"ש הכתוב פנו לכם צפונה, המתינו עד עכשיו מלך המשיח לבא עכ\"ד ז\"ל, ורגיל אני לפרש דברי המדרש ילקוט (פ' בא רמז קצ\"א) מי פורע לכם ממלכות רביעית נטרונא, והי' לכם למשמרת וגו', פי' בזית רענן שצריכים לשמור ולהמתין על הגאולה, ובזכות זה יזכו ישראל אל הגאולה עיי\"ש, ולכאורה אינו מובן מה צורך לצוות על ככה, ובלא\"ה אין ברירה אחרת, כי אם להמתין על ישועת ד', ואם ד' לא יבנה בית שוא עמלו בוניו בו."},{"passage_id":"devurim_91c205f5_p18","passage_content":"אמנם בדורנו עכשיו, מובן הדבר היטב בעוה\"ר, כי כמה גדלו הנסיונות שלא ליפול ח\"ו ברשת המינים, שמדמין ואומרים שאפשר להיות לישראל ממשלה קודם ביאת המשיח, ולזה נצטווינו להרחיק מחשבה זו מלבינו בתכלית הריחוק, וחז\"ל אמרו כל המודה בע\"ז ככופר בכל התורה (ספרי שלח) כל הכופר בה כמודה בכל התורה כולה (קידושין מ' ע\"א), והסט\"א הזה הוא ע\"ז ומינות, ואין צד ספק בזה, שמי שמודה בה ככופר בכל התורה, ומי שעוזר לו השי\"ת וכופר בזה, ה\"ה מודה בכל התורה כולה שכן העידו חז\"ל, ועכ\"פ זכות גדול הוא מה שממתינים על ישועת השי\"ת, והנסיון מעיד על זה, דלולי כן לא הי' ההתגברות והנסיונות קשים כ\"כ בענין זה, ועד\"ז יל\"פ גם כאן הפסוק, רב לכם סוב את הר הזה, הרבה גדולה ושכר לכם סוב את ההר הזה, השי\"ת ירחם על עמו ועל ארצו, וירא בעני עמו, נסיונות הקשים של בנ\"י והשפלות הנורא, ונזכה לראות במהרה בישועת כל ישראל, בהתרוממות קרן התורה וישראל, ובהתגלות כבוד שמים עלינו בב\"א."},{"passage_id":"devurim_91c205f5_p19","passage_content":"R"}]}]
