[{"dvar_torah_id":"vayikru2_4e632c77","title":"קדושים תהיו: הבטחה או ציווי?","summary":"בפרשת קדושים תהיו נידונה השאלה אם מדובר בציווי או הבטחה. משה רבינו מקהיל את כל ישראל, אף את שאינם מהוגנים, כדי להשרות קדושה. המדרשים מדגישים את הקשר בין קדושת ישראל לקדושת ה' והצורך בהשראת השכינה בלימוד התורה.","contents":[{"passage_id":"vayikru2_4e632c77_p1","passage_content":"וידבד ה' אל משה לאמר דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו כי קדוש אני ה' אלקיכם. יש לדקדק על כפל הלשון דבר ואמרת. גם מדוע שינה לשונו מדיבור קשה לאמירה רכה בפסוק אחד."},{"passage_id":"vayikru2_4e632c77_p2","passage_content":"ב) דבר אל כל עדת בני ישראל וגו',  בת\"כ (הובא ברש\"י ז\"ל) איתא מלמד שנאמרה פרשה זו בהקהל מפני שרוב גופי תורה תלויין בה. ודרשה זו נלמדת מיתורא דכל, דהוה סגי למכתב דבר אל עדת בני ישראל. אמנם הקשו המפרשים ז\"ל שהרי כל מצוה ממצוות התורה נאמרה בהקהלת העדה כדאיתא בעירובין (דף נ\"ד ע\"א), ולמה הוצרך הכתוב לרבות שפרשה זו בהקהל נאמרה, ועיין ברא\"ם ובאה\"ח הק' מה שתירצו. והגור אריה כתב ליישב קושיא זו, דאף שבכל פעם הקהיל משה את עדת בני ישראל, מ\"מ לא היתה ביאת כולם חובה, משא\"כ כשנאמרה פרשה זו נתחייבו כולם להקהל אל משה, אחד מהם לא נעדר, עכ\"ד. ואכתי טעמא בעי, מדוע לא היתה ביאת כולם חובה בכל עת שהבהילן משה להגיד להם דברי ה', והלא ודאי היתה תועלת לכל אחד ואחד כששמע הדברים מפי משה."},{"passage_id":"vayikru2_4e632c77_p3","passage_content":"ג) קדושים תהיו, היפה תואר ז\"ל הקשה דאם מאמר זה הוא ציווי לבני ישראל שיקדשו עצמם, היה ראוי לכתוב \"היו', קדושים, דוגמת מה שאמה\"כ (שמות י\"ט) היו נכונים לשלשת ימים, ומדכתיב קדושים תהיו משמע דאינו ציווי אלא הבטחה שהם עתידים להיות מתעלים במדרגת הקדושה, וצ\"ב."},{"passage_id":"vayikru2_4e632c77_p4","passage_content":"ד) כי קדוש אני ה' אלקיכם. הקשו המפרשים ז\"ל דמה נתינת טעם הוא זה לאזהרת קדושים תהיו, וכי יוכל להתדמות יציר חומר ליוצרו להתקדש כמוהו."},{"passage_id":"vayikru2_4e632c77_p5","passage_content":"ה) ובת\"כ איתא קדושים תהיו כי קדוש אני אם מקדישים אתם את עצמכם מעלה אני עליכם כאילו קדשתם אותי, או אינו אומר אלא אם קדשתם אותי הריני מקודש ואם לאו איני מקודש, ת\"ל כי קדוש אני בקדושתי אני בין מקדשין בין אין מקדשין, והוא פלאי."},{"passage_id":"vayikru2_4e632c77_p6","passage_content":"ו) במד\"ר (ר\"פ זו) איתא זש\"ה (ישעי' ה') ויגבה ה' צבאו' במשפט וגו' אימתי שמו של הקב\"ה מתגדל בעולמו בשעה שעושה מדת הדין ברשעים וכו'. וצריך ביאור מה שייך ענין עשיית הדין ברשעים לפרשת קדושים תהיו."},{"passage_id":"vayikru2_4e632c77_p7","passage_content":"ז) גם בתנחומא (סימן א') ובילקוט איתא להך דרשה, אלא שהם דרשו גם סיפא דקרא וז\"ל, מהו והא-ל הקדוש נקדש בצדקה שהוא מתקדש בעולמו בצדקה שהוא מלמד על ישראל סניגוריא וכו'. וגם זה צ\"ב מה שייך הענין שהקב\"ה מתקדש ע\"י הצדקה לפ' קדושים, דלא מיירי הכא כלל מענין זה."},{"passage_id":"vayikru2_4e632c77_p8","passage_content":"ונראה לבאר הענין על פי מה דאיתא בברכות (דף כ\"ח ע\"א) שהיה ר\"ג מכריז ואומר כל תלמיד שאין תוכו כברו לא יכנס לביהמ\"ד, ואותו היום שהעבירו את ר\"ג מנשיאותו ונתמנה ר\"א בן עזריה לנשיא, סילקו את שומר הפתח וניתנה רשות לתלמידים ליכנס, ההוא יומא איתוספו כמה מאות ספסלים בבי מדרשא וכו', עיי\"ש. וביארנו בספר ויואל משה (מאמר לה\"ק סי' ל\"ח ל\"ט מ') דבתלמיד שאינו הגון כולי עלמא מודו שאסור ללמדו תורה, וכדאיתא בחולין (דף קל\"ג ע\"א) א\"ר זירא א\"ר כל השונה לתלמיד שאינו הגון כזורק אבן למרקוליס. וכן פסק הרמב\"ם בפ\"ד מהלכות ת\"ת (ה\"א ועי' בלח\"מ שם) ובטויו\"ד סימן רמ\"ו. ועל כרחך לומר דפלוגתא דר\"ג ובעל מחלוקתו היא באדם ההולך לתומו בדרך התורה, ובחיצוניותו אין רואים שום דבר ביש, ואעפ\"כ סבר ר\"ג דאין ללמדו תורה עד שיוודע כי גם פנימיותו טוב, וכל זמן שלא נוכחנו לדעת שתוכו כברו אל יכנס לביהמ\"ד. והחולקין על ר\"ג ס\"ל דכיון שהוא הולך לתומו בדרך התורה אי אפשר למנוע ממנו ללמוד תורה, כי ע\"י שמתרבים התלמידים מתבררים הרבה הלכות, כמבואר בגמרא שם, ולכן סילקוהו לשומר הפתח, וכל מי שמתנהג בדרך התורה התירו לו להכנס. ולכאורה יש לתמוה על שיטת רבן גמליאל, שהרי בכל איסורין שבתורה סמכינן על חזקת כשרות אף לדבר הרשות, וכל ישראל יש להם חזקת כשרות אם הם מתנהגין על פי התורה, ולמה יגרע לימוד התורה שהוא חיוב דאורייתא ללמד את בני ישראל תורה כדדריש בספרי ושננתם לבניך אלו התלמידים הקרויים בנים, ומדוע לא סמך ר\"ג על חזקת כשרות, ונחסרו כמה מאות ספסלי ביהמ\"ד בימיו."},{"passage_id":"vayikru2_4e632c77_p9","passage_content":"וביארנו שם באורך על פי מה שכתב הרמב\"ם ז\"ל (בפ\"ה מהל' ת\"ת ה\"ד) וז\"ל, וכל תלמיד שלא הגיע להוראה וכו' עליו נאמר רבים חללים הפילה וכו', ואלו התלמידים קטנים שלא הרבו תורה כראוי והם מבקשים להתגדל בפני עמי הארץ ובין אנשי עירם וקופצים ויושבים בראש לדון ולהורות בישראל הם המרבים המחלוקת והם המחריבים את העולם והמכבין נרה של תורה והמחבלין כרם ה' צבאו', עליהם אמר שלמה בחכמתו אחזו לנו שועלים שועלים קטנים מחבלים כרמים, עכ\"ל. הרי לנו מדברי הרמב\"ם ז\"ל שכל עתידו של כלל ישראל תלוי בכך, שבל יראו ובל ימצאו תלמידים שאינם הגונים המכבים נרה של תורה. ואפשר שעל כן חשב ר\"ג להחמיר כ\"כ בלימוד התורה לתלמידים ולא סמך על חזקת כשרות, דכיון ששלימותו של כלל ישראל תלוי בכך יש לחוש מאד, וכמו שכתבו התוספות במסכת יומא (דף ב' ע\"א ד\"ה וחכ\"א) דבכהן גדול שכפרת כל ישראל תלויה בו ראוי להחמיר ולחוש אף לחשש רחוק, ע\"כ."},{"passage_id":"vayikru2_4e632c77_p10","passage_content":"ואחרי ההתבוננות נראה לבאר באופן אחר שיטת רבן גמליאל דתלמיד שאין תוכו כברו אל יכנס לביהמ\"ד, בהקדם מה שכתב ק\"ז זלה\"ה בישמח משה פרשת משפטים (דף קע\"ד ע\"ב) לתת טעם על מה שבשעת הדין מוציאים בעלי הדינין לחוץ דייקא, ולא סגי שילכו לאיזה צד כדי שלא ישמעו דברי הבית דין, וביאר עפ\"י מה שכתב בספר חן טוב כי עומק הדין אינו מושג אלא בהיות ה' עם השופט ומלמדו להועיל לכון הדין כהלכה, וכדכתיב (שופטים ב' י\"ח) והיה ה' עם השופט, ואם אין הקב\"ה בעת המשפט יכשל בדין, ולא ידע בין ימין לשמאל, ועל כן כתיב (תהלים קמ\"ז) מגיד דבריו ליעקב חוקיו ומשפטיו לישראל לא עשה כן לכל גוי ומשפטים בל ידעום, כי אין השכינה שורה על אוה\"ע כידוע. והנה איתא בסוטה (מ\"ב ע\"א) א\"ר ירמיה בר אבא ארבע כתות אין מקבלות פני שכינה וחד מינייהו כת שקרים שנאמר (תהלים ק\"א) דובר שקרים לא יכון לנגד עיני, ע\"כ. ואם אפילו בשקרן בדברי הבל וגוזמא אינו מקבל פני שכינה, על אחת כו\"כ מי שרוצה לגזול חבירו בשקרנותו. והנה בשני בעלי דינין מסתמא חד מינייהו רשע ומשקר ורוצה לגזול וע\"כ אמרו ז\"ל (אבות פ\"א) יהיו בעיניך כרשעים. ולפיכך בעודם במחיצה זו אין השכינה שרויה שם, ואי אפשר לדון דין אמת לאמיתו, עכ\"ד ז\"ל. והנה לא בלבד לדון דין אמת צריך השראת השכינה, אלא גם בכל הלכה אי אפשר לכוון לאמיתה של תורה אלא בבחינה של רוה\"ק שורה עליו, וכמו שדרשו ז\"ל במאה\"כ וה' עמו (שמואל א' י\"ח) שהלכה כמותו בכל מקום. והראב\"ד ז\"ל כתב בהשגות (הל' לולב פ\"ח ה\"ה) כבר הופיעה רוה\"ק בבית מדרשינו וכו'. וכתב עליו בכפות תמרים כי הוא ע\"ד גוזמא וכוונתו להשגה גדולה. אמנם הרחיד\"א ז\"ל בשה\"ג הביא בשם גדולי המקובלים שנגלה אל הראב\"ד ז\"ל אליהו זל\"ט, וז\"כ באמרו כך נגלה לי מסוד ה' ליראיו (עיי\"ש מערכת גדולים א' י\"א), ובשו\"ת חתם סופר (חאו\"ח סי' ר\"ח) ביאר כי כל השגת חכמה הנשפעת לחכמים מן השמים להבין דברים שלא היה בכח שכלם להשיג, היא בחינת נבואה ורוה\"ק, וכמו שאמרו ז\"ל בבבא בתרא (דף י\"ב ע\"ב) מיום שחרב ביהמ\"ק ניטלה נבואה מן הנביאים וניתנה לחכמים."},{"passage_id":"vayikru2_4e632c77_p11","passage_content":"ועפ\"י זה נבא אל הביאור, כי הנה בבית מדרשו של רבן גמליאל נתקבצו כל החכמים, וביררו כשמלה פרושה כל ספק ושאלה בדיני התורה, ואסיקו שמעתתא אליבא דהלכתא, ומהם יצאה הוראה לכל ישראל. ולפי מה שנתבאר לאסוקי שמעתתא אליבא דהלכתא יש צורך להשראת השכינה ולבחי' רוה\"ק, כדי להבין בדברים שאינם בגדר השגה בשכל אנושי. ולפיכך החמיר ר\"ג כ\"כ שלא יכנס מי שאין תוכו כברו, שהרי אם ימצא שם אפילו אחד שפנימיותו רע, וכלפי חון הוא מראה פנים כמתהלך בתומו, א\"כ הרי הוא שקרן המרמה את הבריות, ואין השכינה הקדושה יכולה לדור במדור אחד עמו, ובאין השראת השכינה לא יוכלו לברר ההלכות לאמיתה של תורה כמבואר, על כן אף דבשאר דוכתי מהימנינן לכל אדם המוחזק בכשרות דסמכינן אחזקה, הכא שאני, דכיון שמשם פשטה הוראה לכל ישראל, יש צורך בזהירות יתירה שלא ימצא בין התלמידים אפילו אחד שאינו הגון, כי יגרום להסתלקות השכינה, ולא יוכלו לעמוד על אמיתות ההלכה."},{"passage_id":"vayikru2_4e632c77_p12","passage_content":"אמנם חכמים פליגי על ר\"ג, וס\"ל דאין לחוש לכך, כי רבים המה המוחזקים בכשרות וא\"א לעמוד על פנימיותן, ואם נחוש לכך נמצאת מבעל ת\"ת דרבים, על כן התירו לכל אדם המוחזק בכשרות להכנס לבית המדרש, וסמכו עצמם כי מן השמים יסייעום שאותם שאין תוכם כברם ימנעו מעצמם מלבוא לביהמ\"ד, או יתגלה קלונם ויסלקו אותם מביהמ\"ד. וגם היו סמוכים ובטוחים בכח זכות הרבים, שהיו ת\"ח מרובים מאד בבתי מדרשות שלהם, וזכות הרבים גדול הוא מאד, ובפרט זכות התנאים הקדושים חכמי המשנה והתלמוד, וכדאי הוא זכותם שיגן עליהם שלא יוכלו אותם התלמידים שאין תוכן כברם לגרום הסתלקות השכינה מן הביהמ\"ד."},{"passage_id":"vayikru2_4e632c77_p13","passage_content":"ובזה נבוא אל הביאור במה שהקשו המפרשים ז\"ל דמה טעם הוצרך הכתוב לרבות שפרשה זו בהקהל נאמרה, והרי כמו כשבשאר כל המצוות הקהיל משה את בני ישראל להגיד להם דברי ה'. אמנם אפ\"ל דהנה האה\"ח הקדוש כתב בפרשת ויגש על הפסוק אנכי ארד עמך מצרימה וגו', כי הדרגות אור השכינה רבים המה, ויש הדרגות אין מספר להשראת השכינה וכו', עיי\"ש שהאריך. ועפ\"י זה י\"ל כי הנה במשרע\"ה אמרו ז\"ל כי כל כך עצמה מדרגת קדושתו והשראת שכינתו יתברך עליו, שהשכינה היתה מדברת מתוך גרונו והרי זה מוכיח שהיתה השראת אור שכינתו יתברך על משרע\"ה בהדרגה עליונה עד מאד. ולפיכך יתכן כי בכל עת שהקהיל משה את בני ישראל להגיד להם את הדברים אשר צוהו ה', לא נצטוו להקהל אלא האנשים אשר תוכם כברם, משא\"כ אותם שאין תוכם כברם לא היו רשאין להיות בהקהלת העדה, כי לצד המדריגה הגבוהה של השראת השכינה שהיתה למשרע\"ה, לא יוכלו לעמוד אתו עמו במחיצה אחת, שהרי המה גורמים לסילוק השכינה, ואפשר דאף החולקים על רבן גמליאל שהתירו לכ\"א להכנס לביהמ\"ד, מ\"מ מודו דגבי משרע\"ה שאני, דדוקא בדורות שלאחר משרע\"ה ס\"ל דניתנה רשות לכל מי שירצה שיכנס, משום דבלא\"ה לא היתה אצלם הדרגה גבוהה כ\"כ של השראת השכינה, ע\"כ הותר ללמוד תורה לכל מי שירצה, משא\"כ גבי משרע\"ה שהיתה הדרגת השראת השכינה גבוהה מאד, אף אינהו מודו כי לא הותר להכנס למי שאין תוכו כברו."},{"passage_id":"vayikru2_4e632c77_p14","passage_content":"ובדברים אלו מצאנו טעם נכון למה שהוצרכה תורה לרבות שפרשה זו בהקהל נאמרה, כי משונה פרשה זו משאר פרשיות התורה, דבשאר פרשיות לא הקהיל משה כי אם את האנשים שהיה תוכם כברם, מה שאין כן פרשה זו שרוב גופי תורה תלויים בה, היה צורך להשמיעה אל כל עדת ישראל, אפילו אותם שאין תוכם כברם, לצד שאם ישמעו מפי משה רבינו עליו השלום פרשה זו שרוב גופי תורה תלויים בה ודאי יאיר עליהם משרע\"ה באור קדושתו, ויתעורר לבבם לשנות פנימיותם לטוב. אכן כדי שלא יהיה מקום לחוש שע\"י שיאספו אליו כל העדה וביניהם גם אותם האנשים שאין תוכם כברם ח\"ו תסתלק השכינה, הוצרך משרע\"ה לאמר להם קדושים תהיו, ואין זה ציווי אלא הבטחה, והיה בדבר נס מן השמים, שבכח דבוריו הקדושים של משרע\"ה ונפסקה זוהמתן של האנשים שלא היה תוכם כברם ונתקדשו כבמעמד הר סיני, ובטלה מהם לגמרי מדת השקר. ועל כן כתיב הכא בקרא ויקהל משה את כל עדת בני ישראל, ללא יוצא מן הכלל, ומה שלא עשה כן בכל פעם שהקהיל את העדה, היינו משום דלאו בכל יומא מתרחש ניסא, ובשאר ההקהלות אמנם לא הניחו להכנס את אלו שאין תוכם כברם."},{"passage_id":"vayikru2_4e632c77_p15","passage_content":"ועפ\"י האמור נתיישב גם כפל לשון הכתוב דבר ואמרת (קושיא א') כי היו כאן ב' דבורים, דבור א' הוא מה שאמר להם כל האזהרות והציווים שבפרשה זו, ואמירה נוספת יש בענין זה, שהקדים לומר להם קדושים תהיו, שהיא הבעחה שיושפע שפע קדש גם על אותם שאין תוכם כברם, למען יהיו ראויים להכנס לבית מדרשו של משה, ולא תסתלק השכינה משם."},{"passage_id":"vayikru2_4e632c77_p16","passage_content":"והשתא מובן גם מה ששינה הכתוב לשונו בתוכ\"ד, דפתח לומר דבר המורה על דבור קשה, ואח\"כ כתיב ואמרת שהוא לשון אמירה רכה. כי כלפי האזהרות והציוויים האמורים בפרשה אמר דבר, לפי שפרשה זו יש בה אזהרות וציווים רבים שקשה לקיימן, וכאמרז\"ל שרוב גופי תורה תלויין בה, וכלפי מה שהובטחו ישראל קדושים תהיו אמר ואמרת, כי הבטחה זו היא להם אמירה רכה, שיזכו להתקדש כדי שיהיו ראויים לבא לבית מדרשו של משה."},{"passage_id":"vayikru2_4e632c77_p17","passage_content":"ומבואר גם מה שנתן הכתוב טעם למ\"ש קדושים תהיו באמרו כי קדוש אני ה' אלקיכם, פירוש שעל כן הובעחו ישראל שיהיו קדושים, לצד כי קדוש אני ה' אלקיכם, ולא יתכן שישרה הקב\"ה שכינתו במקום שנמצאים שם בני אדם שאינם מהוגנים, כי באתרא דשקרא קאי לא תהיה השראת השכינה, ולפיכך קדושים תהיו כדי שתשרה שכינה על משה רבינו ע\"ה, ויוכל ללמד לעם פרשה זו, שהרבה גופי תורה תלויין בה. ואף שרבותינו ז\"ל דרשו כמה דרשות במאה\"כ קדושים תהיו, ועפ\"י דרשתם משמעות מקרא זה הוא אזהרה וציווי, כגון קדש עצמך במותר לך וכיו\"ב, מ\"מ אין בכך סתירה למה שפירשנו שהוא הבעחה, כי בתורה הקדושה כלולים כמה וכמה דרכים לאין שיעור וערך. אח\"כ מצאתי שגם בסה\"ק אגרא דכלה פירש מאה\"כ קדושים תהיו שענינו הבטחה יעיי\"ש."},{"passage_id":"vayikru2_4e632c77_p18","passage_content":"ועתה נחזור לביאור המדרשים המוצגים בפתח דברינו, בהקדם עוד מה שכתב בסה\"ק אגרא דכלה פרשת ראה דלכאורה כיצד יתכן להמשיך מפלות על שונאי ישראל באמצעות קיום מצוות ומע\"ט, והרי תכונתם של המצוות ומע\"ט להמשיך אך שפע ברכה, אלא שהדבר יתכן ע\"י עשיית תשובה מאהבה, דהעוונות נעשין לו לזכיות, ואעפ\"כ כיון שמקור זכיות אלו נובע מעבירה אפשר להמשיך מפלות לשונאי ישראל באמצעות אותן זכויות. ובמקום אחר כ' דיתכן גם להמשיך מפלות על שונאי ישראל ע\"י עשיית עבירה לשמה, דזכות היא לו, ואפ\"ה כיון שזכות זו מקורה מעבירה אפשר להמשיך על ידה תבוסה לשונאי ישראל. (עיין בייטב לב פרשת שמות שהביא כן משמו)."},{"passage_id":"vayikru2_4e632c77_p19","passage_content":"והנה עפ\"י מה שנתבאר בדברינו, כי בעת שהקהיל משה את כל עדת בני ישראל לאמר להם פרשה זו המשיך עליהם השפעת קדושה, והשפעה זו נמשכה ובאה גם על אותם האנשים שלא היה לבבם שלם עם ה', שאין תוכם כברם, ובכח שפע הקדושה שהאיר עליהם במדה גדושה ודאי נתחרטו על מעשיהם, ושבו בתשובה שלימה על עוונותיהם. א\"כ נמצא כי היתה זו בחינת תשובה מאהבה, שהרי מחמת אור הקדושה שנגה עליהם נתעוררו בהם החפץ והתשוקה להתדבק בבורא יתברך, ולעזוב רוע דרכם. ובזכות התשובה הגדולה אשר עשו נמשכה מפלה נצחת לשונאי ישראל, כמבואר באגרא דכלה הנ\"ל, שזו היא סגולת תשובה מאהבה. והשתא מובנים שפיר דברי המדרש קדושים תהיו הה\"ד ויגבה ה' צבאו' במשפט כשהקב\"ה עושה דין ברשעים שמו מתגדל וכו', דשפיר שייך ענין שהקב\"ה עושה דין ברשעים לדברי הכתוב קדושים תהיו, שהרי מקרא זה ענינו הבעחה שעתידים כל בני ישראל להתדבק בקדושה, כדאמרן שהיה הכרח בדבר, דבלא\"ה לא היה באפשרי שיהיו נקהלים אל משה כל בני ישראל, וכיון שהובטחו שיהיו קדושים א\"כ יש כאן בחי' תשובה מאהבה באותם האנשים שלא היה תוכם כברם, ותשובה מאהבה כחה יפה להביא מפלה נצחת על שונאי ישראל."},{"passage_id":"vayikru2_4e632c77_p20","passage_content":"אמנם הגם שיש קידוש ה' בשעה שהקב\"ה עושה דין ברשעים, מ\"מ גדול ממנו הוא כבוד שמים הנצמח ממה שהקב\"ה מושיע את בני ישראל הכשרים, כי בעת שנעשה הדין ברשעים ישנו גם צד ובחינה שהחיצונים משתתפים בו (עיין אור החיים הקדוש פרשת בלק פרק כ\"ג ח'), משא\"כ בעת שמתגדל ומתקדש שמו הגדול ע\"י שהוא מושיע את ישראל אזי אין להם בזה אחיזה כלל, כי תשועתן של ישראל באה ממקור הקדושה אשר עליו נאמר עין לא ראתה וגו'. וזה יהיה ביאור התנחומא (קושיא ז') זש\"ה ויגבה ה' צ' במשפט וכו' מהו והא-ל הקדוש נקדש בצדקה שהוא מתקדש בעולמו בצדקה שהוא מלמד על ישראל סניגוריא, והכי פירושו ויגבה ה' צבאו' במשפט, כלומר בגבהי מרומים שם מתגדל ומתקדש שמו יתברך במשפט שהוא עושה ברשעים, אמנם בעלמא הדין גדול הוא כבוד ה' בזמן שהוא עושה צדקה וחסד עם עמו ישראל, וזש\"ה והא-ל הקדוש נקדש היינו בעוה\"ז, בצדקה שהוא עושה עם ישראל ומלמד עליהם סניגוריא. וכאשר כן יהיה גם בזמן הגאולה כדאי' במד' ילקוט (ישעי' רמז תק\"ז) עה\"פ אני מדבר בצדקה (שם ס\"ג) זה שאמר הכתוב (דניאל י\"ב) בעת ההיא יעמוד מיכאל, לעתיד לבא באים שרים ומקטרגים על ישראל ואומרים לפני הקב\"ה רבש\"ע וכי יש לפניך משוא פנים וכו', מפני מה הללו יורדים לגיהנם והללו אין יורדים, באותה שעה מיכאל סניגורן של ישראל משתתק, שנאמר בעת ההיא יעמוד מיכאל וכו', ואין יעמוד אלא שתיקה וכו',  וכיון שהוא משתתק אומר הקב\"ה מיכאל נשתתקת ואין אתה מלמד סניגוריא על בני חייך שאני מלמד ומדבר עליהם בצדקה ומושיעם, שנאמר אני מדבר בצדקה ורב להושיע ובאיזה צדקה וכו' בצדקה שעשיתם עמי שקבלתם את התורה שאלמלא כן היכן היתה מלכותי, וח\"א בצדקה שעשיתם עם עצמכם שאלמלא כן הייתי מכלה אתכם מן העולם, עכ\"ד המדרש."},{"passage_id":"vayikru2_4e632c77_p21","passage_content":"ואפ\"ל עוד עפ\"י מה שכתב ק\"ז זלה\"ה ביטב לב פ' פנחס על הא דאי' במד' (במדב\"ר פכ\"א א') עה\"פ לכן אמור הנני נותן לו אח בריתי שלום אמר הקב\"ה בדין הוא שיטול שכרו. וביאר עפ\"י מה שכתבו המפרשים כי מצד הדין אין מגיע לאדם שכר בעבור מצוותיו, כדאיתא במד\"ר עה\"פ מי הקדימני ואשלם מי עשה מזוזה עד שלא נתתי לו בית וכו' מי מל בנו וכו', ומה שהקב\"ה נותן שכר לאדם הוא רק מצד החסד, וע\"כ מותר לאחר שכרו של האדם לעה\"ב וליכא ביה משום בל תלין. אמנם הנה הפרשת דרכים בסוף הספר העלה דגר שנתגייר מגיע לו שכר מעשיו בעה\"ז, שהרי הוא לא היה מחוייב בדבר שיתגייר ולא שייך ביה מי הקדימני, ופירש בזה דברי המדרש (רות רבה פ\"ה ד') ישלם ה' פעלך וגו' אשר באת לחסות בצל כנפיו א\"ר חסא אשר באת לחסות, עיי\"ש מ\"ש בזה. ולפי זה תקשה דבגר מגיע לו שכרו בעוה\"ז מן הדין וכיצד הקב\"ה משהה שכרו לעוה\"ב, והא איכא בל תלין, אמנם עיקר התירוץ הוא משום דשכר מצוה בהאי עלמא ליכא, כמו שכתב הסידורו של שבת הטעם כי שכר העוה\"ז הגשמי הוא כאין וכאפס לעומת מעשה המצוה והתיקונים הנעשים על ידה בעולמות העליונים גבוה מעל גבוה, ולפיכך לא שייך לשלם שכר בעוה\"ז הגשמי בעבור המצוות ומע\"ט שהם רוחניים, כי במה נחשב הוא. אמנם לפי זה פנחס שעשה דבר שלא נתחייב בו מן הדין, כי מה שאמרו הבועל ארמית קנאים פוגעים בו אינו חיוב אלא רשות, ובפרט כי הערה נפשו למות וזה ודאי יותר מן החיוב, א\"כ מגיע לו שכרו תיכף היום בעבור מפעל הטוב שעשה, לפי שאין זה מן המצוות המחוייבות, שיהיה שייך לומר עליו שכר מצוה בהאי עלמא ליכא. וז\"ש המדרש בדין הוא שיטול שכרו, כלומר מיד. אכן כיצד אפשר לשלם שכר בעוה\"ז, הלא שכר העולם הגשמי הוא כאין לעומת מעשה המצוה, לזה התחכם ה' ואמר הנני נותן לו את בריתי שלום, ואיתא במדרש כמה דאת אמר בריתי היתה אתו החיים והשלום שיחיה לעולם, וא\"כ באמת שכרו היום ולא למחר, כי עודנו חי עומד ומשמש במרום, עכ\"ד הייטב לב זלה\"ה."},{"passage_id":"vayikru2_4e632c77_p22","passage_content":"ולפי זה יהיה ביאור המדרש הנ\"ל זש\"ה ויגבה ה' צבאו' במשפע והא-ל הקדוש נקדש בצדקה וכו' שהוא מתקדש בעולמו בצדקה שהוא מלמד על ישראל סניגוריא באופן זה, דהנה לפי שציוה הכתוב קדושים תהיו, שענינו אזהרה לישראל לפרוש מן המותרות, הם עניני הרשות תענוגות בני אדם שאין בהם איסור מצד הדין, ואעפ\"כ מוטל על האדם לפרוש מהם ולהסתפק בהכרחי לקיום הגוף, וכמ\"ש הרמב\"ן ז\"ל, ופרישה זו מן המותרות היא ענין של לפנים משורת הדין בחי' צדקה, שהרי לא אסרתן תורה, ולפיכך בעת שישראל מקדשים ומטהרים עצמם בפרישה מן המותרות שאין בהם צורך לקיום הגוף הקב\"ה מודד להם כמדתם, ומלמד עליהם סניגוריא למען יצאו בדימוס בדינם. וזהו שסמך המדרש להכא הך קרא ייגבה ה' צבאו' במשפט והא-ל הקדוש נקדש בצדקה, ודריש מינה שהוא מתקדש בעולמו בצדקה שהוא מלמד על ישראל סניגוריא, דשפיר שייכא דרשה זו לענינא דקדושים תהיו, שהרי בעבור שישראל מקדשים עצמן במותר להם ילמד הקב\"ה סניגוריא עליהם להצדיקם ביום דין. והכי פירושא דקרא ויגבה ה' צבאו' פי' מה שיתרומם ויתנשא שמו של ממ\"ה בעולמו זהו \"במשפט\", כלומר מצד הדין, אמנם והא-ל הקדוש נקדש, כלומר מה שעתיד להתקדש שמו יתברך בעוה\"ז כאשר יעזור ויושיע ויגן על ישראל משונאיהם המקטרגים עליהם, ויגאלם גאולת עולמים, זהו \"בצדקה\", פירוש בזכות שאף הם עושים לפנים משורת הדין לפרוש מדברים המותרים, שהם בחי' צדקה, כן יעשה עמהם הקב\"ה ללמד עליהם סניגוריא ולהשתיק פיות המקטרגים. שהרי בדין הוא שיעלו שכרם בעוה\"ז על אשר עשו לפנים משורת הדין לפרוש מן המותרות, אלא שאין שייך לשלם שכר עוה\"ז בעבור המצוות, דלא נחשב לכלום שכר העוה\"ז בערך מעשי המצוות שכולם רוחניים, לזאת יתחכם ה' לשלם שכרם בעת הגאולה העתידה לימות המשיח ויצא ידי שניהם שישולם שכרם בעוה\"ז בעבור שעשו לפנים משורת הדין, ואעפ\"כ יהיה שכרם בערך המצוה, כי יהיה השכר רב ועצום שיזכו ע\"י כן להגאל, שהוא שכר נצחי."},{"passage_id":"vayikru2_4e632c77_p23","passage_content":"ובזאת אפ\"ל גם דברי הת\"כ אם מקדישים אתם עצמכם מעלה אני עליכם כאילו קידשתם אותי, כי ע\"י שישראל מקדשים עצמם במותר להם הם מקרבים את הגאולה השלימה, ואז יתקדש שמו ית' בעולם כולו, ובזה יחשב להם כי קידוש ה' בא בכח מעשיהם, וכאשר נתבאר כי בזכות שהם מתקדשים לפרוש מן המותר, יעשה הקב\"ה צדקה עמהם ויושיעם. ואח\"כ אמר או אינו אומר אלא אם קדשתם אותי הריני מקודש ואם לאו איני מקודש, ויתבאר דהנה אמרו ז\"ל (סנהדרין צ\"ח ע\"א) אין בן דוד בא אלא בדור שכולו זכאי או כולו חייב, וכבר הארכנו בזה בספרי ויואל משה (מאמר א' סימן מ') דאין הכוונה כי בעבור מעשי הדור שכולו חייב יבוא המשיח, דביאת המשיח הוא בהכרח בזמן קץ האחרון, בעבור שהבטיחנו הקב\"ה בשבועה שבכל אופן ואופן תהיה הגאולה, אלא שחז\"ל גילו לנו בחכמתם וברוח קדשם שאם יזכו ישראל ותהיה הגאולה בחי' אחישנה יהיה הדור כולו זכאי, וח\"ו אם לא יזכו יתארך הגלות כ\"כ עד שמרוב עתים ושנים יהי' דור שכולו חייב, אין מי יקרא בשמך בצדק מתעורר להחזיק בך, ובכל זאת השי\"ת לא למעננו יעש ויגאל אותנו ברחמיו הגדולים. ואע\"פ שהשפלות גדול מאד, מ\"מ כל מה שעושים מטע לעורר רחמי שמים מועיל קצת לקירוב הקץ, אלא שבעבור השפלות הגדול שהדור שרוי בו, בחינת כולו חייב, תהיה עיקר ההתעוררות אך ברחמי שמים, כי הקב\"ה צופה ומביט בעניינו ובשפלות מצבנו ומעמדנו, ועם כל זאת שמו הגדול לא שכחנו, אלא אנו מחזיקים את עצמנו בבורא כל העולמים, וחפצים להתקרב אליו ולעשות רצונו."},{"passage_id":"vayikru2_4e632c77_p24","passage_content":"וז\"ש המדרש או אינו אומר אלא אם קדשתם אותי הריני מקודש, כלומר דשמא תאמר שרק אם יהיו ישראל ראויים לעורר ולקרב קץ הגאולה באמצעות מעשיהם הטובים אז מתקדש שמו יתברך בעולם, \"ואם לאו\" כלומר שאין ישראל ראויין להגאל, שהם ח\"ו בחינת כולו חייב, איני מקודש, שלא יגאל הקב\"ה את ישראל במצב שפל כזה ח\"ו, ת\"ל כי קדוש אני בין מקדשין בין שאין מקדשין, כי הגאולה השלימה בהכרח תבא בכל אופן ואופן, בין אם ישראל ראויים בין שאינם ראויים, אלא שאם יזכו ישראל תהיו הגאולה בבחינה גבוהה יותר."}]},{"dvar_torah_id":"vayikru2_9150015f","title":"קדושה במעשה בציבור ובסתר","summary":"בפרשת קדושים מצווה ה' על בני ישראל להיות קדושים, כלומר פרושים במחשבתם. יש יתרון במעשה מצוות בציבור, אך יש להיזהר מכוונות רעות. התבודדות במחשבה אף בתוך קהל תורמת לשלמות המעשה ולכבוד שמים.","contents":[{"passage_id":"vayikru2_9150015f_p1","passage_content":"באופן אחר יתבאר מאה\"כ דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו, ופירש\"י ז\"ל פרשה זו בהקהל נאמרה שרוב גופי תורה תלויים בה. והקשו המפרשים דלהכי לא איצעריך קרא שהרי כל מצוות התורה בהקהל נאמרו, ועדיין איני יודע מה מלמדני הכתוב באומרו דבר אל כל עדת בני ישראל."},{"passage_id":"vayikru2_9150015f_p2","passage_content":"ונראה דהנה תכלית הבריאה היא שיהיה שמו ית' מתגדל ומתקדש בעולם, ע\"י בני ישראל המקדישים שמו יתברך במעשיהם הטובים. והנה אם כי מצד זה איכא מעליותא שיהיו ישראל מקיימים תורה ומצוות בפרהסיא בתוך קהל ועדה, כי אז מתגדל ומתקדש שמו יתברך לעיני הכל, אמנם מאידך גיסא איכא מעליותא בקיום התורה והמצוות בצינעא בסתר ובמחבוא, מקום שאין כל בריה רואה, כי בדרך זו אפשר בנקל לשמור על שלימות המחשבה ועל זכות וצלילות הדעת, שתהיה המצוה מיוחדת בלתי לה' לבדו, ללא שמץ פניה והתפארות, ושאר מחשבות חוץ הפוגמות בשלימות המצוה."},{"passage_id":"vayikru2_9150015f_p3","passage_content":"ואפילו הכי חשובה ומקובלת ומרוצה יותר עשיית המצוות בתוך קהל רב, מאשר יסתר האדם במסתרים ואיש לא יראנו, כי בעשיית המצוות בצבור מתרבה כבוד שמים בעולם. אכן בדבר הזה צריך סייעתא דשמיא מרובה, שאף בזמן קיום המצוות בפני קהל ועדה לא יכנסו בלבו מחשבות התפארות בפני בני אדם, אלא יתאמץ וישתדל בכל כוחו לשמור על בהירות כוונתו, וכמ\"ש ק\"ז זלה\"ה בייטב לב לפרש המשנה (אבות פ\"ב ב') וכל העמלים עם הצבור יהיו עמלים עמהם לשם שמים, ר\"ל שכל העוסקים בתורה ובמצוות בציבור בתוך ישרים ועדה, צריכים לכוון מעשיהם לשם שמים, ולא יתכוונו להתפאר בפני בני אדם, או שאר פניות כיוצא באלו."},{"passage_id":"vayikru2_9150015f_p4","passage_content":"ובחינה זו אפשר להעמיס במאה\"כ דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו, דהנה קדושים ביאורו פרושים, כמ\"ש רש\"י ז\"ל, וכמו כן הרמב\"ן ז\"ל עפ\"י דרכו פירש קדושים תהיו פרושים, וכדאיתא בתורת כהנים. והכוונה במאמר זה לרמוז שאף בעת אשר האדם נמצא בתוך רבים, כדכתיב אל כל עדת בני ישראל, אפ\"ה קדושים תהיו, כלומר הוו זהירים להיות פרושים במחשבתכם, בעת שאתם מקדשים שם שמים ע\"י התורה והמצוות. והוא ע\"ד מה שכתב הרה\"ק מוהר\"ר משה לייב מסאסוב זלה\"ה בהזהרותיו שטוב ההתבודדות עם הצבור, פי' דאף בעת שהוא נמצא עם הצבור תהיה לו התבודדות במחשבתו, כאילו הוא לבדו בביתו ואין זר אתו, ואם ככה תהא מחשבתו יהיו מצוותיו שלימים ורצויים ללא כל שמץ פניה זרה, ובאופן זה יהיו שתי המעלות גם יחד בידו, שיתקדש ש\"ש ע\"י תורתו ומצוותיו, בעבור שהוא עושה אותם ברבים, וגם יהיה מעשה המצוה בשלימות."}]},{"dvar_torah_id":"vayikru2_a8b9530f","title":"קדושים תהיו: אזהרה וקדושה","summary":"בפרשת קדושים תהיו, מזהירה התורה את ישראל לשמור על קדושתם דרך פרישות מן המותרות ותיקון המידות. המדרש מסביר כי הקדושה של הקב\"ה נעלית על זו של בני אדם, אך תלויה במעשיהם ובזמינותם לקיום המצוות.","contents":[{"passage_id":"vayikru2_a8b9530f_p1","passage_content":"וידבד ה' אל משה לאמר דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו כי קדוש אני ה' אלקיכם. פירש\"י ז\"ל פרשה זו נאמרה בהקהל מפני שרוב גופי תורה תלויים בה. והקשו המפרשים שהרי כל פרשיותיה של תורה בהקהל נאמרו כדאיתא בעירובין (דף נ\"ד ע\"ב) וא\"כ מה הודיענו הכתוב בפרשה זו ביחוד שנאמרה בהקהל. גם מה נתינת טעם היא זו שנאמרה בהקהל מפני שרוב גופי תורה תלויים בה, והלא אף שאר פרשיות שאין רוב גופי תורה תלויין בהם נאמרו בהקהל."},{"passage_id":"vayikru2_a8b9530f_p2","passage_content":"ב) במד\"ר (פכ\"ד ע') איתא קדושים תהיו יכול כמוני ת\"ל כי קדוש אני וגו' קדושתי למעלה מקדושתכם. והוא תמוה מאד היעלה על הדעת לדמות קדושת בני אדם שוכני בתי חומר, אשר מעפר לוקחו ואל עפר ישובו, אל קדושתו של יוצר בראשית יתברך שמו, עד דאיצטריך קרא להוציא מטעות זו."},{"passage_id":"vayikru2_a8b9530f_p3","passage_content":"ג) בתודת כהנים (הובא בילקוט) איתא אם מקדישים אתם את עצמיכם מעלה אני עליכם כאילו קידשתם אותי או אינו אומר אלא אם קדשתם אותי הריני מקודש ואם לאו איני מקודש ת\"ל כי קדוש אני בקדושתי אני בין מקדשין בין שאין מקדשין, ע\"כ. והוא פלאי וכי ניתן לדמות ולומר כי קדושת הבוי\"ת שמו תלויה בקדושת בני אדם קרוצי גושי חומר, הלא קדושתו יתברך אינה תלויה בדבר, אלא היא נצחיית ולעד עומדת, ולא יצוייר אצלו ח\"ו העדר קדושה, ואמאי איצטריך קרא לאשמעינן דבין מקדשין בין שאין מקדשין הרי הוא בקדושתו."},{"passage_id":"vayikru2_a8b9530f_p4","passage_content":"ונראה בהקדם לבאר דבריהם ז\"ל דפרשת קדושים תהיו רוב גופי תורה תלויים בה. דהנה רבו הפירושים בדברי מפרשי התורה לבאר מצות קדושים תהיו מה טיבה. רש\"י ז\"ל פירש הוו פרושים מן העריות וכו', שכל מקום שאתה מוצא גדר ערוה אתה מוצא קדושה. והרמב\"ן ז\"ל חלק על פירש\"י ז\"ל משום דבת\"כ משמע שאין זו אזהרה על פרישה מעריות, ולפיכך כתב הוא ז\"ל דהפרישה הזו היא לפרוש מן המותרות, שאם ילך האדם שובב אחרי שרירות לבו ימצא בעל התאוה מקום להיות שטוף בזימה ולהיות זולל וסובא וידבר כל נבלה, וא\"כ יהיה נבל ברשות התורה, לפיכך הזהירה תורה שנהיה פרושים מן המותרות, ויקדש עצמו בזה עד שיגיע לפרישות, וכמו שדרשו ז\"ל קדש עצמך במותר לך."},{"passage_id":"vayikru2_a8b9530f_p5","passage_content":"וק\"ז זלה\"ה בייטב לב ר\"פ זו דרש סמוכין לסוף פרשה הקודמת דכתיב בה ושמרתם את משמרתי וכתיב בתריה קדושים תהיו, וביאר עפ\"י מה שאמרו ז\"ל (יבמות דף כ\"א ע\"ב) עה\"פ ושמרתם את משמרתי עשו משמרת למשמרתי, ושם (דף כ' ע\"א) איתא על הא דתנן במתניתין איסור קדושה מאי איסור קדושה שניות מדברי סופרים ואמאי אמר אביי כל המקיים דברי חכמים נקרא קדוש וכו', ופריך רבא וכל שאינו מקיים דברי חכמים קדוש הוא דלא מקרי רשע נמי לא מקרי (בתמיה) אלא א\"ר קדש עצמך במותר לך (פירש\"י קדש עצמך לעמוד ולהזהיר אף במותר לך להוסיף שניות שהם מותרות לך על העריות כדי שלא תבא לידי עריות האסורות מן התורה). ונראה שזה בעצמו גם טעמו של אביי שאמר כל המקיים דברי חכמים נקרא קדוש, שהוא קדוש משום שהוא מקיים דברים המותרים מן התורה ומקדש עצמו במותר לו. והנה איתא בתנחומא ס\"פ נשא (סימן כ\"ט) לא יאמר אדם איני מקיים מצות זקינים שאינו מן התורה א\"ל הקב\"ה בני כל מה שגוזרים עליכם תהיו מקיימין וכו' למה שאף על דבריהם אני מסכים שנאמר ותגזר אומר ויקה לך וכו', ובזה תתבאר הסמיכות דכתיב ושמרתם את משמרתי, שהיא אזהרה לחכמים לעשות משמרת למשמרתה של תורה כדי שלא יבואו להכשל באיסורים דאורייתא, והדר כתיב אזהרה לבני ישראל קדושים תהיו, שתקיימו דברי חכמים ותזכו למדריגת קדוש, ע\"ד קדש עצמך במותר לך, ונתן טעם לדבר כי קדוש אני ה', כביכול גם אני שומע לדברי חכמים ומסכים עמהם לקיים גזירתם, עכ\"ד ק\"ז זלה\"ה. ועפ\"י זה נמצא כי מצות קדושים תהיו היא אזהרה לבני ישראל שישמרו את הגדרים וסייגים אשר חכמים גוזרים עליהם, ובזה יזכו למדריגת קדושים."},{"passage_id":"vayikru2_a8b9530f_p6","passage_content":"ונראה לומר כי כל הפירושים הללו סובבים על קוטב אחד, ויתבאר בהקדם מה שכתב הרחיד\"א ז\"ל בספרו נחל קדומים בשם רבינו אפרים ז\"ל לפרש קדושים תהיו מזומנים תהיו למצוותי כמו ואל העם תאמר התקדשו למחר, כי קדוש אני, כלומר אני מזומן לשמוע קולכם בכל עת שאתם קוראים אותי שנאמר מי כה' אלקינו בכל קראינו אליו, ע\"כ. ומצינו כמה מקראות כיוצא בזה שלשון קדש פירושו הזמנה, כגון הא דכתיב בפרשת וישב איה הקדשה היא בעינים וגו' ופירש\"י הקדשה מקודשת ומזומנת וכו'. והנה עיקר ההזמנה לשמירת המצוות הוא תיקון המדות, וכמו שכתב הקדוש מהרח\"ו זלה\"ה בספרו שער הקדושה אשר איזן וחיקר על תיקון המדות, כי יסוד כל התורה הוא תיקון המידות, שע\"י שלימות המדות ניתן לזכות בכתרה של תורה, וזלה\"ק בשער ב' שם, והנה בנפש הזה תלויות המדות הטובות והרעות וכו', אשר בה תלויין תרי\"ג מצוות התורה יכו', לפיכך אין המדות בכלל התרי\"ג מצוות, ואמנם הן הכנות עיקריות אל התרי\"ג מצוות בקיומם או בביטולם וכו'. ולפיכך ענין המדות הרעות קשים מן העבירות עצמן מאד וכו', ונמצא כי יותר צריך ליזהר ממדות הרעות יותר מקיום המ\"ע ול\"ת, כי בהיותו בעל מדות טובות בנקל יקייה כל המצוות, עכדה\"ק, עיי\"ש. גם החסיד בעל חובת הלבבות יסד ספרו על תיקון והיישרת המדות, כי זה הוא שורש ועיקר הכל. ובעוה\"ר אין איש שם על לב להשלים עצמו בתיקון המדות הטובות, ולא ידעו ולא יבינו כי המה יסוד לכל התורה."},{"passage_id":"vayikru2_a8b9530f_p7","passage_content":"וזהו המכוון במה שפירש רבינו אפרים ז\"ל קדושים תהיו מל' הזמנה, כי כדי שיזכה האדם אל הקדושה צריך הוא לעשות סכנה דרבה בתיקון המדות, וההכנה לזכות למדות טובות היא ע\"י הזמנת כל כוחות הגוף, להרחיקם מן המדות הרעות ולתקנם במדות טובות וישרות, ובזה יזכה האדם למעלת הקדושה. ואמר הכתוב כי אם אמנם תזמינו עצמכם בתיקון המדות אזי אף אני אעשה זאת לכם כי קדוש ה' אלקיכם, וכפירוש רבינו אפרים ז\"ל שאני מזומן לשמוע קולכס בכל עת שתקראוני, והפעם כי הקב\"ה מתנהג עם האדם במדה כנגד מדה, כשם שהאדם מזמין עצמו במדות טובות וישרות, שעל ידם יגיע לקיום המצוות, כמו כן הקב\"ה מתנהג עמו במדה זו לשמוע קול תפלתו בכל עת שיקרא אליו. וכמו שידוע מה דאיתא במדרש (הביאו השלה\"ק ומטו בה משמיה דהבעש\"ט הקדוש זי\"ע משום שהיה המדרש הזה שגור בפיו ולו רגל על לשונו) עה\"פ ה' צלך כי השי\"ת מתנהג עם האדם בבחינת הצל מה הצל הזה כשאתה משחק הוא משחק לך וכו' כן הוא הדבר אשר הקב\"ה מתנהג עם האדם כפי מעשיו. והכי נמי איתא במד\"ר פרשת וירא (פמ\"ח ו') עה\"פ והוא יושב פתח האוהל ביקש לעמוד א\"ל הקב\"ה שב ואתה סימן לבניך מה אתה יושב ושכינה עומדת כך בניך יושבין ושכינה עומדת על גבן כשישראל נכנסין לבתי כנסיות ולבתי מדרשות וקורין ק\"ש והן יושבין לכבודי ואני על גבן וכו'. ועפ\"י זה יהיה ביאור הכתוב בסגנון זה קדושים תהיו מזומנים למצוותי, וכדאמרן דקאי על הכנת האדם בתיקון המדות, ואם תעשו כן אזי כי קדוש אני ה' אלקיכם, שאהיה מזומן לכם להאזין קול שועתכם בכל קראכם אלי."},{"passage_id":"vayikru2_a8b9530f_p8","passage_content":"ובדרך זה יתבארו דברי המד\"ר קדושים תהיו יכול כמוני, כי לפי שבמאמר זה ישנה הבטחה שהקב\"ה יזמין עצמו כביכול לשמוע קול תפלת עמו ישראל, כשם שהם מזומנים למצוות, וכמו שנתבאר שהוא בחי' ה' צלך, כשם שהאדם מתנהג כן מתנהגים עמו בשמים, ולפי זה אפשר יעלה על הדעת לומר כי הקב\"ה מזמין עצמו כביכול לשמוע תפלות ישראל לפי ערך מה שהזמינו בני ישראל את עצמם לקיום המצוות ולא יותר, וז\"ש המדרש קדושים תהיו יכול כמוני, כלומר שמא תאמרו כי בבחינה שאתם מזמינים עצמכם למצוות תהיה הזמנת הקב\"ה לשמוע קול נאקתכם ותו לא, ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם, כלומר הזמנתי למעלה מהזמנתכם דאף שההזמנה שאתם מזמינים עצמכם למצוות היא במדרגה פחותה, הקב\"ה מתנהג עמכם במדת החסד ובמדת הרחמים, ומזדמן לכם בבחינה גדולה הרבה מאד, וע\"ד הא דאיתא במדרש (שהש\"ר פ\"ה ג') פתחו לי פתח אחד של תשובה כחודה של מחט ואני פותח לכם פתחים שיהיו עגלות וקרונות נכנסות."},{"passage_id":"vayikru2_a8b9530f_p9","passage_content":"והאמת היא כי תהיה ההזמנה שבני ישראל עושים כמה שתהיה, ואפילו במסירות נפש גמורה, לא תגיע הזמנתם אל ההזמנה שהקב\"ה עושה לקבל תפלות ישראל, כי הקב\"ה משגיח על ישראל בעינא פקיחא ובהשגחה נפלאה ובשועם אליו שמע, אלא שההסתר גדול מאד הסתר בתוך הסתר ובעבור כן אין מבינים גודל ההשגחה. והשי\"ת יזכנו לראות עין בעין את גודל ההשגחה שהוא משגיח על עם סגולתו."},{"passage_id":"vayikru2_a8b9530f_p10","passage_content":"ובבחינה זו נבא לביאור הת\"כ (קושיא ג') אם מקדישים אתם את עצמיכם מעלה אני עליכם כאילו קידשתם אותי, כלומר שאם ישראל מזמינים את עצמם לתורה ולמצוות הקב\"ה מזומן להם לשמוע בקול תפלותיהם, ואף שאין הזמנת ישראל דומה אל ההזמנה שהקב\"ה מזדמן להם, כדאמרן כי הזמנתו יתברך לבני ישראל גבוהה ונעלה מאד מהזמנת ישראל אליו, מ\"מ אמר הקב\"ה מעלה אני עליכם כאילו קידשתם אותי, כלומר כאילו כל ההזמנה שהקב\"ה מזמין עצמו אליהם באה מחמת מה שישראל מקדשין ומזמינים עצמם לתורה ולמצוות, כי כל תנועה ותנועה שישראל עושים כדי להתגבר על יצה\"ר חשובה מאד לפני המקום ב\"ה. והדר קאמר המדרש או אינו אומר אלא אם קידשתם אותי הריני מקודש ואם לאו איני מקודש, כלומר דהו\"א כי אם אין ישראל מזמינין עצמם למצוות אין הקב\"ה מזומן להם כלל להאזין בקול תפלתם, ת\"ל כי קדוש אני בקדושתי אני בין מקדישין בין אין מקדישין, שהקב\"ה מזומן בכל אופן ואופן לשמוע קול שועת עמו ישראל ברחמים, ואפילו בזמן שאינם מזמינים עצמם למצוותיו."},{"passage_id":"vayikru2_a8b9530f_p11","passage_content":"והשתא כל הפירושים שנאמרו במצות קדושים תהיו סובבים הולכים אל מקום אחד, כי לכולהו פירושי בא הכתוב להזהירנו כאן להיות מוכנים ומזומנים לקיום התרי\"ג מצוות, ולהרחיק עצמינו מכל דבר אשר ימנענו מלקיים המצוות כראוי. שהרי לפי דברי הרמב\"ן ז\"ל שקדושים תהיו היא אזהרה לפרוש עצמנו מן המותרות, הרי זה עיקר גדול שרוב גופי תורה תלויים בו, כי אם ילך האדם אחרי תאותיו בדברים המותרים ולא ימנע עצמו מכל עשר לבו חומד, אזי ילכד ונכשל גם בדבר איסור ח\"ו, ועלול הוא לעבור על רוב גופי תורה. ולפיכך זה דרך ישר לפני איש שיפרוש עצמו מן המותרות ויקדש עצמו במותר לו, ואז יתקיים אצלו כל המצוות, וא\"כ נמצא כי במצות קדושים תהיו תלוי קיומם של רוב גופי תורה. וכמו כן לפי דברי ק\"ז זלה\"ה הייטב לב דקדושים תהיו היא אזהרה לשמור את הגבולים אשר גבלו ראשונים, הם הגדרים והסייגים שגדרו חז\"ל לעשות משמרת למשמרתה של תורה, אתי שפיר דבכך תלויים רוב גופי תורה, שאם נפרץ הגדר בקל יוכלו להכשל בגוף האיסור. ואף לפירושו של רבינו אפרים ז\"ל מובן שפיר טעם שפרשה זו תלויים בה רוב גופי תורה, כאשר נתבאר באורך, כי קשה מאד עונשן של מדות, ורק בהזמנת הגוף ושלמות המדות אפשר לקיים התורה, וקיום כל התורה תלוי בהנהגת האדם ובשלמות מדותיו."},{"passage_id":"vayikru2_a8b9530f_p12","passage_content":"ואפ\"ל עוד כי כל הפירושים הללו גם יחד כלולים במצות קדושה שציונו יוצרנו, אלא שהאחד הוא דרגה והכנה להגיע אל משנהו, כי בראש ובראשונה על האדם לפרוש מן המותרות ותענוגי הזמן, כפירושו של הרמב\"ן ז\"ל במצות קדושים תהיו, וזו היא המדריגה הראשונה שעל ידה יבא האדם להשיג הקדושה, וכארז\"ל קדש עצמך במותר לך, וצריך האדם לברוח מצ\"ט שערי היתר שלא יכשל ח\"ו בשער א' של איסור, ורק כאשר יתקדש האדם במותר לו יעלה בידו לפרוש מעריות ומע\"ז, כי אם ימלא תאותו בדבר המותר, נפשו לא תמלא ותתאוה גם לעבירה, וייצרו יתגבר עליו ויכשילהו ח\"ו גם בדבר האסור, כארז\"ל כך דרכו של יצה\"ר היום אומר לו עשה כך ומחר אומר לו עשה כך עד שאומר לו לך ועבוד ע\"ז וכו'. משא\"כ אם יגדור עצמו ממותרות ויקדש עצמו במותר לו יעלה בידו להתגבר על יצרו ולפרוש מעריות ומע\"ז, וכאשר יתחזק אצלו כח הקדושה יתקיימו אצלו כל המצוות, כי כח הקדושה יעהו לקיים מצוות ה' כראוי לו, ונמצא כי פרישות אלו הם הכנה והזמנה לקיום המצוות, כפירושו של רבינו אפרים ז\"ל, שהרי ע\"י פרישות אלו יהיה מוכן ומזומן לקיים עצותיו יתברך, באין שען ואין פגע רע."},{"passage_id":"vayikru2_a8b9530f_p13","passage_content":"ועפ\"י זה יתבאר לנו גם מה שפירש רש\"י ז\"ל פרשה זו בהקהל נאמרה (עיין קושיא א') עפ\"י מה דאיתא במד\"ר פרשת יתרו (פכ\"ח ד') וז\"ל, כל מה שהנביאים עתידים להתנבאות בכל דור ודור קבלו מהר סיני, שכן משה אמר להם לישראל כי את אשר ישנו פה עמנו עומד היום אין כתיב כאן אלא עמנו היום אלו הנשמות העתידות להבראות שאין בהם ממש שלא נאמרה בהן עמידה, שאעפ\"י שלא היו באותה שעה כאו\"א קיבל את שלו, וכה\"א משא דבר ה' אל ישראל ביד מלאכי, בימי מלאכי לא נאמר אלא ביד מלאכי שכבר היתה הנבואה בידו מהר סיני, ועד אותה שעה לא ניתנה לו רשות להתנבאות. וכן ישעי' וכו' עד עכשיו לא ניתנה לו רשות להתנבאות ולא כל הנביאים בלבד קבלו מסיני נבואתן אלא אף החכמים העומדים בכל דור ודור כל אחד ואחד קיבל את שלו מסיני, ע\"כ. מבואר מזה דכל מה שהיה עתיד להתגלות לחכמים ולנביאים במשך הדורות כבר נתגלה למשרע\"ה בסיני, וכמו כן כל הגדרים שהוסיפו החכמים בזמן מן הזמנים הכל ניתן בסיני, אלא שלא היה משרע\"ה רשאי לגלותם באותו הזמן."},{"passage_id":"vayikru2_a8b9530f_p14","passage_content":"והנה בזמן שעמדו ישראל על הר סיני היו במדריגה עליונה שפסקה זוהמתן והיו קדושים כמלאכי מרום, ולא היו צריכים אז לפי מצבם ומעמדם לכל הגדרים והסייגים שהוסיפו החכמים במשך הדורות שלאחריהם, וגם לא הותר לגלות להם גדרים וסייגים אלו שעתידים היו להתחדש בדורות הבאים, כי הם שייכים לנשמותיהם של חכמי דור ודור, ועד שהגיע זמנם לא ניתנה רשות לגלותם. ולפי זה נמצא כי מאמר קדושים תהיו שהוא אזהרה שיהיו ישראל משמרים גדרים וסייגים או שיתקנו מדותיהם, הרי לא היה שייך כלל באותו הדור, ועל כרחך לומר שנאמר מקרא זו למען דורות העתידים, וא\"כ יתכן דכשם שבשעת מתן תורה נמצאו והיו כל הנשמות העתידות להבראות למען יקבל כל אחד חלקו המוכן לו בתורה, כמו כן בשעה שנאמרה לישראל מצות קדושים תהיו שהיא אזהרה השייכת לדורות הבאים כמו שנתבאר, נקהלו ובאו כל הנשמות העתידות להבראות, כדי שישיגו מטה זו הנוגעת להם, ואין רחוק כ\"כ גומר כן שהרי חזינן שלא בלבד במעמד הנבחר היו כל הנשמות העתידות להבראות, אלא גם בזמנים אחרים נתכנסו כל הנשמות, וראיה לדבר מדיליף המדרש להך מילתא שבמ\"ת היו כל הנשמות העתידות להבראות מדכתיב את אשר ישנו פה וגו' ואת אשר איננו פה, ומקרא זה כתיב פרשת נצבים כשהשביעם משה באלות הברית בטרם מותו, הרי שלא במ\"ת בלבד היו הנשמות העתידות להבראות, אלא בכל עת שהיה צורך בדבר. כגון בשעה שכרת עמהם את הברית בעבור ישמרו חוקיו ותורותיו ינצורו, כמאה\"כ לעברך בברית ה' אלקיך ובאלתו אשר ה' אלקיך כורת עמך היום. וה\"נ אפ\"ל כי בעת שנאמרה לישראל מצות קדושים תהיו שהיא פרשה שרוב גופי תורה תלויים בה היו באותו מעמד כל הנשמות העתידות להברא, ומה גם שמצוה זו עיקרה נאמרה בעבור הדורות הבאים, להזהירם על שמירת הגדרים והסייגים שהם עתידים להצטוות מפי החכמים הקדושים, ועל תיקון המדות, ולהתקדש במותר להם, שהוא היסוד לשמירת כל התורה כולה."},{"passage_id":"vayikru2_a8b9530f_p15","passage_content":"ובזה מובן היטב מה שדרשו ז\"ל מדכתיב דבר אל כל עדת בני ישראל דפרשה זו בהקהל נאמרה, והכוונה על הקהלת כל הנשמות העתידות להבראות, כשם שנקהלו במעמד הר סיני, שהרי להם היתה מכוונת אזהרה זו, לשמור כל הגדרים והסייגים שיצטוו מפי חכמי דור ודור. והשפעת דיבוריו הקדושים של משרע\"ה שהיתה שכינה מדברת מתוך גרונו הנם חיים וקיימים בכל הדורות, וע\"ד שפירש הבעש\"ט הקדוש (הובא בליקוטי אמרים דף ע\"ו ע\"ב) עה\"כ לעולם ה' דברך נצב בשמים (תהלים קי\"ע) פירוש דברך שאמרת יהי רקיע בתוך המים תיבות ואותיות אלו הן נצבות ועומדות לעולם בתוך רקיע השמים ומלובשות בתוך כל הרקיעים לעולם להחיותם כדכתיב ודבר אלקינו יקום לעולם (ישעי' א') ודבריו חיים וקיימים לעד ולנצח נצחים."},{"passage_id":"vayikru2_a8b9530f_p16","passage_content":"ולפיכך נאספו אליו בשעת אמירת פרשה זו כל הנשמות העתידות להבראות, כדי שיהיו באותו מעמד כשיאמר משה לישראל מצות קדושים תהיו, שהיא אזהרה הנוגעת להם בדורותיהם, דבכל דור ודור הוצרכו להוסיף גדרים וסייגים לפי מצב הדור, ויותר שהדור פרוץ יש צורך בגדרים וסייגים נוספים, כדי שלא יהא הפרוץ מרובה על העומד. וכמו שפירש הרשב\"א ז\"ל הא דאיתא בגמרא ברכות (דף י\"א ע\"א) משל לאחד שאומרים לו זקנך מגודל אומר להם יהא כנגד המשחיתים, דהכוונה ששואלים אותו מדוע אתה מגדל זקנך והרי אפשר לגלחו בדרך היתר, ועל כך הוא משיב אמריו להם יהא כנגד המשחיתים, כלומר דאף שהיה בידי לגלחו בדרך היתר אני מגדלו במכוון כדי להוציא מלבם של אלו המשחיתים זקנם, לפיכך עלי לעשות היפך מעשיהם."},{"passage_id":"vayikru2_a8b9530f_p17","passage_content":"ובדרך רמז אפ\"ל מה שאמר הכתוב בפרשה זו דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו, כי הנה האיש אשר הוא מקיים מצוות ה' כראוי וזהיר בשמירת הגדרים והסייגים אשר גדרו ראשונים, ומקדש עצמו במותר לו, ודאי שמעשיו יקרבוהו ויביאוהו לקדושה וטהרה. אמנם מהות המדריגה אשר הוא זוכה לעלות ולהגיע אליה תלוי במצב הדור, שאם הדור ראוי אזי אף הוא זוכה בגינם לקדושה עליונה רמה ונישאה, אך אם ח\"ו אין הדור ראוי קשה מאד להשיג מדריגה גבוהה, וכהא דמצינו בגמרא (סוטה מ\"ח ע\"ב) יצתה בת קול ואמרה יש כאן אדם אחד שראוי שתשרה שכינה עליו אלא שאין דורו ראוי לכך. וידוע שהמהרח\"ו זלה\"ה שאל מאת רבו האריז\"ל דמאחר שנשמתו גבוהה כנשמות התנאים והאמוראים, מדוע אין רואים אצלו אותם המדרגות שזכו הם להשיג, כגון להחיות מתים, והשיב לו כי באמת הוא ראוי לכך, אלא שאין דורו ראוי לכך. הרי שהכל תלוי במצב הדור, ומעשיהם משפיעים על בני העליה, אם יזכו להתעלות במדרגות הקדושה כראוי להם לפי כשרון מעשיהם אם לאו. וזאת רמז לנו הכתוב דבר אל כל עדת בני ישראל וגו' קדושים תהיו, דענין קדושים תהיו תלוי בכל עדת בני ישראל, כי אם הדור ראוי ומעשיו מתוקנים אזי יוכלו בני העליה צדיקים שבדור לעלות מעלה מעלה במעלות קדושים וטהורים."}]},{"dvar_torah_id":"vayikru2_a2f21c92","title":"קדושת ישראל ויגיעת האדם","summary":"הקדושה המיוחסת לישראל היא תוצאה מהיותם מזרע קדוש, אך כדי להשיג מדרגת קדוש יש צורך ביגיעה רבה. הקדושה האלוקית היא עצמית, בעוד קדושת ישראל היא מושאלת או עתידית, ודורשת עבודה ומעשים טובים.","contents":[{"passage_id":"vayikru2_a2f21c92_p1","passage_content":"באופן אחר יתבאר המד\"ר קדושים תהיו יכול כמוני ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם, ע\"כ. והוא פלאי הכיצד יעלה על הדעת לומר כי יכול האדם להתקדש כמוהו יתברך, עד דאיצטריך קרא למיעוטיה."},{"passage_id":"vayikru2_a2f21c92_p2","passage_content":"ונראה דהנה יש להתבונן במה שמצינו בדברי חז\"ל פעמים הרבה שישראל מכונים בתואר קדושים, וכמו שאמרו ז\"ל ישראל קדושים הם וכו' (עי' שבת פ\"ו ע\"א ועי' חולין צ\"ב ע\"ב), והכוונה שהם קדושים מצד תולדתן ללא שום פעולה. וכיוצא בזה מצינו בדבריהם ז\"ל (ב\"ב קמ\"ט ע\"א) הורתו ולידתו בקדושה, הרי כי כל אשר יוולד מזרע ישראל הרי הוא נקרא קדוש בעבור היות צור מחצבתו קדוש. והרמב\"ן ז\"ל כתב בס\"פ אחרי בפרשתא דעבודת המולך, וז\"ל, ועל דרך האמת ישראל זרע הקדש נולדים בבית ה' והנה המקריב אותו למולך מטמא מקדשו ומחלל שמו הגדול, ע\"כ. וכן פירש\"י עה\"פ והתקדשתם והייתם קדושים, זו פרישת ע\"ז, הרי שבפרישה מע\"ז בלבד ללא עשיית כל פעולה להתקדש נקראים ישראל בשם קדושים."},{"passage_id":"vayikru2_a2f21c92_p3","passage_content":"ובהנחה סוברת זו פירשנו מאמר פלאי במסכת חולין (דף ז' ע\"ב) דקאמר ר' פנחס בן יאיר ישראל קדושים הם יש רוצה ואין לו ויש שיש לו ואינו רוצה וכו',  וכתבו התוס' ד\"ה יש לו ואינו רוצה, אפילו הכי איקרו קדושים שמזמן את חבירו לאכול אצלו מפני הבושת, ע\"כ. ולכאורה דבריהם תמוהים הכי בעבור שהוא מזמן את חבירו מפגי הבושת קדוש יאמר לו, אף אם בסתר לבבו איגו חפץ לקיים המצוה. וגם לאידך גיסא במי שרוצה ואין לו תימה הוא לכנותו קדוש בעבור רצונו הטוב בלבד, אם לכלל מעשה לא הגיע. אמנם יתבאר דהנה אמרו ז\"ל (יבמות ע\"ט ע\"א) דוד גזר על הגבעונים שלא יבואו בקהל אמר שלשה סימנים יש באומה זו רחמנים ביישנים גומלי חסדים וכו' כל מי שיש בו ג' סימנים הללו ראוי לדבק באומה זו וכו'. ועפ\"י זה יובן דאותו שרוצה לזמן את חבירו אלא שאין לו הרי זה מורה כי מדת הרחמנות מצאה בו מקום לנוח, וא\"כ זה סימן מובהק כי נשמתו משרש ישראל ולא ממקום אחר, וכמו כן זה שיש לו ואינו רוצה והוא מזמן את חבירו מפני הבושה כמו שכתבו התוספות, הרי זה מוכיח כי ממקור ישראל הנהו, מכיון שיש לו בושת פנים. ומכיון שנודע לנו כי שורש נשמתו מישראל, ולא נתחלפה בנשמת עכו\"ם או עבד, כידוע מ\"ש המג\"א בסימן מ\"ו בשם המקובלים שאף בנולדים מזרע ישראל יתכן שתתחלף נשמתם בלילה בנשמת עכו\"ם או עבד, ועל כן מברכין בכל בוקר שלא עשני גוי ושלא עשני עבד וכו',  עיי\"ש. והכא הרי מכיון שיש בבני אדם אלו מדת הרחמנות ומדת הבושת, בע\"כ שורש נשמתן מישראל, ולא חל בהם חילוף או תמורה, וכיון שכן ממילא הם נקראים קדושים אפילו בלא שום פעולה, כמבואר בעבור שנפשות ישראל חוצבו מכסא הכבוד וממקום קדוש יתהלכו. ואתי שפיר מה שתיארו חז\"ל בתואר קדושים את מי שיש לו ואינו רוצה או שרוצה ואין לו, כי לא בעבור מעשיהם הם קרויים קדושים, אלא שמעשיהם מוכיחים עליהם כי מזרע ישראל מקורן ושורשן, וממילא הם קדושים."},{"passage_id":"vayikru2_a2f21c92_p4","passage_content":"אכן אף שהוכחנו מדבריהם ז\"ל כי ישראל קדושים מתולדתן אף בלא פעולה, מ\"מ בהרבה מקומות מבואר לכאורה ההיפך, כי לא בניקל יעלה ביד האדם לעלות ולהגיע למדרגת קדוש. וכדאיתא בגמרא (ברכות דף י' ע\"ב) בהא דכתיב גבי אלישע (מלכים ב' ד') ותאמר אל אישה הנה נא ידעתי כי איש אלקים קדוש הוא וגו' אריב\"ח מכאן שהאשה מכרת באורחים יותר מן האיש, קדוש הוא, מנא ידעה רב ושמואל ח\"א שלא ראתה זבוב עובר על שלחנו וח\"א סדין של פשתן הציעה על מטתו ולא ראתה קרי עליו, ע\"כ. ולכאורה יל\"ד שהרי היא אמרה איש אלקים קדוש הוא, ומדוע.שאלו בגמרא על אמרה \"קדוש הוא\" מנא ידעה, ולא קא מתמה כמו כן על מה שאמרה כי \"איש אלקים\" הוא מנא ידעה זאת. אמגם מזה נראה כי מעלת קדוש גבוהה יותר ממעלת איש אלקים, ולפיכך הבחינה יותר בנקל כי אלישע הוא איש אלקים, כי האשה מכרת באורחים, אבל על מה שגודע לה כי הוא עלה וגתעלה למדריגת קדוש שפיר תמהו מנא ידעה, כי מדריגה גבוהה זו היא רבה ונכבדה מאד נעלה, ולא ניתן להבחין בכך בניקל."},{"passage_id":"vayikru2_a2f21c92_p5","passage_content":"ושוב מצאתי כדברים האלה בספר סמיכת חכמים וז\"ל, כי דבר זה אפשר להכיר בלי סימן, כי אפשר ששמעה ממנו דברי עתידות וכיוצא בזה, והכירה שהוא איש אלקים, כי ד\"ז אפשר לידע, משא\"כ מה שאמרה קדוש הוא דמשמע שהוא דבר פנימיות יותר מאיש אלקים וכו', ע\"ז מקשה בגמרא מנא ידעה, דדבר זה א\"א לידע מכח שכל, ותירצו רב ושמואל וכו', עכ\"ל הסמיכת חכמים. הרי מבואר עד כמה נשגבה היא מעלת קדוש, עד שגדלה מדריגתה ממדריגת הנביא איש האלקים. ויש להוכיח דבר זה גם ממה שנתקן בנוסח תפילת שבת בפי ישרים תתרומם ובשפתי צדיקים תתברך ובלשון חסידים תתקדש ובקרב קדושים תתהלל, מסדר הדברים מוכח כי הוא מונה והולך מעלת השבחים ממעה למעלה, ומדנקט קדושים באחרונה משמע שהיא המדרגה הגדולה שבכולן, ומעלתה נשגבה ממעלת הצדיקים והחסידים."},{"passage_id":"vayikru2_a2f21c92_p6","passage_content":"עוד ראיה ממה שמצינו שאמרו ז\"ל (בבא בתרא ע\"ה ע\"ב) עתידין צדיקים שיאמרו לפניהם קדוש וכו' שנאמר (ישעי' ד') והיה הנשאר בציון והנותר בירושלים קדוש יאמר לו. הרי מזה מה גדולה היא מעלת קדוש, שבישר הנביא אשר לעת\"ל יקראו ישראל קדושים, משא\"כ בזמן הגלות זעירין אינון הזוכים להשיג מעלה גבוהה זו, וצריך לכך יגיעה גדולה מאד."},{"passage_id":"vayikru2_a2f21c92_p7","passage_content":"והכי מוכח מדברי הזה\"ק פרשת תרומה (קכ\"ח ע\"א) שהאריך בדברי קדשו כמה יגיעה רבה ועצומה צריך האדם כדי שיזכה להמשיך עליו רוח קדושה, וז\"ל, ההוא עובדא דבעי לאשתדלא ביה בעי למיקני ליה באגר שלים בכל מה דיבעון מיניה בין זעיר בין רב בגין דרוח מסאבא איהי אזדמן תדיר במגנא ובריקניא ואזדבן בלא אגרא ואניס לבני נשא למשרי עלייהו ומפתי לון לדיירא עמהון בכמה פתויין וכו' ורוח קודשא לא הכי אלא באגר שלים ובאשתדלותא רב סגי ובאתדכאותא דגרמיה ובאתדכאותא דמשכניה וברעותא דלביה ונפשיה ולואי דיכיל למרווח ליה דישווי מדוריה עמיה וכו', עכלה\"ק. מכל הלין מבואר שצריך האדם יגיעה עצומה להגיע למדריגת קדוש. ולכאורה זה סוחר למאמרי חז\"ל שהבאנו לעיל, שמהם משמע כי ישראל קרויים קדושים מבטן ומלידה אפילו בלא שום פעולה מצידם, וצריך לחלק דמה שישראל קרויים קדושים מחולדה אין זו קדושה עצמית אלא שם מושאל הוא להם, לצד שנפשם קדושה היא מעת רדתה אל העולם השפל להכנס בגופו של אדם, אבל ודאי שאם האדם מקלקל מעשיו ומרבה חבילות חבילות עבירות, גם הנפש מתגשמת ע\"י החטאים, ומעלת קדוש לא יהיה לה עוד."},{"passage_id":"vayikru2_a2f21c92_p8","passage_content":"וכיוצא בדבר מצאנו שדרך חז\"ל לדבר בלשון מושאל לפי הענין, כמו שכתב הרב המבי\"ט ז\"ל על מה שאמרו ז\"ל (סנהדרין ל\"ג ע\"ב) במאה\"כ ונקי וצדיק אל תהרוג (שמות פכ\"ג) מנין ליוצא מב\"ד זכאי ואמר אחד יש לי ללמד עליו חובה שאין מחזירין אותו לב\"ד ת\"ל וצדיק אל תהרוג וזה צדיק הוא שנצטדק בבית דין. ולכאורה מכיון שנמצא כאן אחד האומר שיש לו ללמד עליו חובה כיצד יקרא בשם צדיק דלמא באמת רשע הנהו, אלא ודאי כיון דבהך דינא יצא זכאי הרי הוא קרוי צדיק לענין זה, אף כי לקושעא דמילתא יתכן כי חייב הוא. והרב התניא ז\"ל בריש ליקוטי אמרים האריך טובא במה שאמרו ז\"ל (ר\"ה ט\"ז ע\"ב) בינונית מחצה זכיות מחצה עוונות, אף דבאמת אין אלו בינונית, שהרי מי שעובר עבירה אחת הריהו רשע, אלא דלאותו ענין שדברו בו חז\"ל כינו אותם בשת בינונית. וה\"נ כן הוא לענינינו דתואר קדוש שנתכנו בו ישראל מתולדה הרי זה לשון מושאל, בעבור נפשת אשר מכסא כבוד חוצבה, אך לאמתו של דבר לא יוכל האדם להשיג מעלת קדוש כ\"א אחרי יגיעה רבה ועצומה, כמבואר בזה\"ק הנ\"ל."},{"passage_id":"vayikru2_a2f21c92_p9","passage_content":"ואפ\"ל עוד כי מה שישראל נקראים עתה קדושים הוא על שם שיזכו לעתיד להיות במדריגה זו, כמפורש בדברי הנביא והיה הנשאר בציון וגו' קדוש יאמר לו. והוא ע\"ד הא דאיתא בגמרא (ברכות ח' ע\"א) אמרו ליה לר' יוחנן איכא סבי בבבל תמה ואמר למען ירבו ימיכם וימי בניכם על האדמה כתיב אבל בחו\"ל לא כיון דאמרי ליה מקדמי ומחשכי לבי כנישתא אמר היינו דאהני להו. וכתב המהרש\"א ז\"ל דלכאורה אכתי לא נתיישבה תמיהתו, דמה בכך שהם מקדימין ומעריבים בבתי כנסיות ובבתי מדרשות, סוף סוף אכתי בחו\"ל נינהו, וקרא כתיב על האדמה. וביאר עפ\"י אמרם ז\"ל (מגילה כ\"ט ע\"א) עתידין בתי כנסיות ובתי מדרשות שבבבל שיקבעו בארץ ישראל, ולפיכך אמר דאהני להו מאי דמקדמי ומחשכי לבי כנישתא דבבבל לזכותם באריכות ימים ושנים, שהרי בי כנישתא דבבל נחשבים כאילו הם על האדמה, מחמת שהם עתידין להקבע בארץ ישראל, עכת\"ד המהרש\"א ז\"ל."},{"passage_id":"vayikru2_a2f21c92_p10","passage_content":"וכמו כן יתכן לומר גם לענין זה, שישראל קרויים גם עתה קדושים אף שבאמת עדיין אינם במעלה זו, ע\"ש שהם עתידים להיות קדושים לעתיד לבא. אבל הא פשיטא כי לא בניקל ניתן להגיע למעלת קדוש בזה\"ז, כי אם אחרי עמל רב ויגיעה גדולה מאד."},{"passage_id":"vayikru2_a2f21c92_p11","passage_content":"ובזה נבא לביאור המד\"ר קדושים תהיו יכול כמוני, כלומר דהו\"א כי כשם שהקב\"ה הוא קדוש בעצם ולא מחמת פעולותיו, כמו כן גם קדושת ישראל היא קדושה עצמית מבלי שיצטרכו אליה יגיעה ועבודה, וז\"ש יכול כמוני, כלומר כשם שאני קדוש בלא פעולה, גם אתם תהיו נקראים קדושים בעצם, וכמו שמצינו בדברי חז\"ל הנ\"ל שישראל קדושים הם מבטן ומלידה, לזאת אמר ת\"ל כי קדוש אני ה' אלקיכם קדושתי למעלה מקדושתכם, דלא שייך לומר קדוש בלא שום פעולה כי אם אצל הקב\"ה, שקדושתו עצמית, משא\"כ בני ישראל קרויים קדושים רק בלשון מושאל, או ע\"ש העתיד, אבל באמת עליהם לטרוח ולהתייגע ביגיעות עצומות כדי שישיגו מעלת קדושים."}]},{"dvar_torah_id":"vayikru2_156aa7f5","title":"קדושת המצוות והכוונה בעשייתן","summary":"באם האדם מקדש את המצוות בפה, מעלה עליו הקב\"ה כאילו קדש את המצווה. יש צורך בכוונה בעשיית המצווה לשם יחוד, אף שהמצווה מקודשת מעצמה. המדרש מלמד כי קדושת ה' שורה על המקדש את המצווה.","contents":[{"passage_id":"vayikru2_156aa7f5_p1","passage_content":"עוד יאמר לפרש דברי התורת כהנים אם מקדישים אתם עצמיכם מעלה אני עליכם כאילו קדשתם אותי וכו'. ונראה עפ\"י מה שביאר האה\"ח הקדוש מאה\"כ כי קדוש אני ה' אלקיכם ע\"ד אמרם ז\"ל (תקו\"ז ד\"ק ק\"ל ע\"ב) כי העושה מצוה א' שמו ית' הוי\"ה שורה על אבר שבו עשה המצוה, כי תיבת המצוה בו רמוז שם מ\"צ בא\"ת ב\"ש י\"ה ואותיות ו\"ה הרי הוי\"ה, וא\"כ בעשות האדם הדבר לשם מצוה הנה שם הוי\"ה שורה עליו, והוא אומרו כי קדוש אני ה' אלקיכם לרמוז אל דביקות ה' במתקדש לעשות המעשה לשם מצוה וכו', עיי\"ש באורך מה שפירש עפ\"י דרכו בקדש. והכי איתא בזה\"ק בכמה דוכתי (עי' זה\"ק בראשית כ\"ד ע\"א ובפ' בהר ק\"י ע\"ב) עה\"פ זה שמי לעולם וזה זכרי לדר דר י\"ה עם שמי בגימטריא שס\"ה ו\"ה עם זכרי בגימטריא רמ\"ח, בכל מצוה ומצוה קשיר לון לישראל בשמיה למיהוי כל אבר ואבר דלהון חולק עדביה ואחסנתיה, ע\"כ. ומשום הכי מכונים המצוות רמ\"ח ושס\"ה איברין דמלכא, כדאיתא בזה\"ק."},{"passage_id":"vayikru2_156aa7f5_p2","passage_content":"והנה בשו\"ת נודע ביהודה (חיו\"ד סימן צ\"ג) ערער על אמירת לשם יחוד קודם עשיית מצוה, והביא דברי האומרים שע\"כ צריך לומר לשם יחוד כדי להוציא מפיו שעושה הכוונה ע\"ד הסוד, והביאו ראי' מריש זבחים דבגט צריך שיאמר בפירוש שעושה לשם גירושין וכן בנדר גמר בלבו צריך שיוציא בשפתיו. ודחה דבריהם וז\"ל, ואני אומר ממקום שהביא ראיה משם הוא סתירה דהרי מחלק שם בין אשה לקדשים דאשה סתמא לאו לגירושין עומדת ולכך צריך שיאמר בפה וקדשים להכי סתמא כשרים לפי שסתמא לשמן עומדין וא\"כ מצוות שלנו קדשים נינהו קדשי גבוה וסתמא לשמן עומדין וכו', עכת\"ד עיי\"ש."},{"passage_id":"vayikru2_156aa7f5_p3","passage_content":"והגה\"ק בעל באמ\"ח זלה\"ה בתשובה הנדפסת בסוף ספרו שער התפלה האריך לסתור דברי הנוב\"י, שהרי כל הפוסקים הראשונים והאחרונים הבה\"ג והרי\"ף והרא\"ש והטור והשו\"ע וכו' כולם כאחד פסקו כר' זירא שמצוות צריכות כוונה, והוא שצריך לכוון לצאת בעשיית אותה מצוה כמ\"ש בשו\"ע שם, והוא כמו לשם ששה דברים שהזבח נזבח או כמו לשם ניחוח הנזכר שם וכו', ובמצוות אם לא כיון לבו לזה לא יצא, ומזה נראה בעליל דלא מדמינן מצוות לקדשים בזה ולא אמרינן בהם סתמא לשמן עומדין, והחילוק ביניהם מבואר וכו' כי בקדשים כבר היה בהם הכוונה והדבור לשמן בעת הפרשתן במ\"ש הרי זו עולה או חטאת וכדומה, ולשם זה הביאן עתה למקדש להקריבן, וע\"כ בעת ההקרבה גם כשמקריבין סתם אמרינן מן הסתם לשם זה וכו', ולא כן בעשיית המצוות שאין שמם עליהם מקודם וכו' וע\"כ לא מהני ביה סתמא בשום פנים והוא דומה ממש לגירושין שאשה בסתמא לאו לגירושין עומדת וכו', עיי\"ש באורך באורך בירור דבריו. ונראה לומר כי שניהם צדקו יחדיו ואלו ואלו דא\"ח. דהנה אמנם מסתברא יותר לדמות המצוה לקדשים כפי דברי הזה\"ק הנ\"ל דמצוה היא עצם שם הוי\"ה ב\"ה, אלא דאעפ\"כ צריך לכוון בעשייתה לשמה, דזולת זאת יתכן שאין הוא עושה אותה לשם מצוה כלל, כגון בתוקע יש לומר שהוא תוקע לשיר וכן בכל המצוות, ואם אמנם כוונתו לדבר שאינו מצוה א\"כ אין כאן מצוה כלל, ודמי לאשה דלאו לגירושין עומדת. ולהוציא מחששא זו לכאורה סגי בכוונה שהוא מכוון בעשיית המצוה לשמה, אלא דאפ\"ה צריך לומר בפה לשם יחוד קודם עשיית המצוה, כי חביב ומרוצה לפני הקב\"ה כאשר האדם מקדש המצוה בפה וקורא עליו שמו יתברך, אף דבלא\"ה המצוה מקודשת שהיא עצם שם הוי\"ה ב\"ה, מ\"מ ע\"י שהאדם מוציא בשפתיו שהוא עושה המצוה לשם יחוד קב\"ה, מעלה עליו הקב\"ה כאילו הוא מקדש המצוה. ובד מן דין ישנם עוד פעמים נוספים באמירת לשם יחוד במ\"ש בספה\"ק אור לישרים בדרוש הראשון, וחזינן דאף הגאון בעל נודע מיהודה זלה\"ה שקרא ערער על אמירת לשם יחוד, מ\"מ נתן הסכמה נלהבת על הספר אור לישרים, וכתב עליו שהוא בעצמו שמע מפיו דברים מתוקים ונכנסים בלב השומע להלהיב הלבבות לי\"ש, ומסתברא דבתר דשמע מיניה פעם אמירת לשם יחוד הדר קבליה (ועי' מ\"ש בזה בספרי ויואל משה מאמר ישוב א\"י סימן מ\"ז)."},{"passage_id":"vayikru2_156aa7f5_p4","passage_content":"פירות הנושרים מדברינו כי ע\"י שהאדם מקדש את המצוה מעלה עליו הקב\"ה כאילו נתקדשה המצוה על ידו, אף דבאמת המצוה מקודשת ממילא מאחר שהיא עצם שמו יתברך. וזה יהיה ביאור המדרש אם מקדשים אתם את עצמיכם, פירוש שאתם מקדישים את המצות ומוציאים בשפתותיכם כי אתם עושים מצוה זו לשם יחוד קב\"ה ושכינתיה, וע\"י שהאדם מקדש את המצוה הוא זוכה להמשיך על עצמו שפע קודש הנשפע עליו מקדושת המצוה, וזהו שאמר אתם מקדישים עצמיכם ע\"י שאתם מקדשים את המצוה, אזי מעלה אני עליכם כאילו קדשתם אותי, פירוש כאילו כל קדושת המצוה שעליה שורה שמו יתברך באה על ידיכם, אף שבאמת המצוה מקודשת בלאו הכי, וז\"ש כאילו קדשתם \"אותי\" היינו המצוה שהיא מעצם שמו יתברך. או אינו אלא אם קדשתם אותי הריני מקודש ואם לאו איני מקודש, פירוש דהוה אמינא דאם אין ישראל מקדשים את המצוות אין המצוות קדושים מצד עצמם, ת\"ל כי קדוש אני בקדושתי אני בין מקדשין בין שאין מקדשין, כי קדושת המצוה נשפעת מכח שם הוי\"ה ב\"ה השורה עליה."}]},{"dvar_torah_id":"vayikru2_7cbd4927","title":"קדושת ישראל וקדושת ה'","summary":"בפרשת קדושים מצווה ה' את ישראל להיות קדושים, אך המפרשים תמהים כיצד ייתכן להשוות קדושת בני אדם לקדושתו של מקום. המדרש מבהיר שהקדושה העליונה של ה' נעלית על זו של ישראל, והקשר ביניהם הוא בבחינת נישואין, המצריך שמירה מעוונות.","contents":[{"passage_id":"vayikru2_7cbd4927_p1","passage_content":"וידבר ה' אל משה לאמר דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו כי קדוש אני ה' אלקיכם. הקשו המפרשים ז\"ל וכי מה נתינת טעם הוא זו שנצעוו ישראל להיות קדושים בעבור כי קדוש אני ה' אלקיכם, האם יוכל להתדמות יציר חומר ליוצרו להתקדש כמותו, הלא אנוש אנוש הוא עפר מן האדמה הוא, ואיך יוכל להשיג חומר עכור מדריגת קדושה שיהיה בה דמיון בצד מה אל קדושתו יתברך, אשר תוקף קדושתו לספר כח מי יכיל, וצא ולמד מה דאי' בתיקונים (דף קל\"ה ע\"ב) כתר עלאה אע\"ג דאיהו אור קדמון אור צח ואור מצוחצח איהו אוכם קדם עלת העלות וכו' לית נהורא קיימא קמיה נהוריה דכלהו נהורין אתחשכאן קמיה וכו', עיי\"ש. הלא אתה תחזה מכל זה כי גם בשיעור קומת השכינה הקדושה ישנן מדרגות זו למעלה מזו, וכל אחת מהם אור צח ומצוחצח, ואעפ\"כ הרי הם גבוהים זו מזו וכל אחת נחשך אורה לגבי זו שלמעלה הימנה, וכלם נמשכים כלפי עלת כל העלות דלית נהורא קיימא קמיה. וא\"כ איך שייך להשוות ולדמות דמיון כל שהוא ענין קדושת בני אדם אל דמיון קדושת השי\"ת, הלא כמו זר נחשב הוא. ובמד\"ר איתא קדושים תהיו יכול כמוני ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם, והוא תמוה עד מאד כנ\"ל, מה היתה ההו\"א שקדושת ישראל תשוה לקדושתו של מקום, דאיטעריך קרא לאפוקי ממחשבה זו."},{"passage_id":"vayikru2_7cbd4927_p2","passage_content":"ב) במדרש פליאה (שמו\"ר פל\"ח הביאו ק\"ז זלה\"ה ביש\"מ) אי' אמרו ישראל לפני הקב\"ה רבש\"ע קראתנו קדושים הסר מעלינו את המות הזה, והוא פלאי."},{"passage_id":"vayikru2_7cbd4927_p3","passage_content":"ג) התוספות במסכת מגילה (דף ל\"א ע\"א) כתבו טעם על שקורין ביוהכ\"פ במנחה פרשת עריות, וז\"ל, ובמדרש יש לפי שישראל עושין רמז להקב\"ה שכשם שהזהיר אותם שלא לגלות ערוה כך לא תגלה ערוותה בעוונותם, ע\"כ. וצ\"ב לכאורה מה שייכו זה לזה."},{"passage_id":"vayikru2_7cbd4927_p4","passage_content":"ד) בסיומא דפ' עריות האמורה לעיל בס\"פ אחרי כתיב ושמרתם את משמרתי לבלתי עשות מחקות התועבות וגו' והדר כתיב קדושים תהיו ופירש\"י ז\"ל (והוא מדברי המד\"ר) למה נסמכה פרשת עריות לת' קדושים תהיו ללמדך שכל מקום שאתה מוצא גדר ערוה אתה מוצא קדושה. וצ\"ב מה דנקע בלשונו \"גדר\" ערוה, יותר הול\"ל כ\"מ שאתה מוצא שמירה מעריות כלישנא דקרא ושמרתם וגו'."},{"passage_id":"vayikru2_7cbd4927_p5","passage_content":"והנראה לבאר הענין בהקדם הא דאיתא בילקוט ס\"פ אחרי עה\"פ ושמרתם את משמרתי (והוא מדברי הירושלמי ר\"ה פ\"א ה\"ג) וז\"ל, בנוהג שבעולם מלך בו\"ד גוזר גזירה רצה מקיימה רצו אחרים מקיימים אותה אבל הקב\"ה אינו כן אלא גוזר גזירה ומקיימה תחלה מ\"ט ושמרו את משמרתי אני ה' אני הוא ששימרתי מצוותיה של תורה תחלה, ע\"כ. וכתב ק\"ז זלה\"ה בישמח משה פרשת אחרי דזה תמוה ביותר, דאין שייך ענין זה שהקב\"ה משמר מצוותיה של תורה לפרשת עריות כלל, אלא גבי מצוות שבת ומצות גמילות חסדים, דאינהו שייכי גבי המקום ב\"ה, עיי\"ש מה שכתב בזה."},{"passage_id":"vayikru2_7cbd4927_p6","passage_content":"ולי נראה לפרש כוונת הירושלמי, דהנה דבר זה כתוב בנביאים ומבואר בדברי חכמינו ז\"ל, כי הקשר בין ישראל לאביהם שבשמים הרי הוא כביכול בבחינת קשר הנישואין שבין איש לאשתו, ומקראות רבות יעידון על כך, כגון הא דכתיב קרא לאמר (ישעי' נ\"ד) כי בועליך עושיך ה' צבאות שמו וגו', ונאמר (ישעיה ס\"ב) ומשוש חתן על כלה ישיש עליך אלקיך, ואמר הכתוב (הושע ג') ואמרה (כנס\"י) אלכה ואשובה אל אישי הראשון כי טוב לי אז מעתה. ובגמרא סנהדרין (דף ק\"ה ע\"א) איתא אמר להם נביא לישראל חזרו בתשובה אמרו לו עבד שמכרו רבו ואשה שגירשה בעלה כלום יש לזה על זה כלום אמר לו הקב\"ה לנביא לך אמור להם (ישעיה נ') איה ספר כריתות אמכם אשר שלחתיה או מי מנושי אשר מכרתי אתכם לו וכו', ע\"כ. וכהנה מבואר ענין זה במקומות רבים בדבריהם ז\"ל, וכמו כן נתקנה מגלת שיר השירים על דרך משל בבחינה זו לעורר האהבה והדביקות בין כנסת ישראל לאביהם שבשמים, וכמו שכתב רש\"י ז\"ל בהקדמתו לשה\"ש שראה שלמה ברוה\"ק שעתידין ישראל לגלות גולה אחר גולה וכו',  ולזכור חבה הראשונה אשר היו סגולה לו מכל העמים, לאמר אלכה ואשובה אל אישי הראשון כי טוב לי אז מעתה, ויסד ספר הזה ברוה\"ק בלשון אשה צרורה אלמנות חיות משתוקקת על בעלה, מתרפקת על דודה, מזכרת אהבת נעוריה אליו ומודה על פשעיה, אף דודה צר לו בצרתה, ומזכיר חסדי נעוריה וכשרון פעליה אשר בהם נקשר עמה באהבה עזה, להודיע כי וכו' לא שלוחיה שלוחים, כי עוד היא אשתו והוא אישה, והוא עתיד לשוב אליה, ע\"כ."},{"passage_id":"vayikru2_7cbd4927_p7","passage_content":"ובעל המקנה ז\"ל בפתיחתו למסכת קידושין האריך טובא להוכיח מדברי חז\"ל כי ביזת מצרים היתה כסף הקידושין מאת הקב\"ה לעמו ישראל, והלוחות היו שטר הכתובה, וכפיית ההר כגיגית היתה בבחינת חופה. מכל אלו נשמע כי כנסת ישראל היא כלה קרויה בנעימה, אשר נקשרה אל השי\"ת בעבותות האהבה והדביקות בבחינת נישואין. והנה לצד שהדביקות בין הקב\"ה לישראל הוא בבחינת נישואין, א\"כ נמצא כי בעת אשר ישראל זרויים בגולה, והמה סרים מאחרי ה', לעשות כתועבות הגוים לעבוד אלהי נכר הארץ ולהתדבק בכוחות הטומאה, הרי זה ענין זנות, כמאה\"כ (דברים ל\"א) וקם העם הזה וזנה וגו', אמנם לא יתכן לומר כן אלא באותם אשר פירשו לגמרי מדרך ישראל, ובחרו בתועבות הגוים, ואלו אינם בגדר ישראל כלל, ובידוע שלא עמדו רגלי אבותיהם על הר סיני, והם המה כתות הערב רב המעיקים לישראל בכל דור ודור, ולא כן הדבר בכלל ישראל, אשר אף בעת היותם כבושים בגולה נתונים למשיסה ורוב ענים ומרודם גורם לפעמים להעבירה על דעת קונם, מ\"מ א\"א שיתדבקו בכוחות הטומאה לגמרי, אלא בכל מצב שהם עזה אהבתם אל השי\"ת, והמה דבוקים בו בנפשם ובמאודם, עולם ועד לא תהיה בינינו פרידה."},{"passage_id":"vayikru2_7cbd4927_p8","passage_content":"ועל פי זה מבוארים היטב דברי הילקוט, דיליף מדכתיב בפרשת עריות ושמרו את משמרתי אני ה' אני הוא ששימרתי מצוותיה של תורה תחלה, דשפיר שייך ענין שמירה מעריות כביכול אצלו יתברך בבחינה הנ\"ל, כי לא יטוש ה' את עמו ולא יסיר קדושתו מאתם, ולא יחליפם ולא ימיר אותם באומה אחרת לעולם, כי אם ידביקם ויקשרם אליו בעבותות האהבה בדביקה בחשיקה וחפיצה, וכנסת ישראל מתרפקת על דודה ולבה נכון עמו ונאמנה בבריתו, ולא תעזבנו לזנות אחרי אלהי נכר, ולחבק חיק נכרי'."},{"passage_id":"vayikru2_7cbd4927_p9","passage_content":"ובאופן אחר קצת תתבאר כוונת הילקוט, ודרך שם נפנה לבאר יתר המדרשים והדקדוקים בענין, בהקדם מה שכתב האבן עזרא ז\"ל בפרשת וישלח עה\"פ (פל\"ה ב') ויאמר יעקב אל ביתו ואל כל אשר עמו הסירו את אלהי הנכר אשר בתוככם, וזה לשונו, חלילה חלילה שישכב הנביא עם עובדת אלהי נכר (פירוש ולא יתכן שעד עתה היו ביד בני ביתו אלהי נכר) ופירושו תמצאנו בפרשת וילך, עכ\"ד ז\"ל. וכוונתו אל מה שכתב בפרשת וילך עה\"פ הנך שוכב עם אבותיך וקם העם הזה וזנה אחרי אלהי נכר הארץ וז\"ל, ידענו כי השם אחד והשינוי יבא מהמקבלים והשם לא ישנה מעשיו כי כולם בחכמה ומעבודת ה' לשמור כח הקיבול כפי המקום על כן כתיב את משפט אלקי הארץ על כן אמר יעקב הסירו את אלהי הנכר והפך המקום הדבוק בעריות וכו' והמשכיל יבין, עכ\"ד ז\"ל. מבואר מדבריו כי לפי כח הקיבול של המקום כן בחינת החטא בו, ולפיכך כיון שמעלת ארץ ישראל עליונה ביותר, וכח הקדושה בה גדול עד מאד, ישנם דברים רבים אשר בחוץ לארץ לא היו נחשבים לחטא, ורק בעבור מעלת הארץ וקדושתה יחשבו גם הם לעוונות. וזה טעם אמירת יעקב אל ביתו הסירו את אלהי הנכר, כי לא על עבודה זרה ממש היתה כוונתו, שהרי גם קודם לכן לא היה ונמצא ביד אנשי ביתו של יעקב אבינו ע\"ה שמץ טינופת עבודה זרה, אלא שהיו ברשותם דברים אשר בחוץ לארץ לא היו חשובים עבודה זרה, והותר להם לקיימם, אך מיד בבואם לשערי א\"י והכנסם לשכם גם דברים הללו כע\"ז נחשבו למו, לצד גודל מעלת הארץ הקדושה, כי לפי ערך הקדושה יהיה ערך הפגם גדול וחמור בה יותר. ולזאת אמר להם יעקב הסירו את אלהי הנכר, כי כנכריות נחשבו לגבי מעלת ארץ הקדש. וכיוצא בזה מבואר בדברי הרמב\"ן ז\"ל בס\"פ אחרי עה\"פ ותטמא הארץ ואפקד עוונה עליה ותקיא הארץ את יושביה, כי ארץ ישראל היא נחלת ה' המיוחדת לו לבדו ואין עליה קצין או שוטר משרי מעלה, ולכן גדולה קדושתה ולא תסבול בעלי עבירה, ועונשם חמור הרבה מן העובר עבירה בחו\"ל, עיי\"ש שהאריך הרבה בענין, ובתוך דבריו הביא גם דברי הראב\"ע ז\"ל בפרשת וילך הנ\"ל."},{"passage_id":"vayikru2_7cbd4927_p10","passage_content":"והנה דברי הראב\"ע והרמב\"ן ז\"ל שכתבו כי הפגם והעונש תלוי במעלת המקום, מכוונים אל מה שכתבו משם האריז\"ל לפרש מה שמצינו בדברי חז\"ל שהפליגו בכמה ענינים לחשבם כעוון ע\"ז, כגון הא דאמרו ז\"ל בסוטה (דף ד' ע\"ב) ארשב\"י כל אדם שיש בו גסות הרוח כאילו עובד ע\"ז וכו' כאילו כפר בעיקר כאילו בא על כל העריות, וכיוצא באלו מצינו בכמה מקומות בדברי חז\"ל. ולכאורה הרי לפי ההלכה ודאי דאין הם נחשבים כעובדי ע\"ז וכו', ואין הם נענשים על עבירות אלו בב\"ד כעוע\"ז. וביאר האר\"י ז\"ל כי הכוונה אשר הפגם מגיע לעולמות העליונים, ושם גדול מאד פגם המתגאה כאילו עובד ע\"ז, כי לגודל הקדושה בעולמות העליונים גם עבירה זו אשר בעולם הזה אינה חמורה כ\"כ להיותה נחשבת כעבודה זרה, תחשב שם לע\"ז. ועל פי בחינה זו יתבאר לנו מאמרם ז\"ל בכתובות (דף ק\"י ע\"ב) כל הדר בחו\"ל כאילו עובד עבודת כוכבים וכן בדוד הוא אומר (שמואל א' כ\"ו) כי גרשוני היום מהסתפח בנחלת ה' לאמר לך עבוד אלהים אחרים וכי מי אמר לו לדוד לך עבוד אלהים אחרים אלא לומר לך כל הדר בחו\"ל כאילו עובד ע\"א, ע\"כ. והוא תמוה לכאורה. ועפ\"י האמור נראה דהנה במסכת בבא בתרא (דף צ\"א ע\"א) על הברייתא דאין יוצאין מארץ ישראל לחו\"ל כתב שם הרשב\"ם ז\"ל דטעם הדבר הוא משום שהוא מפקיע עצמו ממצוות התלויות בארץ. ועפי\"ז אפ\"ל טעם דבריהם ז\"ל שאמרו כל הדר בחו\"ל כאילו עובד ע\"ז, דמיירי ביוצא מארץ ישראל לדור לחו\"ל, כדמייתי ראיה מדוד שיצא מארץ ישראל לחו\"ל, וכיון שהוא מפקיע עצמו ממצוות התלויות בארץ נחשב לו עון זה כע\"ז בעולמות עליונים, וכדברי האריז\"ל כי אף עון אשר קל הוא בערך העולם הזה, גדול פגמו מאד בעולמות העליונים."},{"passage_id":"vayikru2_7cbd4927_p11","passage_content":"ובדרך זה יתבאר לנו עוד מאמר תמוה בדבריהם ז\"ל דגרסינן בסנהדרין (דף ק\"ז ע\"א) א\"ר יהודה אמר רב ביקש דוד לעבוד ע\"ז שנאמר (שמואל ב' ט\"ו) ויהי דוד בא עד הראש אשר ישתחוה שם לאלקים ואין ראש אלא ט\"ז וכו' אמר לו לדוד יאמרו מלך שכמותך יעבוד עבודת אלילים אמר לו מלך שכמותי יהרגנו בנו מוטב יעבוד עבודת אלילים ואל יתחלל ש\"ש על ידו וכו', עכ\"ד הגמרא. ומאמר זה כולו פלאי, כי היעלה על הדעת לומר על דוד משיח ה' שביקש לעבוד ע\"ז. גם צ\"ב להבין מה שטען כנגדו חושי הארכי יאמרו מלך שכמותך יעבוד ע\"ז, מה דקדק באמרו \"מלך שכמותך\", וכי רק בעבור שהוא מלך יש לו להמנע מלעבוד לאלהים אחרים, הלא ע\"ז אסורה לכל ישראל, ואיסורה שוה למלך ולהדיוט."},{"passage_id":"vayikru2_7cbd4927_p12","passage_content":"אמנם נראה בהקדם לבאר דברי המד\"ר (ב\"ר פל\"ח ו') ר' אומר גדול השלום שאפילו ישראל עובדים עבודת כוכבים ושלום ביניהם אמר המקום כביכול איני יכול לשלוט בהם כיון ששלום ביניהם שנאמר (הושע ד') חבור עצבים אפרים הנח לו אבל משנחלקו מה הוא אומר (שם) חלק לבם עתה יאשמו הא למדת גדול השלום ושנואה המחלוקת, עכ\"ד המדרש. ודבריו תמוהים עד מאד דמאי מעליותא איכא אם יש שלום בין הרשעים עובדי ע\"ז, והלא במתניתין איפכא תנן (סנהדרין ע\"א ע\"ב) כנוס לרשעים רע להם ורע לעולם, אלמא דאדרבה גריעותא היא ההתחברות בין הרשעים, ומוטב להם ולעולם כולו שיהיו מפוזרים ומפורדים במחלוקת. ונראה לבאר דברי המד\"ר עפ\"י אמרם ז\"ל (סנהדרין צ\"ב ע\"א) וא\"ר יצחק כל המחליף בדבורו כאילו עובד ע\"א כתיב הכא (בראשית כ\"ז) והייתי בעיניו כמתעתע וכתיב התם (חבקוק ג') הבל המה מעשה תעתועים. ונ\"ל דכוונת הגמרא לבחינה שנתבארה לעיל מדברי האריז\"ל כי ישנם עוונות אשר בעולם התחתון אינם חמורים ובעולמות העליונים יחשבו לעוון חמור ביותר כעוע\"ז וכדומה, וע\"כ ישנם מעשים אשר אצל המון העם אינם נחשבים לחטא, מפאת שמעשיהם וכל מחשבותם בעניני העוה\"ז הגשמיים, ובעה\"ז אין נחשב דבר זה לחטא, אך לגבי הקדושים אשר בארץ המה וראשם מגיע השמימה, בהיות מחשבותיהם משוטטות תמיד בעולמות העליונים, ושרעפי לבבם דבוקים בכל עת תמיד ביוצר בראשית, ע\"כ אף דבר קטן לפגם גדול יחשב, כי בעולמות העליונים גבוה מעל גבוה הרי זה נחשב לפגם גדול. ולפיכך אמר יעקב אע\"ה (בראשית כ\"ז) אולי ימושני אבי והייתי בעיניו כמתעתע, דאף שלגבי פשוטי העם אין חמור כ\"כ חטא המחליף בדיבורו להיות נחשב לו כאילו עבד ע\"א, מ\"מ כלפי יצחק אע\"ה שהיה דבוק תמיד בחי העולמים, ומחשבתו היתה משוטטת תמיד בגבהי מרומים, נחשב גם המחליף בדיבורו כעובד ע\"א, וע\"כ חשש יעאע\"ה פן ירגיש יצחק כי שינה בדיבורו, ובעיניו הטהורות של יצחק אע\"ה יהיה חמור פגם זה כעבודה זרה, לגודל מדרגתו."},{"passage_id":"vayikru2_7cbd4927_p13","passage_content":"ועפ\"י דברים אלו מצאנו מנוחה גם בהבנת המד\"ר הנ\"ל גדול השלום וכו' שאפילו ישראל עובדים ע\"ז ושלום ביניהם אמר המקום כביכול איני יכול לשלוע בהם, דהכוונה באמרו ישראל עובדים ע\"ז היינו שהם מחליפים בדבורם למען השלום, והמחליף בדבורו הרי הוא כעובד ע\"ז כדאיתא בסנהדרין, ואפ\"ה אמר המקום איני יכול לשלוט בהם, והטעם כמן ששלום ביניהם, וכל מגמתו במה שהוא מחליף בדיבורו הוא למנוע מחלוקת, וזה מותר להלכה, כדאמרינן בפ' הבא על יבמתו (יבמות ס\"ב ע\"ב) מותר לשנות מפני דרכי שלום. והשתא ניחא שפיר דאין כאן סתירה מדברי המדרש דקא משבח מדת השלום אפילו בין עוע\"ז להא דתנן כינוס לרשעים רע להם ורע לעולם, דהכא לאו ברשיעי עובדי עבודה זרה בפועל עסקינן, אלא במחליף בדבורו שאף הוא נחשב כע\"ז לפי מדת הפגם בעולמות העליונים, ואפ\"ה כיון שהחליף בדבורו למען הרבות שלום לא יחשוב ה' לו עוון."},{"passage_id":"vayikru2_7cbd4927_p14","passage_content":"ומשם בארה להא דאיתא בסנהדרין שביקש דוד לעבוד ע\"ז ואמר לו חושי הארכי יאמרו מלך שכמותך יעבוד ע\"ז, דהנה מבואר בקרא (שמואל ב' ע\"ו) כי בעת שברח דוד מפני אבשלום בנו בא לקראתו חושי הארכי וחפץ ללכת אתו בגולה, וציווה לו דוד להשאר בירושלים ולהעמיד פנים לנוכח אבשלום כאלו הוא אוהב לו ולא מבקש רעתו, וע\"י כן יעלה בידו להפר עצת אחיתופל אשר היה עם אבשלום בקושרים, וכן הוה שהטעה חושי את אבשלום בערמתו, ושינה דיבורו לומר כי קיבל על עצמו מרותו של אבשלום, ובכך עלתה בידו לסכל מזמתו של אחיתופל אשר יעץ לאבשלום לרדוף מיד אחרי דוד ולהכותו נפש (עיין כל הענין באורך שמואל ב' י\"ז). היוצא מזה כי הצלת דוד מחרב אבשלום היתה ע\"י מה שפקד על חושי הארכי לשנות דבורו, ולהעמיד פני אוהב לאבשלום, ואף כי באמת היה לו בזה היתר ברור עפ\"י הלכה לעשות כן, שהרי היה בדבר פיקוח נפש, שהיו צודים את נפשו לקחתה, מ\"מ לגבי מעלת דוד המלך עליו השלום היה חשוב אף פגם קען זה של אמירת שקר כאילו עבד ע\"ז, בעבור שכן נחשב פגם זה בעולמות העליונים. וזאת אשר טען חושי הארכי כלפי מה שצוהו דוד להחליף בדבורו, יאמרו \"מלך שכמותך\" יעבוד ע\"ז, כלומר דאף שלגבי העם היתר גמור יש בדבר לשנות בדבורו במקום פיקוח נפש, מ\"מ לגבי קדושת מעלתך רוח אפינו משיח ה' יחשב הדבר כע\"ז, וכיון שאני עושה כן בפקודתך יחשב אף לך לחטא. והשיב לו דוד מלך שכמותי יהרגנו בנו, וכפירש\"י ז\"ל שיהיו מתרעמין על מדותיו של הקב\"ה ויאמרו מלך חסיד שכמותו יהרגנו בנו, מוטב אעבוד ע\"ז כלומר שיגרום לחושי לשנות דבורו, כדי לסכל עצת אחיתופל, ואל יתחלל שם שמים בפרהסיא."},{"passage_id":"vayikru2_7cbd4927_p15","passage_content":"ובדרך זו נלך לבאר דברי הירושלמי, בשנקדים הא דאיתא בשבת (נ\"ה ע\"ב) א\"ר שמואל בר נחמני אר\"י כל האומר בני עלי חטאו אינו אלא עועה שנאמר (שמואל א' א') ושם שני בני עלי חפני ופנחס כהנים לה' וכו',  אלא מה אני מקיים אשר ישכבון את הנשים (שמואל א' ב') מתוך ששהו את קיניהם שלא הלכו אצל בעליהן מעלה עליהם הכתוב כאילו שכבום. וזה מפורש באר היטב עפ\"י הבחינה שכתבו משם האריז\"ל, כי אף שלא היה בידם כי אם פגם זה בלבד ששהו מלהקריב קרבנותיהן של היולדות, מ\"מ לצד מעלתם הנשגבה נחשב להם פגם זה כג\"ע, משום שבעולמות העליונים נחשב אף פגם דק וקלוש לחטא חמור מאד. וזהו גם ביאור מאמרם ז\"ל (שם) א\"ר שמואל בר נחמני א\"ר יונתן כל האומר ראובן חטא אינו אלא טועה שנאמר (בראשית ל\"ה) ויהיו בני יעקב שנים עשר וכו' אלא מה אני מקיים וישכב את בלהה פלגש אביו עלבון אמו תבע אמר וכו' שפחת אחות אמי תהא צרה לאמי וכו' שתי מצעות בלבל אחת של אביו ואחת של שכינה, ע\"כ. והכוונה לפי שבלבל דעתו של יעאע\"ה שהיתה נפשו דבוקה בקונו בכל עת תמיד, לזאת נחשב לו פגם זה כגילוי עריות לגבי קדושת העולמות העליונים."},{"passage_id":"vayikru2_7cbd4927_p16","passage_content":"והנה בזמן שישראל כבושים בגולה זרויים בין מכעיסיהם, לחוצים מכל צרות ממחרפיהה ומלוחציהם, אזי גדול מאד בלבול המוחות וטירוף הדיעות, וזה מונע ומעכב את הקירבה בין כנסת ישראל לקב\"ה, ולצד שהקשר אמיץ בין ישראל לאביהם שבשמים בבחינת נישואין, על כן הגורם לאריכות הגלות ע\"י שמרבה חבילות חבילות עבירות הרי זה נחשב לו כג\"ע, כי דין גרמא להאריך הפירוד בין כנסת ישראל לאביהם שבשמים. וזהו ענין אמרם בירושלמי לבאר מאה\"כ בפרשתא דעריות שהקב\"ה שומר משמרתה של תורה, פירוש כי לא יאריך הקב\"ה זמן הגלות אף ברגע אחת יותר מן הראוי, וכאשר מצינו בגאולת מצרים שאחרי אשר הכה ה' כל בכור קמו פרעה ועבדיו באישון לילה ואפילה ורצו למהר לשלחם מיד לאלתר, ובני ישראל לא הלכו משום שנצטוו מן הקב\"ה ואתם לא תצאו איש מפתח ביתו עד בקר, ואילו היו מקדימין לצאת היה בכך משום דחיקת הקץ, דאכתי לא מטא זימניה, אמנם בהגיע העת אשר הועיד הקב\"ה לצאת ישראל ממצרים לא יכלו להתמהמה אף רגע נוסף, כי גורשו ממצרים וגם צידה לא עשו להם, והפעם דכיון שכבר הגיע זמן גאולתן לא רצה הקב\"ה שיתעכבו יותר אפילו רגע, וכמו כן בהגיע עת דודים זמן סוף וקץ גלותינו ותחלה וראש לגאולתינו הנצחית, אזי קול דודי הנה זה מדלג על ההרים ולא יתמהמה אף רגע, ואז יתקטרון ישראל בחד קטירא לחי עלמא, והוא ידביקנו אליו כאזור, ויהי הקשר אמיץ בינותינו, עולם ועד לא תהיה בינינו ובינו יתברך פרידה. והשתא שפיר שייך ענין שמירת פרשת עריות גבי השי\"ת בבחינה זו, שלא ישהה ולא יאחר אפילו רגע זמן הגלות ופירוד הדביקות בינו לבין ישראל."},{"passage_id":"vayikru2_7cbd4927_p17","passage_content":"מעתה מבוארים גם דברי התוספות במס' מגילה (קושיא ג') בשם המדרש שע\"כ קורין פרשת עריות ביהכ\"פ לעת מנחת ערב לרמוז שכשם שהזהיר אותם שלא לגלות ערוה כך לא תגלה ערוותם בעוונותם. כלומר כשם שאנו נשמרים מגילוי עריות, כך יעשה הקב\"ה לשמור משמרתה של תורה בבחינות דשייכו גביה שלא תגלה ערוותן בעוונותם, פירוש שלא יאריך הקב\"ה זמן הגלות יותר מן הקץ הנגזר בעבור עוונותיהם של ישראל, דזה נחשב כביכול אצלו בחי' עריות, אם יתארך הפירוד בין הדבקים קב\"ה וכנסת ישראל. ואף כי בטוחים אנחנו שלא יאחר הקב\"ה לגאול את ישראל אפילו רגע, וכמבואר במדרש (שהש\"ר פ\"ב י\"ט) עה\"פ קול דודי וגו' וזה לשונו, קול דודי הנה זה בא מלך המשיח בשעה שהוא אומר לישראל בחדש הזה אתם נגאלים אומרים לו היאך אנו נגאלים ולא כבר נשבע הקב\"ה שהוא משעבדנו בע' אומות והוא משיב להם וכו' א' מכם גולה לברברי' וכו' ואחד לסמטריא דומה כמו שגליתם כולכם וכו'. הרי כי כל כך ימהר ויחיש הקב\"ה את הגאולה בהגיע עת קץ, עד שלא יאמינו ישראל ויהיו תמהין ושיילין ליה היאך אנו נגאלין, ואעפ\"י כן אנו מזכירין זכות זו ביום הכפורים, שלא תגלה ערות ישראל בעוונותם כדי לעורר רחמי שמים, וע\"י כן מקרבין את הזמן."},{"passage_id":"vayikru2_7cbd4927_p18","passage_content":"ועפ\"י האמור אפ\"ל כוונת הכתוב ושמרתם את משמרתי, כלומר שהזהיר הכתוב את ישראל דלא סגי להו בשמירה מגילוי עריות ממש, אלא עליהם להיות נשמרים גם מכל העוונות שיש בהם איזה צד ובחינה של ג\"ע בעולמות העליונים, וכגון הא שאמרו ז\"ל כל מי שיש בו גסות הרוח כאילו בא על כל העריות וכיוצא בזה. וז\"ש ושמרתם את משמרתי, פירוש שיהיו ישראל נשמרים מעריות כמשמרת הקב\"ה, כשם שהקב\"ה משמר משמרתה של תורה בכל בחינה של ג\"ע כנ\"ל, כן יהיו ישראל נשמרים מכל אופן ובחינה של פגם זה."},{"passage_id":"vayikru2_7cbd4927_p19","passage_content":"ובזה מבוארים גם דברי רש\"י ז\"ל (קושיא ד') למה נסמכה פ' עריות לפרשת קדושים ללמדך שכל מקום שאתה מוצא גדר ערוה אתה מוצא קדושה, נקט \"גדר\" ערוה דייקא, להורות על כוונה זו, דבסוף פרשה הקודמת כתיב ושמרתם את משמרתי, והכוונה כמו שנתבאר שלא זו בלבד שישראל מוזהרים להיותם פרושים מעריות ממש, אלא שיהיו מובדלים גם מן העוונות העושים רושם בעולמות העליונים כפגם גילוי עריות, וזה שדקדק רש\"י ז\"ל בלשונו הזהב כ\"מ שאתה מוצא \"גדר\" ערוה, דהייט שנשמרים אפילו מן הדברים שהם בגדר גילוי עריות, באיזה צד ובחינה שהיא, שם אתה מוצא קדושה, כי אף שגם באדם הנשמר אך ורק מגילוי עריות ממש המצא תמצא בו בחי' קדושה, מ\"מ כמה מעלות והדרגות ישנם בקדושה זו למעלה מזו וכארז\"ל (מסכת כלים פ\"א ו') עשר קדושות הן זו למעלה מזו וכו'. וכמו כן ישנם הדרגות רבות בקדושה עליונה גבוה מעל גבוה עד אין חקר, ובמקום שיש שמירה אף מגדר ערוה דהיינו מן הדברים שהם פוגמים למעלה כעריות, שם אתה מוצא קדושה, היינו מדריגה גבוהה של קדושה. וזהו שנתן הכתוב טעם לצווי קדושים תהיו באומרו כי קדוש אני ה', כלומר על כן אנכי מצוה אתכם להשמר אף מגדר ערוה, והם הדברים שבעה\"ז אינם נחשבים לערוה אלא בערך העולמות העליונים כאיסורי עריות נחשבו, ולפיכך הנשמר מכל אלה זוכה להשיג מעלת קדושה עליונה, ויהיב טעמא כי קדוש אני, פירוש כביכול אף הקב\"ה שומר משמרתה של תורה בבחינה זו, ולפיכך עליכם הדבר מוטל לשמור משמרת, ולהזהר מלגלות ערוה בכל בחינה ואופן."},{"passage_id":"vayikru2_7cbd4927_p20","passage_content":"ועתה נבא לביאור המדרש קדושים תהיו יכול כמוני ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם, בהקדם לבאר הפליאה (שמו\"ר פל\"ח ב') אמרו ישראל רבש\"ע קראתנו קדושים הסר מעלינו את המות הזה. ויתבאר בפשטות דאיתא בגמרא (סנהדרין צ\"ב ע\"א) צדיקים שעתיד הקב\"ה להחיותן אינם חוזרים לעפרן שנאמר (ישעיה ד') והיה הנשאר בציון והנותר בירושלים קדוש יאמר לו מה קדוש לעולם קיים כך הם לעולם קיימים, ע\"כ. מבואר מזה שאין שייך לכנות שם קדוש אלא על דבר המתקיים לעולם ואף שגם בעה\"ז כנויים ישראל קדושים מ\"מ אין זה אלא שם מושאל להם ואין זו עדיין מבחינת הקדושה העליונה עדיין דהרבה מדריגות אינון בבחינת הקדושה. והוא ע\"ד מה שכתב הרב בעל התניא בריש ספרו (פ\"א) דפעמים יתכנה שם צדיק בלשון מושאל לפי הענין ובאמת אינו במדריגת צדיק עדיין כי קשה מאד להשיג מדריגת צדיק. וכמו כן הוא הענין במה שישראל קרויים עתה קדושים הוא לשון מושאל, כי אין לנו רק בחינת מה מן הקדושה, אבל הקדושה בשלימות היא עדיין מאתנו והלאה, בעבור שהקדושה האמיתית היא המתקיימת לעד לעולם, אכל הקדושה שביכולתו של אנוש להשיג עתה אינו כעוח שתתקיים וכאמרם ז\"ל (אבות פ\"ב מ\"ד) אל תאמין בעצמך עד יום מותך ויוחנן כהן גדול יוכיח ששימש פ' שנה בכהונה גדולה ולכסוף נעשה צדוקי (ברכות כ\"ע ע\"א). כי כך דרכו של יצה\"ר שעד זיבולא בתרייתא אורב הוא לנפשו של אדם לצודו ברשתו ולהפרידו מן הקדושה, ולפיכך לא תהיה הקדושה בשלימותה מושגת אלינו כי אם לעתיד, וכאמרם ז\"ל בבבא בתרא (דף ע\"ה ע\"ב) א\"ר אלעזר עתידין צדיקים שיאמרו לפניהם קדוש כדרך שאומר לפני הקב\"ה שנאמר והיה הנשאר בציון והנותר בירושלים קדוש יאמר לו, ע\"כ. וזהו ביאור המדרש אמרו ישראל לפני הקב\"ה קראתנו קדושים הסר מעלינו את המות הזה, כי רק בעת שיבולע המות לנצח ויהיה התיקון השלם נוכל להשיג בחינת קדושה עליונה זו, להיות קדושים בעצם, ולא ע\"ד לשון מושאל בלבד."},{"passage_id":"vayikru2_7cbd4927_p21","passage_content":"וע\"ד זה יתכאר המדרש (קושיא א') קדושים תהיו יכול כמוני, פירוש דהו\"א שיוכל האדם להגיע מעצמו למדריגת קדושה עילאה, כשם שהקב\"ה עתיד לקדש לעת\"ל את ישראל, וז\"ש יכול כמוני, כלומר שתוכל להתקדש מעצמך בבחי' הקדושה כמוני באותה מדריגה שאנכי עתיד לקדש אותכם, ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם, קדושתי היינו מדריגת הקדושה שאני עתיד לקדש את ישראל לעת\"ל היא למעלה מן הקדושה שאתם מקדשים עצמיכם בעה\"ז, כי לא יוכל האדם להשיג בעה\"ז בחינת קדושה עליונה זו כמבואר. ואעפ\"י כן גם בעבור מה שהאדם זוכה להתקדש מעצמו בעוה\"ז הריהו מכונה בשם קדוש, ועמלו ויגיעתו לעלות במעלות הקדושה חשובה ומרוצה מאד לפני הקב\"ה. הבוכ\"ע יעזור שנזכה לעבדו במחשבה בדבור ובמעשה, ולטהר רעיונותינו ומחשבות לבנו לעבודתו ית'. והבכ\"ע יאציל מאורו העליון על עמו ישראל, ויקרב אותם לעבודתו, ונזכה להיות מאותם אשר עליהם נאמר והיה הנשאר בציון והנותר בירושלים קדוש יאמר לו, בישועת כל ישראל ובהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru2_6728d736","title":"קדושת ישראל לעתיד לבוא","summary":"ה'קדושים תהיו' הוא הבטחה לעתיד, שבו ישראל יקראו קדושים. המדרש מדגיש כי קדושת ישראל אינה שווה לקדושת הבורא, והקב\"ה נשאר קדוש לעולם ועד, אף כשישראל יזכו לשם זה בעתיד.","contents":[{"passage_id":"vayikru2_6728d736_p1","passage_content":"קדושים תהיו וגו' האוה\"ח הק' דקדק במאה\"כ קדושים תהיו לשון עתיד, שהיה ראוי שיאמר היו קדושים."},{"passage_id":"vayikru2_6728d736_p2","passage_content":"ב) במד\"ד (פכ\"ד ע') קדושים תהיו יכול כמוני ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם. והמדרש הזה תמוה מאד היאך יעלה על הדעת שיוכל להתדמות יציר חומר אל הקב\"ה להתקדש כמוהו עד שהוצרך למעטו. ומצינו שתיקנו חז\"ל במטבע ברכה ברוך שחלק מכבודו לבו\"ד, ושחלק מחכמתו ליראיו, אך לא יעלה על הדעת לדמות ולומר כי יש בזה אחה ערך והשואה לכבוד הבורא יתברך ולחכמתו."},{"passage_id":"vayikru2_6728d736_p3","passage_content":"ונראה בהקדם הא דאיתא במדרש תנחומא פ' זו (סימן ה') וכ\"ה בילקוט וז\"ל, אמר להם הקב\"ה לישראל אני אינני כבשר ודם מלך בשר ודם אין רשות להדיוט להקרות בשמו וכו' אבל ישראל נקראו בשמו של הקב\"ה, כל שם חביב שהיה להקב\"ה בהם קרא את ישראל, קרא שמו אלקים וקרא לישראל אלהים שנאמר (תהלים פ\"ב) אני אמרתי אלהים אתם וגו', נקרא חכם, וכו' קרא לישראל חכם וכו',  נקרא קדוש שנאמר קדוש קדוש קדוש ה' צבאות וגו' (ישעי' ו'), וקרא לישראל קדושים שנאמר קדושים תהיו, אמר הקב\"ה בעוה\"ז קדושים נקראתם לעתיד והיה הנשאר בציון והנותר בירושלים קדוש יאמר לו (ישעי' ד'), ע\"כ. ונקדים עוד מה שכתב בספה\"ק אוהב ישראל פ' וישב עה\"פ הלא אחיך רועים בשכם, לפרש נוסח התפלה לדור ודור נגיד גדלך ולנצח נצחים קדושתך נקדיש ושבחך אלקינו מפינו לא ימוש לעולם ועד, עפ\"י מה דאיתא בגמרא (בבא בתרא ע\"ה ע\"ב) א\"ר אליעזר עתידין צדיקים שיאמרו לפניהם קדוש כדרך שאומר לפני הקב\"ה שנאמר (ישעי' ד') והיה הנשאר בציון והנותר בירושלים קדוש יאמר לו. ופריך היאך יהיה נקרא הקב\"ה לעת\"ל ומשני שהקב\"ה יקרא קדוש לעולם ועד (הגם שלא נמצא קושיא ותירוץ זה בגמ' מסתמא עיניו ראו כן באיזה מדרש או גירסא כזו היתה לו). וז\"פ לדור ודור נגיד גדלך והיינו בזמן הזה, ולנצח נצחים דהיינו לעתיד, קדושתך נקדיש היינו במה שאתה נקרא בזמן הזה, לעתיד נהיה אנחנו נקראים באותו השם, ושלא תקשה דא\"כ באיזה שם יהא נקרא הקב\"ה, לכן אומרים ושבחך אלקינו מפינו לא ימוש לעולם ועד, כלומר שאז נשבח להקב\"ה בשם קדוש לעולם ועד, עכ\"ד ז\"ל."},{"passage_id":"vayikru2_6728d736_p4","passage_content":"היוצא מזה כי ישראל יהיו קרויים קדושים רק לעת\"ל, ומה דאיתא במד\"ר הנ\"ל כי ישראל קרויים קדושים הוא רק שם מושאל ע\"ש העתיד, אבל באמת שמם אשר יקראו להם קדוש הוא לעתיד לבא. ובזה אפ\"ל מה שאמה\"כ קדושים תהיו, שהוא הבטחה על לעתיד שיקראו ישראל בשם קדושים. ומשם בארה להבין דברי המד\"ר הנ\"ל קדושים תהיו יכול כמוני, והיינו כקושיא הנ\"ל שהביא בספר אוהב ישראל דהו\"א שגם הקב\"ה יהא נקרא בשם קדוש לעת\"ל, וא\"כ יהיה שמם של ישראל כשם המקום ב\"ה, ת\"ל כי קדוש אני והכוונה לסיום הפסוק דכתיב כי קדוש אני ה' אלקיכם, שהרי שם הוי\"ה מורה על כך שהשי\"ת הוא היה הוה ויהיה, מהוה כל ההויות, ועבר עתיד והוה הם אצלו כאחת, נמצא כי במאה\"כ כי קדוש אני ה' נרמזת בחינה זו שהקב\"ה יהיה נקרא קדוש לעולם ועד. וזה שסיים המדרש קדושתי למעלה מקדושתכם, דאף לעתיד שיקראו ישראל בשם קדוש לא יהיה שמם כשמו של הקב\"ה, דכתיב כי קדוש אני \"ה\"' וזה מורה על כך ששמו של הקב\"ה יהיה קדוש לעולם ועד."}]},{"dvar_torah_id":"vayikru2_086fc982","title":"","summary":"","contents":[{"passage_id":"vayikru2_086fc982_p1","passage_content":"עוד יאמר בדברי המד\"ר הנ\"ל עפ\"י מ\"ש ק\"ז זלה\"ה בישמח משה (ס\"פ אחרי) על הא דאיתא בירושלמי (מס' ר\"ה פ\"א ה\"ג) א\"ר לעזר וכו' בנוהג שבעולם מלך בשר ודם גוזר גזרה רצה מקיימה רצו אחרים מקיימין אותה אבל הקב\"ה אינו כן אלא גוזר גזירה ומקיימה תחלה מ\"ט ושמרתם את משמרתי אני ה' (ויקרא י\"ט) אני הוא ששימרתי מצוותיה של תורה תחלה (עיין בילקוט ס\"פ אחרי). והקשה בישמח משה דאין זה ענין כלל לפ' עריות, דאין זה שייך גבי הקב\"ה כלל, רק למצות שבת ומצוות גמ\"ח וכדומה. ותירץ היש\"מ ז\"ל שהקב\"ה שומר את ישראל שלא יפלו בחרבו של עשיו, בזכות מה שישראל משמרים אות ברית קדש, דמצות מילה מבטלת כוחו של עשו. וידוע שהפוגם בעריות נפגם אות ברית קודש ונמשכת ערלתו, והיינו ושמרתם את משמרתי מה שאני שומר, דהיינו כשם שהקב\"ה שומר את ישראל בזכות אות ברית קדש כן ישמרו ישראל מעריות שלא יפגמו אות ברית קודש, שאם יפגמו ח\"ו לא ישמור אותם הקב\"ה, את\"ד עיי\"ש באורך. אבל אכתי קשה שאין פשטות הירושלמי משמע כן, ופירשנו בדברינו לעיל ס\"פ אחרי עפ\"י דברי התוספות (מגלה ל\"א ע\"א ד\"ה במנחה) שכתבו על מה שקורין ביוהכ\"פ במנחה פ' בעריות, דאיתא במדרש שישראל עושים רמז להקב\"ה שכשם שהזהיר אותם שלא לגלות ערוה כך לא תגלה ערותם בעוונותם, עכ\"ד. הרי דשייך כביכול גבי הקב\"ה ענין זה של שמירה מעריות, שהוא מכסה על עוונות ישראל ואינו מגלם. ובזה אפ\"ל דברי הירושלמי שדרש הא דהקב\"ה שומר משמרתה של תורה בפ' עריות. והנה מצינו שפעמים הקב\"ה מגלה את החוטאים, וכגון הא דאיתא (אבות פ\"ד ד') כל המחלל שם שמים בסתר נפרעין ממנו בגלוי. ולפי זה נבא לביאור המדרש הנ\"ל קדושים תהיו וכמו שפירש\"י ז\"ל דקאי על פרישה מעריות, ועל כך אמר יכול כמוני כלומר דכשם שהקב\"ה מגלה לפעמים עוונות הרשעים וזה הוא ג\"כ בחינה מג\"ע כמ\"ש התוס' הנ\"ל, כן הותר גם לישראל ח\"ו איזה פעם איסור ג\"ע, ת\"ל כי קדוש אני ה' א' קדושתי למעלה מקדושתכם, ואין שייך להדמות אליו יתברך בזה כלל."}]},{"dvar_torah_id":"vayikru2_b4aa8e68","title":"קדושה ומעלתה בעבודת ה'","summary":"בפרשת קדושים תהיו מתבארת מעלת הקדושה הנובעת מקיום מצוות ופרישות מעבירה. המדרש ותורת כהנים חלוקים בהבנת הקדושה, אך שניהם מסכימים שהקדושה ניתנת מהשמים בעמל האדם, והקב\"ה מעלה את ישראל כאילו השיגו בכוחות עצמם.","contents":[{"passage_id":"vayikru2_b4aa8e68_p1","passage_content":"באופן אחר יתבאר המד\"ר קדושים תהיו יכול כמוני ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם."},{"passage_id":"vayikru2_b4aa8e68_p2","passage_content":"ב) בתורת כהנים (ר\"פ זו) איתא קדושים תהיו כי קדוש אני אם מקדישים אתם את עצמכם מעלה אני עליכם כאילו קדשתם אותי או אינו אומר אלא אם קדשתם אותי הריני מקודש ואם לאו איני מקודש ת\"ל כי קדוש אני בקדושתי אני בין מקדשין בין שאינן מקדשין, וצ\"ב."},{"passage_id":"vayikru2_b4aa8e68_p3","passage_content":"ונראה דהנה רש\"י ז\"ל כתב קדושים תהיו הוו פרושים מן העריות ומן העבירה, שכל מקום שאתה מוצא גדר ערוה שם אתה מוצא קדושה. והרמב\"ן ז\"ל נחלק עליו משום דבתורת כהנים איתא בסתמא פרושים תהיו, ולפי דעתו אין הפרישות הזו לפרוש מן העריות כדברי רש\"י ז\"ל, אלא היא הפרישות המוזכרת בכ\"מ בתלמוד שבעליה קרויים פרושים וכו', עיי\"ש בדבריו הקדושים בארוכה. ולכאורה קשה שהרי דברי רש\"י ז\"ל נובעים מן המד\"ר פרשה זו, והכי אי' התם אר\"י בן פזי מפני מה נסמכה פרשת עריות לפרשת קדושים אלא ללמדך שכל מקום שאתה מוצא גדר ערוה אתה מוצא קדושה, הרי להדיא דהמדרש ס\"ל דמצות קדושים תהיו היא אזהרה להיות גדורים מעריות, ולפי מה שהוכיח הרמב\"ן ז\"ל מן התורת כהנים דאין הפרישות הזו לפרוש מן העריות א\"כ נמצא דהמד\"ר והת\"כ פליגי בביאור מצות קדושים תהיו, דהמד\"ר מפרש לה על פרישה מעריות וכמ\"ש רש\"י ז\"ל, והת\"כ ס\"ל דהיא אזהרה לפרוש מן המותרות."},{"passage_id":"vayikru2_b4aa8e68_p4","passage_content":"ובאמת אין צורך לומר דפליגי דשפיר שייך לפרש מאה\"כ קדושים תהיו כפירושו של רש\"י ז\"ל עפ\"י המדרש וכפירושו של הרמב\"ן ז\"ל עפ\"י התו\"כ גם יחד. דהנה ענק קדושה מצינו בדברי חז\"ל לא באזהרת פרישה מעבירה בלבד, אלא אף גם בקיום מצות עשה, וכאשר תיקנו לנו חכמינו ז\"ל במטבע ברכות המצוות אשר קדשנו במצוותיו וציונו, וכן בנוסח התפלה קדשנו במצוותיך, כי קיום המצוות מביא קדושה לעושיהן. וכמו כן כאשר האדם זוכה לפרוש מן המותרות הריהו משרה עליו רוח קדושה וטהרה, וכאמרם ז\"ל קדש עצמך במותר לך, וכמו שהאריך בזה הרמב\"ן ז\"ל. והשתא א\"ש דלא פליגי המדרש והת\"כ אהדדי אלא מר אמר חדא ומר אמר חדא, שהרי כל הענינים המביאים את האדם לידי קדושה הן הפרישה מן העריות הן הפרישה מן המותרות וכן קיום המצוות כולהו איתנייהו בכלל מצות קדושים תהיו."},{"passage_id":"vayikru2_b4aa8e68_p5","passage_content":"אכן לפי שכ\"כ רבים ענפי מצות קדושים תהיו קשה מאוד על האדם לזכות להשיג קיום מצוה זו לכל פרטיה, לרבוי עניניה וקושי השגתם בשלימות הראויה, ואף שכך קשה להשיגה חייב האדם להתייגע ולעשות כל מה שבכוחו להגיע לידי מדריגה זו, ואף אם נבצר ממנו לפי כוחותיו הדלים, מ\"מ אם יעשה הוא כל מה שביכלתו מן השמים יסייעו בידו להגיע אל הקדושה בבחינת מציאה ומתנה יותר מכפי יגיעתו. וכאשר פירש ק\"ז זלה\"ה בתפלה למשה עה\"פ (תהלים י\"ח) כי שמרתי דרכי ה' ולא רשעתי מאלקי, כי עיקר ההתגברות נגד היצה\"ר היא בעזר ה' כאמרם ז\"ל (סוכה נ\"ב ע\"א) אלמלא הקב\"ה עוזרו אין יכול לו, וז\"פ כי שמרתי דרכי ה' ולא רשעתי פירוש דכל מה ששמרתי דרכי ה' ולא רשעתי הוא \"מאלקי\", בעזר השי\"ת, דאילולא כן אין יכול לו. וכיו\"ב כתב בסה\"ק אמרות טהורות בהך קרא, יגמלני ה' כצדקי דאף שהקב\"ה עוזר ומסייע לצדיק עכ\"ז יגמלני ה' כאילו היה זה צדקי, וכבור ידי ישיב לי כאילו היה המעשה הטוב בור ידי בלבד ללא סיוע ממעל, אף כי מה ששמרתי דרכי ה' ולא רשעתי היתה לי מאלקי, כי הקב\"ה עזרני, עכ\"ז ידעתי שיגמלני כאילו היה זה צדקי וכו',  עיי\"ש."},{"passage_id":"vayikru2_b4aa8e68_p6","passage_content":"עוד זאת נקדים מה שפירש ק\"ז זלה\"ה בתפלה למשה (פ' קי\"ט) מאמרם ז\"ל (מגלה ו' ע\"ב) יגעתי ומצאתי תאמין דלכאורה ב' דברים אלו סותרים זה את זה דאם יגע אין זה מציאה, דמציאה באה בהיסח הדעת ללא יגיעה, וביאר כי אם האדם מייגע עצמו בעסק התורה בעיון רב, אם כי לפעמים יעלה חרס בידו, שוב אחרי זה ישכיל ויבין המצאה נפלאה והיא מתת אלקים בקרבו, וז\"ש יגעתי ואח\"כ מצאתי בהיסח הדעת תאמין, עכ\"ד ז\"ל. ולי נראה לבאר מאמר זה בדרך פשוט, עפ\"י מה דאיתא במד\"ר פ' יתרו (פ' כ\"א א') עלית למרום שבית שבי (תהלים ס\"ח) יכול מפני ששבה אותה נעלה חנם ת\"ל לקחת בלקיחה נתנה לו יכול יהא חייב ליתן דמים ת\"ל מתנות במתנה נתנה לו, ופירש היפה תואר, יכול בחנם, שניתנה לו התורה חנם ללא יגיעה, ת\"ל לקחת, שזכה בה ביגיעה גדולה מ' יום לא אכל לא שתה ולא ישן, יכול יהא חייב ליתן דמים, פירוש שלא ישיג בתורה אלא כפי ערך יגיעתו שזהו בחי' דמים הניתנים לפי ערך החפץ ושויותו, וא\"כ איך יוכל ללמוד כל דבר ביגיעתו, אחרי אשר היא ארוכה מארץ מדה ורחבה מני ים, ת\"ל מתנות, שאחר שיגע בה בכל כוחו ניתנה לו במתנה, עכ\"ד היפ\"ת ז\"ל. ובדרך זה אף אנו נאמר לפרש מאמרם ז\"ל יגעתי ומצאתי תאמין, פירוש כאשר האדם מייגע עצמו בלימוד התורה עד מקום שידו מגעת, הקב\"ה מזכהו להבין ולהשכיל בה יותר ממה שהיה בכוחו להשיג על פי עמלו ויגיעתו, דמשמיא קא זכו ליה השטת נפלאות בתה\"ק, כי מתנה היא לו חלף עבודתו ויגיעתו בתה\"ק. וזהו שאמרו יגעתי ומצאתי, דאף בשעת היגיעה חכה לתוספת הארה והשגה בתה\"ק בבחינת מציאה, דהיינו יותר מכפי עמלו וטרחתו בה (ועיין בדברינו לעיל פרשת תרומה רכ\"ג ב')."},{"passage_id":"vayikru2_b4aa8e68_p7","passage_content":"ועפ\"י כל האמור נבא לביאור המדרש עה\"פ קדושים תהיו יכול כמוני, פירוש דלפי שרבו סעיפיה וענפיה של מצוה זו, וקשה מאד שיוכל האדם בכוחותיו לקיים מצוה זו בכל תנאיה, והוה אמינא כי ישראל זוכים להשיג בבחינת הקדושה כפי מעשיהם בלבד, דלפי ערך מה שיזכו לפרוש מן המותרות ולגדור עצמם מן העריות ולהתקדש בקיום המצוות תהיה השפעת הקדושה אשר תושפע עליהם מן השמים, ותו לא. וזהו שאמר יכול כמוני, דהו\"א שהעבודה הנדרשת מכם להשגת הקדושה היא כמדת הקדושה שאשפיע אני לכם, ולא תזכו להשפעת קדושה מן השמים יתר מן המגיע לכם על פי פעלכם, ת\"ל כי קדוש אני ה' אלקיכם קדושתי למעלה מקדושתכם, פירוש הקדושה שהקב\"ה משפיע לעמו ישראל ע\"י מעשיהם והנהגתם, היא למעלה מן הקדושה שהם זכאים לה לפי ערך מעשיהם, כי כל כמה שיטרח האדם ויתייגע בתורה ובמצוות לא יוכל להשיג אותו שפע קדושה הנשפע עליו מלמעלה, אלא שעל האדם לעשות כל מה שביכולתו ואז יזכה להשפעת קדושה מן השמים יתר מכדי יגיעתו, בבחי' מציאה ומתנהג וכמו שנתבאר במאה\"כ לקחת מתנות, שע\"י העמל והיגיעה בתורה הוא זוכה לקבל את התורה בחי' מתנה."},{"passage_id":"vayikru2_b4aa8e68_p8","passage_content":"ובדרך זו יתבארו גם דברי הת\"כ (קושיא ב') אם מקדישים אתם עצמכם מעלה אני עליכם כאילו קידשתם אותי וכו'. דהנה ע\"י שהאדם מקדש את עצמו בשמירת התורה והמצוות הרי מתקדש שם שמים בעולם, ומה גם אם הוא עוסק בתורה ובמצוות בפרהסיא בתוך קהל ועדה, שממנו ילמדו לעשות כמעשהו, גדול הוא כבוד שמים הנצמח מכך. וע\"ד שפירש\"י ז\"ל בפרשת חיי עה\"פ ה' אלקי השמים אשר לקחני מבית אבי, ולא אמר אלקי הארץ ולמעלה אמר ואשביעך בה' אלקי השמים ואלקי הארץ אמר לו עכשיו הוא אלקי השמים ואלקי הארץ שהרגלתיו בפי הבריות אבל כשלקחני מבית אבי היה אלקי השמים ולא אלקי הארץ שלא היו באי עולם מכירים בו ושמו לא היה רגיל בארץ, ע\"כ."},{"passage_id":"vayikru2_b4aa8e68_p9","passage_content":"אמנם מה רפה הוא כוחו של אדם לעומת כוחות הס\"מ וחיילותיו המבקשים את נפשו לקחתה, אד כיון שהאדם עמל ומתייגע להתגבר על יצרו ולקדש עצמו, ישלח הקב\"ה עזרו מקדש לסעדו ולסמכו שיוכל לעמוד ולהתייצב כנגדם. והם המה דברי הת\"כ אם קדשתם עצמכם מעלה אני עליכם כאילו קדשתה אותי, פירוש דאף שלא יתכן שיגיע האדם אל הקדושה בכוחות עצמו מבלי שיסייעוהו מן השמים, אפי\"ה הקב\"ה מעלה על ישראל כאילו השיגו כל השפעת הקדושה בכוחות עצמם בלבד, כמ\"ש התפל\"מ הנ\"ל, וכיון שבאמצעות מעשיהם הטובים מתקדש שם שמים בעולם, יחשב להם מה שנתקדש ש\"ש בעולם כאילו היה בכח מעשיהם בלבד ללא סיוע מלמעלה, ויטלו שכרם משלם אף על אותו חלק קדושה שזכו לו בסייעתא דשמיא, וז\"ש כאילו קדשתם אותי, כלו' כאילו אתם עצמכם בעבודתכם קידשתם את ה' בעולם, מבלי עזר מן השמים."},{"passage_id":"vayikru2_b4aa8e68_p10","passage_content":"ולבאר סיום דברי הת\"כ או אינו אלא אם אתם מקדשים אותי הריני מקודש ואם לאו איני מקודש ת\"ל כי קדוש אני בין מקדשים בין אין מקדשין, נקדים דברי ק\"ז זלה\"ה בישמח משה פרשת בראשית (ד\"ה נעשה אדם) לפרש מאמרם ז\"ל במד\"ר (פ\"ב ז') והארץ היתה תוהו אלו מעשיהם של רשעים ויאמר אלקים יהי אור אלו מעשיהם של צדיקים ואיני יודע באיזה מהם חפץ כיון דכתיב וירא אלקים את האור כי טוב הוי במעשיהם של צדיקים חפץ ואינו חפץ במעשיהם של רשעים, ע\"כ. וצ\"ב האיך ס\"ד לומר שהשי\"ת חפץ במעשיהם של רשעים, אבל הענין הוא כי כל הנברא לכבודו ברא, וכשם שקילוסו של הקב\"ה עולה מג\"ע כך קילוסו עולה מגיהנם (שמו\"ר פ\"ז ג'), ובין כך ובין כך כבודו מתרבה, אלא דע\"י הצדיקים מתגדל ומתקדש שמו יתברך בקיומן, וע\"י הרשעים באיבודן כדכתיב והתגדלתי והתקדשתי וגו' (יחזקאל פל\"ח). וא\"כ הוה ס\"ד כיון שעכ\"פ כבודו מתרבה מה איכפת ליה במעשי הרשעים, וז\"ש ואיני יודע באיזה מהם חפץ. אבל האמת כי הוא יתעלה מקור הטוב ורוצה להיטיב ולא להעניש, וז\"ש כשהוא אומר וירא אלקים את האור אלו מעשיהם של צדיקים שזה נראה בעיניו, והטעם כי טוב וכו' עייש\"ד. ועד\"ז ביאר גם כוונת המדרש בפרשת ראה הובאו דבריו לעיל בארוכה. ובזה יתבארו גם דברי הת\"כ על נכון דלפי שאמר הכתוב קדושים תהיו שהיא אזהרה לישראל שיקדשו עצמם, ויהיה נחשב להם כאילו כל מה שמתקדש שם שמים בעולם אינו אלא מחמת פעולותיהם, לכן אמר שלא תחשוב דאין שמו יתברך מתקדש בעולם אלא כאשר ישראל מקדשים אותו ע\"י התורה והמצוות, ואילולא זאת אין שם שמים מתקדש בעולם, ת\"ל כי קדוש אני בקדושתי אני בין מקדשין בין שאין מקדשין, כי בין כך ובין כך כבוד שמו יתברך מתקדש ומתעלה בעולם, וגם אם אין ישראל מקדשין אותו שמו יתברך מתקדש ע\"י שהוא עושה דין ברשעים, דכשם שקילוסו עולה מג\"ע כך קילוסו עולה מגיהנם, אלא שהקב\"ה חפץ יותר בקידוש שמו ע\"י מעשיהם הטובים של בני ישראל, וע\"כ דיבר לעם סגולתו שיתקדשו במעשי המצוות, כי באלה חפץ יותר, שיתגדל ויתקדש שמו הגדול בעולם באופן זה."}]},{"dvar_torah_id":"vayikru2_49c0646f","title":"קדושים תהיו: אזהרה ותקווה","summary":"בפרשת קדושים מצווה ה' את ישראל להיות קדושים, תוך הדגשת חשיבות שמירת עריות ושבתות. המדרש מסביר את הקשר בין קדושה לגאולה, ומדגיש את הצורך בהקהלת כל העדה כדי לחזק את המודעות למצוות אלו, לקראת הגאולה העתידית.","contents":[{"passage_id":"vayikru2_49c0646f_p1","passage_content":"וידבר ה' אל משה לאמר דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו כי קדוש אני ה' אלקיכם. פירש רש\"י ז\"ל פ' זו בהקהל נאמרה לפי שרוב גופי תורה תלויין בה. והקשו המפרשים שהרי התורה כולה בהקהל נאמרה כדאיתא בעירובין (דף נ\"א ע\"א), ומה נשתנתה פ' זו שהודיע בה הכתוב שנאמרה בהקהל. והאה\"ח הקדוש תירץ דבשאר פעמים לא הקהילו אלא את האנשים משא\"כ בהקהלה זו באו כולם אנשים נשים וטף, ע\"כ. אמנם אכתי איכא לאקשויי שאם היתה תועלת להקהיל את כל עדת ישראל אנשים נשים וטף בעת שהגיד להם משה את דברי ה', משום דע\"י שנשמעו להם הדברים מפי משה השיגו כולם השגה גדולה במצוות התורה, א\"כ מדוע לא נקבצו ובאו הנשים והטף גם בעת שנאמרו שאר המצוות, והרי כל מצוות התורה הם רחבים מני ים וארוכים מארץ מדה, ובודאי שהיו הדברים מושגים להם יותר אם הם נאמרים אליהם מפי משה."},{"passage_id":"vayikru2_49c0646f_p2","passage_content":"ב) יל\"ד בכפל הלשון דבר ואמרת, גם למה אמר תחלה דיבור לשון קושי והדר ואמרת שהוא מורה על אמרות רכות."},{"passage_id":"vayikru2_49c0646f_p3","passage_content":"ג) בתורת כהנים (הובא בילקוט) איתא קדושים תהיו וגו' אם מקדישים אתם עצמכם מעלה אני עליכם כאילו קדשתם אותי או אינו אומר אלא אם קידשתם אותי הריני מקודש ואם לאו איני מקודש ת\"ל כי קדוש אני בקדושתי אני בין מקדשין בין אין מקדשין, אבא שאול אומר פמליא של מלך מה עליה להיות מחכה למלך, ע\"כ. ודבריו תמוהים מאד איך יעלה על הדעת להסתפק בזה שאם אין ישראל מקדישין אותו כביכול אינו מקודש."},{"passage_id":"vayikru2_49c0646f_p4","passage_content":"ד) במד\"ר (פכ\"ד ג') איתא קדושים תהיו הה\"ד דכתיב ישלח עזרך מקודש וגו' (תהלים כ'), וצ\"ב."},{"passage_id":"vayikru2_49c0646f_p5","passage_content":"ה) איש אמו ואביו תיראו ואת שבתותי תשמורו. יש להקשות עפ\"י מ\"ש המהרש\"א ז\"ל במסכת נדה (דף ל\"ח ע\"א) על מה שדרשו בגמרא (שבת קי\"ח ע\"ב) אלמלא שמרו ישראל ב' שבתות מיד היו נגאלים שנאמר כה אמר ה' לסריסים אשר ישמרו את שבתתי וגו' וכתיב בתריה והביאותים אל הר קדשי, והקשה כיצד אפשר לדרוש דהיכא דכתיב שבתותי ב' שבתות במשמע, והרי בפרשת תשא כתיב את שבתותי תשמורו ושם ליכא למימר שהזהירה תורה על שמירת שתי שבתות בלבד שהרי זוהי אזהרה על שמירת כל השבתות. וכקושיא זו יש להקשות גם בפרשה זו, שנאמר ואת שבתותי תשמורו, דהכא נמי ליכא למימר שהוא אזהרה על שמירת ב' שבתות בלבד, וצ\"ב."},{"passage_id":"vayikru2_49c0646f_p6","passage_content":"ונראה לבאר הענין דהנה רש\"י ז\"ל פירש במאה\"כ קדושים תהיו הוו פרושים מן העריות וכו' שכל מקום שאתה מוצא גדר ערוה אתה מוצא קדושה. ומזה למדנו כי המקדש ומטהר עצמו בעשיית גדרים וסייגים לשמירה מעריות ואביזרייהו בשם קדוש יכונה, וכהא דאמרו ז\"ל (ברכות דף י' ע\"ב) דכתיב גבי אלישע ותאמר אל אישה הנה נא ידעתי כי איש אלקים קדוש הוא וגו' (מלכים א' ד') מנא ידעה וכו' סדין של פשתן הציעה על מעתו ולא ראתה קרי עליו. ומינה כי שם קדוש מיוחד אל השומר עצמו שלא יפגום במדת היסוד דוקא. והוא ע\"ד שפירש המבי\"ט ז\"ל מאה\"כ (שמות כ\"ג) ונקי וצדיק אל תהרוג שהכוונה באמרו צדיק שהוא צדיק באותו ענין אע\"פ שאינו זכאי בכל עניניו. וכן ה\"נ שם קדוש מכונה אל השומר עצמו מפגם הברית דייקא."},{"passage_id":"vayikru2_49c0646f_p7","passage_content":"והנה בתיקון מדת היסוד תלויה הגאולה העתידה, כדאיתא בגמרא (נדה י\"ג ע\"ב) ת\"ר וכו' והמשחקין בתינוקות מעכבין את המשיח וכו' דאר\"י א\"ר אין בן דוד בא עד שיכלו כל הנשמות שבגוף. וכבר הארכנו בזה בדברינו למעלה כי לא יזכו ישראל למעלת קדושים בעצם אלא בעת התיקון השלם, וכדאיתא בב\"ב (ע\"ה ע\"ב) עתידין צדיקים שיאמרו לפניהם קדוש וכו' שנאמר והיה הנשאר בציון והנותר בירושלים קדוש יאמר לו. ומה שישראל קרויים עכשיו קדוש הוא רק לשון מושאל ע\"ש העתיד, כי מעשיהם של ישראל עתה הם הכנה והזמנה אל מה שיזכו להקרא לעתיד בשם קדוש. וז\"ש הכתוב קדושים תהיו לשון עתיד, כי הוא הבעחה אל מה שיזכו ישראל לעת\"ל להקרא בשם קדושים."},{"passage_id":"vayikru2_49c0646f_p8","passage_content":"ועפ\"י האמור נבא אל הביאור בדברי המדרש הנ\"ל (קושיא ד') הה\"ד ישלח עזרך מקדש וגו', דהנה בפ' בראשית (פ\"ב) כתיב אעשה לו עזר כנגדו ופירש\"י ז\"ל זכה עזר לא זכה כנגדו להלחם. ונ\"ל שרמז לנו הכתוב בזה ענין נשגב, והוא שאם אדם זוכה ומתנהג בקדושה ובטהרה בעניני אישות, אזי היא לו לעזר בעבודת ה' ית', וטהר גברא בטהרת הלב ובזכות המחשבה. אך אם לא זכה שאין התנהגותו בקדושה אלא בגדר התאוה, נמשל כבהמות נדמה, אזי היא לו כנגדו להלחם בו, כי בכל דבר שבקדושה היא לו לאבן נגף ולצור מכשול, הן בתורה הן בתפלה הן בכל שאר הענינים."},{"passage_id":"vayikru2_49c0646f_p9","passage_content":"ובזה מבוארים היטב דברי המדרש עה\"פ קדושים תהיו הה\"ד ישלח עזרך מקודש, דהנה לפי שמאמר קדושים תהיו הוא אזהרה אל האדם שיתנהג בקדושה ובטהרה במדת היסוד, על כן קאמר המדרש הה\"ד ישלח עזרך, פירוש אימתי תהיה האשה אשר הוכיח לך ה' לעזר, אם תהיה \"מקודש\" שתתנהג בקדושה, וכאזהרת הכתוב קדושיס תהיו שהוא אזהרה על השמירה מגדר ערוה. ובזה מבואר שפיר סיום דברי הכתוב ומציון יסעדך, פירוש בזכות שהתנהגו בקדושה ובטהרה תזכו לנחמת ציון ולבנין ירושלים, כמבואר ששמירת מדת היסוד מקרבת את הגאולה, ואזי כשנזכה לראות בנחמה יגיעו ישראל לבחינת הקדושה האמיתית, כמו שביארנו, כי קדושה זו היא רק הכנה אליה, וז\"ש הכתוב ומציון יסעדך, כלומר כשתבנה ציון וירושלים יהיה השי\"ת בסעדך שתזכה להטהר ולהתקדש בקדושה של מעלה, ואזי תהיה נקרא בעצם בשם קדוש, לא ע\"ד לשון מושאל בלבד. אמנם מה שתזכה להיות נקרא לעתיד בשם קדוש הוא בזכות ההכנה אל הקדושה בעוה\"ז, וזהו ישלח עזרך מקודש, פירוש ע\"י שמתנהגים עתה בקדושה וזוכים לעזר, בזכות זה לעת\"ל ומציון יסעדך שתגיעו למעלת הקדושה העליונה."},{"passage_id":"vayikru2_49c0646f_p10","passage_content":"ובדרך זו נלך ליישב מה שהקשינו במאה\"כ ואת שבתותי תשמרו דכיצד יתכן לפרשו שהוא אזהרה על שמירת ב' שבתות בלבד (עי' קושיא ה'), דהנה האה\"ח הקדוש כתב לפרש טעם שנסמכה מצות מורא אב ואם לפ' עריות, כי הנכשל בעריות ביעל מורא אב ואם, שגרם להם זלזול שיאמרו ארור שזו ילד ארור שזו גידל, ע\"כ. ולפי זה מבואר היטב שאחר שהזהיר הכתוב על פרישה מעריות במאמר קדושים תהיו, ועוד הוסיף להזהיר על כך באמרו איש אמו ואביו תיראו, ובשמירה מעריות מקרבים את הגאולה כמבואר, ולפי דמיירי בקרא מאותם הדברים המקרבים את הגאולה סמך להם אזהרת ואת שבתותי תשמורו שהיא אזהרה על שמירת ב' שבתות. לרמוז לנו בכך על ענין נוסף המעכב ביאת בן דוד, לפי שלא שמרו ישראל ב' שבתות כהלכתן."},{"passage_id":"vayikru2_49c0646f_p11","passage_content":"ובדברינו מבואר נמי טעם שנאמרה פרשה זו דייקא בהקהלת כל ישראל אנשים נשים וטף (עי' קושיא א'), דהנה בספה\"ק נועם מגדים (פרשת תשא) תמה על הא דאמרו ז\"ל אלמלי שמרו ישראל ב' שבתות מיד היו נגאלין, האם לא היו מימות עולם ועד עכשיו צדיקים וקדושים ששמרו ב' שבתות כהלכתן, ותירץ דלא סגי במה שישמרו יחידי סגולה בלבד ב' שבתות כהלכתן, אלא שיש צורך לזה שישמרו כל ישראל יחד שני שבתות כהלכתן, ע\"כ. ולפי\"ז מובן שהרי בפרשה זו ישנה אזהרה לשמירת שתי שבתות כהלכתן, שעל ידי כך יזכו להגאל, ולפיכך היה צורך להקהיל את כל העדה ולהזהירם על כך, שהרי יש צורך שישמרו כל ישראל שתי שבתות אלו אנשים נשים וטף כמ\"ש בנועמ\"ג."},{"passage_id":"vayikru2_49c0646f_p12","passage_content":"ואפ\"ל כוונה זו גם בדברי רש\"י ז\"ל שכתב פרשה זו בהקהל נאמרה מפני שרוב גופי תורה תלויין בה, דהנה בזמן הגלות חסרנו רוב המצוות שאין בידינו לקיימם, כמו שנתנו דורשי רשומות סימן ה'ג'ש'ס' חלף הלך לו, דסכום מצוות כמנין תיבת הגשם אינם בידינו לקיימם. וז\"ש רש\"י ז\"ל שפרשה זו נאמרה בהקהלת כל עדת ישראל אנשים נשים ועף, לפי שרוב גופי תורה תלויים בה, כלומר לפי שבפ' זו ישנה אזהרת שבשמירתה תלוי קיום רוב גופי תורה, והיא אזהרת את שבתותי תשמרו, דקאי על שמירת ב' שבתות שבזכות זה מיד היו נגאלין, ואז יהיה בידינו לקיים כל המצוות אשר חסרנו בגלות, על כן נאמרה פרשה זו בהקהלת כל העדה אנשים נשים וטף, שהרי תנאי הוא הדבר שישמרו כל ישראל ב' שבתות אלו."},{"passage_id":"vayikru2_49c0646f_p13","passage_content":"ובדרך רמז אפ\"ל מה שנאמרה פרשה זו בהקהלת כלם. דהנה נתבאר בדברינו שמאמר קדושים תהיו הוא הבטחה על לעתיד לבא, שאז יזכו ישראל למעלה זו. והנה דבר זה מפורש ביעודי הנביאים כי לעתיד לבא יזכו כל ישראל למדרגת החכמה, ולא יהיו צריכים לקבל השפעת חכמה א' מחבירו וכמאה\"כ (ירמי' ל\"א) ולא ילמדו עוד איש את רעהו וגו', ואז יהיו כל ישראל שוים במעלה, ולא תהיה הדרגה והתנשאות ביניהם כלל. וזו היתה גם טענת קרח לפני משה באמרו כי כל העדה כולם קדושים וגו' ומדוע תתנשאו על קהל ה' (במדבר ט\"ז), דהנה מבואר בדברי רבינו האריז\"ל שקרח טעה וסבר כי כבר הגיע התיקון השלם, ולעתיד יהיו הלוים כהנים, על כן ערער על כהונת אהרן, כי אמר שכבר הגיע עתו להיות משמש בכהונה גדולה, ע\"כ. ולפי שסבר כי כבר הגיע זמן התיקון השלם טען כי כל העדה כולם קדושים, שהרי בזמן התיקון השלם כולם בדרגא חדא, ומדוע תתנשאו על קהל ה'."},{"passage_id":"vayikru2_49c0646f_p14","passage_content":"ולטעם זה אפ\"ל שנאמרה להם פרשה זו בהקהל משום דפרשה זו מיירי מן המצוות המקרבים את הגאולה, ולכן הקהילו את כולם יחד אנשים נשים ועף, ושמעו כולם כאחד פרשה זו מפי משה, לרמוז על כך כי בעת הגאולה תהיה מדרגת כולם שוה, ולא יצטרכו ללמוד איש מרעהו. ובזה מובן טעם שבשאר מצוות לא הקהילו את כל העדה אנשים נשים וטף, דדוקא בפרשה זו הרומזת אל הגאולה שייך להורות על כך."},{"passage_id":"vayikru2_49c0646f_p15","passage_content":"ועל פי בחינה זו נבא לביאור דברי הת\"כ הנ\"ל (קושיא ג') אם מקדישים אתם את עצמכם מעלה אני עליכם כאילו קדשתם אותי וכו', דהנה נתבאר בדברינו כי בזכות שישראל נגדרים מעריות ומתנהגים בקדושה ובטהרה הרי הם מקרבים ביאת המשיח. והנה עיקר קידוש שמו יתברך בעולם יהיה בביאת המשיח, כי אז יכירו וידעו כל יושבי תבל כי לה' המלוכה ונשגב ה' לבדו ביום ההוא, וכאשר כתבו התוס' בריש מסכת ברכות (דף ג' ע\"א ד\"ה ועונין) מה שפירש במחזור ויטרי לפרש נוסח הקדיש יהא שמיה רבא וכו' שזו.תפלה שאנו מתפללין שימלא שמו כדכתיב (שמות ע\"ז) כי יד על כס י-ה שלא יהא שמו שלם וכסאו שלם עד שימחה זרעו של עמלק, ופירושו כך יהא שמי\"ה שם י-ה רבא כלומר שאנו מתפללים שיהא שמו גדול ושלם וכו', ע\"כ. וז\"פ דברי המדרש אם אתם מקדישים עצמכם מעלה אני עניכם כאילו קדשתם אותי, שהרי בזכות מה שישראל מקדשים עצמם ונגדרין מעריות הם מקרבים את הגאולה, ואז יתגדל ויתקדש שמו הגדול והנורא, לפיכך מעלה אני עליכם כאילו אתם מקדישים אותי, שע\"י מעשיכם אתם גורמים שיתקדש שם שמים בעגלא ובזמן קריב."},{"passage_id":"vayikru2_49c0646f_p16","passage_content":"ובדרך זו יבואר גם המשך דברי המדרש הנ\"ל, או אינו אלא אם קדשתם אותי הריני מקודש ואם לאו איני מקודש ת\"ל כי קדוש אני בקדושתי אני בין מקדשין בין אין מקדשין. ונראה דהנה אמרו ז\"ל זכו אחישנה לא זכו בעתה (סנהדרין צ\"ז ע\"ב), והכוונה כי אם יזכו ישראל מצד מעשיהם יחיש הקב\"ה ויקרב זמן הגאולה, אך אם לא יזכו לגאולה מצד מעשיהם כי יהיו בבחי' כולו חייב, אזי תהיה ביאת המשיח בעת קץ האחרון בכל אופן ואופן, כי כבר הבטיחנו השי\"ת בשבועה כי הגאולה בא תבא, כדאיתא בגמרא שם מקרא דסוף דניאל דכתיב כי למועד מועדים, ופירש\"י אלמא יש קץ בדבר. ואם לא יהיו ישראל ראויים לגאולה מצד מעשיהם יגאלנו הקב\"ה למען כבוד שמו, כמאה\"כ (ישעי' מ\"ח) למעני למעני אעשה."},{"passage_id":"vayikru2_49c0646f_p17","passage_content":"וזאת אפ\"ל בכוונת המדרש או אינו אלא אם מקדישים אתם אותי הריני מקודש, כלומר דהו\"א שרק אם יהיו ישראל קדושים וטהורים וראויים לגאולה מצד מעשיהם אז יתגדל ויתקדש שמו של הקב\"ה בביאת הגואל, ואם לאו שלא יהיו ישראל קדושים ולא יהיו ראוים להגאל איני מקודש, שחס ושלום לא יזכו להגאל, ת\"ל כי קדוש אני בין מקדישים אותי בין אין מקדישים אותי, דסוף סוף תהיה הגאולה השלמה בכל אופן ואופן בין ראויים בין אינם ראויים. אף שאין אתנו יודע באיזה אופן תהיה אם קודם הגאולה יבא אליהו זל\"ט להחזיר את ישראל בתשובה או באופן אחר, ואוי לה לאותה בושה אוי לה לאותה כלימה אם תהיה הגאולה באופן זה (עיין בדברינו בספר ויואל משה מאמר שלש שבועות סימן נ' ואילך), אך הגאולה תהיה בודאי בלי שום ספק בכל אופן ואופן."},{"passage_id":"vayikru2_49c0646f_p18","passage_content":"ובזה מבואר גם מה שסיים בת\"כ פמליא של מלך מה עליה להיות מחכה למלך (כ\"ה גירסת הילקוט וכן גורס הראב\"ד ז\"ל בפירושו לת\"כ), דהנה אמרו ז\"ל (סנהדרין צ\"ז ע\"א) אין בן דוד בא עד שיתייאשו מן הגאולה כי הא דר' זירא כי הוה משכח רבנן דמיעסקי ביה (פירש\"י לידע מתי יבא) אמר במטותא בעינא מינייכו דלא תרחקוה וכו' דתניא שלשה באין בהיסח הדעת ואלו הן משיח מציאה ועקרב וכו'. וכבר ביארנו מאמר זה (עיין בדברינו לעיל פרשת תולדות תרס\"ב א') שהכוונה שלא להיות ממחשבי קיצים ולא לצייר במחשבה איך ומתי תהיה הגאולה, אלא עלינו לצפות בתמימות לישועת ה' שתבא בעת שיעלה רצון מלפניו יתברך. וזה אפ\"ל בכוונת הת\"כ הנ\"ל דהוא מיירי מענין הגאולה העתידה, כמבואר דזהו שאמר בקדושתי אני בין מקדשין בין שאין מקדשין, דבכל אופן ואופן תהיה הגאולה אפילו אם לא יזכו ישראל יהיה הקץ בבחינת בעתה, ולפיכך הוא מסיים פמליא של מלך עליה להיות מחכה למלך, שעלינו להיות מחכים ומצפים בתמימות לביאת משיח צדקינו ולהתגלות כבוד מלכותו עלינו, ולא לעשות חשבונות ולצייר במחשבות הלב כיצד תבא הגאולה, כי לא יושג הדבר בשכל האנושי, אלא יבא בהיסח הדעת כלומר למעלה מדעת אנוש."},{"passage_id":"vayikru2_49c0646f_p19","passage_content":"ובזה יתיישב מה שדקדקנו בכפל לשון הכתוב דבר ואמרת, וגם מה ששינה מדבור קשה לאמירה רכה, כי לפי שהכתוב רומז אל הגאולה העתידה, במה שאמר קדושים תהיו, לזאת כתיב דבר לשון קשה, כי קודם הגאולה יהיו חבלי משיח קשים, אבל אחרי שכבר נזכה אל הגאולה תהיה אמירה רכה, ויתעלו ישראל למדריגת קדושים. והשי\"ת יזכנו ללכת בדרך האמת ולדבקה בו יתברך באמת ובתמים, ולקבל פני משיח צדקינו בקדושה ובטהרה בשמחה ובנחת, ונזכה לראות בישועת כל ישראל ובשמחתן בהתרוממות קרן התורה וישראל, ובהתגלות כבוד שמים עלינו במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru2_20cb4ef0","title":"קדושים תהיו: אזהרה לעריות בהקהל","summary":"בפרשה זו מזהיר ה' את ישראל, אנשים ונשים, על קדושה ופרישות מעריות. הכפל 'דבר ואמרת' משקף את הצורך להבחין בין דיבור קשה לזכרים לאמירה רכה לנשים, כדי למנוע מכשול בעת התקהלותם.","contents":[{"passage_id":"vayikru2_20cb4ef0_p1","passage_content":"באופן אחר י\"ל כפל הלשון דבר ואמרת. גם מה שפתח בדיבור לשון קשה, ואח\"כ ואמרת לשון אמירה רכה."},{"passage_id":"vayikru2_20cb4ef0_p2","passage_content":"ב) רש\"י ז\"ל פירש קדושים תהיו הוו פרושים מן העריות ומן העבירה שכל מקום שאתה מוצא גדר ערוה אתה מוצא קדושה וכו'. וצ\"ב דלפי זה היה ראוי לומר קדושים תהיו בסוף הפרשה הקודמת, ששם הזהירה תורה על העריות לכל פרעיהן, ושם מקום להזהיר על הפרישה מהם, ואמאי נטר קרא עד הכא, דלא מיירי פרשה זו כלל מענין זה."},{"passage_id":"vayikru2_20cb4ef0_p3","passage_content":"ונראה לומר בביאור הענין עפ\"י מה דאיתא בת\"כ (הובא ברש\"י ז\"ל) מדכתיב דבר אל כל עדת בני ישראל מלמד שנאמרה פרשה זו בהקהל מפני שרוב גופי תורה תלויין בה. והקשו המפרשים ז\"ל מדוע גילה לנו הכתוב זאת בהך פרשה דוקא, והלא כל מצוות התורה נאמרו בהקהלת כל העדה כדאיתא בעירובין (דף נ\"ד ע\"ב) ת\"ר כיצד סדר משנה וכו'. והאה\"ח הקדוש כתב וז\"ל, והנכון בעיני כי בסדר הראשון לא היה מדבר משה אלא לאנשים וכאן צוה ה' שידבר לכל עדת ישראל אנשים נשים ועף כסדר שהיו מקבצים במתן תורה, עכ\"ד (ותירוץ זה מוזכר גם ברא\"ם ופלא שהאה\"ח הקדוש אינו מביאו בשמו)."},{"passage_id":"vayikru2_20cb4ef0_p4","passage_content":"ועפ\"י דברים אלו נבא אל הביאור, כי הנה בפרשת יתרו כתיב כה תאמר לבית יעקב ותגיד לבני ישראל, ופירש\"י ז\"ל (ומקורו בדברי המכילתא שם) לבית יעקב אלו הנשים תאמר להן בלשון רכה, ותגיד לבני ישראל, לזכרים דברים הקשים כגידים. והקשו המפרשים ז\"ל שלא מצינו בפרשה זו ב' סוגי דבורים רכים וקשים, דכל הפרשה בסגנון אחד נאמרה, וא\"כ כיצד יתכן שיאמרו אותם הדברים עצמם בלשון קשה לזכרים ובאמירה רכה לנשים, אם רכים הם יהיו נוחים ועריבים לכולם, ואם דברים קשים הם יהיו קשים לכולם. ולא יתכן לומר שאמר להם דברים אחרים מלבד האמור בענין, שהרי בסוף אותה פרשה כתיב אלה הדברים אשר תדבר אל בני ישראל, ואמרו ז\"ל לא פחות ולא יותר, הרי כי לא היה רשאי להוסיף עניהם או לגרוע מהם דבר. וכבר נאמרו ונשנו הרבה תירוצים על קושיא זו, וכולם סובבים הולכים על קוטב אחד, שבדברים אלו עצמם נשמעו לבני ישראל אלו הזכרים דברים קשים כגידים, משום שהשיגו פנימיותן של דברים, ולבית יעקב אלו הנשים שלא השיגו כי אם פשטות הדברים היתה בהם אמירה רכה (ועיין בדברינו לעיל פרשת יתרו מה שכתבנו בזה)."},{"passage_id":"vayikru2_20cb4ef0_p5","passage_content":"היוצא לנו מזה כי במקום שדיבר משה לאנשים ולנשים גם יחד נכללו בדבריו הקדושים ב' מיני דבורים, דברים הקשים כגידין לאנשים, ואמירה רכה לנשים. וביאור הדבר הוא עפ\"י מה דאיתא בחגיגה (דף ג' ע\"א) עה\"פ הקהל את האנשים והנשים והטף (דברים ל\"א) אם אנשים באים ללמוד נשים באות לשמוע עף למה באין וכו'. וכתבו התוספות (שם ד\"ה נשים) דאמר בירושלמי דהך דרשה דראב\"ע דקאמר נשים באות לשמוע אתיא דלא כבן עזאי דאמר חייב אדם ללמד את בתו תורה דמדאמר נשים לשמוע משמע דסבר שאסור לנשים ללמוד תורה כי אם לשמוע ההלכות כדי שידעו לקיים המצוות. וכ\"כ התוספות בסוטה (דף כ\"א ע\"ב ד\"ה בן עזאי). מזה מבואר להדיא דאסור לנשים ללמוד דרשות חז\"ל על הכתובים וכמו שאמרו ז\"ל (דף כ' ע\"ב) ר\"א אומר כל המלמד בתו תורה כאילו מלמדה תפלות אלא שהנשים היו באות לשמוע המצוות הנוהגות בהם (ועיין מ\"ש בענין זה בספרי ויואל משה מאמר לשון הקדש סימן ל' שם הארכנו בביאור הענין)."},{"passage_id":"vayikru2_20cb4ef0_p6","passage_content":"ועל פי זה יתבאר לנו היטב מה שכפל הכתוב לומר דבר ואמרת, גם שינה לשונו מדבור קשה לאמירה רכה, שהרי כיון שמשונה פרשה זו שאף הנשים נקהלו ובאו לשמוע המצוות האמורות בה מחמת שרוב גופי תורה תלויין בה, וכמ\"ש האה\"ח הקדוש, לפיכך הוצרך קרא לכתוב דבר ואמרת, שהרי יש כאן ב' סוגי דבורים, דבור הקשה לזכרים שהרי להם נתבארו גם הדרשות היוצאות מן הכתובים הללו, ודברים קשים הם להשיג כל הדרשות והדקדוקים וצריך יגיעה רבה להבינם על בוריים. אמנם לנשים היו הדברים האמורים בפרשה לאמירה רכה, כיון שהם לא באו כי אם לשמוע המצוות הנאמרות בענין, למען ידעו דרך ילכו בה ואת המעשה אשר יעשו, משא\"כ הדרשות והדקדוקים היוצאות מן הפסוקים לא למדו עמהם, משום שאסור לנשים ללמוד תורה כמבואר, ומשו\"ה היו הדברים הללו אצלם אמירה רכה, שלא הוצרכו עמל ויגיעה להשיגם. וע\"כ נקט קרא דבר ואמרת, נקט דבור תחלה ואח\"כ אמירה, לפי שהדבור נוגע לזכרים שלמד עמהם הדרשות הנלמדות מן הפסוקים, לפיכך הקדים הכתוב את הזכרים, ואף שבמ\"ת כתיב כה תאמר לבית יעקב תחלה ואח\"כ ותגיד לבני ישראל, התם טעמא איכא למילתא כדאי' במכילתא עיי\"ש, משא\"כ בעלמא ראוי להקדים את האנשים לנשים."},{"passage_id":"vayikru2_20cb4ef0_p7","passage_content":"ולפי מה שכתב האה\"ח הקדוש כי פרשה זו נאמרה גם לנשים, יתבאר גם מה שפירש\"י ז\"ל דמצות קדושים תהיו היא אזהרה לפרוש מעריות, דלכאורה לפי זה היה מקומה של אזהרה זו ראוי להיות בסוף פרשה הקודמת, ששם הזהירה תורה על העריות (עיין קושיא ב'). ואפ\"ל עפ\"י מה דאיתא במסכת קידושין (דף פ\"א ע\"א) סקבא דשתא רגלא, ופירש\"י ז\"ל ריעוע של ימות השנה ליחוד ולעבירה ימות הרגל שיש קבוצות אנשים ונשים לשמוע הדרשה ונותנין עין זה על זה. וכ\"כ התוספות שם והביאו בשם י\"א שמשום כך נהגו להתענות לאחר פסח ולאחר סוכות, ע\"כ. והובאו דברי התוספות הללו ביתה יוסף ובב\"ח ריש הלכות פסח (סימן תכ\"ט)."},{"passage_id":"vayikru2_20cb4ef0_p8","passage_content":"וכיו\"ב איתא בגמרא מגילה (דף ל\"א ע\"א) ביום הכפורים במנחה קורין בעריות, וכתבו התוספות הטעם לפי שהנשים מקושטות בשביל כבוד היום לפיכך צריך להזכירם שלא יכשלו בהן, עכ\"ל. ולכאורה לפי טעם זה היה מן הראוי לקרוא בפרשת עריות ביום הכפורים שחרית, כדי להזהיר את העם שלא יכשלו בעבירה, ולמה ממתינין עד קריאת המנחה, ואפ\"ל כי הנה ביום הקדוש והנורא לבם של ישראל נשבר בקרבם מאימת הדין ואז אין לחוש כ\"כ למכשול עד שיהא צורך להזכירן שלא יכשלו, אכן כאשר היום יפנה בטרם יבא השמש ויחשיך והעם יחזרו לבתיהם, יש צורך להזהירן לבל יבואו לידי מכשול, כי מחמת גודל שמחתן על שנמחלו עוונותיהם וכמו שאמרו ז\"ל (מדרש הובא בתוס' מס' יומא פ\"ז ע\"ב) במוצאי יום הכפורים בת קול יוצאת ואומרת לך אכול בשמחה לחמך וגו', יש לחוש פן יבואו לידי מכשול, ולפיכך קורין במנחה פרשת עריות כדי להזהירן ממכשול סמוך לביאתם לביתם שמחים וטובי לב."},{"passage_id":"vayikru2_20cb4ef0_p9","passage_content":"מכל אלו נמצינו למדים כי במקום שמתקבצין אנשים ונשים יש לחוש פן יבואו לידי מכשול בעריות, ולפיכך כיון שפרשה זו אמרה משה לכל ישראל יחד אנשים נשים וטף, ע\"כ בטרם החל להגיד להם מצוות הנאמרות בענין פתח להזהירן קדושים תהיו, וכפי' רש\"י הוו פרושים מן העריות ומן העבירה, להזכירם ולעוררם שלא יאונה להם ח\"ו כל מכשול מפאת היותם מקובצים יחדיו."}]},{"dvar_torah_id":"vayikru2_18201ad4","title":"קדושה ופרישות בעבודת ה'","summary":"בפרשת קדושים תהיו מצווים על קדושה ופרישות מעבירות. רש\"י מפרש פרישות מעריות, והרמב\"ן מוסיף על כך פרישות מעבודה זרה. הקב\"ה מקדש את ישראל, והשמירה על קדושת ישראל מביאה להצלחתם ולהסתרת עוונותיהם.","contents":[{"passage_id":"vayikru2_18201ad4_p1","passage_content":"קדושים תהיו כי קדוש אני ה' אלקיכם פירש\"י ז\"ל הוו פרושים מן העריות ומן העבירה וכו' שכל מקום שאתה מוצא גדר ערוה אתה מוצא קדושה וכו',  ע\"כ. והרמב\"ן ז\"ל השיג על דברי רש\"י ז\"ל וכתב אבל בתורת כהנים ראיתי סתם פרושים תהיו, וכן שנו שם והתקדשתם והייתם קדושים כי קדוש אני ה', כשם שאני קדוש כך אתם תהיו קדושים כשם שאני פרוש כך אתם הוו פרושים. ולפי דעתי אין הפרישה הזו לפרוש מן העריות כדברי הרב וכו' עיי\"ש שהאריך לבאר דפרישה ענינה ההתבדלות מן המותרות והתענוגים היתירים, כענין שאמרו קדש עצמך במותר לך. ולכאורה לפי מה שפירש\"י ז\"ל במצות קדושים תהיו שענינה פרישה מעריות, צ\"ב להבין כוונת הת\"כ כשם שאני קדוש כך אתם תהיו קדושים כשם שאני פרוש כך אתם הוו פרושים, והרי לא שייכו כלל הני עניני קדושה ופרישות כביכול אצלו יתברך."},{"passage_id":"vayikru2_18201ad4_p2","passage_content":"ב) וכיוצא בזה תקשה דלהלן בפרשה מצינו לרש\"י ז\"ל עצמו שפירש באופן אחר מצות קדושה, שכ' עה\"פ והתקדשתם והייתם קדושים כי קדוש אני, זו פרישות עבודה זרה. וה\"נ קשה כדלעיל דמאי נתינת טעם היא זו שע\"כ עלינו להיות פרושים מע\"ז משום כי קדוש אני ה', והרי אצלו יתברך לא שייך ענין ע\"ז בשום פנים, וא\"כ כיצד תלה הכתוב חיוב קדושתנו ופרישתנו במה שהוא יתברך פרוש מכל אלו, בעוד דלא שייכי כל עניני פרישות אלו בגויה."},{"passage_id":"vayikru2_18201ad4_p3","passage_content":"ג) בתורת כהנים (הובא בילקוט רמז תר\"צ) אי' קדושים תהיו כי קדוש אני אם מקדישים אתם את עצמכם מעלה אני עליכם כאילו קדשתם אותי, או אינו אומר אלא אם קדשתם אותי הריני מקודש ואם לאו איני מקודש ת\"ל כי קדוש אני בקדושתי אני בין מקדישין בין שאינן מקדישין, ע\"כ. והוא פלאי הכיצד יעלה על הדעת לומר שקדושת הבורא ית\"ש תלויה בקדושת בני אדם קרוצי חומר, והלא הקב\"ה הוא קדוש בכל אופן ואין שום מציאות של העדר קדושה אצלו כביכול, ואמאי איצטריך קרא להודיע דבין מקדישין ובין אין מקדישין הרי הוא בקדושתו."},{"passage_id":"vayikru2_18201ad4_p4","passage_content":"ואפ\"ל בביאור הענין עפ\"י מה שכתב ק\"ז זלה\"ה בישמח משה ס\"פ אחרי על דרשת הירושלמי (ר\"ה פ\"א ה\"ג הובא בילקוט ס\"פ אחרי יע\"ש) ושמרתם את משמרתי מה שאני שומר שהקב\"ה שומר תורתו, עכ\"ד הירושלמי. והנה זה תמוה ביותר דאינו ענין כלל לפרשת עריות רק למצות שבת ומצות גמילות חסדים, ואיך דרשו ממקרא זה הנאמר בפ' עריות שהקב\"ה שומר תורתו, הכיצד שייכא שמירה זו אצלו יתברך. ותירץ עפי\"ד היערות דבש שהקב\"ה שומר את הנימולים מחרבו של עשיו, כי מאדים כוכבו של עשיו וע\"י המילה מחליש כוחו, עייש\"ד. וידוע דהפוגם בעריות ר\"ל נפגם אות ברית קדש ר\"ל ונמשכת ערלתו, והיינו ושמרתם את משמרתי מה שאני שומר שלא תפגמו אות ב\"ק ע\"י עריות, וע\"י זה אהיה לכם שומר, עכלה\"ק. ובעיני יפלא מה שתמה תמיהה גדולה ע\"ד הירושלמי, דהלא כל זה יתבאר עפ\"י דברי התוספות במגילה (דף ל\"א ע\"א) על הא דאי' בגמרא התם דיוהכ\"פ במנחה קורין בפרשת עריות, וכתבו ב' טעמים בדבר, והטעם הב' הוא דאיתא במדרש שע\"כ קורין בעריות לפי שישראל עושין רמז להקב\"ה שכשם שהזהיר אותם שלא לגלות ערוה כך לא תגלה ערותם בעוונותם, ע\"כ. ולפי זה שייך מנין פרישה מעריות אצלו כביכול, שלא תגלה ערוותן של ישראל בעוונותיהם."},{"passage_id":"vayikru2_18201ad4_p5","passage_content":"ומעתה מבוארים דברי הירושלמי על נכון ושמרתם את משמרתי מה שאני שומר שהקב\"ה שומר את תורתו, דשפיר שייך לדרוש כן במקרא הנאמר בפרשת עריות, משום שזוהי הבטחה לנו מאתו יתברך, שאה נשמור עצמנו מעריות גם השי\"ת ישמור מצוה זו שלא לגלות עוונותיהם של ישראל, כי הקב\"ה שומר מצוותיה של תורה. ועפ\"י זה יהיה ביאור הכתוב לפי פירושו של רש\"י ז\"ל באופן זה, קדושים תהיו דהיינו פרושים מן העריות, ואז כי קדוש אני, אף אני אעשה זאת לכם שלא לגלות ערות עוונותיכם. דשייכא פרישה זו אצלו יתברך שלא יתגלו מל ידו עוונות ישראל. ובאמת זהו רצונו של מקום שלא לגלות עוונות ישראל, ובלא\"ה נמי אינו מגלה אותם, דאל\"כ לא היתה תקומה לשונאי ישראל ח\"ו, אלא שאם עושים עבירות ואין נשמרין מעריות ח\"ו אזי מתישין כח של מעלה כביכול, כמאה\"כ (דברים ל\"ב) צור ילדך תשי, ואז מתעוררים עליהם קטרוגים ח\"ו אבל אם ישראל נזהרין בפרישה מעריות הם מוסיפים כח בפמליא של מעלה, ומדה כנגד מדם ה' בשמן יגער ויחסום פי קטיגור, והקב\"ה מסתיר עוונותיהם, ולא תגלה ערותם כלל. וכמאה\"כ (מיכה ז') וכל חטאות עמך בית ישראל תשליך במקום אשר לא יזכרו ולא יפקדו ולא ימלו מל לב למולם."},{"passage_id":"vayikru2_18201ad4_p6","passage_content":"ובזה יתבארו גם דברי התורת כהנים (קושיא ג') אם מקדישים אתם את עצמכם ממלה אני עליכם כאילו קדשתם אותי, כלומר אם תקדשו את עצמכם בפרישה מעריות כמו שפירש\"י ז\"ל, אזי מעלה אני עליכם כאילו הקדושה שלי שאנכי שומר, שלא לגלות ערות ישראל ועוונותיהם, באה מחמת מעשיכם, אף כי לאמתו של דבר גם בלא\"ה אין הקב\"ה מגלה עוונות ישראל, מ\"מ הקב\"ה מחשיב לנו כאילו בא לנו זאת ע\"י מעשינו בלבד. והוא כעין מה שכתב ק\"ז זלה\"ה בישמח משה (פ' חיי שרה) לפרש הכתוב (תהלים ס\"ב) ולך ה' החסד כי אתה תשלם לאיש כמעשהו, ותו\"ד כי ממידת חסדו וטובו יתברך עלינו שאף המצוות אשר הם מוטבעים בטבע האדם אפילו אם לא היה מצווה עליהם, כגון שקצים ורמשים שנפשו של אדם קצה בהם, וא\"כ עפ\"י שורת הדין לא היה מגיע עליהם שכר, אפ\"ה הקב\"ה מעלה עלינו כאילו עשינו כל אלו מחמת בחירתינו. וז\"ש הכתוב ולך ה' החסד, כי דבר זה ממידת טובו וחסדו יתברך, כי אתה תשלם לאיש כמעשהו כלומר כאילו היתה המצוה נגמרת בכח מעשינו וע\"י בחירתינו אף שכך הוא העבע, עכת\"ד ז\"ל. וכמו כן הוא גם לענינינו, דאף שגם בלא פעולתינו נמי לא היה הקב\"ה מגלה עוונות ישראל, מ\"מ אם אנו מקדישין עצמינו הקב\"ה יחשוב לנו כאילו מעשינו גרמו שלא יגלה עוונותינו, וישלם לנו שכר טוב גם בעבור זה שעשינו נחת רוח לפניו שיוכל להטיב לנו, כי חפץ חסד הוא, ורצונו להטיב לעמו ישראל."},{"passage_id":"vayikru2_18201ad4_p7","passage_content":"וגם סיום מאמר הת\"כ הרי הוא כמבואר עפ\"י דברינו, יכול אם קדשתם אותי הריני מקודש ואם לאו איני מקודש, כלומר דהו\"א שאם ח\"ו אין ישראל מתקדשים כראוי בפרישה מעריות אזי כביכול אף הוא אינו נשמר מלגלות עוונות ישראל, ת\"ל כי קדוש אני בין מקדשין בין שאין מקדשין, דבכל אופן אין הקב\"ה מגלה עוונות ישראל, כמאה\"כ נושא עון ועובר על פשע לשארית נחלתו וגו' כי חפץ חסד הוא, אלא שאם אנו מקדשים עצמינו יסתיר הקב\"ה עוונותינו בבחינה גבוהה יותר, דהיינו שיסתירם לגמרי, כדכתיב התם וכל חטאות וגו' תשליך במקום אשר לא יזכרו ולא יפקדו ולא יעלו על לב לעולם."},{"passage_id":"vayikru2_18201ad4_p8","passage_content":"ובאופן אחר יתבאר מאמר הת\"כ אם מקדישים אתם עצמיכם מעלה אני עליכם כאילו קדשתם אותי, בהקדם עוד מה דאיתא במד\"ר פרשה זו קדושים תהיו הה\"ד ויגבה ה' צבאו' במשפט, תניא אמר רשב\"י אימתי שמו של הקב\"ה מתגדל בעולמו בשעה שעושה מדת הדין ברשעים וכו'. ובתנחומא איתא נמי כהך דרשה, ואח\"כ קא דריש סיפא דהך קרא, מהו והאל הקדוש נקדש בצדקה שהוא מתקדש בעולמו בצדקה שהוא מלמד סניגוריא על ישראל וכו', ואתם מתקדשים בי ואני מתקדש בכם שנאמר והתקדשתם והייתם קדושים, עכ\"ד התנחומא. ולכאו' צ\"ב שייכות דרשות אלו לפרשת קדושים דמיירי בפרישה מעריות ומע\"ז וכו'. אמנם יובן בהקדם מה שכתב הרמב\"ן ז\"ל בפרשת האזינו עה\"פ אמרתי אפאיהם וגו', לולא כעס אויב אגור פן ינכרו צרימו פן יאמרו ידינו רמה ולא ה' פעל כל זאת, וזלה\"ק, והטעם בטענה הזאת אינו כרוצה להראות כוחו בין שונאיו, כי כל הגוים כאין נגדו מאפס ותוהו נחשבו לו, אבל השם ברא את האדם שיכיר את בוראו ויודה לשמו וכו', וכאשר חטאו העמים וכפרו בו כולם לא נשאר רק העם הזה לשמו ופירסם בהם האותות והמופתים, כי הוא אלקי האלקים ואדוני האדונים, ונודע בזה לכל העמים, והנה אם ישוב ויאבד זכרם ישכחו העמים את אותותיו ואת מעשיו ולא יסופר בהם עוד וכו', הנה תהיה כוונת הבריאה בטילה כו', וע\"כ ראוי מדינא וכו' להקים לו לעם כל הימים וכו', כענין שנאמר כל הנקרא בשמי ולכבודי בראתיו וגו', עכדה'ק."},{"passage_id":"vayikru2_18201ad4_p9","passage_content":"ומעתה יתבאר התנחומא דמייתי הכא מאה\"כ והא-ל הקדוש נקדש בצדקה ודריש מיניה שהוא מתקדש בצדקה שהוא מלמד סניגוריא על ישראל, כי מה שהקב\"ה מציל את ישראל מן המקטריגים בסניגוריא שהוא מלמד עליהם, דין הניא להון שישארו חיים וקיימים כל הימים, ועל ידם יהיה פירסום אלקותו יתברך לכל העמים, אשר יעריצו ויקדישו את שמו לנצח, בזכרם כל האותות והמופתים הגדולים והנוראים אשר עשה ה' לעמו ישראל, להצילם מיד שונאיהם ולעשות באויביהם שפטים גדולים."},{"passage_id":"vayikru2_18201ad4_p10","passage_content":"ובדרך זה מובן גם סיום דברי התנחומא ואתם מתקדשים בי ואני מתקדש בכם שנאמר והתקדשתם והייתם קדושים וכו',  ר\"ל ע\"י שתהיו אתם מתקדשים בפרישה מע\"ז ומעריות, וכן שאר עניני פרישה הכלולים באזהרת קדושים תהיו, יהיה שם שמים מתקדש בעיני הגויה ע\"י מעשיכם הטובים, ובזכות זה תהיו ראויים להצלה, ותשארו חיים וקיימים לעולמים, ויהיה שם שמים מתפרסם על ידכם לעולם. וזהו שאמר ואני מתקדש בכם, היינו על ידיכם. וא\"ש דשייכא דרשה זו לפרשת קדושים, גם מובן מה שתלה קדושתו יתברך בקדושת ישראל, כי ע\"י קדושת ישראל מתגדל ומתקדש שם שמים בכל העולם."},{"passage_id":"vayikru2_18201ad4_p11","passage_content":"אכן באמת אין הקב\"ה צריך לפעולתינו, ובלא\"ה יתפרסם שמו בכל העולם כאשר יהיה התיקון השלם והאלילים כרות יכרתון וכל בני בשר יקראו בשמו יתברך, וכמה מקראות יעידו על כך, אבל הקב\"ה ברחמיו וברוב חסדיו מחשיב לנו פעולתינו כאילו נעשה הכל על ידינו, כמ\"ש לעיל עה\"פ ולך ה' החסד כי אתה תשלם לאיש כמעשהו. ומעתה יובנו דברי הת\"כ הנ\"ל אם אתם מקדישים את עצמכם בכל סוגי קדושה ופרישות ונעשה קידוש ש\"ש בעולם על ידכם, מעלה אני עליכם כאילו קדשתם אותי, כלומר כאילו נעשה כביכול על ידיכם תוספת בקדושתי, וכאמרם ז\"ל (איכ\"ר פ\"א ל\"ה) ישראל מוסיפין כח בגבורה של מעלה. או אינו אלא אם מקדישין אותי הריני מקודש ואם לאו איני מקודש, שלא יתפרסם ויתגלה חלילה אלקותו אם לא על ידינו, ת\"ל כי קדוש אני בין כך ובין כך הריני מקודש, שבכל אופן יתגלה ויתפרסם כבוד שמו בכל העולם, אלא שאם ישראל מסייעין לזה במעשיהם הטובים יקבלו על כך שכר טוב כאילו נתקדש שמו בעולם על ידם."},{"passage_id":"vayikru2_18201ad4_p12","passage_content":"ובאופן אחר יבואר הת\"כ אם מקדישים אתם עצמכם מעלה אני עליכם כאילו קדשתם אותי וכו'. בהקדם ליישב דברי רש\"י ז\"ל עה\"פ והתקדשתם והייתם קדושים, זו פרישות ע\"ז. וקשה דלפי זה יהיה נכלל גם באזהרת קדושים תהיו ענין פרישה מע\"ז, וכיצד יתבאר מ\"ש הכתוב כי קדוש אני ואיתא בת\"כ כשם שאני פרוש כך אתם תהיו פרושים, דע\"כ לא שייכא פרישה מע\"ז אצלו יתברך. ואפ\"ל עפ\"י מה דאיתא בגמרא חגיגה (דף י\"ג ע\"ב) וכו' אר\"י א\"ר שהלך לכבוש את כל העולם תחת נבוכדנצר הרשע אמר הקב\"ה מי גרם לי שאהיה משמש לע\"ז עוונותיהם של ישראל, ע\"כ. וביאור הדבר הוא עפ\"י מה שפירש\"י ז\"ל עה\"פ (דברים כ\"ח) ועבדתם שם אלהים אחרים עץ ואבן וכו' משאתם עובדים לעובדיהם כאילו אתם עובדים להם, ע\"כ. וה\"נ כן הוא דע\"י שנתן הקב\"ה ממשלה לנבוכדנצר הרשע שהי' עובד אלילים נעשה כביכול כאילו הוא משמש לע\"ז, דמשאתם עובדים לעובדיהם כאילו אתם עובדים להם."},{"passage_id":"vayikru2_18201ad4_p13","passage_content":"היוצא מזה דשייכא בחינת ע\"ז בצד מם אצל הבורא ית\"ש, דע\"י עוונות ישראל הקב\"ה נותן מלכות וממשלה לאומות העולם עובדי ע\"ז, והויא כבתי' ע\"ז, דמשאתם עובדים לעובדיהם וכו'. ומלבד זה עוד ישנה בחינת ע\"ז באופן אחר, דהנה בזמן שישראל חוטאין מתקלקלין צינורי השפע, וההשפעה יורדת לאוה\"ע עובדי ע\"ז, וזהו ענין ע\"ז, כמ\"ש האה\"ח הקדוש בפ' יתרו עה\"פ לא יהיה לך אלהים אחרים, לא תתן להם הויה וכח להיות להם אלהות. נמצא דעוונות ישראל גורמים שיהיה השפע יורד לאומות, ובזה ניתן לעוע\"ז כח והויה, וזהו ענין ע\"ז."},{"passage_id":"vayikru2_18201ad4_p14","passage_content":"ובדברים אלו מובן הת\"כ אם אתם מקדישים עצמכם ע\"י פרישה מע\"ז כמו שפירש\"י ז\"ל, מעלה אני עליכם כאילו קדשתם אותי, כלומר כאילו היתה הפרישה שאני עושה ע\"י מעשיכם, ותקבלו עליהם שכר טוב כאילו עשיתם, וכמאה\"כ ולך ה' החסד וגו' כמבואר. או אינו אלא אם קדשתם אותי הריני מקודש ואם לאו איני מקודש, כלומר שאם לא יהיו ישראל פרושים ומובדלים לגמרי מע\"ז אזי לא עביד קב\"ה פרישה, דהיינו שח\"ו לא יטול את השפע והממשלה מידי העמים עובדי ע\"ז, ת\"ל כי קדוש אני בין מקדשין בק שאין מקדשין, כי בכל אותן ואופן יפסוק הקב\"ה מהם את השפע ותנעל מהם המלכות והממשלה, והאלילים כרות יכרתון ויתוקן עולם במלכות שד-י, ואף אם יהיה הדור כולו חייב יעשה הקב\"ה פרישה זו, אלא דבאופן זה לא יחשב לנו כאילו אנחנו קדשנו אותו כביכול, ורק אם נהיה אנחנו פרושים ומובדלים מע\"ז לגמרי, יעלה עלינו הקב\"ה כאילו קדשנו אותו."}]},{"dvar_torah_id":"vayikru2_4e5a8436","title":"קדושים תהיו וכבוד שמים","summary":"בפרשת קדושים תהיו, מצווה ה' על ישראל לקדש עצמם, ובכך מתקדש שמו בעולם. המדרש מדגיש כי קידוש ה' נובע מקיום מצוות ולא מעונש הרשעים, אך גם אז מתגדל שמו. כפל הלשון 'דבר ואמרת' מייצג את שני סוגי הדיבור בהקשר זה.","contents":[{"passage_id":"vayikru2_4e5a8436_p1","passage_content":"דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו כי קדוש אני ה' אלקיכם. יל\"ד בכפל הלשון דבר ואמרת. גם למה שינה הכתוב לשונו תכ\"ד, דתחלה פתח בדיבור שהוא לשון קושי, והדר כתיב ואמרת שהוא לשון רך."},{"passage_id":"vayikru2_4e5a8436_p2","passage_content":"ב) במד\"ר ר\"פ זו איתא קדושים תהיו וגו' הה\"ד (ישעי' ה') ויגבה ה' צבאו' במשפט תניא אמר רשב\"י אימתי שמו של הקב\"ה מתגדל בעולמו בשעה שעושה מדת הדין ברשעים וכו'. וצ\"ב מאי שייכא דרשה זו דמיירי בדין הקשה שהשי\"ת עושה ברשעים לפרשת קדושים תהיו."},{"passage_id":"vayikru2_4e5a8436_p3","passage_content":"ג) במדרש ילקוט (והוא בת\"כ) איתא קדושים תהיו כי קדוש אני אם מקדישים אתם את עצמכם מעלה אני עליכם כאילו קדשתם אותי או אינו אומר אלא אם קדשתם אותי הריני מקודש ואם לאו איני מקודש ת\"ל כי קדוש אני בקדושתי אני בין מקדשין בין שאינן מקדשין. ולכאורה דברי המדרש הלזה תמוהים מאד כאשר הקשו כל המפרשים, דאיך יעלה על הדעת לומר שאם אין ישראל מקדשים את השי\"ת כביכול אינו מקודש."},{"passage_id":"vayikru2_4e5a8436_p4","passage_content":"ונראה לומר בביאור הענין עפ\"י מה שכתב ק\"ז זלה\"ה בישמח משה ר\"פ ראה לבאר דברי המדרש (ילקוט ר\"פ ראה ומקורו בספרי שם) ברכה וקללה למה נאמר לפי שנאמר את החיים ואת המות נתתי לפניך הברכה והקללה (דברים כ\"ט) שמא יאמרו ישראל כיון שנתן לפנינו הקב\"ה שני דרכים נלך באיזה מהן שנרצה ת\"ל ובחרת בחיים, ע\"כ. ופירש הכוונה דהנה אמרו רז\"ל (אבות פ\"ו) כל מה שברא הקב\"ה בעולמא לא בראו אלא לכבודו וכו'. ולפי העולה על הדעת בהשקפה ראשונה באלו הבוחרים ברע ולא בטוב נעדר ח\"ו כוונתו יתברך בבריאתם, כי אין מתרבה מהם כבוד שמים, ואיך יתכן שתעדר כוונתו יתברך בשום פעם, הלא עצת ה' לעולם תעמוד, אך התשובה בזה כי בוודאי לא נעדרה כוונתו יתברך בשום אופן, כי אף מאנשי רשע ופשע מתרבה כבוד שמים, כי כשהקב\"ה נפרע משונאיו שמו מתגדל ומתקדש ונורא על כל סביביו, רק ההפרש הוא כי בצדיקים שמו יתברך מתגדל ומתקדש בשעת קיומן, כי תהלתו בקהל חסידים כבוד מלכותו יאמרו וגבורתו ידברו, ומאנשי רשע נצמח כבוד שמים בשעת איבודן ולא בשעת קיומן. ולפי זה היה סברא לומר דלא איכפת ליה לקב\"ה באתה דרך נלך, שהרי בין אם הולכין בדרך התורה ובין שחוטאין לפניו יתברך מתגלה כבוד מלכותו בעולם, וז\"ש המדרש שמא יאמרו ישראל כיון שנתן לפנינו הקב\"ה שני דרכים נלך באיזה שנרצה, כי בין כך ובין כך מתגדל ומתקדש שמו יתברך, לכך נאמר ובחרת בחיים, פירוש שאחר שנתן השי\"ת את הבחירה ביד האדם ללכת באחד משני הדרכים והזהיר וענש, ובין כך ובין כך יתעלה מלכותו, מ\"מ גילה לנו רצונו שנלך בדרך הטוב ונבחור בחיים, עכת\"ד ז\"ל."},{"passage_id":"vayikru2_4e5a8436_p5","passage_content":"ועפ\"י זה יתבאר המדרש אם אתם מקדישים עצמיכם מעלה אני עליכם כאילו קדשתם אותי, כי בזמן שישראל מקדשים עצמם בקיום התורה והמצוות, אזי ע\"י מעשיהם הטובים המה מקדשים ש\"ש בעולם, וע\"כ מעלה אני עליכם כאילו קדשתם אותי, ולא כן הדבר בזמן שהקב\"ה עושה דין ברשעים, ובסיבת כן שמו הגדול מתיירא ומתקדש, שהרי אז אין קידוש ה' בא ממעשי הרשעים, כי אם מן הפורעניות הבאה עליהם מן השמים להשיב להם גמול על עוונותיהם. ולפיכך נבחר לפניו יתברך שיתעלה ויתקדש שמו הגדול ע\"י שנלך בדרך הטוב ונקיים מצוותיו, מאשר יתגדל ויתקדש שמו ע\"י שיעשה דין ברשעים."},{"passage_id":"vayikru2_4e5a8436_p6","passage_content":"וזהו שסיים המדרש או אינו אומר אלא אם קדשתם אותי הריני מקודש ואם לאו איני מקודש, כלומר דהו\"א שאין מתעלה ומתקדש ש\"ש בעולם כי אם בזמן שישראל מקיימים תורה ומצוות, ולא בזמן שהוא עושה דין ברשעים, ת\"ל כי קדוש אני בין מקדשין בין אין מקדשין, דאפילו ח\"ו עוברים על מצוות ה' מתגדל כבוד שמו יתברך ע\"י שהוא עושה דין ברשעים, וכדברי ק\"ז זלה\"ה, דאף מאנשי רשע לא נעדרה כוונת הבריאה, כי כשהקב\"ה עושה דין בשונאיו שמו מתעלה ומתרומם ומתקדש."},{"passage_id":"vayikru2_4e5a8436_p7","passage_content":"ובזה יתיישב מה שאמר הכתוב דבר ואמרת, כי הנה לפי מה שנתבאר נמצא כי בענין זה ישנם ב' סוגי דבורים, האחד אומרו יתעלה קדושים תהיו, והוא הציווי לבני ישראל להרבות כבוד שמים בעולם ע\"י קיום התורה והמצוות, וכלפי ציווי זה כתיב ואמרת לשון אמירה רכה, כי יש במצוה זו שכר טוב לעושיה, אמנם מלבד זאת אמר הכתוב דבר המורה על דברים הקשים כגידין, ונתכוון בזה כלפי מה שאמה\"כ כי קדוש אני, וזה רומז על קידוש ה' הנצמח מעשיית הדין ברשעים כאשר ביארנו בכוונת הילקוט, ומש\"ה כתיב דבר לשון קשה. ובדברינו אלו מבוארת גם דרשת המד\"ר (קושיא ב') הה\"ד ויגבה ה' צבאו' במשפט וכו' אימתי שמו של הקב\"ה מתגדל בעולמו בשעה שעושה מדת הדין ברשעים. ואפ\"ל דנתכון ליישב כפל הלשון דבר ואמרת, וגם לבאר אומרו כי קדוש אני, לפיכך מייתי הך קרא ויגבה ה' צבאות במשפט, אלמא כי גם ע\"י עשיית דין ברשעים מתקדש ש\"ש בעולם, ולפיכך אמה\"כ כי קדוש אני בכל ענין בין מקדשין בין אין מקדשין, כמו שנתבאר דאף בזמן שאין ישראל מקדשין שמו ית' במצוות ובמע\"ט, מ\"מ שמו יתברך מתעלה בעולם ע\"י המשפט שהוא עושה ברשעים, וע\"כ נקט קרא דבר ואמרת כי ב' סוגי דבורים ישנם בפרשה זו."}]},{"dvar_torah_id":"vayikru2_f0dd3f82","title":"קדושת ה' ומדת הדין","summary":"בפרשת קדושים תהיו נדרש מהקב\"ה קדושתי למעלה מקדושתכם, שאין בני אדם יכולים להתדמות לו במדת הדין. הקב\"ה מתקדש בצדקה, ובכך יש ללמוד על מידותיו, אך דין ברשעים שמור לו בלבד.","contents":[{"passage_id":"vayikru2_f0dd3f82_p1","passage_content":"דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו כי קדוש אני ה' אלקיכם. במד\"ר (פכ\"ד א') הה\"ד ויגבה ה' צבאות במשפט וגו' (ישעי' ה') תניא אמר ר' שמעון בן יוחאי אימתי שמו של הקב\"ה מתגדל בעולמו בשעה שעושה מדת הדין ברשעים וכו' ע\"כ. וצריך ביאור להבין שייכות דרשה זו דמיירי בפורענות שהקב\"ה מביא על הרשעים לפרשת קדושים תהיו, דלא מיירי הכא כלל בדין שהקב\"ה עושה ברשעים. והנה גם בתנחומא איתא כדרשה הנ\"ל, אלא שהוסיף לדרוש גם סיפא דהאי קרא, וז\"ל, והא-ל הקדוש נקדש בצדקה שהוא מתקדש בעולמו בצדקה שהוא מלמד על ישראל סניגוריא שנאמר (שם ס\"ג) אני מדבר בצדקה רב להושיע אמר הקב\"ה לישראל לעתיד אני מתקדש בכם וכו' ואתם מתקדשים בי שנאמר (ויקרא י\"א) והתקדשתם והייתם קדושים עכ\"ד התנחומא. ולפי זה מובן שפיר מה דשייכא דרשה זו לפרשתן, משום סיפא דקרא דכתיב והא-ל הקדוש נקדש בצדקה, ודריש מיניה שהקב\"ה מתקדש בישראל והם מתקדשים בו. אך בדברי המד\"ר ליכא למימר הכי, שהרי לא הביא אלא רישא דהך קרא דכתיב ויגבה ה' צבאות במשפט ותו לא, והא לא שייכא כלל לענינא דקדושים תהיו כדאמרן."},{"passage_id":"vayikru2_f0dd3f82_p2","passage_content":"ב) עוד איתא במד\"ר (פכ\"ד ט') קדושים תהיו יכול כמוני ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם. והוא פלאי הכי עלתה על הדעת לחשוב כי יוכל יצור להתדמות ליוצרו ולהתקדש כמוהו כביכול, עד דאיצטריך קרא לאפוקי ממחשבה כזו."},{"passage_id":"vayikru2_f0dd3f82_p3","passage_content":"ונראה לבאר הענין עפ\"י מה דאיתא במד\"ר ר\"פ בחקותי (פל\"ה א') עה\"פ אם בחקותי תלכו הה\"ד (תהלים קי\"ט) חשבתי דרכי ואשיבה רגלי אל עדותיך אמר דוד רבש\"ע בכל יום ויום הייתי מחשב ואומר למקום פלוני ולבית דירה פלונית אני הולך והיו רגלי מביאות אותי לבתי כנסיות ולבתי מדרשות הה\"ד ואשיבה רגלי אל עדותיך, ע\"כ. ולכאורה יפלא על דברי המדרש, הכיצד יתכן לומר על אדוננו המלך החסיד ע\"ה שהיה מחשב בכל יום ויום ללכת למקומות אחרים חוץ מבתי כנסיות ובתי מדרשות. ואפ\"ל עפ\"י מה דאיתא בגמרא (גיטין דף ז' ע\"א) שלח ליה מר עוקבא בר חמא לר\"א בני אדם העומדים עלי ובידי למסרם למלכות מהו וכו' שלח ליה קא מצערי לי טובא ולא מצינא דאיקום בהו שלח ליה דום לה' והתחולל לו (תהלים ל\"ז) השכם והערב עליהם לביהמ\"ד והן כלין מאליהן. וכעין זה איתא במסכת ברכות (דף ז' ע\"א) ההוא צדוקי דהוה בשבבותיה דריב\"ל הוה קא מצער ליה טובא בקראי יומא חד שקל תרנגולא ואוקמיה בין כרעיה דערסא ועיין ביה סבר כי מטא ההיא שעתא אלטייה כי מטא ההיא שעתא ניים אמר ש\"מ לאו אורח ארעא למעבד הכי דכתיב (משלי י\"ז) גם ענוש לצדיק לא טוב, ע\"כ."},{"passage_id":"vayikru2_f0dd3f82_p4","passage_content":"ועפ\"י זה יתבאר המד\"ר הנ\"ל, כי הנה דוד המלך עליו השלום היה סובל רבות משונאיו ומרודפיו שהתנכלו לו והיו מצערים אותו מאד, כאשר מבואר בכמה מזמורי תהלים שהוא מתחנן לפני הקב\"ה שיצילהו מיד שונאיו ומרודפיו, והוא מקלל אותם בקללות נמרצות. אכן באמת היה בידו של דוד הע\"ה להענישם בקל ולכלותם כמו רגע, ע\"י שיתן עיניו בהם ויעשה מהם גל של עצמות, דוגמת הא דאיתא בגמרא (שבת דף ל\"ד ע\"א) ברשב\"י נתן בו עיניו ועשאו גל של עצמות, כי גדול כחם של הצדיקים הקדושים להעניש בראייה בעלמא. ולפי שגדול היה צערו ומצוקתו של דוד המלך מתגרת יד אויביו ומרודפיו, לזאת חשב מחשבות ואמר למקום פלוני ולבית דירה פלונית אני הולך, כדי להעניש את שונאיו בהסתכלותו בהם, אבל אחרי כן חזר בו ממחשבה זו והיו רגליו מביאות אותו לבתי כנסיות ולבתי מדרשות, דלאו אורח ארעא למיעבד הכי להעניש את הרשעים, דגם ענוש לצדיק לא טוב, אלא עליו להשכים ולהעריב עליהם לבית המדרש והם כלים מאליהם, וכדשלח לי' ר' אלעזר למר עוקבא."},{"passage_id":"vayikru2_f0dd3f82_p5","passage_content":"וע\"ד זה נבא לביאור המדרשים בפרשתינו, בהקדם מה שכתב בספה\"ק אמרות טהורות על תהלים לפרש הכתוב (תהלים י\"ח) כי שמרתי דרכי ה' ולא רשעתי מאלקי, וזה לשון קדשו, יתכן עם מה ששמעתי פירוש הכתוב (הושע י\"ד) כי ישרים דרכי ה' וגו',  והוא כי יש לאדם להדבק בדרכי ה' מה הוא רחום אף אתה רחום וכו', אמנם מצינו בהקב\"ה כי א' קנא הוא גאות לבש גאה גאה וזה נאסר לאדם, והרשע לומד מהקב\"ה מדות הללו, וזה כי ישרים דרכי ה' צדיקים וגו'. וזה כוונת הכתוב כי שמרתי דרכי ה' לדבק בדרכיו, אבל לא רשעתי מאלקי, ר\"ל מדת הגאוה והקנאה אינם רק לה' לבדו, זה לא למדתי, עכל\"ק. ועתה יתבארו ב' המדרשים הנ\"ל כמין חומר, דהאי מדרשא דסמיך להכא הך קרא ויגבה ה' צבאות במשפמ וגו', ויליף מיניה ששמו של הקב\"ה מתגדל כשהוא עושה מדת הדין ברשעים, הרי הוא כמשלים ומבאר כוונת אידך מדרשא יכול כמוני וכו' ועל קוטב אחד תסוב כוונתם על סגנון זה, דתחלה מבאר המדרש כי כאשר הקב\"ה עושה מדת הדין ברשעים שמו מתגדל ומתקדש בעולם, וא\"כ נמצא כי בקדושת שמו יתברך נכלל גם ענין עשיית דין ברשעים, ולפי זה יש לחוש פן ואולי יעלה על לב האדם כי לפי שאנו מצווים ועומדים להדבק במדותיו של מקום א\"כ גם בענין להתנהג במדה\"ד הקשה עלינו להדבק במדותיו של מקום, ומה גם שאנחנו מצווים קדושים תהיו, ואף ענין עשיית דין יש בה משום קדושת שמו של הקב\"ה כמבואר במד\"ר. ובאמת אין הדבר כן דלא יתכן לבני אדם ללמוד מדה זו ממנו ית\"ש, כי רק הקב\"ה כי לו נאה כי לו יאה להשתמש במדת הדין הקשה, דאצלו משמשות מדת הדין ומדת הרחמים בבת אחת, וכמפורש באותו מקרא עצמו דכתיב ויגבה ה' צבאות במשפט הרי שהזכיר שם הוי-ה שהוא שם הרחמים בעת המשפע, וכן כתיב קרא (תהלים ט') נודע ה' משפט עשה. משא\"כ האדם א\"א לו להשתמש בב' מדות הפכיות גם יחד, ע\"כ אין לו להתנהג במדה\"ד הקשה."},{"passage_id":"vayikru2_f0dd3f82_p6","passage_content":"וזהו ביאור המד\"ר יכול כמוני דהו\"א כי לפי שציוה הכתוב קדושים תהיו נצעוינו לנהוג במדה זו לכל פרמיה וענפיה כמוהו יתברך, ובכללה גם להתנהג במדה\"ד הקשה, ת\"ל כי קדוש אני ה' אלקיכם קדושתי למעלה מקדושתכם, וא\"א לכם להתדמות אלי בכל עניני קדושה, דאין ענין עשיית דין ברשעים מסור ביד בני אדם, כדקאמר ליה ר\"א למר עוקבא השכם והערב עליהם לביהמ\"ד והם כלים מאליהם. והמעה שאין מדה זו נוהגת בבני אדם מבואר בדברי הכתוב, באמרו כי קדוש אני ה' אלקיכם, כלומר דבקדושה זו של עשיית דין ברשעים יכול להתנהג רק הקב\"ה לבדו, משום שהוא נוהג במדת הדין ובמדת הרחמים גם יחד. וז\"ש כי קדוש אני \"ה' אלקיכם\" הוא מדה\"ר ומדה\"ד, משא\"כ בני אדם שא\"א להם בכך אין להם להתנהג במדה זו."},{"passage_id":"vayikru2_f0dd3f82_p7","passage_content":"ובדרך זה מובן היטב מה דמסיים בתנחומא והא-ל הקדוש נקדש בצדקה שהוא מתקדש בעולמו בצדקה וכו', דמשום דברישא דקרא כתיב ויגבה ה' צבאות במשפט, ומדה זו של עשיית דין ברשעים איך ללמוד ממנו ית', על כן קאמר והא-ל הקדוש נקדש בצדקה פירוש דבמדת הצדקה שהקב\"ה מתקדש על ידה צריכים בני אדם להתדבק במדתו של מקום ולעסוק בצדקה."}]},{"dvar_torah_id":"vayikru2_c60d1e16","title":"","summary":"","contents":[{"passage_id":"vayikru2_c60d1e16_p1","passage_content":"שנת ה'תרצ\"ו לפ\"ג"}]},{"dvar_torah_id":"vayikru2_6341cc45","title":"קדושים תהיו: גדרים וסייגים בתורה","summary":"בפרשת קדושים נלמד על מצוות קדושים תהיו, המורה על הצורך בגדרים שסייגו חכמים. אף אנשי דור המדבר, שהיו קדושים, נדרשים לשמור על גדרים אלו כדי שלא יכשלו באיסורים, והזלזול בנטילת ידים מביא לעונש חמור.","contents":[{"passage_id":"vayikru2_6341cc45_p1","passage_content":"דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו כי קדוש אני ה' אלקיכם. פירש\"י ז\"ל (תורת כהנים) מלמד שנאמרה פרשה זו בהקהל מפני שרוב גופי תורה תלויים בה. וכתבו המפרשים דמרבינן לה מדכתיב כל עדת בני ישראל דבמעמד כלם נאמרה, איש מהם לא נעדר. אך הקשו דמה טעם הוצרך הכתוב להודיע בפרשה זו שנאמרה בהקהל, והלא כל פרשיותי' של תורה בהקהל נאמרו כדאיתא במסכת עירובין (דף נ\"ד ע\"ב), וא\"כ אכתי איני יודע מה מלמדני הכתוב באמרו כל עדת בני ישראל."},{"passage_id":"vayikru2_6341cc45_p2","passage_content":"ב) בתנדב\"א רבה (פט\"ו הובא בילקוט ראובני פרשה זו) אי' דבר אל כל עדת בנ\"י וגו' קדושים תהיו כי קדוש אני ה' אלקיכם, מכאן אמרו כל המזלזל בנטילת ידים סימן רע הוא לו ועליו הוא אומר (דברים כ\"ט) והיה בשמעו את דברי האלה הזאת והתברך בלבבו וגו' למען ספות הרוה את הצמאה לא יאבה ה' סלוח לו וגו'. והוא פליאה נשגבה מה שייכא מצות נטילת ידים לפרשתא דא, וביותר יפלא מה ענין האלה האמורה בפרשה נצבים למצות נט\"י (ועי' מ\"ש בזה בזקוקין דנורא שם)."},{"passage_id":"vayikru2_6341cc45_p3","passage_content":"ונראה לומר ביאור הענין עפ\"י מה דאיתא בנדרים (דף כ\"ב ע\"ב) אלמלא חטאו ישראל לא ניתן להם אלא ה' חומשי תורה וספר יהושע בלבד וכו', ופירש הר\"ן ז\"ל שעיקרן של נביאים לא היה אלא להוכיח את ישראל על עבירות שבידם ואלמלא חטאו לא הוצרכו לתוכחות, ע\"כ. והנה כיוצא בדבר זה אתה אומר אף בענין הגדרים והסייגים שהוסיפו חכמינו ז\"ל על מצוות התורה לבל יקרבו לפרוץ פרץ בגוף המצוות, דאלמלא חטאו ישראל לא היה צורך בהם, ורק בסיבת החטאים הוצרכו לגדור גדר ולעשות סייג לתורה. ועפ\"י זה היה מקום לכאורה להניח הנחה סוברת כי אנשי דור המדבר שהיו קדושים וטהורים כמלאכי מעלה (פרקי דר\"א פרק מ\"א) לא היו צריכים לעשיית גדרים וסייגים לקדש עצמם במותר להם, ולהרחיק מצ\"ט שערי היתר למען לא יכשלו בשער אחד של איסור, וכדי להוציא מסברא זו כתבה תורה רבויא יתירא דבר אל כל עדת בני ישראל, לאורויי שאף ישראל שבאותו הדור הרי הם בכלל מצות קדושים תהיו, דגם הם מצווים לקדש עצמם במותר להם, ולעשות גדרים וסייגים כדי שלא יבואו לידי מכשול בגופו של איסור, וכמו שכתבו המפרשים ז\"ל."},{"passage_id":"vayikru2_6341cc45_p4","passage_content":"ולבא אל ביאור המאמר הפלאי הלז (קושיא ב') נקדים לבאר מקרא קודש בפ' נצבים, והיה בשמעו את דברי האלה הזאת והתברך בלבבו לאמר שלום יהיה לי כי בשרירות לבי אלך למען ספות הרוה את הצמאה לא יאבה ה' סלוח לו, ופירש רש\"י ז\"ל למען ספות הרוה וגר לפי שאוסיף לו פורענות על מה שעשה עד הנה בשוגג וכו' שאצרפם עם המזיד וכר וכן תרגם אונקלוס בדיל לאוספא ליה חטאי שלותא על זדנותא שאוסיף לו אני השגגות על הזדונות ע\"כ. ולכאורה קשה וכי כך היא המדה להעביר משוגה לזדון כדי להעניש את האדם על השגגות כאילו עשאן במזיד."},{"passage_id":"vayikru2_6341cc45_p5","passage_content":"ונראה דהנה בפרשת התוכחה האמורה במשנה תורה (פ' כי תבא) אחרי שהכתוב מונה כל הפורעניות כתוב לאמר (בפסוק נ\"ח) אם לא תשמור לעשות את כל דברי התורה הכתובים בספר הזה וכו', וצ\"ב מה מרבה קרא בתיבת \"כל', דברי התורה, ואפ\"ל כי בא הכתוב לרבות את הגדרים והסייגים אשר גדרו חז\"ל להעמיד חומת הדת על תלה לבל יבואו להכשל באיסורי תורה, דאף אינהו בכלל התורה הם, למיקם עלייהו בארור אשר לא יקים, כי באין גדר וגבול יבואו לפרוץ בגופו של איסור."},{"passage_id":"vayikru2_6341cc45_p6","passage_content":"וזאת אפ\"ל בכוונת הכתוב והיה כשמעו את דברי האלה הזאת, היא האלה האמורה בפרשת כי תבא כמו שכתבו המפרשים (עי' באבן עזרא שם), ובדברי האלה האמורים שם כתוב באר היטב כי אף שמירת הגדרים והסייגים אשר תיקנו חכמינו ז\"ל מוסדי דור ודור הרי הם בכלל האלה, כדאמרן שריבה אותם הכתוב מדכתיב \"כל\" דברי התורה הזאת, והתברך בלבבו לאמר שלום יהיה לי כי בשרירות לבי אלך, כלומר שאין הוא חפץ לשמוע דברי חכמים ולקיים גזירותיהם, כי הולך הוא בשרירות לבו הרע לפרוץ את הגדרים, באמרו שלום יהיה לי, כי זדון לבו השיאו דאף בלי שמירת הגדרים יוכל להיות זהיר ונשמר מלהכשל באיסורי תורה, וכל רעה אליו לא תאונה, עליו הכתוב אומר כי בסופו של דבר יכשל בגופו של איסור, ואז למען ספות הרוה את הצמאה, כמו שפירש\"י ז\"ל שיוסיפו לו אף את השגגות על הזדונות, כי כך שורת הדין נותנת, דבעבור שהוא חטא ואשם לפרוץ גדרות עולם ברשע, לעבור על הגזירות והסייגים שעשו חכמים, עבירה גוררת עבירה, עד שבסופו של דבר בא לעבור על איסורי תורה, וכיון שכל השגגות נגרמו לו ממה שעשה בזדון תחלה שמיאן לקיים גזירות חז\"ל במעל ובמרד, על כן יוסיפו לו אף את השגגות על הזדונות, שכולם הם תוצאה משרירות לבו הרע."},{"passage_id":"vayikru2_6341cc45_p7","passage_content":"ועפ\"י זה נבוא לביאור התנדב\"א דהנה נטילת ידים תקנת חכמים היא כדאיתא בשבת (דף י\"ד ע\"ב) דשלמה המלך עליו השלום גזר נטילת ידים לקדש, ואח\"כ הוסיפו חז\"ל בי\"ח דבר לגזור אף על התרומה, והדר חקינו נעילה אף לחולין (עיין חגיגה י\"ח ע\"א), ומשום סרך תרומה נגעו בה שהרי חולין עצמן מותר לאכלן בטומאה. והשתא מבוארים דברי התנדב\"א על נכון, קדושים תהיו כי קדוש אני וגו' מכאן אמרו כל המזלזל בנפילת ידים וכו', עליו הכתוב אומר והיה בשמעו אח דברי האלה הזאת וגו' למען ספות הרוה אח הצמאה לא יאבה ה' סלוח לו, דהנה מצות קדושים תהיו ענינה להזהיר את ישראל על שמירת הגדרים שגדרו חכמים, ולהתקדש במותר להם, ומדכתיב דבר אל כל עדת בני ישראל נתרבו אף אנשי דור המדבר דור דיעה, שעליהם לשמור את הגדרים אשר גדרו חכמים ולהתקדש במותר, ולא יסמכו על מעלתם לומר כי מובטחים הם שלא יכשלו בחטא אף אם לא יזהרו בגדרים ובסייגים, ומכאן למדנו שהמזלזל בנטילת ידים פירוש אף בנפילת ידים לחולין, ואף עפ\"י שנטילה זו אינה אלא תקנת חכמים שגזרו עליה משום סרך תרומה, מ\"מ עליו הכתוב אומר והי' בשמעו את דברי האלה וגו' למען ספות הרוה את הצמאה, דמתוך שיפרוץ גדרם של חכמים יבא להכשל בגוף האיסור, ובדין הוא שיוסיפו לו את השגגות שיכשל בהם אח\"כ על הזדונות, מכיון שמקור ושורש המכשול בא ממה שהזיד לעבור על דברי חכמים. וכבר קדם הכתוב להזהיר אח כל עדת בני ישראל ולו גם אם כגובה ארזים גבהם ותוקף קדושתם חסון הוא כאלונים אל להם להיות בוטחים בחילם, אלא עליהם לשמור את הגדרים והסייגים שגדרו חז\"ל."}]},{"dvar_torah_id":"vayikru2_4f5f52d9","title":"קדושים תהיו ומיתת הצדיקים","summary":"במדרש נאמר כי ישראל ביקשו להסיר המות כדי להיות קדושים. נדונה השאלה מדוע נגזרה מיתה על הצדיקים, והוסבר כי המות הוא חלק מהטבע לאחר החטא, וכי יש צורך בניסיונות כדי להבחין בין צדיקים לרשעים. הצדיקים מאירים את עיני ישראל, אך בשפלות הדור קשה לקיים מצוות קדושים תהיו.","contents":[{"passage_id":"vayikru2_4f5f52d9_p1","passage_content":"קדושים תהיו וגו' במד' פליאה הביאו ק\"ז זלה\"ה ביש\"מ (והוא משמו\"ר פל\"ח) אמרו ישראל אתה גוזר ואומר קדושים תהיו וכו' רבון העולם אתה מבקש שנהא קדושים הסר ממנו המות שנא' (חבקוק פ\"א) הלא אתה מקדם ה' אלקי קדושי ולא נמות אמר להם אי אפשר ה' למשפט שמתו ע\"כ. והוא פלאי וצ\"ב."},{"passage_id":"vayikru2_4f5f52d9_p2","passage_content":"ויתבאר בהקדם מ\"ד בב\"ר (פ\"ט ס\"ה) ראוי היה אדה\"ר שלא לטעום טעם מיתה ולמה נקנסה בו מיתה אלא צפה הקב\"ה שנבוכדנצר וחירם מלך צור עתידין לעשות עצמן אלהות וכו' א\"ל ר\"י א\"כ יגזור מיתה על הרשעים ואל יגזור מיתה על הצדיקים אלא שלא יהיו הרשעים אומרים כלום הצדיקים חיים אלא שהן מסגלין מצות ומעש\"ט אף אנו נסגל מצות ומע\"ט נמצאת עשי' שלא לשמה, ע\"כ. והקשה היפ\"ת דמה בכך אם יעשו הרשעים תשובה שלא לשמה הלא אמרז\"ל (פסחים נ') לעולם יעסוק אדם בתומ\"צ אפילו שלא לשמה שמתוך של\"ש יבא לשמה, א\"כ אדרבה מעליותא איכא אפילו בלימוד תורה של\"ש, ואף לפי מה שחילקו בתוס' שם דתרי גווני שלא לשמה נינהו והלומד ע\"מ לקנטר נוח לו שלא נברא, מ\"מ הכא אילו לא נגזרה מיתה על הצדיקים א\"כ לא היו הרשעים מסגלין מצות ומעש\"ט לקנטר וכדומה שהרי כל עשייתם היא בעבור שלא ימותו, וכה\"ג שפיר דמי לעסוק בתומ\"צ של\"ש, ודמיא להא דאיתא בגמ' (פסחים ח' ע\"ב) האומר סלע זו לצדקה ע\"מ שיחי' בני הר\"ז צדיק גמור. ומצינו שהתוה\"ק מזרזת את ישראל על קיום המצות בהבטחת למען תחיה אתה וזרעך."},{"passage_id":"vayikru2_4f5f52d9_p3","passage_content":"ואפ\"ל הענין בהקדם דברי הרמב\"ן ז\"ל ר\"פ בראשית שהביא שם מ\"ש אנשי הטבע שהאדם היה מעותד למיתה מתחלת היצירה, מפני היותו מורכב מן היסודות וכ\"ד שבא מהרכבה הכרח הוא שיפרדו יסודותיו, ולא יתכן שלא יהי' קצב לחיבורן, והוא ז\"ל דחה דבריהם כי ע\"ד רז\"ל (שבת נ\"ה) אלמלא שחטא לא היה מת לעולם כי הנשמה העליונה נותנת חיים לעד והחפץ האלקי אשר בו בעת היצירה יהיה דבק בו תמיד ויקיים אותו לעד ודע כי אין ההרכבה מורה על הפסד אלא לדעת קעני אמנה וכו' אבל לדעת אנשי האמונה כי העולם מחודש בחפץ אלו-ה פשוט שגם הקיום יהיה בו לעד כל ימי החפץ ההוא ואלולא חטא היה החפץ האלקי שיתקיים האדם לעד, יעיי\"ש באורך. וכ\"כ גם הרמב\"ם ז\"ל בספר המורה כי ערם שחטא היה גם ההרכבה והטבע באופן אחר, וחכמי הטבעיים מכורים רק טבע גוף האדם כמו שהוא עכשיו אחר החטא שכבר נשתנה טבעו, משא\"כ לפני שנגזרה עליו מיתה שהיה גם טבעו ומהותו שונה לגמרי היה באמת ראוי לחיות לנצח, שאי אפשר לדון מדבר שרואין עכשיו על טבע גוף האדם שקודם החטא שלא ראוהו מעולם, יעיי\"ש."},{"passage_id":"vayikru2_4f5f52d9_p4","passage_content":"ובזה פירשתי מ\"ד במד\"ר (ב\"ר פי\"ע ס\"ג) ויאמר הנחש לא מות תמותון דחפה עד שנגעה בו אמר לה כשם שאין מיתה בנגיעה כך אין מיתה באכילה, דלכאורה הוא פלא וכמו שהקשה הגו\"א דמנא ידעה שלא תמות על הנגיעה, והרי נאמר לו ביום אכלך ממנו מות תמות ועדיין לא עבר היום דהא בשעה עשירית חטאו, ועוד דיומו של הקב\"ה אלף שנים והן עוד היום גדול ואפשר עדיין שתתקיים גזירת המיתה על הנגיעה. ופירשתי כי הנה אדם וחוה הרי היו מבינים על שורש כל הבריות וטבעיות הרכבתן וקראו להן שמות כפי שורשן וטבען, וכמ\"ש הכתוב וכל אשר יקרא לו האדם נפש חיה הוא שמו, וכן בחוה כתיב כי היא היתה אם כל חי, ולפיכך היו מכירים ומבינים כי לפי עבע גופם ותכונתו המה מעותדים לחיות לנצח, ולזה כאשר ראתה כי גם אחרי אשר נגעה בעץ הדעת לא נשתנה עוד תכונת גופה ועדיין נצבת היא על יסודה הקודם, מזה שפטה כי לא נגזרה עליה מיתה, דאילולא זאת היתה משתנית מיד טבע הרכבתה להיותה מעותדת למות, ולז\"א כשם שאין מיתה בנגיעה כך אין מיתה באכילה."},{"passage_id":"vayikru2_4f5f52d9_p5","passage_content":"ועפי\"ז יתבאר המד\"ר הנ\"ל, דהנה אחר החטא הרי נשתנה טבע הרכבתו של האדם, והיסודות שממנו הורכב עומדין להתפרד, וכן נקבע הטבע לדורותיו אחריו להיותם מעותדין למיתה, בעבור כי טבע יסודותיהן יתפרדו, וא\"כ לו חפץ ה' לעשות שהצדיקים יחיו לנצח היה צריך לעשות לזה נס חוץ לדרך הטבע, כי לפי הטבע המה ראויין למות. ואף כי למען הצדיקים ודאי היה ראוי לעשות נס הזה, אך אילו היו הרשעים רואין שאין הצדיקים מתים היו עושין גם הם מצות ומעש\"ע שלא לשמה אך ורק למען מלע נפשם מיד שאול, כדי שגם להם עשה יעשה הקב\"ה נס הזה להחיותם חיים נצחיים, וזהו דבר שא\"א וכמ\"ש הרמב\"ן (סו\"פ עקב) כי אין הקב\"ה עושה נסים לטובה או לרעה רק לצדיקים גמורים או לרשעים גמורים אבל הבינונים כדרך מנהגו יעשה בהם טובה או רעה כדרכם וכעלילותם, עכל\"ק. עכ\"פ לזכות לזה שיעשה להם הקב\"ה נס כזה צריך שיהיה באמת לשמה ולא סגי אם הוא שלא לשמה, ואף אם יעשו הרשעים חבילות מצות כדי למלע נפשם ממות עכ\"פ הוא שלא לשמה וא\"א להם לזכות שיעשה להם הקב\"ה נס לשנות טבעם, שיחיו לעולם, ואם אמנם לא יעשה ה' שיחיו אלא הצדיקים הגמורים והעושים שלא לשמה ימותו אזי יהיה ח\"ו תרעומות כביכול על הבוי\"ת מה נשתנו אלו מאלו, דהרי אי אפשר לבנ\"א להבחין מי הוא העושה באמת לשמה, ועד כמה הוא לשמה באמת, ואין מכיר בכך אלא הבוי\"ת לבדו, וכדי שלא יבואו להרהר אחרי עדותיו ית' לכן גזר מיתה על כל בנ\"א מלך במשפט יעמיד ארץ ומקרה אחד לצדיק ולרשע והחיים כולם יודעים שימותו, עדי יתוקן עולם במלכות ש-די ומלאה הארץ דיעה את ה' ורוח הטומאה יעבור מן הארץ, אזי יתקיים בלע המות לנצח, וכמו שהיה מעותד מלפני החטא, והבן."},{"passage_id":"vayikru2_4f5f52d9_p6","passage_content":"ועתה נבוא לבאר הפליאה המוצגת בפתח דברינו שאמרו ישראל אתה גוזר ואומר קדושים תהיו הסר ממנו המות וכו',  דהנה מ\"ע של קדושים תהיו ה\"ה נצחית ונוהגת בכל דור ודור, ולכאורה יוקשה איך אפשר בדור שפל כמו שאנו היום לזכות להגיע למעלת קדושים, ובפרט לפי' הרמב\"ן ז\"ל קדושים תהיו שהכוונה קדש עצמך במותר לך להתנהג בדרך החסידות והפרישות, כמה קשה בדורות השפלים הללו להגיע לזה, והרי בחומרות ובפרישות צריך האדם זהירות גדולה לבל יטעה ויכשל, וכמו שפירש בספה\"ק אגרא דכלא (פ' קרח) מה שאמר דוד המע\"ה שמרה נפשי כי חסיד אני ע\"ד מאמרם ז\"ל (קידושין ל' ע\"ב) אם פגע בך מנוול זה משכהו לביהמ\"ד וכו' דהיצר מסיתו לעבירה באמור לו בפיתוייו שהוא מצוה, ולזה העצה היעוצה מרז\"ל אם יפתה אותך באמרו שהוא מצוה משכהו לביהמ\"ד, ששם מרחיבין תורה ותלמוד מפי סופרים ומפי ספרים, אם הוא מכלל התרי\"ג מצות וענפיהם, ותראה שזה פיתוי היצר אזי לא יוכל לך, אך אם המתפתה הוא איש חסיד אין תקנה במשיכה לביהמ\"ד, כי יאמר לו היצר הגם שאין הענין הזה מבואר בתורה הלא חסיד אתה מתנהג בחסידות לפנים משוה\"ד, והענין הזה הוא מכלל החסידות דלפנים משוה\"ד, הגם שאינו מבואר בתנ\"ך ובדברי רז\"ל, ולז\"א דוד שמרה נפשי כי חסיד אני ולא מהני נגד היצה\"ר משיכה לביהמ\"ד, באמור לו אתה חסיד עשה לפנים משוה\"ד, ע\"כ. וכעי\"ז כתב האוה\"ח הקדוש עה\"כ אם בחקותי תלכו (אופן ו') ע\"ד אמרם ז\"ל ולא ע\"ה חסיד פירוש שאסור לע\"ה להתנהג בחסידות שיעשה חומרות וגדרים כמנהג החסידים כי לפעמים יעשה חומרא בדבר שהוא אדרבה עבריין וכו', וכמו ששמענו שהיה מעשה כן והן כדומה לזה ציוו חז\"ל שאין לע\"ה להתנהג במדת חסידות, עכדה\"ק."},{"passage_id":"vayikru2_4f5f52d9_p7","passage_content":"עכ\"פ בחומרות וזהירות יתירות אפשר להכשל חלילה ולהלכד ברשת היצר, ותחת מצוה יעשה עבירה, ולבבו ידמה כי הנהו חסיד ועושה לפנים משוה\"ד, וכמה קשה הוא בדור שפל כזה לקיים קדושים תהיו קדש עצמך במותר לך, כי אפילו בגופי תורה רבו כמו רבו האומרים לטוב רע ולרע טוב ומהפכין דא\"ח, ועאכו\"כ בדברים אשר לא כתובים בתורה בפירוש אפשר בקל לטעות ולהכשל. וביארתי עד\"ז מה שהוכיח מרע\"ה את בני דורו דור דיעה הן בעודני חי עמכם ממרים הייתם עם ה' ואף כי אחרי מותי, וארז\"ל (ב\"ר פצ\"ב ז') זה אחד מעשרה ק\"ו שבתורה, והקשה המהרש\"א (סנהדרין ל\"ז) מהנהו בריוני דהוו בשיבבותיה דר\"ז והוו מצערו ליה טובא וכי נח נפשי' דר\"ז אמרי עד האידנא הוה ר\"ז בעי רחמי ענן השתא מאן בעי רחמי עלן והרהרו בלבייהו ועבדו תשובה. וכמו\"כ איכא למיפרך מאי ק\"ו הוא זה אדרבה דלמא יאמרו ישראל עד האידנא הוה משה בעי רחמי עלן השתא מאן בעי רחמי עלן ויהרהרו בתשובה. ופירשתי בשנדקדק לישנא דקרא ממרים הייתם \"עם\" ה', ולכאורה כיון שהם ממרים הרי הם \"נגד', ה' ולא \"עם\" ה', אכן הכוונה שהיה מרע\"ה מוכיחן על שהיו נמצאין אז בימיו כעדת קרח ודומיהן שהיו מהפכין דא\"ח לדיעות הפכיות, ואמרו שכ\"ה רצון הבוב\"ה וכן צוותה תורה, ולז\"א ממרים הייתם \"עם\" ה', היינו שאמרו שכן הוא רצון הבוי\"ת וזהו כבוד שמים, והוציאו מן התורה את ההיפך, ויפה כח הק\"ו הן בעודני חי עמכם להאיר עיניכם ולהעמיד אתכם על האמת עכ\"ז ממרים הייתם \"עם\" ה' לסלף דא\"ח בזדון, עאכו\"כ כי אחרי מותי שלא יהיה מי שיגלה את האמת. ול\"ד להנהו בריוני שהכירו בחטאם רק שלא היה בידם לכבוש יצרם, משא\"כ הם סילפו בזדון את דברי מרע\"ה ותוה\"ק ותלו בו בוקי סריקי, ק\"ו כי אחרי מותו שלא יהיה מי שיברר את האמת יוסיפו להמרות."},{"passage_id":"vayikru2_4f5f52d9_p8","passage_content":"וכ\"ה בכל דור ודור שרבו המזייפים להפוך דא\"ח ואומרים לרע טוב ולטוב רע ומענה בפיהם שמעשיהם על פי התורה, אולם אף על פי כן היו נמצאין עוד בכל דור יחידי סגולה שהעמידו את הדת על תילה והאירו את העינים, וכמו שכתב בחובת הלבבות (שער הפרישות פרק ב') שאפילו אז בדורות הראשונים שרוב אנשי התורה נטו מן התורה ורחקו מאור האמת עד אשר חשבו דרכו הרעה כי היא הטובה ותעותו כי היא הישרה וכו' והגיע היצר הזה ברוב אנשי התורה וכו', והיה בדין בעבור זה שיהיו באנשי התורה אנשים יחידים נושאים הפרישות המיוחדת ומקבלים תנאי' להועיל בם אנשי התורה וכו', וכמ\"ש לולא משה בחירו עמד בפרץ לפניו וכו', יעיי\"ש באורך דבה\"ק שכ\"ז הגיע אף בגופי התורה, ועאכו\"כ בפרישות המיוחדת וקדש עצמך במותר לך כמה קשה לכוון אל האמת. ואם בדורות הראשונים הגיע אליהם ככה מה נאמר בדורות השפלים האלו שנבאו חכז\"ל (שבת קל\"ח) שעתידה תורה שתשתכח מישראל וכו' שלא ימצאו הלכה ברורה במקו\"א, זה אומר בכה וזה אומר בכה, ובפרט בעניני קדש עצמך במותר לך איך אפשר להגיע אל האמת איזה אסור ואיזה מותר, כי אם א\"א לכוון אל האמת והלכה ברורה בגופי תורה המפורשים ומבוארים, עאכו\"כ בקדש עצמך במותר לך מי יוכל להבחין מה נכלל במצות קדושים תהיו ולהיפך באיזה ענין אסור להחמיר."},{"passage_id":"vayikru2_4f5f52d9_p9","passage_content":"וזהו ביאור המדרש פליאה אמרו ישראל אתה גוזר ואומר קדושים תהיו הסר ממנו המות וכו', דהנה אם לא היתה נגזרת גזירת מיתה בהחלט על כל בנ\"א לרבות הצדיקים, והיו נשארין אתנו בחיים הצדיקים קדושי עליונים מדורות הקודמין שהאירו פני תבל בקדושתם והאירו עיניהם ולבם של ישראל בכל העולם, אזי בודאי היה לנו פנים אחרות, והיינו יודעים אחה דרך ישכון אור, כי אף בדור שלפנינו היו עוד קדושי עליונים שהתחממו ישראל לאורן, ועל אכו\"כ בדורות ראשונים שזרחה שמשן של התנאים והאמוראים ורבנן סבוראי ואחריהם הגאונים והפוסקים גדולי וצדיקי הדורות, שמהם יצאה תורה והוראה לישראל, כל רז לא אניס להו והארץ האירה מכבודם. ואילו זכינו שישארו בחיים עמנו היום היינו יודעים ומשיגים בבירור מוחלט גדר מצוה ומה נכלל בקדש עצמך במותר לך, ולא היינו נתעים לחשוב על עבירה כי היא מצוה וחוב קדוש. וז\"ש המד\"ר שטענו כלל ישראל רבש\"ע אתה מבקש שנהא קדושים שה\"ה מצוה נצחית, ובכל דור ודור מבקשין מאתנו שנהא קדושים, ואיך אפשר להגיע לזה, אלא הסר ממנו המות שישארו אתנו בחיים כל הצדיקים והקדושים מדורות הקודמין ויאירו עינינו, ואזי נוכל להיות קדושים ונדע את הדרך נלך בה. אבל הבוכ\"ע א\"ל דזה א\"א, ה' למשפט שמתו, ומלך במשפט יעמיד ארץ, מטעמים הכמוסים לפניו יתברך, והיינו טעמא דמקרה אחד לצדיק ולרשע וכנ\"ל במד\"ר, והוא יתברך רואה כן לטובה עבור נסיונות הדור, ויש במדרש שכשמסתלקין הצדיקים אזי הקב\"ה מרבה השגחתו על בנ\"י משל לאוהבו של מלך שנסתלק אמר המלך עד עכשיו היה אוהבי משגיח על בני מעתה צריך אני בעצמי לשים עיני עליהן."},{"passage_id":"vayikru2_4f5f52d9_p10","passage_content":"וזאת נחמתינו בעניינו כי אף בשפלותינו המר הזה לא עזבנו ה' אלקינו והוא עמנו בכל צעדינו, וכמו שביארתי המד\"ר פרשת לך משל לאחד שהיה עובר ממקום למקום וראה בירה דולקת אמר תאמר שהבירה זו בלא מנהיג הציץ עליו בעל הבירה וא\"ל אני הוא בעל הבירה כך לפי שהיה א\"א אומר תאמר שהעוה\"ז בלא מנהיג הציץ עליו הקב\"ה וא\"ל אני הוא בעל העולם, והקושיא מבוארת דהיתכן שעלתה על מחשבתו של אאע\"ה להסתפק ח\"ו שהעוה\"ז בלא מנהיג אחרי כל הנסיונות שעברו עליו ושכבר הושלך לכבשן האש עבור האמונה, וביארתי דאיתא במדרש אל הארץ אשר אראך שהראה הקב\"ה את ארץ ישראל לאאע\"ה עד סוף כל הדורות, והרי ראה כל המאורעות וכל מה שיעבור על אר\"י ועל בנ\"י במשך כל הדורות, וגודל שפלות הדור שנשתכחה תורה מישראל ולא נשארו אתנו מנהיגים שיאירו עינינו ומצב האמונה הרופפת בידי ישראל אין מי יורה דיעה ומי יבין שמועה, וזהו בירה דולקת שמלהעת האש בכל סביבותינו, תמה תאמר שהבירה הזו בלא מנהיג שאם הניח הבוכ\"ע את העולם בלא מנהיג איך יתקיימו בנ\"י נגד שטף מים הזדונים, הציץ עליו הקב\"ה וא\"ל אני הוא בעל הבירה כי גם בגודל שפלות מצב הדור אם רוצין האמת ומבקשין מאת בורא כל העולמים שיזכו להגיע אל האמת, אזי הבוכ\"ע חונן דעת בס\"ד להגיע אל האמת."},{"passage_id":"vayikru2_4f5f52d9_p11","passage_content":"ועד\"ז פירשתי הא דתנן בסוף מסכת סוטה אחר שמונה והולך שפלות דור האחרון מסיים אין לנו על מי להשטן אלא על אבינו שבשמים, ולכאורה וכי מלפנים בדור זכאי סמכו על אחר זולתי הבוכ\"ע והאם גריעותא היא זאת להשטן על אבינו שבשמים, אכן מלפנים היו צדיקים וקדושי עליונים שסייעו לבנ\"י להתקרב אל אבינו שבשמים, וכידוע מק\"ז היש\"מ זלה\"ה (מובא ביט\"פ מאמר אבני זכרון אות י\"א) שבבואו בפעם הראשונה ללובלין היה קשה בעיניו התנהגות החסידים וכו' והתפלל במחשבתו אנא ה' הושיעה נא בעת בואי אל הצדיק יורני תי' נכון וכו', וכבר ארז\"ל הבא לטהר מסייעין אותו לא אמרו מסייע אלא מסייעין לשון רבים משמע שהכל מסייעין א\"כ גם הצדיק יסייע אותו, וכאשר בא אל בית רבו הקדוש מיד פתח פיו כי באמת לא היה ראוי לגלות הדבר אבל הלא כבר אמרו חכמים הבא לטהר מסייעין אותו לא אמרו מסייע כ\"א מסייעין וכו' א\"כ גם אנו צריכין לסייע יעיי\"ש. וזהו הכוונה בדברי חכז\"ל אין לנו ע\"מ להשטן אלא על אבינו שבשמים, כי הן אמת שבכל הדורות היו מסייעין, אמנם בשפלות מצב הדור כהיום שאין מי שיסייע אזי אין לנו ע\"מ להשטן כ\"א על אבינו שבשמים שהוא לבדו המסייע ואין זולתו, ולולא זאת לא היתה ח\"ו פליטה לשארית ישראל. והשי\"ת יעזור שנזכה להשיג את האמת ונזכה שיתקדש ש\"ש על ידינו, ונזכה לעשות תשובה שלימה להבוכ\"ע ונזכה לעשות הכנת טהרה כדבעי בימים אלו שהם הכנה לקבלת התורה, ונזכה לקבלת התורה באמת, ונזכה לעשות רצון הבוב\"ה ונקדש ש\"ש ברבים, ויהיה מאתנו נח\"ר להבוכ\"ע, ונזכה במהרה לראות הישועה והגאולה השלימה האמיתית בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru2_b990ec3e","title":"קדושים תהיו: חובת המנהיגות בישראל","summary":"בפרשה זו נדונה חובת הקדושה של ישראל, והקשר בין חטאי העם למנהיגותם. המפרשים עוסקים בשאלת סמיות העיניים של בתי הדין, ובתופעת נביאי השקר המטעים את העם. יש להבחין בין אמת לשקר ולשוב בתשובה שלימה.","contents":[{"passage_id":"vayikru2_b990ec3e_p1","passage_content":"דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו כי קדוש אני ה' אלקיכם. דקדקו המפרשים בכפל הלשון דבר ואמרת. גם צריך טעם על ששינה לשונו מדיבור קשה לאמירה רכה באותו פסוק עצמו."},{"passage_id":"vayikru2_b990ec3e_p2","passage_content":"ב) בסוף הפרשה כתיב ואל בני ישראל תאמר איש איש מבני ישראל אשר יתן מזרעו למולך מות יומת עם הארץ ירגמוהו באבן כי מזרעו נתן למולך למען טמא מקדשי ולחלל את שם קדשי, ואם העלם יעלימו עם הארץ את עיניהם מן האיש ההוא בתתו מזרעו למולך וגו', ושמתי אני את פני באיש ההוא וגו'. וצ\"ב מה שכינה הכתוב את ישראל בפרשה זו בשם עם הארץ, ולא מצינו כזאת במקום אחר שתכנה אותם התוה\"ק בלשון זה. ורש\"י ז\"ל פירש עם הארץ שאם אין יכולת בבית דין להמיתו עם הארץ מסייעין להם, ד\"א עם שבגינו נבראת הארץ, ד\"א עם שעתידין לירש את הארץ ע\"י מצוות הללו. ואכתי קשה דהלא כ\"כ ניתן לדרוש גם בשאר מקומות, ומאי שנא הכא דקארי לה. ומלבד זאת קשה לפי פירושי רש\"י ז\"ל, דמה נאמר להלן בקרא דכתיב ואם העלם יעלימו עם הארץ, דהתם לא שייך לפרש כפירושיו של רש\"י ז\"ל עם שבגינו נבראת הארץ וכו', שהרי כתוב זה מיירי כשהם חוטאים בהעלימם עין מן הפושעים, ולא שייך לספר בשבחן ומענתן שבגינן נברא הארץ וכו'. ואף לפי פירושא קמא שכתב רש\"י ז\"ל שאם אין כח בבי\"ד עם הארץ מסייעין אותן נמי קשה, מה שייך בהעלמת עין שיהיו עם הארץ מסייעין להם לבית דין, והלא ביד בית דין הדבר מסור אם לדון את החוטא כרעתו או להעלים עיניהם ממנו. ובדברינו להלן יתבאר באופן אחר מה שאמה\"כ בפרשה זו עם הארץ, ולדרכנו יובן מה דכתיב להלן בפרשה ואם העלם יעלימו עם הארץ."},{"passage_id":"vayikru2_b990ec3e_p3","passage_content":"ד) אם העלם יעלימו וגו' פירש\"י ז\"ל אם העלימו בדבר אחד סוף שיעלימו בדברים הרבה אם העלימו סנהדרי קטנה סוף שיעלימו סנהדרי גדולה. ובתו\"כ איתא אם העלימו בי\"ד אחד סוף שיעלימו הרבה בתי דינין. והקשו המפרשים מדוע נענשים הרבה בתי דינים וכן סנהדרי גדולה בהעלמת עינים בעבור שהעלים אחד מן הבתי דינים עיניו מן הפושעים, ואף שאמרו ז\"ל עבירה גוררת עבירה, זה שייך בבעל עבירה עצמו, שהמלאך הנוצר מעוונו מסיתו להפילו ולהכשילו בשאר עבירות, אבל הכא אם ב\"ד אחד חטא מה פשעם ומה חטאתם של שאר בתי דינין, שיכשלו גם המה בהעלמת עינים בעבורם."},{"passage_id":"vayikru2_b990ec3e_p4","passage_content":"ונראה לומר בביאור הענין בהקדם לפרש מאמרי הכתובים בנבואת ירמיה (פרק י\"ד) אשר היה דבר ה' אל ירמיה על דברי הבצרות וגו' ויאמר ה' אלי אל תתפלל בעד העם הזה לטובה וגו', כי בחרב וברעב ובדבר אני מכלה אותם, ואומר אהה ה' אלקים הנה הנביאים אומרים להם לא תראו חרב ורעב לא יהיה לכם כי שלום אמת אתן לכם במקום הזה, ויאמר ה' אלי שקר הנביאים נבאים בשמי לא שלחתים ולא ציויתים ולא דברתי אליהם. וביארו המפרשים ז\"ל כי ירמיהו רצה ללמד זכות על ישראל בזה, באמרו מדוע יכלו כל העם ואין עליהם אשם, כי הנה נביאי השקר מתעים אותם בכזביהם באמרם אל תיראו וגו', כי שלום אמת אתן לכם וגו',  ולזה חושבים ישראל שמעשיהם מרוצים לה', ומהראוי להביא העונש על הנביאים ההם בלבד. ולכאורה לפי זה יש להבין מה השיב הקב\"ה לירמיה על כך, במה שאמר לו שקר הנביאים נבאים, וכי לא ידע ירמיה ששקר בפיהם, אנא שנתכוון ללמד זכות על ישראל שאין לשית עליהם חטאת, באשר טעו אחרי נביאי השקר וסברו כי אמת יהגה חכם."},{"passage_id":"vayikru2_b990ec3e_p5","passage_content":"אמנם הרד\"ק ביאר שם בארוכה כי היה לאותם נביאי השקר כח להגיד עתידות, ונתברר כי צדקו דבריהם בכמה ענינים, ובזה יכלו להטעות את ישראל שלא יפחדו מדברי ירמיה שהזהירם כי הם עתידים נהענש, כי אמרו להם שהמה רואים במראה הנבואה שלא יהיה חרב ורעב כי אם שלום אמת, ובדבריהם אלה היו מיפים להם מעשיהם הרעים, שכל רעה אליהם לא תאונה. וזהו שהשיב לו הקב\"ה לירמיה, כי אעפ\"י שהנביאים התעו אותם במשאות שוא ומדוחים, מ\"מ היה להם להבחין בין נביאי אמת לנביאי שקר, כי נביאי האמת מעמידים אותם על תורת משה, ונביאי השקר מיפים להם עבודה זרה, שזהו ביטולה של תורה. ואעפ\"י שנוכחו ישראל לדעת כי נתקיימו כמה דברים שהגידו נביאי השקר בעתידות, עכ\"ז היה להם לתלות הדברים ההם בקסם ולא בנבואה, כי הלא דבריהם מכוונים לביטול התורה, ודינם כמסיתים לעבוד ע\"ז, שאפילו יעשה אותות ומופתים לקיים דברי הסתתו אמרה תורה יומת כי דבר סרה. וכבר אמר הכתוב הטעם למה מתקיימים האותות והמופתים ההם של נביאי השקר וקוסמי קסם, כי מנסה ה' אתכם, עכת\"ד הרד\"ק ז\"ל."},{"passage_id":"vayikru2_b990ec3e_p6","passage_content":"ולי נראה לומר ביאור הכתובים האלה בהקדם דברי ק\"ז זלה\"ה בישמח משה פרשת שופעים לפרש מאה\"כ אשר ידבר הנביא בשם ה' ולא יהיה הדבר ולא יבא הוא הדבר אשר לא דברו ה' בזדון דברו הנביא וגו', וזלה\"ק, והנראה כי מצינו באחאב שיצא רוח נבות ואמר והייתי רוח שקר בפי כל נביאיו (מלכים א' כ\"ב), וכן נמצא לפעמים שבא משחית ושד ומדבק באחד ואומר לו עתידות, והוא סובר שרוה\"ק אתו, הכי יהיה חייב מיתה על זה, הא אין הקב\"ה בא בטרוניא עם בריותיו, וא\"כ איך נהרוג נביא שקר, דלמא היה כזה ואינו חייב כלל בדבר הזה, כי מטעי קא טעי. אך נקדים מאמר חז\"ל בסנהדרין (דף מ\"ד ע'א) גבי יהושע שאמר הלנו אתה אם לצרינו (יהושע ה') והא אין שואלין בשלום בלילה חיישינן דלמא שד הוא ומשני שאני הכא דא\"ל כי אני שר צבא ה', ודלמא משקר, גמירי דלא מפקי שם שמים לבטלה, ע\"כ. וזהו הפירוש אשר ידבר הנביא בשם ה' ולא יהיה הדבר וכו' הוא הדבר אשר לא דברו ה', דהא לא בא הדבר, וגם שד לא הטעה אותו, רק בזדון דברו הנביא דהא לא מפקי ש\"ש לבטלה, ע\"כ חייב מיתה, לכך באמת אינו חייב מיתה רק כשאומר בשם ה', עכ\"ד ז\"ל. וכעין בחינה זו כתב גם האה\"ח הקדוש באופן אחר, עפ\"י מה שאמר הנביא במעשה יהושפט ואחאב במלחמת רמות גלעד, שכל הנביאים פה אחד דברו לאחאב עלה והצלח, ומדברי מיכיהו בן ימלה נתגלה שרוח יצא מלפני ה' לפתות את אחאב לעלות וליפול במלחמה וכו'. הנה הדברים אשר העיר ה' בנועם דבריו לפי שהכל צפוי לפני הבורא, שיבא זמן שתצא רוח מלפניו ותטעה הנביאים, והגם ששקר דברו עכ\"ז אנוסים הם, לזה כשבא לצוות עונש הנביא הקדים ואמר אך הנביא \"אך\" מיעוט, נביא כיוצא בזה וכו', אבל נביא שדבר שקר ולא הזיד וכגון שהטעהו רוח נבות, שזה אין עליו אשמת דבר וכו'. ומעתה כאן הבן שואל במה נדע הדבר וכו', אמר אשר ידבר הנביא וגו', פי' אם הנביא יאמר נבואתו בשם ה', והוא מה שדקדק לומר בשם ה' ולא יהיה הדבר וגו', אז תדע כי בזדון דברו הנביא, פירוש ולא בא דברו מצד רוח שהטעתו, והטעם כי לא ינוח רוח שקר בשם ה' הנכבד, כי ה' אלקים אמת וכו', עיי\"ש בדברי קדשו באורך."},{"passage_id":"vayikru2_b990ec3e_p7","passage_content":"היוצא מדברים אלו כי כמה סיבות ישנם לזה אשר נתן ביד נביאי השקר לפתות את ישראל בכזביהם, ובכחם להראות אותות ומופתים, וכבר ביארנו בדברינו בכ\"מ מה הם הסיבות המחזקות כוחן של נביאי השקר להטעות אחריהם את ישראל (ועי' בקונטרס על הגאולה ועל התמורה סימן ע\"ח). ואם בזמן הנביאים היה הדבר במציאות שיעמדו נביאי שקר ויראו אותות ומופתים לחזק דבריהם, עאכו\"כ אחרי שכבר בטלה נבואה, ואין לנו שיור רק דעת תורה לחוד, וודאי שצריכין להזהר מאד להתייגע ביגיעה גדולה ולברר בדעת צלולה וישרה הלכה ברורה לאמתה שנ תורה, ובלא\"ה בקל אפשר להכשל ולנטות מני הדרך, כי בנגיעה מעטה נסמין עיניו של אדם."},{"passage_id":"vayikru2_b990ec3e_p8","passage_content":"ובספרי ויואל משה (ח\"א סימן ק\"נ) ביארתי כי עוונות הדור המה הגורמים לסמות עיני המנהיגים, כדאיתא בגמרא (ב\"ק דף ע\"א ע\"א) כד רגיז רעיא על ענא עביד לנגדא סמותא. והנה בשיטה מקובצת הביא פירוש הר\"ר יונתן ז\"ל וז\"ל, כשהרועה רוצה להנקם מן העזים המקציפות אותו בכל עת, עביד לנגדא סמותא, לוקח מן העז הסומא שבעדר ותולה לה זוג בצוארה וכו', ע\"כ. ולפי הנראה מדבריו הנמשל הוא שהקב\"ה ממנה לישראל פרנסים שמתחלת התמנותם אינם מהוגנים. אכן מדברי רש\"י ז\"ל לא משמע הכי, שפירש עביד לנגדא סמותא לעז המושכת מנקר עיניה ונכשלת ונופלת בבורות והעדר אחריה כך כשהמקום נפרע משונאי ישראל ממנה להם פרנסים שאינם מהוגנים. מדנקט במשל לעז המושכת מנקר עיניה, משמע דגם הנמשל בהכי קמיירי, שמתחילה היו המנהיגים טובים, אלא שבעבור קצף הקב\"ה על הצאן הוא מסמא עיני המנהיגים. וכן מטין דברי הגמרא דקאמר עביד לנגדא סמותא, משמע שאחרי קצפו הוא מסמא עיניה. ובחינת סמיות העינים היא ע\"ד שאמרו ז\"ל במד\"ר פרשת וירא (פרשה נ\"ג) עה\"פ ויפקח אלקים את עיניה א\"ר בנימין הכל בחזקת סומין עד שהקב\"ה מאיר את עיניהם מן הכא ויפקח וכו', כלומר שהבאר ההיא שראתה היתה ונמצאה שם מקדם, אלא שהיא לא ראתה אותה עד שפקח הקב\"ה את עיניה, וכמו כן אין האדם זוכה לראות האמת כי אם בעזר השי\"ת הפוקח עיניה עורות להבחין בין טוב לרע, ובזמן שהדור חייב אין המנהיגים זוכים לכך, וממילא עיניהם סמויות."},{"passage_id":"vayikru2_b990ec3e_p9","passage_content":"ואפ\"ל עוד בביאור אומרם עביד לנגדא סמותא דאין המכוון בזה שהקב\"ה מסמא עיני המנהיגים, אלא ע\"ד שכתב המהרש\"א ז\"ל (במסכת מכות דף י') במה שאמרו ז\"ל בדרך שאדם רוצה לילך מוליכין אותו, דאין הכוונה שהקב\"ה בעצמו מוליך את האדם בדרך רעה ח\"ו, כי מפי עליון לא תנא הרעות, אלא שע\"י העבירה שהאדם עושה נברא מנאך רע המסית את האדם להרע. וזהו שאמרו מוליכין אותו, פי' המלאכים שנבראו מחטאיו מוליכין אותו נחטוא, עכ\"ד ז\"ל. ובדרך זו י\"ל הכוונה במאמר הגמרא עביד לנגדא סמותא, כלומר שעוונות הדור מסמין עיני המנהיגים שלא יראו האמת. וכדבר הזה היה גם בימי ירמיהו, שניתנה רשות לנביאי השקר לפתות את ישראל בנבואתם, כי שלום יהיה להם, והיה בידם הכח לעשות אותות ומופתים לחזק נבואתם, כי עוונות ישראל גרמו לסמות עיני מנהיגיהם ולהטעותם בדברי שקר, ואילו לא היו בני הדור ההוא חוטאים ופושעים כ\"כ, לא היו מניחים מן השמים לנביאי הבעל נביאי השקר למשוך לבב ישראל אחריהם."},{"passage_id":"vayikru2_b990ec3e_p10","passage_content":"ובזה מבוארים הכתובים בנבואת ירמיה, כי הנה ירמיה הנביא העתיר בעד ישראל ולימד עליהם זכות כי אינם אשמים בחטאותיהם, באשר נביאי השקר גרמו להם כל אלה, ומה היה בידם לעשות, הלא לא יכלו להתייצב כנגדם, מאחר שטעו והאמינו לדברי נבואתם. ועל כך השיב לו הקב\"ה שקר הנביאים נבאים בשמי לא שלחתים ולא צויתים ולא דברתי אליהם וכו', כלומר שאין בכך די השב להסיר האשמה מעל ישראל משום שתעו אחרי נביאי השקר, שהרי הם בעצמם גרמו לכך בחטאותיהם שינבאו להם הנביאים שקר, כמו שנתבאר כי בעוונות הדור נענשים ישראל בסמיות עיני המנהיגים, וא\"כ הם עצמם חייבים במה שהטעו אותם נביאי השקר. וז\"ש הכתוב לא שלחתים ולא צויתים וגו', כי אם היו נביאי השקר שלוחיה מאת השי\"ת לנסות בהם את ישראל, כדוגמת מה שהקב\"ה שולח את היצה\"ר לפתות את בני האדם, או דוגמת רוח נבות וכיו\"ב, אזי יש מקום ללמד עליהם זכות כי אנוסים היו בעבור שטעו אחריהם, אבל מכיון שלא שלחתים ולא צויתים, אלא הם עצמם גרמו לחרבן הנורא שבא עליהם בסבת מעשיהם הרעים, ע\"כ ענוש יענשו."},{"passage_id":"vayikru2_b990ec3e_p11","passage_content":"אכן עדיין היה מקום לדון כי אף שעוונות ישראל גרמו לנביאי השקר להתנבאות, מ\"מ דינה רק כדין גרמא בנזיקין, ובגרמא בנזיקין קיי\"ל דפטור מדיני אדם וחייב בדיני שמים, אמנם אילו היו המנהיגים דנים דין כראוי אז לא היו נענשים על גרמא בנזקין, דבזמן שיש דין למטה אין דין למעלה (דברים רבה פ\"ה ד'), אבל בגלל שהיו להם מנהיגים לא טובים שלא דנום כמשפט, נחשב להם החטא שגרמו לנביאי הבעל להתנבאות, כי בזמן שאין דין למטה יש דין למעלה, ולפיכך יצאו חייבים בדיני שמים."},{"passage_id":"vayikru2_b990ec3e_p12","passage_content":"ובדרך זו נבא לביאור פסוקי הפרשה, שאומר הכתוב ואם העלם יעלימו עם הארץ את עיניהם, דבא הכתוב לתת טעם וליישב שלא תתמה תמיהה קיימת כיצד יתכן הדבר שיעלימו הבית דין את עיניהם מן האיש אשר מזרעו נתן למולך, ולא יענישו אותו על חטאתו, לזאת אמר הכתוב ואם העלם יעלימו הבית דין, אתה דע לך כי סבת הדבר היא \"עם הארץ\", כי עוון הדור גרם להם זאת, שכל כך גדלו עוונות עם הארץ עד שהשפיעו על המנהיגים להעצים את עיניהם מראות ברעת האיש הנותן מזרעו למולך. וכיו\"ב כתב האבן עזרא בפרשת ראה עה\"כ ובא אליך האות והמופת וגו' כי מנסה ה' אלקיכם אתכם, והטעם שמנסה ה' אלקיכם אתכם הוא בעבור שעזבוהו ולא המיתוהו. מבואר גם מדבריו כי עוון הדור שהניחו את הנביא שקר ולא המיתוהו גרם שיבא עליהם נסיון קשה כזה שיצליח בנבואתו, ויתקיים האות והמופת אשר אמר."},{"passage_id":"vayikru2_b990ec3e_p13","passage_content":"ובזה יבוארו דברי התורת כהנים אם העלימו סנהדרי קטנה סוף שיעלימו סנהדרי גדולה, אם העלימו בבית דין אחד סוף שיעלימו בשאר בתי דינים. דהנה מצינו בדבריהם ז\"ל דכאשר הקב\"ה שולח פורענות על ישראל הריהו שולחה במדת הרחמים, כמו שאמרו (ויקרא רבה פי\"ז ד') אין בעל הרחמים פוגע בנפשות תחלה וכו' ואף בנגעים תחלה הם באים על ביתו וכו', עיי\"ש. כי מדת העונש נשלחת בהדרגה קימעא קימעא, אולי ישוב וניחם מדרכו הרעה ושב ורפא לו, וכמו כן ה\"נ כיון שסמיות עיני הב\"ד באה מכח עוונות הדור, אין העונש נשלח בבת אחת, להעלים בפעם אחת מכל הבתי דינים את האמת, אלא תחלה נעלם רק מבית דין אחד, ודבר זה בלבד שנעלם מעיני ב\"ד אחד הוא עונש חמור מאד, ואם לא שבו ישראל מדרכם הרעה נסמין גם עיני שאר בתי דינים, ואם בתחלה נסמו רק עיני סנהדרי קטנה, אם לא ישובו העון גורם שיעלימו אף סנהדרי גדולה."},{"passage_id":"vayikru2_b990ec3e_p14","passage_content":"ובפשטות אפ\"ל מאה\"כ ואם העלם יעלימו עם הארץ, כי מה שהב\"ד מעלימים עיניהם מלרדות עוברי עבירה טעם הדבר הוא משום שהם נמשכים אחרי עם הארץ, שהם מושפעים מהם בשוחד אשר הם משחדים אותם באופנים שונים. וזש\"ה ואם העלם יעלימו עם הארץ את עיני הב\"ד מראות ברע, כאשר רואים בחוש בדורנו זה בעוה\"ר, שהמנהיגים נמשכים אחרי הדור, והכתוב צווח ולא תקח שוחד וגו' כי השחד יעור עיני חכמים ויסלף דברי צדיקים. ולכאו' יש להתבונן במקרא זה שהאריך לתת טעם לאיסור מקח שוחד, ואין כן דרך הכתוב בכל מקום לבאר טעמי המצות, והיה די שיאמר הכתוב לא תקח שוחד ותו לא, והוה סגי בהכי להודיענו כי חיובא רמיא להמנע מלקיחת שחד, ומה לנו לדעת טעם האזהרה ונימוקה. אכן נראה דהנה הטור כתב בריש הלכות סוכה (סימן תרכ\"ה) וז\"ל, בסוכות תשבו שבעת ימים וגו' למען ידעו דורותיכם כי בסוכות הושבתי את בני ישראל בהוציאי אותם וגו' תלה הכתוב מצות סוכה ביציאת מצרים וכו', עיי\"ש שהאריך לבאר טעם מצות סוכה. וכתב עליו הב\"ח איכא למידק בדברי רבינו שאין זה מדרכו בחיבורו זה לבאר כוונה לשום מקרא שבתורה, כי לא בא רק לפסוק הוראה או להורות מנהג, ופה האריך לבאר ולדרוש המקרא דבסוכות תשבו, ויראה לי לומר בזה דסובר שכיון דכתיב למען ידעו דורותיכם כי בסוכות וגו' לא קיים המצוה כתיקונה אם לא ידע כוונת מצות הסוכה כפי פשטה, ולכן ביאר לפי הפשט דעיקר הכוונה בישיבת הסוכה שיזכור יציאת מצרים, ע\"כ."},{"passage_id":"vayikru2_b990ec3e_p15","passage_content":"המורם מדבריו כי במקום שהתורה כתבה טעם הדבר חייבים לכוון במעשה המצוה לטעם המבואר בקרא, דלא סגי בלאו הכי, וה\"נ כן הוא דכיון שכתבה תורה טעם לאיסור לקיחת שוחד כי השחד יעור וגו',  חייבים לכוון טעם זה שעל כן הוא נמנע מלקיחת שוחד כי השחד יעור. והכוונה בזה להודיע כי לא זו בלבד שהלוקח שוחד נכשל באיסור זה, אלא שאין להתחשב כלל בדעתו לפסק הלכה, כי הוא סומא בעיניו ולא יוכל לראות את האמת (ועיין בדברינו לעיל פרשת משפטים קל\"ח ב'). וכמו שנראה בעליל בעוה\"ר בזמנינו שע\"י שנהנים מממשלת הכופרים באיזה אופן שהוא, בממון או בכבוד או טובת הנאה כל שהיא, נעשים משוחדים בדעתם, ולוקחים חבל בעוון הנורא של לקיחת ממשלה קודם הזמן, ובדבר הזה טעו והתעו אחריהם את כלל ישראל, להיות גרורים אחרי המינים והכופרים, ואף כי הם בעצמם לא ידעו ולא יבינו כי משוחדים המה, אדרבה עוד טענתם בפיהם כי אעפ\"י שהם נהנים מן המינים מ\"מ בזה הפרע אינם משוחדים, והם רשאים לחוות דעתם בענינים אלו, אך האמת היא כי התורה מעידה עליהם כי השחד יעור, ואמרו ז\"ל (כתובות ק\"ה ע\"א) בא וראה סמיות עיניהן של מקבלי שוחד אדם חש בעיניו נותן ממון לרופא ספק מתרפא וכו' והן נוטלין שוה פרוטה ומסמין עיניהם. ואמרו ז\"ל (ביצה ל\"ב ע\"ב) המצפה לשולחן אחרים עולם חשך בעדו. וכמו כן הנהנים מאותה המלוכה המרה באיזה הנאה שהיא, חשכו עיניהם מראות ולא יוכלו לכוון אל האמת."},{"passage_id":"vayikru2_b990ec3e_p16","passage_content":"וכבר נתבאר שצריך לכוון טעם איסור לקיחת שוחד שכתבתו תורה במפורש, ועדות ה' נאמנה, וקושטא דמילתא הכי הוא, שאם לוקחים שוחד אין רואים האמת, ואסור להם לחוות דיעה בענינים אלו, כי הם פסולים לדין זה ודעתם בעלה ומבוטלת כעפרא דארעא."},{"passage_id":"vayikru2_b990ec3e_p17","passage_content":"ומה גדול הוא חילול השם הנורא הנצמח משומרי תורה ומצוות המשתתפים למלוכה טמאה זו, ומאשרים זדים וקדוש וברוך לעומתם יאמרו. וצא ולמד ממה דאיתא בגמרא סנהדרין (דף ס\"ד ע\"ב) עה\"פ (ויקרא י\"ח) ומזרעך לא תתן להעביר למולך שאם העביר כל זרעו למולך פטור, שנאמר ומזרעך ולא כל זרעך. ולכאו' יש להתבונן מדוע הענישה תורה בנותן מקצת זרעו למולך והנותן כל זרעו פטור, הלא איפכא מסתברא שהנותן כל זרעו עוונו חמור יותר. אמנם נראה דהנה הרמב\"ן ז\"ל כתב עה\"פ ומזרעך לא תתן להעביר למולך ולא תחלל את שם אלקיך וז\"ל, והנה הזכיר הכתוב כי העברת הזרע למולך הוא חילול ה', ובפרשה האחרת הוסיף למען עמא את מקדשי ולחלל את שם קדשי, ואולי טעמו וכו' מפני שהמקריב מזרעו למולך ואח\"כ יבא אל מקדש ה' להקריב קרבן מעמא את המקדש, כי קרבנותיו טמאים ותועבה לשם, הוא עצמו טמא לעולם שנטמא ברעה שעשה וכו', והזכיר בו חילול ה' כי כאשר ישמעו הגויים שכיבד את המולך בזרעו ויקריב מבהמתו לה' הוא חילול ה' עכ\"ל."},{"passage_id":"vayikru2_b990ec3e_p18","passage_content":"ולכאורה הלא אף בלא שיקריב קרבן לה' הרי הוא מחלל שם שמים בתתו מזרעו למולך, ומה יתן ומה יוסיף להגדיל את חילול ה' בהקריבו אח\"כ קרבן לה'. אך הכוונה בזה דאם לא היה מביא קרבן לה' אין חילול ה' גדול כ\"כ, כי ישנם הרבה עובדי עבודה זרה בעולם, והיה גם הוא כאחד מהם, אך אם אחרי עבודת המולך יבא להקריב קרבן לה', א\"כ אות הוא שירא שמים הנהו ועוסק במצוות ובמעשים טובים, ונוסף לכך הוא מייקר גם את שם המולך, בתתו מזרעו אליו, זהו חילול ה' גדול ונורא, שיאמרו הגוים איש כזה אשר יראת ה' מפעמת בקרבו, ומקריב קרבן לה', יתן מזרעו למולך. והם המה הפוסחים על שתי הסעיפים, שעליהם אמר אליהו הנביא זל\"ט מדוע אתם פוסחים על שני הסעיפים אם לה' לה' ואם לבעל וגו',  וכבר ביארנו בדברינו כמ\"פ כי הפוסחים על שתי הסעיפים הם הגרועים ביותר, וכמו שכתב בעל העקידה בפרשת ואתחנן (ועיין בדברינו בספר ויואל משה בהקדמה י\"ג ע\"ב)."},{"passage_id":"vayikru2_b990ec3e_p19","passage_content":"והיינו טעמא דמילתא שהמעביר כל זרעו למולך פטור והמעביר מקצת זרעו חייב, כי המעביר כל זרעו אין חילול ה' גדול כ\"כ, דיאמרו שיש הרבה עוע\"ז בעולם ונוסף גם הוא עליהם, אבל אם הוא מעביר רק מקצת זרעו למולך, וקצתם ישלח לבית ה', אזי חילול ה' גדול עד מאד, כי יאמרו ראו גם ראו כי זה האיש ירא ה' ושולח בניו לבית ה', ואפילו הכי הוא מעביר מזרעו למולך, וא\"כ ש\"מ כי דבר טוב הוא והכי כשר למיעבד, ואעשה כן גם אני. ועל כן אלו וכיוצא בהם הם הגרועים ביותר, בעבור שהם עושים שותפות לה' בע\"ז, והם היו לנו בעוכרינו להטעות לב העם אחריהם."},{"passage_id":"vayikru2_b990ec3e_p20","passage_content":"והנה הראשונים ז\"ל נחלקו מה היתה עבודת המולך, רש\"י ז\"ל כתב בס\"פ אחרי עה\"פ ומזרעך לא תתן להעביר למולך ע\"א היא ששמה מולך וזו היא עבודתה שמוסר בנו לכומרים ועושים שתי מדורות גדולות ומעבירין את הבן ברגליו בין שתי מדורות האש. והרמב\"ן ז\"ל בפרשתן השיג על רש\"י ז\"ל, וכתב שזה איננו עולה מתוקן כהוגן לפי העולה בגמרא וכו', ונראה שלפי הדעת הזו לשון מולך אינו שם לפסל ולצלם מיוחד אלא שם לכל נעבד בכלל כל שתמליכהו ותקבלנו עליך כאלוה. והנה כפי הדעת הזו יקראו בני עמון לשקוץ שלהם מולך, כי הוא מלכם, והוא שם כולל לכל נעבד כי הוא מלשון מלכות, עכ\"ל הרמב\"ן ז\"ל."},{"passage_id":"vayikru2_b990ec3e_p21","passage_content":"ולכאורה יש להתבונן בדברי הרמב\"ן ז\"ל למה כינו את הע\"ז בלשון מלכות, וכי ענין מלוכה שייך בע\"ז דוקא, הלא מלוכה שייך גם במלכות דקדושה, כמצווה עלינו בתורתינו הקדושה שום תשים עליך מלך, ורבותינו ז\"ל אמרו (גיטין ס\"ב ע\"א) מאן מלכי רבנן. הרי דשם מלכות אינו מורה על ענין אלהות ח\"ו, אלא על שררה והנהגת העם, וא\"כ אין שם מולך כינוי לעבודה זרה שעובדיה מקבלים אותה עליהם לאלוה. ועוד צ\"ב שאם הוא מלשון מלכות היה להם לכנותו מלך, ומדוע קראוהו מולך בוא\"ו."},{"passage_id":"vayikru2_b990ec3e_p22","passage_content":"אמנם בעוה\"ר בזמנינו אנו מובן הרמז הטמון בשם הע\"ז מולך, כי רואים אשר רבים מישראל נהנים ממה שהקימו להם ישראל מלוכה של טומאה וסט\"א, ממשלת כופרים ואפיקורסים נגד התורה כולה, ומלוכה זו היא עצם הסט\"א, ולה הולם הכינוי עבודת המולך. והוא עפ\"י מה שאמרו ז\"ל (יבמות ס\"א ע\"א) ביושע בן גמלא שקידש את מרתא בת בייתוס ומינהו המלך להיות כהן גדול, ובגמרא שם מינהו אין נתמנה לא אמר רב יוסף קטיר קחזינא הכא. ופי' רש\"י מינהו אין, כלומר המלך מינהו אבל אחיו הכהנים וסנהדרין לא מינוהו. נתמנה לא קתני, דהוה משמע דראוי היה לכך. קטיר וכו', קשר של רשעים אני רואה כאן שלא היה ראוי לכך אלא שנתן ממון ומינוהו. מבואר מזה דהלשון נתמנה מורה על מי שראוי לאותו מינוי, שמן השמים נתמנה לכך, וע\"ד שאמרו ז\"ל (בבא בתרא צ' ע\"ב) אפילו ריש גרגותא מן שמיא מוקמי ליה, אבל מי שאינו ראוי למלוכה על פי תורה אין זה נתמנה מן השמים, אלא מולך שמלך מעצמו (וכמו שדרשו ז\"ל בריש אסתר רבתי הוא אחשורוש המולך שמלך מעצמו ולא היה ראוי למלוכה עיין פירש\"י שם). וכמו כן כל עבודה זרה שמקבלים על עצמם כאלהות, אין זו שררה מן השמים, אלא מולך שמלך מעצמו."},{"passage_id":"vayikru2_b990ec3e_p23","passage_content":"ומובן מזה כי ישראל הלוקחים לעצמם ממשלה האסורה על פי תורה הרי זו ע\"ז בשם מולך, וכמ\"ש הרמב\"ן ז\"ל שמולך הוא מלשון מלוכה. ובעוה\"ר מה שאין ממתינין לישועת השי\"ת אלא מולכין מעצמן היא הע\"ז החמורה ביותר, ודדא ביה כולה ביה ע\"ז ומינות מתחלה ועד סוף, וקאי ביהרג ואל יעבור, כאשר ביארתי בארוכה בספרי ויואל משה. ולזאת חילול ה' הגדול והנורא בא מאותם שהם עדיין שומרי תורה ומצוות, ולאידך גיסא הם נותנים שבח ויקר וגדולה למלוכתם הטמאה, כי בכך נותנים להם חיזוק רב ועצום, שיאמרו הנה יהודים שומרי תורה ומצוות מכבדים את המלוכה הטמאה, והרי הם נותנים מזרעם למולך, ואח\"כ גם מקריבים קרבן לה', שעליהם הכתוב אומר למען טמא מקדשי ולחלל שם קדשי. ובעוה\"ר הבעל דבר מצא כאן מקום לתפוס את כלל ישראל בטומאת המולך הלזו, והוא מתגבר מאד כאשר היה בימי בית ראשון שהתגברה יצרא דעבודה זרה, ולא נשארו כי אם מעטים שלא טעו אחריה."},{"passage_id":"vayikru2_b990ec3e_p24","passage_content":"ועל פי הדברים הנאמרים בענין אפ\"ל מאה\"כ בריש פרשתן (קושיא א') דבר אל כל עדת בני ישראל ואמרת אליהם קדושים תהיו, בהקדם דברי ק\"ז זלה\"ה בייטב לב שפירש מאה\"כ קדושים תהיו עפ\"י מה שאמרו ז\"ל ביבמות (דף כ' ע\"א) כל המקיים דברי חכמים נקרא קדוש, ובתנחומא ס\"פ נשא איתא לא יאמר אדם איני מקיים מצות זקנים שאינן מהתורה א\"ל הקב\"ה בני כל מה שגוזרים עליכם תהיו מקיימים שנאמר ועשית וגו' עפ\"י התורה אשר יורוך למה שאף על דבריהם אני מסכים שנאמר (איוב כ\"ב) ותגזר אומר ויקם לך וכו', ובזה פירש קדושים תהיו כלומר שתקיימו דברי חכמים שבזה תהיו קרויים קדושים כנ\"ל, כי קדוש אני ה' אלקיכם, כביכול גם אני שומע לדברי חכמים, ואני מחמיר על עצמי לקיים גזירתם, עיי\"ש."},{"passage_id":"vayikru2_b990ec3e_p25","passage_content":"ובספרי חכמי הדקדוק מבואר כי ב' הפירושים בתיבת \"דבר\" משורש אחד מוצאם, כי באמצעות הדיבור מנהיג האדם אחרים, וזכר לדבר מה שפירש רש\"י ז\"ל עה\"פ ויקהל משה את כל עדת בני ישראל שאינו אוסף אנשים בידים אלא הם נאספין עפ\"י דיבורו. ואפ\"ל דגם תיבת נביא שהוא מלשון ניב שפתים מורה על היות הנביא מנהיג את ישראל, כי בכח אמרי פיו שאומר דעת תורה אמיתי לישראל נעשה מנהיג אמיתי לכלל ישראל."},{"passage_id":"vayikru2_b990ec3e_p26","passage_content":"וזה אפ\"ל בכוונת הכתוב דבר אל בני ישראל, נרמז בכאן ציווי למנהיג ישראל שיהיה הוא \"דבר\" לדור, להורות להם דעת אמת בתורה הקדושה, ולא שיהיה נתון תחת השפעת אחרים, וישחדוהו לסלף דבריו. וז\"ש דבר אל בני ישראל פירוש בזמן שרועה ישראל הוא ה\"דבר\" לעם ישראל, כלומר שהוא המנהיג האמיתי להם על פיו יצאו ועל פיו יבואו ואין עליו השפעת אחרים, אזי ואמרת אליהם קדושים תהיו, כפי' ק\"ז זלה\"ה שתקיימו דברי חכמים שבזה תהיו נקראים קדושים, אבל אם אין הדבר כן אלא המנהיג מושפע מהמון העם, א\"כ אין הוא \"הדבר\" לבני ישראל, אלא העם מנהיגים אותו, ואין לו דיעה אמיתית בתוה\"ק, אזי אנו אין לנו לשמוע בקולם, ורק עצה אחת יש לנו לצאת בעקבות הראשונים כמלאכים ולעשות כמעשיהם, כמאה\"כ (שה\"ש א') אם לא תדעי לך היפה בנשים צאי לך בעקבי הצאן ופירש\"י ז\"ל אם חדל הרועה מלהנהיג אותך הסתכלי בפסיעות דרך שהלכו הצאן והעקבים ניכרים (ועיין בדברינו לעיל פרשת אחרי עמוד מ\"ו בענין זה באורך). והבוכ\"ע ירחם על עמו ישראל וישרש מקרב לבם את טומאת המולך הזו, וברוב רחמיו וחסדיו יחוס על עמו שינצלו מצרה זו של מלכות טמאה, הבוכ\"ע יעזור שנזכה לברכת קדושים תהיו, ונהיה דבוקים בתה\"ק בדרך האמת, ועד ביאת משיח צדקינו לא נכשל ח\"ו, ונזכה לעשות תשובה שלימה לפני הבוכ\"ע, ולקבל פני משיח צדקינו בנחת ובשמחה באנפין נהירין, ובמהרה נזכה לראות בהתרוממות קרן התורה וישראל ובהתגלות כבוד שמים עלינו, במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru2_2074097c","title":"קדושת ישראל וירושת הארץ","summary":"בפרשה זו נדונה קדושת ישראל, הקשורה במעשים ובמצוות, והקשר בין קדושת ה' לקדושת ישראל. כמו כן, נדונה חשיבות שמירת התורה והמצוות להמשך ירושת הארץ, וההשלכות של העלמת עין מצד בתי הדין על הציבור כולו.","contents":[{"passage_id":"vayikru2_2074097c_p1","passage_content":"קדושים תהיו כי קדוש אני ה' אלקיכם. במד\"ר (פכ\"ד ד') איתא הה\"ד ישלח עזרך מקדש (תהלים כ'), א\"ר לוי כל טובות וברכות ונחמות שהקב\"ה עתיד ליתן לישראל אינן אלא מציון, ישועה וכו', תורה מציון וכו', עזרה וסיוע מציון שנאמר ישלח עזרך מקדש מקדוש מעשים שיש בידך ומציון יסעדך מציון מעשים שיש בידך וכו', ע\"כ. וצ\"ב דהמדרש מוציא מקרא זה מידי פשוטו, דדריש מקודש מקידוש מעשים ומציון מציון מעשים, ופשוטו של מקרא מיירי בציון וירושלים, וכיצד יהיו מקושרים יחדיו הפשט והדרש במקרא זה. גם גוף הדרשה צ\"ב, מה הכוונה בדבריו מציון מעשים שיש בידך."},{"passage_id":"vayikru2_2074097c_p2","passage_content":"ב) עוד איתא במד\"ר (פכ\"ד ט') קדושים תהיו יכול כמוני ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם. והוא תמוה עד מאד היאך יעלה על הדעת להשוות קדושת יציר חומר בהשואה כל שהיא לקדושתו של המקום ברוך הוא, מלך רם ונשא קדוש ונורא, קדיש בשמי מרומא עלאה קדיש על ארעא קדיש לעלם ולעלמי עלמיא, ומה דמות תערכו לו ואל מי תדמיוני ואשוה יאמר קדוש."},{"passage_id":"vayikru2_2074097c_p3","passage_content":"ג) בסוף הפרשה וידבר ה' אל משה לאמר ואל בני ישראל תאמר איש איש מבני ישראל וגו' אשר יתן מזרעו למולך מות יומת עם הארץ ירגמוהו באבן וגו',  ואם העלם יעלימו עם הארץ את עיניהם מן האיש ההוא בתתו מזרעו למולך וגו',  ויל\"ד מה כוונת הכתוב באמרו עם הארץ, ואונקלוס תרגם עמא דבית ישראל, אך תמוה הוא שלא מצינו בשאר מקומות שיאמר הכתוב כהאי לישנא בשום עונש או אזהרה הכתובים בתורה הקדושה אלא הכא, וטעמא בעי."},{"passage_id":"vayikru2_2074097c_p4","passage_content":"ד) ורש\"י ז\"ל כתב ליישב אומרו עם הארץ, שבא ללמדנו דאם אין כח בבית דין עם הארץ מסייעין אותו וכו' ד\"א עם שעתידין לירש את הארץ ע\"י מצוות הללו, ע\"כ. ואכתי צריך ביאור שהרי לא באזהרה זו בלבד שייך לומר כן, דכמה מצוות ואזהרות יש שהם מסורין לב\"ד ואם אין בכח בי\"ד לעשות חייבים ישראל לסייע בידם, וכן אידך דרשא שהם עתידים לירש את הארץ ע\"י מצוות, נמי שייכא בשאר מצוות, ואפי\"ה לא מצינו שתכתוב תורה כהאי לישנא כי אם הכא, הלא דבר הוא."},{"passage_id":"vayikru2_2074097c_p5","passage_content":"ה) וביותר יש להפליא על מה ששנה הכתוב לכתוב עם הארץ להלן באותה פרשה, דכתיב ואם העלס יעלימו עם הארץ את עיניהם וגו', ושם אין לומר כחדא מהנך פירושים שכתב רש\"י ז\"ל, שהרי העלם יעלימו קאי על הבית דין, וליכא למידרש מיניה שעם הארץ יהיו המסייעים לבי\"ד להעלים כדפירש\"י ז\"ל לעיל מיניה בפירוש הא', דמאי שייך ענין סיוע ועזרה בזה, הלא אם ימאנו הבית דין לדונו על רשעתו יסבו עיניהם מנגדו, ויכבשו פניהם בקרקע, ומה צורך שיסייעו להם עמא דארעא בזה. וגם הדרשות שהביא רש\"י ז\"ל מת\"כ לא שייכי הכא, דאדרבה אין זה שבח ומעלה לישראל שהם מעלימים עינים מעוברי עבירה ואין מענישין אותם, אלא להיפוך גנאי הוא להם דבר זה, ומה שייך להזכיר בכאן שבחם של ישראל שהם עתידין לירש את הארץ."},{"passage_id":"vayikru2_2074097c_p6","passage_content":"ו) ואם העלם יעלימו פירש\"י ז\"ל אם העלימו בדבר אחד סוף שיעלימו בדברים הרבה אם העלימו סנהדרי קטנה סוף שיעלימו סנהדרי גדולה, ע\"כ. ודרשה זו מקורה בת\"כ, ושם היא באריכות יותר (וכ\"ה גם בילקוט) שדרשו אם העלימו ב\"ד אחד סוף שיעלימו הרבה בתי דינים. ומעולם נתקשיתי בזה מדוע יהיה זאת שאם העלים בית דין אחד עינו מלהעניש את הרשעים יעלימו גם שאר בתי דינים, וכי מה פשעם ומה חטאתה של שאר בתי דינים שיהיו נכשלים אף המה על ידי העלמת עין של אותו בית דין, והרי מה דאיתא בדבריהם ז\"ל (אבות ד' ב') עבירה גוררת עבירה זה שייך דוקא באותו אדם עצמו שעבר עבירה, שהחטא גורם לו לחזור ולהכשל בעבירות אחרות, משא\"כ הכא שבית דין אחד נכשל בהעלמת עין מן הפושעים, מדוע יגע עון זה גם בשאר בתי דינים אשר לא פעלו כל און."},{"passage_id":"vayikru2_2074097c_p7","passage_content":"והלום ראיתי אחרי רואי כי קושיא זו כבר הקשה בזית רענן על הילקוט, דאם ב\"ד אחד חטא מה חטאו השאר וק\"ו סנהדרי גדולה, ומתרץ על פי מאי דאמרינן פ\"ק דע\"ז (דף ח' ע\"ב) מ' שנה עד שלא חרב הבית גלתה סנהדרין וישבה לה בחנות למאי הלכתא וכו' שלא דנו דיני נפשות מ\"ע כיון דחזו דנפישי להו רוצחין ולא יכלו למידן אמרו מוטב נגלי ממקום למקום כי היכי דלא ליחייב דכתיב ועשית על פי הדבר אשר יגידו לך מן המקום ההוא מלמד שהמקום גורם (ופירש\"י שאין דנין דיני נפשות ואפי' בסנהדרי קטנה שבכל עיר אלא בזמן שסנהדרי גדולה במקומה בלשכת הגזית). וזהו שדרשו אם יעלימו סנהדרי קטנה את עיניהם מן הרוצחים סוף שיעלימו סנהדרי גדולה, משום דיהיו נפישי רוצחים מחמת סבה זר יעלימו סנהדרי קטנה עיניהם, וזה יגרום שתוצרך אף סנהדרי גדולה לגלות ממקומה, ושוב לא יוכלו לדון דיני נפשות, שהרי המקום גורם, אח\"ד ז\"ל. אכן בדבריו אכתי לא נתיישב הא דאיתא בת\"כ ובילקוט אם העלימו ב\"ד אחד סוף שיעלימו שאר בתי דינין, שהרי לא שייך לומר כן אלא בסנהדרי גדולה, שעל ידי שתעלים סנהדרי קטנה עיניה מן הרוצחים תגלה סנהדרי גדולה ממקומה בלשכת הגזית, משא\"כ בשאר בתי דינין לא שייך ענין זה."},{"passage_id":"vayikru2_2074097c_p8","passage_content":"ובספר קרבן אהרן ביאר דברי התורת כהנים דלפי ששרש נשמות ישראל אחד הוא, ממילא בזמן שא' מישראל עובר עבירה נעשה פגם בכללות ישראל, ולפיכך תגרום העלמת עין של בית דק אחד להעלמת עיני שאר בתי דינים, כי העון עשה רושם אף בהם. אך גם בזה לא הונח לנו, דא\"כ בכל חטא אשר יחטא האדם שייך לומר כן, ולאו דוקא בחטא דהעלמת עין. ועוד וכי כללא הוא דע\"י שקצת מישראל נכשלים בעוונות יכשלו גם שאר ישראל בחטא. והלא כאשר נסקור מצב הדורות שעברו נראה כי בכל דור ודור נמצאו והיו צדיקים וקדושים אשר האירו פני תבל בתורתם ובקדושתם, אף שגם בזמניהם צצו ועלו קוצים בכרה ישראל, אשר חטאו והחטיאו והסיתו והדיחו אחריהה קצת מישראל, אעפ\"כ לא השפיעו חטאתיהם ופשעיהם לרעה על הצדיקים הקדושים שבדורם. וכאשר מצינו כי בזמן התנאים והאמוראים הקדושים קמה כת הצדוקים והבייתוסים. וכמו כן בסוף ימי בית ראשון נמצאו והיו החרש והמסגר אלף, וכן היו נביאי אמת באותו זמן, אף שהיו ישראל עובדי ע\"ז, ובעוון זה חרב הבית, אפ\"ה לא יכלו הרשעים שבדור לגרום להחטיא את הצדיקים מחמת עוונותיהם. וא\"כ מאי האי דדריש כי אם יעלים ב\"ד אחד יעלימו שאר בתי דינים, משמע דמילתא פסיקא היא."},{"passage_id":"vayikru2_2074097c_p9","passage_content":"ועוד יש להקשות על מה שדרש התורת כהנים מדכתיב עם הארץ עם שעתידין לירש את הארץ, דהרי מקרא זה מיירי בעת שישראל שרויין על אדמתן והסנהדרי גדולה יושבת בלשכת הגזית, דאז שייך לדון דיני נפשות, ועל אותו זמן קא מזהר קרא ואם העלם יעלימו עם הארץ את עיניהם ולא יעשו כמועל עליהם לדון עוע\"ז במיתה, ולפי זה אין מובן כלל לדרשת הת\"כ עם שעתידין לירש את הארץ, שהרי באותו זמן שעליו הכתוב מדבר כבר נתיישבו בארץ וירשוה, והוה ליה למימר עם שירשו את הארץ."},{"passage_id":"vayikru2_2074097c_p10","passage_content":"ונראה לבאר הענין בהקדם דברי ספר עקידת יצחק בפרשת וירא, שנתן טעם למה שנענשו דוקא אנשי סדום בעונש חמור כזה להיות נהפכים כמו רגע, והלא במשך הדורות היו גם שאר רעים וחטאים כסדום ויותר, וזה לשונו, וכי משוא פנים יש בדבר, מה נשתנו בעלי הגבעה (במעשה פלגש בגבעה, שופטים י\"ט) מאנשי סדום, שאלו נענשו במדה\"ד עזה וקשה ואלו לא די שלא נענשו אלא שנענשו ישראל על ידם וכו', ופשט הכתוב משוה אותם לגמרי וכו'. אמנם ישוב הענין וכו' בשנשים לב אל מה שכתב החוקר וכו' בהבדל אשר בין החוטא והרשע, כי החוטא אשר ענינו הוא בלתי כובש את יצרו, הוא אשר התאווה בו לבד היא נפסדת, אמנם שכלו אינו נפסד, והרשע הוא שהתאווה והשכל בו נפסדים. והיוצא מזה כי הרשע אינו מתנחם לעולם מרעתו, כי אין לו דבר שיעוררהו על זה, אמנם החוטא כאשר יעבור ההתפעלות ההוא הגובר על שכלו הנה השכל ההוא ישוב לאיתנו, ומתעצב ממעשהו ומעצבון ידו. והשני כי החוטא ששכלו שלם אפשר שיקבל רפואה, כי יש התחלת בריאה ממנה יבא הבריאות, אמנם הרשע אין לו שום דבר ממנו יותחל הבריאות, ולזה אין רפואה למחלתו. והנה באמת זה היה חטאות סדום ובנותיה, כי הם לא חטאו בחטא התאווה בלבד, כערים אשר יש להם מצוות וחוקים טובים ואין עושים אותם וכו',  אבל כבר נפסדה התחלתם בתכלית ההפסד, עד אשר הקימו להם דברים רעים ומגונים לחוקים ומשפטים טובים וישרים, וקבעו בהם מסמרות בקנסות ועונשים שלא יעברו מהם לעולם, וההנחה הזאת תחייב אותם לצאת אל הקצה האחרון בדרכי הרשע והחמס, עכ\"ד בעל העקידה ז\"ל."},{"passage_id":"vayikru2_2074097c_p11","passage_content":"ועל פי דברים אלו יתבאר לנו על נכון התורת כהנים דדרש מדכתיב ואם העלם יעלימו אם העלימו סנהדרי קטנה סוף שיעלמו סנהדרי גדולה אם העלימו בית דין אחד סוף שיעלימו הרבה בתי דינים. דהנה אם כי אמת נכון הדבר שבכל דור ודור היו גם עבריינים שהרבו למרוד ולפשוע, אך בזמן שהיו בישראל בתי דינים כשרים לא העלימו בי\"ד עיניהם מפשעיהם לכל חטאתיהם, כי אם עשו כמצווה עליהם לדון אותם ולהענישם, וע\"י כן נודע ונתפרסם בקרב ישראל כי דרך הרשעים ומעשיהם המה היפך התורה, וכל העם ישמעון ויראו ולא יזידו לעשות בתועבותיהם, וכאשר כן עשו חז\"ל הקדושים לכת צדוק ובייתוס שהוציאום מן הכלל לגמרי, ותיקנו להוסיף ברכה בשמנה עשרה שתהיה בה שאלה מלפני השם לאבד האפיקורסים כי ראו שזו גדולה מכל צרכי בני אדם, בעבור שהיו האפיקורסים מצירים לישראל ומסיתים אותם לסור מאחרי ה', כמ\"ש הרמב\"ם ז\"ל (רפ\"ב מהלכות תפלה). וכן מצינו כיוצא בזה שעשו חכמי הדורות במקומם ובשעתם תקנות להרחיק המורדים והפושעים ולהוציאם מן הכלל, ולא חכר עליהם שם ישראל עוד."},{"passage_id":"vayikru2_2074097c_p12","passage_content":"אכן אם הבית דין מעלימים עיניהם מן החוטאים, ואינם נזקקים לדון אותם על פשעיהם, הרי זה מוכיח כי הם מאשרים זדים, ולא עוד אלא שיבואו לחפש עליהם לימוד זכות, ולהצדיק כל תועבותיהם, כדי להסיר מעליהם התלונה כי אינם עושים משפט. ולפיכך חמור עד מאד עון העלמת עינים מן הפושעים, שהרי בהעלמת עין זו הבית דין קובעים מסמרות נטועות כי שורת הדין נותנת כך, ושפיר קא עבדי, ואין בהם כל עול. וכמ\"ש בעל העקידה כי המעשה הזאת שעשו לקבוע דברים רעים ומגונים מעשים אשר לא יעשו לחוקים ומשפטים צדיקים וישרים היא תחייב אותם לצאת עד קצה האחרון בכל דרכי הרשע והחמס. וכל כך גדולה פירצה זו עד שהעלמת עינים של בית דין אחד יגרום שגם בתי דינים אחרים יעלימו עיניהם מן החוטאים, ויחפו על פשעיהם, ואם העלימו סנהדרי קטנה בסופו של דבר יעלימו גם סנהדרי גדולה."},{"passage_id":"vayikru2_2074097c_p13","passage_content":"ובא הכתוב ופירש סיבת הדבר אשר יגרום חטא העלמת עיני ב\"ד אחד מן הפושעים שגם שאר בתי דינים יעלימו עיניהם, באמרו ואם העלם יעלימו עם הארץ, והכונה דבראות העם אשר הבית דין מחפין על מעשי הרשעים, ולא עוד אלא מאשרים אותם כי יפה עשו והכי כשר למעבד לעבוד למולך, אזי הדבר נעשה להם כהיתר גמור, כי מסתמא אם בית דין ניחא להו בהכי נכון הדבר לעשותו, וכיון שיהיה הדבר פשוט להיתר בעיני עמא דארעא, ידרשו בתוקף גם משאר בתי דינים להעלים עיניהם מן הרשעים הנותנים מזרעם למולך, וז\"ש הכ' ואם העלם יעלימו עם הארץ, ודרשו בת\"כ אם העלים ב\"ד אחד סוף שיעלימו גם שאר בתי דינים, כי ע\"י שיעלים בית דין אחד עיניו מן הפושעים, וגם יחפו על מעשי הרשע, וילמדו עליהם זכות, יוצמח מזה כי עם הארץ ישפיעו בלחצם על בתי דינים אחרים שיעלימו אף הם עין ממעשי הרשעים, ואם העלימו סנהדרי קטנה, בסופו של דבר יעלימו אף סנהדרי גדולה, בהשפעת עמא דארעא."},{"passage_id":"vayikru2_2074097c_p14","passage_content":"ובזה מובן מה דנקט קרא הכא עם הארץ, ופירש\"י ז\"ל שאם אין כח בבית דין עם הארץ מסייעין אותן, והקשינו דלכאורה לא שייך לפרש כן להלן בפרשה היכא דכתיב ואם העלם יעלימו עם הארץ, דמה שייך שיהיו עם הארץ מסייעין לבית דין להעלים עיניהם מן החוטאים. ולדברינו מובן דכוונת הכתוב להזהיר כי ע\"י העלמת עיני בית דין האחד ישפיע עם הארץ על בתי דינים אחרים שאף הם יעשו כמותו, להעלים עיניהם מן הרשעים. וז\"ש ואם העלם יעלימו עם הארץ, דאף ששאר בתי דינים מצד עצמם היו רוצים לדון את הרשעים ולהענישם על פשעיהם, אין ביכולתם לעמוד בלחץ ובהשפעת עמא דארעא, שהדבר בעיניהם כהיתר ברור, מחמת שהעלים אותו הבית דין עיניו."},{"passage_id":"vayikru2_2074097c_p15","passage_content":"ובדרך זו יתבאר גם מה שפירש\"י ז\"ל עם הארץ עם שעתידין לירש את הארץ, והקשינו דהרי הכתוב מיירי בזמן שישראל שרויין על אדמתן והארץ כבושה לפניהם, ומה שייך לומר שהם עתידין לירש את הארץ. אמנם נראה כי הנה ירושת הארץ תלויה במה שישמרו ישראל את התורה והמצוות, ובהעדר שמירה זו אבדו ישראל זכותם לרשת את הארץ, שהרי על מנת כן נתן הקב\"ה את הארץ לישראל שישמרו מצוותיו ויעסקו בתורתו, כמבואר בכמה מקראות ובמקומות רבים בדברי חז\"ל, ואמר הכתוב (תהלים ק\"ה) ויתן להם ארצות גוים ועמל לאומים יירשו בעבור ישמרו חוקיו ותורותיו ינצורו, הרי כי תנאי הן הן הדברים אם ישמרו חוקיו ותורותיו ינצרו, אז ישבו בה ויירשוה וזרע עבדיו ינחלוה ואוהבי שמו ישכנו בה, לא זולת. והכי איתא במכילתא פרשת יתרו שלשה דברים ניתנו על תנאי ארץ ישראל וביהמ\"ק ומלכות בית דוד א\"י מנין שנאמר (דברים י\"א) השמרו לכם פן יפתה לבבכם וגו' ואבדתם וגו'. והאה\"ח הקדוש כתב בפרשת בהר דטעם שהזכירה תורה הר סיני במצות שמיטה, כי לצד שהזכיר מתנת הארץ כדכתיב אשר אני נותן דקדק לומר בהר סיני, כי מחמת הר סיני פירוש מה שקיבלו בו הוא שנגמרה המתנה שע\"מ תורה נתן ה' את הארץ, ע\"כ."},{"passage_id":"vayikru2_2074097c_p16","passage_content":"ובגמרא סנהדרין (דף צ\"א ע\"א) איתא כשבאו בני אפריקיא לדון עם ישראל לפני אלכסנדרוס מוקדון אמרו לו ארץ כנען שלנו היא דכתיב (במדבר ל\"ד) ארן כנען לגבולותיה וכו', אמר להו גביהה בן פסיסא לחכמים תנו לי רשות ואלך ואדון עמהם אמר להם מהיכן אתם מביאים ראיה אמרו לו מן התורה אמר להם אף אני לא אביא אלא מן התורה שנאמר (בראשית ע') ויאמר ארור כנען עבד עבדים יהיה לאחיו עבד שקנה נכסים עבד למי ונכסים למי. והקשה המהרש\"א ז\"ל דכיון שבני אפריקי היו באים בראיה מן התורה דכתיב בה ארץ כנען לגבולותיה ע\"כ יאמינו במה שכתוב בתורה, וא\"כ אין להם פתחון פה כלל, דכמה מקראות יש שהקב\"ה נתן לישראל ארץ שבעה עממין, ותירץ דכיון שהיה המעשה הזה בתחלת בית שני, ותמיד מיום חורבן בית ראשון היתה ידם תקיפה עלינו בתחלה יד כשדים ואח\"כ יד מלכי פרס ומדי ואח\"כ יד מלכות יון ומוקדון, והיתה טענת בני אפריקיא על פי דברי התורה, דכיון דכבר עשיתם כמונו כחטאות כל הגוים אשר סביבותיכם, וקאה אתכם הארץ בחורבן ראשון, ועד היום אתם בחטאתכם ובעונש הזה שיד העכו\"ם תקיפה עליכם, ולא טובים אתם מאתנו, והנה אנחנו קודמים לזכות בה מצד ירושה דכתיב ארץ כנען לגבולותיה. והשיב להם גביהה דמ\"מ הקב\"ה נתן אתכם להיות עבדים לעבדים וכו',  והנה אנחנו היום מבני שם עבדים נכנעים לבני יפת, מ\"מ אתם בני כנען עבדים לנו, ועבד שקנה נכסים וכו', עכת\"ד המהרש'א ז\"ל."},{"passage_id":"vayikru2_2074097c_p17","passage_content":"היוצא לנו מכל זה כי ירושת הארץ תלויה ועומדת בקיום התורה והמצוות, ומבלי קיום התורה והמצוות אין רצון השי\"ת שישבו בני ישראל בארץ הנבחרת, ואף בזמן שהם יושבים כבר על אדמתם אין להם טענת ירושה עליה אם אינם משמרין את התורה (ועיין מה שכתבנו בזה בספר ויואל משה מאמר ישוב ארץ ישראל סימן מ\"ג). ועד כמה יש להתאונן על החורבן הנורא שבזמנינו, שבא על ידי מעשיהם המתועבים של המינים והאפיקורסים, שהמשיכו את העולם לרעיונם הטמא, לקחת לעצמם ממשלה קודם הזמן, והטעו אחריהם את ישראל, בהסתתרם תחת מסוה מצות ישוב ארץ ישראל, ובמעשי תועבותיהם הם מעכבין גאולתינו ופדות נפשינו. וכדאיתא בגמרא (ראש השנה י\"ז ע\"א) המינים והאפיקורסין שכפרו בתורה ובתחיית המתים וכו' יורדין לגיהנם ונידונין בה לדורי דורות גיהנם כלה והם אינם כלים שנאמר (תהלים מ\"ט) צורם לבלות שאול וכל כך למה מפני שפשטו ידיהם בזבול שנאמר מזבול לו ואין זבול אלא ביהמ\"ק שנאמר (מלכים א' ח') בנה בניתי בית זבול לך, ופירש\"י ז\"ל שפשטו ידיהם בזבול, שהחריבו ביהמ\"ק בעוונם. והרמב\"ם ז\"ל בספר הי\"ד (פ\"ג מהלכות תשובה הלכה ו') מביא מאמר זה ומוסיף עלה שכפרו בביאת הגואל. ולכאורה אין הבנה למאמר זה, דלא מצינו בדבריהם ז\"ל באיזהו מקומן שנחרב הבית בעוון מינות ואפיקורסות, שהרי אמרו ז\"ל ביומא (דף ט' ע\"ב) דבית המקדש הראשון נחרב בעון ע\"ז ג\"ע ושפ\"ד, ובית שני חרב בעון שנאת חנם. וא\"כ מאי האי דקאמר שהמינים והאפיקורסים פשטו ידיהם בזבול, והחריבו את ביהמ\"ק בעוונם."},{"passage_id":"vayikru2_2074097c_p18","passage_content":"אמנם נראה שהוא ע\"ד מה שאמרו ז\"ל (ירושלמי יומא פ\"א) כל דור שלא נבנה ביהמ\"ק בימיו כאילו נחרב בימיו. וכלפי זאת אמרו בגמרא ר\"ה הנ\"ל על המינים והאפיקורסים שבכל דור ודור אף אחרי שחרב הבית שהם פושטים ידיהם בזבול, כי ע\"י עוונותיהם הם מעכבים גאולתינו ופדות נפשנו, והכתוב מעלה עליהם כאילו פשטו ידיהם בזבול קדשנו ותפארתנו והחריבוהו במו ידיהם, דכל דור שלא נבנה בימיו כאילו נחרב בימיו, ולפיכך עוונם גדול מנשוא, גיהנם כלה והם אינם כלים. וע\"ד זה אפ\"ל מה שהוסיף הרמב\"ם ז\"ל שכפרו בביאת הגואל, כי רמז רמז לנו בזה על המינים והאפיקורסים שבדור האחרון, ששורש המינות והאפיקורסות נמשך ממה שכפרו בביאת הגואל, והקימו לעצמם מלוכה לכפור בה' ובתורתו הקדושה, ובזה הם מעכבים את הגאולה."},{"passage_id":"vayikru2_2074097c_p19","passage_content":"והשתא ניחא מה שפירש\"י ז\"ל על אומרו עם הארץ עם שעתידין לירש את הארץ, דאף שהכתוב מדבר בזמן שכבר ירשו ישראל את האת ונתיישבו בה, אכתי אין הם מובטחים בירושה זו כי תתקיים בידם, והם צריכים עדיין תדיר לשמירת התורה והמצוות כדי שיוכלו לשבת באת ולהאחז בה, ומבלי שמירת התורה והמצוות בטלה חזקתם, וא\"כ בכל זמן ועידן הם עם שעתידין לירש את הארץ, כלומר להחזיק בירושתם, אם יזכו וישמרו בה את התורה והמצוות כראוי. ושפיר שייכא דרשה זו להכא דייקא שבא הכתוב לרמוז דאם בני ישראל יושבים בארץ ישראל ויש ביניהם עובדי ע\"ז הנותנים בניהם למולך, והבתי דינים שהם מאשרים זדים וגם מחפים על עושי רשעה ובכך מעלימים עיניהם מפשעיהם לכל חטאתם, ולא עוד אלא המה שמים אותה לחוק על אדמת הקדש כי עבודת המולך היתר גמור היא וכל העם ישמעו ויראו ויעשו עפ\"י הוראת זקניהם ושופטיהם, אזי חטאתם כבדה מאד ואין חפץ לה' שישבו בארץ ישראל באופן זה וע\"כ כתבה תורה כאן עם הארץ ודרשו ז\"ל עם שעתידין לירש את הארץ, להזהיר כי בדבר זה תלוי המשך ירושת הארץ שלא יהיו בית דין מעלימים עיניהם מן הפושעים כי אם יבערו את הרע מקרבם וכל העם ישמעו ויראו."},{"passage_id":"vayikru2_2074097c_p20","passage_content":"ועתה נחזור לביאור המדרשים המוצגים בפתח הדרוש (קושיא א' וב') עה\"פ קדושים תהיו וגו' יכול כמוני ת\"ל כי תדוש אני וכו'. דהנה נתבאר בדרושים הקודמים באורך דאף שישראל כנויים קרואים קדושים מתחלת בריאתם, כאמרם ז\"ל במקומות הרבה ישראל קדושים הם, מ\"מ אין זה אלא שם מושאל להם, אבל עצם הקדושה לא תושג כי אם בעמל רב וביגיעה עצומה בעבודת השי\"ת, ואם אין האדם עושה פעולות לזכך חומרו ולקדש עצמו, אזי ח\"ו נופל הוא לשערי הטומאה, ואף גם נפשו הטהורה החצובה מכסא הכבוד מתגשמת ונטמאת בעוונותיו."},{"passage_id":"vayikru2_2074097c_p21","passage_content":"וזהו ביאור המדרש יכול כמוני פי' כלפי שאמר הכתוב קדושים תהיו, שלא יטעו לחשוב כי אין ישראל צריכים לשום פעולה כדי להשיג קדושה זו, אלא הם קדושים בעצם ללא כל השתדלות כשם שהקב\"ה קדוש בעצם ת\"ל כי קדוש אני ה\"א קדושתי למעלה מקדושתכם. כלומר דלא שייך ענין קדושה בעצם אלא גבי הקב\"ה, אבל ישראל צריכים להרבות במצוות ובמע\"ט כדי שבאמצעותם יזכו למדריגת קדושים."},{"passage_id":"vayikru2_2074097c_p22","passage_content":"ובבחינה זו יתבאר גם המדרש (קושיא א') הה\"ד ישלח עזרך מקודש, בהקדם עוד מה שכתב ק\"ז זלה\"ה בישמח משה בהפטרת פרשת דברים עה\"כ (ירמיה ל') כי נדחה קראו לך ציון היא דורש אין לה בשם הגאון בעלי טורי זהב זלה\"ה, דהנה שם ציון מורה על מצויינים בהלכה (ברכות ח' מ\"ב) מצויינים במצוות (שה\"ש ג') והנה איתא בספרים ובמדרשים שלכך חרבה ירושלים מפני שעבדו בה ע\"ז ונידונה כעיר הנדחת. והנה במסכת סנהדרין (דף ע\"א ע\"א) אי' עיר הנדחת לא היה ולא יהיה אתיא כר\"א דאמר עיר שיש בה מזוזה אחת אינה נעשית עיר הנדחת, ורצה לומר איזה מצוה שיש בה מציל אותה דלא תהיה עיר הנדחת, וא\"א שלא תהיה איזה מצוה דאפילו פושעי ישראל מלאים מצוות כרמון. ועפ\"י זה יתבאר הכתוב הנ\"ל בירמיה נדחה קראו לך, ר\"ל שאומרים שאת עיר הנדחת ודנו אותך כעיר הנדחת ח\"ו, והוא תרתי דסתרי אהדדי, דכיון דנקראת ציון ע\"ש שמצויינים במצוות א\"א להיות עיר הנדחת, וז\"ש ציון היא ואיך יתכן שקראו לך נדחה, אבל הסבה שקראו לך נדחה היא משום שדורש אין לה לציון שידרוש מפני מה היא נקראת ציון, לכך קראו לך נדחה, אבל באמח לאו נדחה את, עכ\"ד הט\"ז זלה\"ה. וז\"ש המדרש קדושים תהיו הה\"ד ישלח עזרך מקדש מקידוש מעשים שיש בידך, בא לבאר בזה כוונת הכתוב קדושים תהיו דאין זו קדושה דאתיא ממילא, אלא מקידוש מעשים שיש בידך, ר\"ל שתקדש עצמך במצוות ובמע\"ט אז ישלח הקב\"ה עזרך מקודש, שישפיע עליך שפע קדש ממעון קדשו מן השמים, והדר דרש ומציון יסעדך מציון מעשים שיש בידך, כלומר שאם תהיה מצויין במצוות ובמע\"ט אזי יסעוד ויסמוך אותך הקב\"ה שאתחזק בדרך הטוב וישפיע עליך קדושה עילאה, ובלאו הכי לא סגי, כי לא תשרה הקדושה על האדם אלא אם יתאמץ במצוות ובמע\"ט בכל כוחו, ואז מן השמים יסיימוהו לעלות מעלה מעלה במדריגות הקדושה."},{"passage_id":"vayikru2_2074097c_p23","passage_content":"ועל פי מה שביארנו בארוכה כי ירושת א\"י תלויה ועומדת, אם יעסקו ישראל בתורה ובמצוות תהיה הארץ מוחזקת בידם, וח\"ו אם לאו בטלה חזקת ירושתם, יתיישב על נכון מה שדרשו בדברי הכתוב ישלח עזרך מקדש ומציון יסעדך מקידוש מעשים וכי' ומציון מעשים שיש בידך, דשפיר מושך שייכי להדדי דרשה זו עם פשטות הכתוב (קושיא א'), שהרי אף ירושת ציון וירושלים תלויה בקידוש ובציון מעשיהם של ישראל, ורק על תנאי זה ציון וירושלים נתונה בידם של ישראל, אם יקדשו עצמם ויהיו מצויינים במצוות ובמעשים טובים, ועל שם כך היא נקראת ציון המצויינת במצוות ובמעשים טובים. ירחם ה' על ישראל עמו, וישפיע בלבבינו שנזכה לעשות תשובה שלימה לפניו, ולהתקרב לקדושתו יתברך, ובמהרה נזכה לראות בהתרוממות קרן התורה וישראל בקדושה ובטהרה, בהתגלות כבוד שמים עלינו במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru2_e9b04849","title":"קדושת ישראל וגדרי תורה","summary":"בפרשת קדושים תהיו נדרש העם לקדש עצמם ולשמור גדרים וסייגים. יש להבין מדוע נאמרה בהקהל, שכן גזירות חכמים תלויות בקיום התורה. המדרש מדגיש את ההבדל בין קדושת העליונים לתחתונים, והצורך בגדרים מפני יצר הרע.","contents":[{"passage_id":"vayikru2_e9b04849_p1","passage_content":"באופן אחר יתבאר מה שכפל הפסוק לומר דבר ואמרת. גם טעם ששינה מדיבור קשה לאמירה רכה בתוך כדי דיבור."},{"passage_id":"vayikru2_e9b04849_p2","passage_content":"ב) בתו\"כ (הובא ברש\"י ז\"ל) דרשו מדכתיב דבר אל כל עדת בני ישראל מלמד שנאמרה פרשה זו בהקהל מפני שרוב גופי תורה תלויין בה. והקשו המפרשים ז\"ל הלא כל פרשיותיה של תורה בהקהל נאמרו, כדאיתא במסכת עירובין ומייתי לה רש\"י ז\"ל בסוף פרשת כי תשא כיצד סדר משנה וכו' נכנסו כל העם וכו', מבואר מזה שבכל המצוות הקהיל משה את עדת בני ישראל, וא\"כ מה הודיענו הכתוב בפרשה זו דייקא שנאמרה בהקהל. והרא\"ם ז\"ל תירץ דבשאר מצוות לא נקהלו כל העדה יחד, אלא נכנסו לפניו כת אחר כת כמבואר בברייתא הנ\"ל, אבל בפרשה זו שרוב גופי תורה תלויין בה נצטוה להקהיל את כל העדה ביחד. אך האה\"ח הק' דחה תירוצו יעיי\"ש בארוכה. והעלה כי בסדר הראשון לא היה מדבר משה אלא לאנשים, אבל כאן צוה ה' את משה שידבר אל כל עדת בני ישראל אנשים נשים וטף, כסדר שהיו מקובצים במ\"ת. וכיוצא בזה כתב גם הר\"א מזרחי ז\"ל באחד מן התירוצים. אך אכתי צ\"ב דאם לכך נתכוון הכתוב מדוע לא נאמר בפירוש להקהיל את כל העדה אנשים נשים וטף כדכתיב במצות הקהל. ותו דאם היה צורך להשמיע המצוות הנאמרות בפרשה זו אף לנשים, משום דאף בהו שייכו מצוות אלו, א\"כ תקשה מדוע לא נצטוו להקהל אף הם בשעה שנאמרו כל האזהרות והעונשים, דאף אינהו שייכו בהו, דהשוה הכתוב אשה לאיש לכל עונשין שבתורה, אלא ודאי היינו טעמא שלא נקהלו הנשים בשעה שנאמרו לישראל מצוות התורה, משום דנשי לא שייכי בתלמוד תורה, ואין נוהג בהם חלק הלימוד, ע\"כ סגי באזהרת האנשים, והם יזהירו לנשים באזהרות ובמצוות דשייכו בהו. ולפי זה חזרה הקושיא למקומה מה טעם נאמרה פרשת קדושים אף לנשים, ולא סגי שתאמר לאנשים כשאר מצוות התורה."},{"passage_id":"vayikru2_e9b04849_p3","passage_content":"ג) במד\"ר קדושים תהיו יכול כמוני ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם. והוא תמוה איך יעלה על הדעת לחשוב כזאת שתהיה קדושת בו\"ד שום בצד מה אל קדושת הבוי\"ת, דאיצטריך קרא לאפוקי ממחשבה זו."},{"passage_id":"vayikru2_e9b04849_p4","passage_content":"ד) עוד איתא במד\"ר (פכ\"ח ח') ר' אבין אמר וכו' משל למלך וכו', כך העליונים לפי שאין יצה\"ר מצוי בהם קדושה אחת שנאמר (דניאל ג') ובמאמר קדישין שאילתא, אבל התחתונים לפי שיצה\"ר שולט בהם הלואי לשתי קדושות יעמדו, הה\"ד דבר אל כל עדת בני ישראל וכתיב והתקדשתם והייתם קדושים, ע\"כ. וצריך ביאור."},{"passage_id":"vayikru2_e9b04849_p5","passage_content":"ולבא אל הביאור נראה דהנה כבר נתבאר בדברנו לעיל באריכות דכל הפירושים האמורים בדברי המפרשים ז\"ל במצוות קדושים תהיו סובבים הולכים אל מקום אחד, שענין המצוה הזו היא ההתבדלות והפרישה מן הדברים המותרים כדי שלא יבואו להכשל בגופי איסורים, ובכלל אזהרה זו גם הגדרים והסייגים אשר גוזרים החכמים הקדושים על ישראל כדי שלא יקרבו לעבור על גופי תורה, וכאשר נתבאר לעיל מדברי ק\"ז הייטב לב זלה\"ה פרשה זו שביאר בזה מאה\"כ קדושים תהיו, ע\"ד מאמרם ז\"ל ביבמות כל המקיים דברי חכמים נקרא קדוש, ועד\"ז באה האזהרה לבני ישראל שיקיימו דברי חכמים לשמור ולעשות ככל אשר יגזרו עליהם גדרים וסייגים כפי ראות עיניהם לצורך שמירת הדת, ובזה קדוש יאמר להם. והנה האה\"ח הקדוש בפרשת בחקתי כתב כי אסור לעם הארץ להתנהג בחסידות, ולעשות גדרים וסייגים כמנהג החסידים, משום שלפעמים יבא להחמיר בדבר שיהיה ע\"י זה עבריין וכו', וכמו ששמענו מעשה שהיה כן, עיי\"ש. ופירש בזה דברי הכתוב אם בחקותי תלכו, וכמ\"ש רש\"י ז\"ל שתהיו עמלים בתורה, אז ואת מצוותי תשמרו לעשות לכם משמרת גדרים וסייגים כדי לקיימם לא זולת זה, עכת\"ד ז\"ל."},{"passage_id":"vayikru2_e9b04849_p6","passage_content":"ועפ\"י זה אף אנו נאמר דלעולם ענין הקהלת העדה בפרשה זו היה כמו בשאר מצוות התורה, ואפ\"ה לק\"מ קושיית המפרשים ז\"ל דא\"כ מה משמיענו הכתוב שנאמרה פרשה זו בהקהל, והלא פשיטא היא דכל מצוותיה של תורה בהקהל נאמרו, דהשתא טובא אשמעינן קרא בהכי, דהנה כיון שבפרשה זו נצטוו ישראל לקדש עצמם במותר להם ולעשות גדרים וסייגים לתורה, ודבר זה אינו ניתן למסור ביד כל אדם לגזור גזירות כחפצו, כי אם לחכמי ישראל שבכל דור ודור היודעים לשקול בשקל הקדש מה הם הגדרים והסייגים הנחוצים לגדור ולהוסיף לפי מצב הדור, ואין מדמין גזרות חכמים זה לזה, כהא דתנן במסכת ידים (פ\"ג מ\"ב) אין דנין דברי סופרים מדברי סופרים וכתב הרע\"ב ז\"ל דאין ללמוד מגזירה אחת למקום אחר דמאי דתקון תקון ומאי דלא תקון לא תקון. עכ\"פ מבואר דכח זה לגזור גזירות ולעשות סייגים נמסר רק לחכמי ישראל מוסדי דור ודור, ולפיכך איצעריך קרא להודיענו דפרשה זו נאמרה בהקהל, דאי לאו שגילה לנו הכתוב דבר זה היתה הסברא נותנת שלא אמר משה מצות קדושים תהיו שענינה עשיית גדרים וסייגים אלא לגדולי ישראל, שבהם בלבד שייך לעשות גדרים וסייגים, אבל כל עדת ישראל דלא שייך בהו עשיית גדר וסייג לא שמעו אמירת פרשה זו, להכי איצעריך קרא לאשמעינן דבר אל כל עדת בני ישראל, שאף פרשה זו נאמרה בהקהלת כל העדה."},{"passage_id":"vayikru2_e9b04849_p7","passage_content":"אכן באמת טעמא בעי דכיון דלא שייכא עשיית גדרים וסייגים כי אם בחכמים, מ\"ע נאמרה פרשה זו בהקהלת כל העדה, והרי לא אליהם נוגעים הדברים, דאינהו אסירי להוסיף גדרים מעצמם, משום שהם עלולים לטעות ולהכשל. ואפ\"ל דלטעם זה אמר הכתוב בפרשה זו דבר ואמרת, ע\"ד שפירש\"י ז\"ל במאה\"כ אמור אל הכהנים וגו' ואמרת אליהם להזהיר גדולים על הקטנים, כמו כן אפ\"ל גם הכא, דכפל האמירות בא להורות דתחלה הזהיר משרע\"ה את גדולי ישראל חכמי הדורות שיעשו גדרים וסייגים לתורה, ועוד הזהירם שימסרו וילמדו גדרים וסייגים אלו להמון העם. וזה שאמר הכתוב \"דבר\" הוא הדבור לחכמי ישראל לצוותם שיגזרו גזרות כפי הצורך לקיום התורה, ואח\"כ אמר \"ואמרת אליהם\" להזהיר הגדולים על פשוטי העם קדושים תהיו, דהיינו שיקיימו גזירות החכמים שע\"י כן יהיו נקראים קדושים כמבואר."},{"passage_id":"vayikru2_e9b04849_p8","passage_content":"ולפי זה מובן הטעם שנאמרה פרשה זו בהקהלת כל העדה, כדי שיקבלו על עצמם כל ישראל לקיים כפי אשר יגזרו עליהם החכמים הקדושים גדרים וסייגים, וא\"כ גם אינהו שייכו במצוה זו לשמור ולעשות כפי אשר יורו אותם חכמי ישראל. ואפשר לרמוז כוונה זו גם בדברי רש\"י ז\"ל פרשה זו בהקהל נאמרה מפני שרוב גופי תורה תלויים בה, דבא לתת טעם למה שנאמרה פרשה זו בהקהלת העדה אף שהיא מסורה לגדולי ישראל בלבד לגזור גזרות, לזאת אמר שרוב גופי תורה תלויים בה, כלומר במה שיקיימו ישראל הגזירות והסייגים אשר יגדרו החכמים תלוי קיום התורה, ע\"כ הקהילו את כל העדה לצוותם לשמוע דברי חכמים, ולקבל על עצמם גזירותיהם, שהם היסוד לקיום התורה."},{"passage_id":"vayikru2_e9b04849_p9","passage_content":"ועתה נבא לבאר טעם שנאמרו במקרא זה דבור קשה ואמירה רכה גם יחד, עפ\"י מה שהקשו התוס' במסכת שבת (דף פ\"ח ע\"א) דאמאי הוצרכו ישראל לכפות עליהם הר כגיגית למען יקבלו את התורה, והרי ענו ואמרו נעשה ונשמע, וקבלו על עצמם לקיים התורה מרצונם הטוב, ואמאי הוצרכו עוד לכפיה, ועיי\"ש מה שתירצו. ובדברי המדרש תנחומא פרשת נח (סימן ג') מיושבת קושיית התוס', דקאמר שמה שקבלו ישראל על עצמם נעשה ונשמע היינו על תורה שבכתב דייקא, אבל תושבע\"פ שיש בה דקדוקי מצוות קלות וחמורות לא רצו לקבל, ולפיכך הוצרכו לכפית ההר. והאלשיך הקדוש כתב דכוונת ישראל במה שמיאנו לקבל תורה שבע\"פ היתה מאהבת המקום ב\"ה, באמרם מי יעצור כח לעמוד בדקדוקי תורה שבע\"פ. ופן נעבור עליהם ונמרה פני מלך עליון ונורא ח\"ו."},{"passage_id":"vayikru2_e9b04849_p10","passage_content":"ועפ\"י זה אפ\"ל דלפי שבפרשה זו כלולות ב' סוגי מצוות, הא' הם המצוות שבכתב הכתובות והמפורשות, והב' הם המצוות שעליהם לקיים מכח גזירות החכמים, הכלולות במצות קדושים תהיו, על כן אמר הכתוב דבר ואמרת, דכלפי המצוות המפורשות בקרא להדיא כתיב ואמרת, כי קבלו אותם ישראל בחפץ לב, והיו להם אמרות רכות ונעימות, שכבר אמרו נעשה ונשמע לקיים תשב\"כ, אכן כלפי הציווי הנכלל במצות קדושים תהיו לקיים דברי חכמים והגזירות והסייגים שהם עתידין לגזור, כתיב דבר לשון קושי, כי מצוה זו לא קבלו ישראל ברצון, מחמת שנתייראו פן לא יוכלו לעמוד באלו, דגדרים וסייגים אין להם שיעור, ויש אשר גזרו חכמינו ז\"ל כמה גזירות בענין אחד, וכולהו חדא גזירה נינהו, דאי לאו הא לא קיימא הא."},{"passage_id":"vayikru2_e9b04849_p11","passage_content":"ובבחינה זו תתבאר כוונת המדרש (קושיא ד') עליונים שאין יצה\"ר מצוי בהם קדושה אחת דיה להם אבל תחתונים שיש בהם יצה\"ר הלואי לשתי קדושות יעמדו. פירוש דלפי שיש בהם יצה\"ר המסיתם לעבירה על כן זקוקים הם לעשיית גדרים וסייגים, כדי שלא יכשלו בגוף האיסור, ואף גם לזה יקרא קדושה, כאמרם ז\"ל כל המקיים דברי חכמים נקרא קדוש, ואמרו קדש עצמך במותר לך. וזהו שאמר הלואי לב' קדושות יעמדו, כלומר הלואי יועיל להם כח שמירת הגדרים והסייגים, שלא יכשלו בגוף המצוות, והם הב' קדושות גוף האזהרה והגדר שגדרו חכמים לשמירתם."},{"passage_id":"vayikru2_e9b04849_p12","passage_content":"ובדרך זה נלך לבאר גם כוונת המדרש קדושים תהיו יכול כמוני וכו', עפ\"י מה שכתב הרמב\"ם ז\"ל (בפ\"ב מהלכות ממרים ה\"פ) וזה לשונו, הואיל ויש לב\"ד לגזור ולאסור דבר המותר וכו', וכן יש להם להתיר איסורי תורה לפי שעה, א\"כ מהו זה שהזהירה תורה לא תוסיף עליו ולא תגרע ממנו, אלא אם יבא בית דין ויאסור בשר עוף בחלב ויאמר שהוא אסור מן התורה, הרי זה מוסיף על מצוות התורה, אבל אם יאמר בשר העוף מותר מן התורה, ואנו נאסור אותר משום גזירה אין זה מוסיף אלא עושה סייג לתורה, וכן כל כיוצא בזה, עכ\"ל. ועפ\"י זה יתבאר המדרש דכלפי שהזהיר הכתוב לחכמי ישראל במאמר קדושים תהיו שיעשו סייג לתורה, לזאת אמר יכול כמוני, כלומר שיהיו החכמים רשאים להשוות הגזרות שהם גוזרים למצוות השי\"ת, באמרם שגזירותיהם אסורות מן התורה, ת\"ל כי קדוש אני, קדושתי למעלה מקדושתכם, ולפיכך עליכם לעשות הפרש בין המצוות שנאמרו מפי הגבורה לבין הגזירות שהחכמים הקדושים מוסיפים, ועליהם לגלות דעתם ולאמר דבר זה מותר מן התורה ואנו נאסור אותו משום גזירה, כמו שכתב הרמב\"ם ז\"ל."}]},{"dvar_torah_id":"vayikru2_1d65ff1a","title":"קדושה ופרישות לכל ישראל","summary":"פרשת קדושים תהיו נדרשת בהקהלת כל ישראל, להורות על חובת הפרישה מהמותרות. כל אדם לפי מדרגתו חייב להתקדש, ואין לפטור עצמו מהמצווה. קדושה אינה תלויה במעמד אלא במעשה הפרטי של כל אחד ואחד.","contents":[{"passage_id":"vayikru2_1d65ff1a_p1","passage_content":"עוד יאמר לבאר דברי רשיז\"ל פרשה זו בהקהל נאמרה מפני שרוב גופי תורה תלויים בה. והקשו המפרשים דמאי צריכא למימרא, והלא כל פרשיותיה של תורה בהקהלת כל עדת ישראל נאמרו. והגור ארי' כ' דבשאר פרשיות לא היתה ביאת כולם חובה משא\"כ בפ' זו נקהלו כל עדת ישראל א' מהם לא נעדר."},{"passage_id":"vayikru2_1d65ff1a_p2","passage_content":"ונראה דהנה רש\"י ז\"ל ביאר דמצות קדושים תהיו ענינה פרישה מן העריות ומן העבירה. והרמב\"ן ז\"ל כתב על דברי רש\"י ז\"ל אבל בתורת כהנים ראיתי סתם פרושים תהיו וכן שנו שם והתקדשתם והייתם קדושים כי קדוש אני ה' כשם שאני קדוש כך אתם תהיו קדושים כשם שאני פרוש כך אתם תהיו פרושים ולפי דעתי אין הפרישות הזו לפרוש מן העריות כדברי הרב, אבל הפרישות היא המוזכרת בכל מקום בתלמוד שבעליה נקראים פרושים. והענין כי התורה הזהירה בעריות ובמאכלים האסורים, והתירה הביאה איש באשתו ואכילת הבשר והיין, א\"כ ימצא בעל התאווה מקום להיות שעוף בזימת אשתו, ולהיות בסובאי יין וזוללי בשר למו, וידבר כרצונו בכל הנבלות שלא הוזכר איסור זה בתורה, והנה יהיה נבל ברשות התורה, לפיכך בא הכתוב אחרי שפרט האיסורים שאסר אותם לגמרי, וציוה בדבר כללי שנהיה פרושים מן המותרות וכו'. באלו ובכיוצא בהם באה המצוה הזאת הכללית, אחרי שפרט כל העבירות שהן אסורות לגמרי וכו'. עיקר הכתוב בכיוצא בזה יזהיר, שנהיה נקיים טהורים ופרושים מהמון בני אדם שהם מלכלכים עצמם במותרות ובכיעורים וכו', עכדה\"ק לענינינו. ולפי דברי הרמב\"ן ז\"ל צריך לומר דטעם הדבר שלא מנה הכתוב מצות קדושים תהיו בכלל תרי\"ג מצוות, משום שהיא מצוה כוללת כל עניני פרישה והרחקה ממותרות ומתענוגים, ובכלל זה ישנם כמה דברים שונים."},{"passage_id":"vayikru2_1d65ff1a_p3","passage_content":"ואפ\"ל עפ\"י דברי הרמב\"ן ז\"ל מה שנאמרה פרשה זו בהקהלת כל העדה אחר מהם לא נעדר, יותר מבכל המצוות, דהנה כל התרי\"ג מצוות שמירתן שוה בכל ישראל, ואין כל הבדל בין בני העליה לפשוטי העם, כולם חייבים בקיום המצוות בכל פרטיהן ודקדוקיהן, משא\"כ מצות קדושים תהיו שענינה אזהרה לפרוש מן המותרות כאמרם ז\"ל קדש עצמך במותר לך, ואזהרה זו אף שהיא נוהגת בכל אדם, מ\"מ אין ענינה ובחינתה שוה בכל, כי הכל תלוי בטבע האדם ותכונתו מדרגתו ובחינתו, כי לא הרי חובת הפרישה באיש ההמוני כחובת הפרישה בבני העליה, והכל לפי מה שהוא אדם, וא\"כ נמצא דאין ללמוד מאחד לחבירו בעניני קדושה ופרישות, כי אין שיעור וגבול למעלות הקדושה. ולפיכך הוצרכה פרשה זו להיות נאמרת במעמד כל עדת בני ישראל, דאילולא זאת מי שלא היה באותו מעמד היה יכול לטעון ולומר כי לא אליו מכוון ציווי זה, כי לפי מצבו ומעמדו אין הוא בכלל חיוב פרישה מן המותרות, ולא נאמרה פרשה זו אלא לבני העליה מובחרים שבעם, אשר המה במדרגה זו להתקדש במותר להם. וכדי להוציא מכך נאמרה פרשה זו בהקהלת כל עדת בני ישראל, כדי להודיעם כי פרשה זו נוהגת בכל אחד ואחד מישראל לפום דרגא דיליה, ואין לשום אדם לפטור עצמו ממצוה זו. אלא כל אחד מישראל באשר הוא שם עליו להתבונן ולשום לב לתקן מדותיו, ולזכך חומר גופו, שיוכל לעלות במעלות הקדושה, כל יחיד ויחיד לפי מדרגתו ובחינתו, וידע וישכיל כי כל שער משערי הקדושה אשר יבא אל תוכו עדיין ישנו בגדר הכנסה למעלה ממנו, כי אין שיעור וערך לדרגות הקדושה המזומנים לכל הרוצה ליטול את השם, כמ\"ש האה\"ח הקדוש. ולפיכך פרט הכתוב בפרשה זו דבר אל כל עדת בני ישראל, להודיע כי חיובא רמיא על כל אדם לקיים מצוה זו, ואין אתה בן חורין להבטל ממנה."}]},{"dvar_torah_id":"vayikru2_cc3590c5","title":"מורא אב ואם ושמירת שבת","summary":"הדבר תורה עוסק בהקשר בין מצוות כיבוד אב ואם לשמירת שבת, ומבאר מדוע לא ישמע הבן לאביו אם מצווהו לחלל שבת. נדונה גם השאלה על תוספת שבת והאם היא מדאורייתא, תוך הבאת קושיות ותירוצים מחכמים שונים.","contents":[{"passage_id":"vayikru2_cc3590c5_p1","passage_content":"איש אמו ואביו תיראו ואת שבתתי תשמורו אני ה' אלקיכם. פירש\"י סמך שמירת שבת למורא אב לומר אע\"פ שהזהרתיך על מורא אב אם יאמר לך חלל את השבת אל תשמע לו וכן בשאר כל המצוות. אני ה' אלקיכם, אתה ואביך חייבים בכבודי לפיכך לא תשמע לו לבטל את דברי, ע\"כ. הקשה הרא\"ם ז\"ל דהיכי מפיק ממה שסמכה תורה שמירת שבת למורא אב ואם דשמירת שבת עדיפא ממורא אב ואם ולא ההיפך, אדרבה מדהקדים הכתוב מורא אב ואם לשמירת שבת משמע דמורא אב ואם עדיף טפי, דכי האי גוונא דייק רש\"י ז\"ל בפרשת ויקהל הקדים אזהרת שבת לצווי מלאכת המשכן לומר שאינה דוחה את השבת. הרי דהמוקדם בקרא עדיף לדחות את הנאמר אחריו, וה\"נ הול\"ל איפכא דמורא אב ואם הקודם בכתוב ידחה למצות שבת הכתובה לאחריו."},{"passage_id":"vayikru2_cc3590c5_p2","passage_content":"ב) החזקוני ז\"ל הקשה דאמאי איצטריך קרא למיעוטי שאם אביו מצווהו חלל את השבת לא ישמע לו, והלא בלאו הך קרא נמי הוה ידעינן ליה, דכיון שאביו מצווהו לחלל שבת הרי הוא רשע ואין הבן חייב בכבודו, כמו שדרשו ז\"ל (ב\"מ ס\"ב ע\"ב) מקרא דכתיב ונשיא בעמך לא תאור בעושה מעשה עמך, ותירץ החזקוני דהכא מיירי שהאב מצווהו לחלל את השבת באיסור שבות דרבנן, דהו\"א דאתי מצות כיבוד אב ואם דאורייתא ודחי לשבות דרבנן, להכי איצטריך קרא דאף באיסור דרבנן לא יאבה לו ולא ישמע אליו. אכן תירוץ זה קשה להולמו מכמה טעמים, חדא קשה דכיצד יתכן לומר שנאמר בתורה פסוק להזהיר שלא ישמע לאביו אם ציווהו לעבור על שבות דרבנן, בעוד שעדיין לא נאסרו שבותים מן התורה כלל, אלא שחכמים היו עתידין לאסרו אחרי כן."},{"passage_id":"vayikru2_cc3590c5_p3","passage_content":"ג) עוד יש לתמוה על תירוץ החזקוני שהרי בדברי הגמרא (יבמות דף ה' ע\"א) מבואר להדיא דאיצטריך הך קרא למיעוטי שאל ישמע לאביו בזמן שמצוהו לעבור על איסור תורה, דבעי גמרא לאוכוחי דעשה דוחה אפילו לא תעשה שיש בו כרת, מדתניא יכול יהא כיבוד אב ואם דוחה שבת ת\"ל איש אמו ואביו תיראו ואת שבתתי תשמורו כולכם חייבים בכבודי מאי לאו דא\"ל שחוט לי בשל לי וטעמא דכתב רחמנא את שבתתי תשמרו הא לאו הכי הוה דחי, וקא מדחי בגמרא לא לאו דמחמר (שהוא לאו שאין בו כרת לפיכך הוה דחי ליה עשה דכיבוד אב ואם אי לאו דכתיב קרא למיעוטי) הרי להדיא דקרא דאיש אמו ואביו תיראו ואת שבתתי תשמורו מיירי במצווהו לחלל שבת באיסור דאורייתא, ונסתר תירוצו של החזקוני ז\"ל, והדרה קושייתו לדוכתה, דאמאי איצטריך קרא שלא ישמע לאביו המצווהו לעבור על איסור תורה, והלא בלא\"ה אינו חייב לכבדו ולשמוע בקולו, דאינו עושה מעשה עמך מקרי."},{"passage_id":"vayikru2_cc3590c5_p4","passage_content":"ד) ובעיקר מה שחידש לנו החזקוני ז\"ל בתירוצו דהעובר על איסור דרבנן אכתי עושה מעשה עמך הוא, יש להקשות דאיתא בגמרא (יבמות כ' ע\"א) על הא דתנן במתני' התם איסור קדושה דהיינו שניות מדברי סופרים ואמאי קרי ליה איסור קדושה אמר אביי כל המקיים דברי חכמים נקרא קדוש א\"ל רבא וכל מי שאינו מקיים דברי חכמים קדוש הוא דלא מקרי רשע נמי לא מקרי בתמיה וכו' עיי\"ש. הרי לפניך דהעובר על דברי חכמים נקרא רשע, וא\"כ אף אם נתפוס כדברי החזקוני דהכא מיירי במצוהו לעבור על איסור דרבנן אכתי תקשה דלא איצטריך קרא שאינו צריך לשמוע לו, שהרי מכיון שאביו מצוהו לעבור על איסור דרבנן לאו עושה מעשה עמך הוא. אמנם לקושטא דמילתא דבר זה במחלוקת שנוי דדעת הרמב\"ם ז\"ל (פ\"ו מהלכות ממרים הי\"א) דאעפ\"י שהאב רשע ובעל עבירות הבן מחוייב בכבודו והטור ביורה דעה (סימן ר\"מ) נחלק עליו דכיון שהוא רשע אינו חייב בכבודו ומייתי ראיה מברייתא (ב\"ק צ\"ד ע\"ב) גבי הניח להם אביהם פרה גזולה וכו' יעיי\"ש."},{"passage_id":"vayikru2_cc3590c5_p5","passage_content":"ה) גם צריך ביאור להבין דרשתם ז\"ל שע\"כ הסמיכה תורה מורא אב ואם למצות שבת להורות שאם אביו מצוהו לחלל שבת לא ישמע אליו, ולכאורה הרי ענין זה שייך בכל המצוות כולם, ולא במצות שבת בלבד, דזיל בתר טעמא דקאמר קרא אני ה' אלקיכם ופירש\"י אתה ואביך חייבים בכבודי לפיכך לא תשמע לו לבטל דבריו, וא\"כ יש לתמוה מדוע פרט לנו הכתוב כאן מצות שבת דייקא, יותר היה ראוי שיאמר איש אמו ואביו תיראו ואת מצוותי תשמרו, והוה שמעינן מינה דבכל המצוות דינא הכי שאם אביו מצווהו לעבור על אחת מהנה לא ישמע לו לבטל מצוות ה'."},{"passage_id":"vayikru2_cc3590c5_p6","passage_content":"ו) עוד יש להתבונן דמאי שייך כל ענין זה שלא ישמע לאביו כשהוא מצוהו לחלל שבת למצות קדושים תהיו."},{"passage_id":"vayikru2_cc3590c5_p7","passage_content":"ז) אל תפנו אל האלילים ואלהי מסכה לא תעשו לכם, פירש\"י אלילים לשון אל כלא הוא חשוב תחלתן אלילים הם כלא הם חשובים ואם אתה פונה אחריהם סופך לעשותן אלהות, ע\"כ. וצ\"ב דאם מיירי שהוא יודע שהם אלילים וכאין וכאפס נחשבו בעיניו מה לו להיות פונה אחריהם."},{"passage_id":"vayikru2_cc3590c5_p8","passage_content":"ח) לא תעשו לכם, פירש\"י לא תעשו לאחרים ולא אחרים לכם. וצ\"ב דלפי זה עסקינן לקרא בסכינא חריפא, דלא תעשו היא אזהרה בפני עצמה שלא תעשו לאחרים, ותיבת לכם מילתא אחרינא היא שאחרים לא יעשו בשבילכם."},{"passage_id":"vayikru2_cc3590c5_p9","passage_content":"והנראה לומר בביאור כל הענין בהקדם קושיית המהרש\"א ז\"ל במסכת נדה (דף ל\"ח ע'א) אהא דדרשו ז\"ל במסכת שבת (דף קי\"ח ע\"ב) אלמלא שמרו ישראל ב' שבתות מיד היו נגאלין שנאמר כה אמר ה' לסריסים אשר ישמרו את שבתתי, וקשה דלפי זה דהיכא דכתיב שבתתי ב' שבתות במשמע, א\"כ כיצד יתבאר מאה\"כ בפרשת תשא אך את שבתתי תשמרו, דהתם ע\"כ ליכא למימר דקא מזהר לן קרא אשמירת ב' שבתות דוקא, יעיי\"ש. וכיוצא בזה יש להקשות מדברי הפסוק בפרשתן דכתיב ואת שבתותי תשמרו דלא יתכן לומר שהוא מזהיר על שמירת ב' שבתות בלבד."},{"passage_id":"vayikru2_cc3590c5_p10","passage_content":"ונבא אל הביאור עפ\"י דברי ק\"ז זלה\"ה בייטב פנים (דרוש לשבת הגדול ב') לבאר מאמרם ז\"ל אלמלי שמרו ישראל ב' שבתות מיד היו נגאלין, ולכאורה זה סותר להא דאיתא במד\"ר (פ' בשלח פכ\"ה י\"ב) אם משמרים ישראל את השבת כראוי אפילו יום אחד בן דוד בא למה שהיא שקולה כנגד כל המצוות, והכי איתא נמי בירושלמי דתענית (פ\"א ה\"א), הרי דשמירת שבת אחת כחה יפה להביא את הגאולה. ותירץ ק\"ז זלה\"ה דשתי שבתות היינו עיצומו של יום השבת ותוספת שבת. וכדאיתא בשו\"ע או\"ח (סימן רס\"א) דמצוה להוסיף מחול אל הקדש איזה זמן שהוא ודאי יום, וזמן תוספת זה הוא מתחילת שקיעת החמה רצה לעשות כולו תוספת עושה רצה לעשותו מקצתו עושה ובלבד שיוסיף משעה שהוא ודאי יום מחול אל הקדש, עכת\"ד הקדושים. היוצא מזה כי היכא דכתיב שבתתי אמרינן דאף תוספת שבת בכלל. והנה השו\"ע או\"ח הלכות שבת (סימן רס\"א ס\"ד) פסק דאחר עניית ברכו אעפ\"י שעדיין יום הוא אין מערבין ואין טומנין משום שכבר קבלו שבת עליהם, וכתב המג\"א (ס\"ק י\"ב) דבקיבל עליה תוספת שבת גרע מבין השמשות דבספק חשיכה קיי\"ל דטומנין את החמין, ע\"כ. והגאון חכם צבי בתשובותיו סימן י\"א לחלק יצא על פסק זה, שמקורו טהור מדברי המרדכי, ותמה תמה יקרא דלפי זה נמצא שיהא חמור תוספת שבת שהוא מקבלו ברצונו ואינו אלא עשה בעלמא, מבין השמשות שהוא ספק איסור סקילה."},{"passage_id":"vayikru2_cc3590c5_p11","passage_content":"ובהגהות דגול מרבבה הוסיף להקשות מדברי השו\"ע להלן בהלכות עירובין (סימן שצ\"ג ס\"ב) שהביא גם דעת רבינו יואל המתיר לערב ביה\"ש אף אם כבר קיבל עליו תוספת שבת, ולמה השמיע בסימן רס\"א דעת המתיר ולא הביא כ\"א דברי המרדכי האוסר, ותירץ הדגמ\"ר דבהלכות עירובין מיירי שקיבל על עצמו תוספת שבת ואמר להדיא שהוא מקבלו על עצמו בתורת תוספת שבת, וא\"כ לא קבל ע\"ע רק איסור עשה, משו\"ה יש להקל בשבותין, אבל בסימן רס\"א מיירי אחר עניית ברכו שמסתמא מקבל עליו קדושת השבת ממש, ע\"כ השמיע דעת המקיל עכת\"ד הדגמ\"ר ז\"ל."},{"passage_id":"vayikru2_cc3590c5_p12","passage_content":"והשתא דאתאן להכי, אף אנן נימא דהך ברייתא דדריש מדכתיב איש אמו ואביו תיראו ואת שבתתי תשמרו שאם אביו מצוהו לחלל שבת לא ישמע לו, איכא לאוקמה דמיירי במצווהו לעשות מלאכה בפניא מעלי דשבתא בטרם יבא השמש ויעריב, ועדיין יום גמור הוא, ומיירי שהאב לא קבל על עצמו תוספת שבת ולגביה דידיה אכתי חול הוא, אלא שהבן קיבל ע\"ע תוספת שבת ואמר בהדיא שהוא מקבלו עליו כתוספת, וא\"כ הבן עובר באיסור עשה אם יעשה מלאכה באותו זמן, אמנם הכא מיירי שנעלם מאביו והוא לא ידע שבנו קבל ע\"ע תוספת שבת, דאילו הוה ידע שבנו קיבל ע\"ע תוספת שבת ודאי הוה מימנע מלצוותו לעשות מלאכה באותה שעה, אלא שהוא סבור בדעתו שאצל בנו אכתי חול גמור הוא, ולפיכך הוא מצווהו לעשות לו מלאכה, והוה אמינא דאתי עשה דמורא או\"א ודחי לעשה דתוספת שבת, ואין הבן מחוייב להודיע לאביו שכבר קבל עליו תוספת שבת, אלא יעשה כאשר צוה עליו אביו, והוא ע\"ד מה שפסק הרא\"ש ז\"ל בפ\"ע דנדה ברואה את חבירו בשוק לבוש כלאים דאי\"צ להודיע לו שהוא לבוש כלאים, דמכיון שחבירו שוגג בדבר גדול כבוד הבריות. וה\"נ הו\"א דמשום כבוד אביו לא יתחייב להודיעו שכבר קבל ע\"ע תוספת שבת ומותר לו לעבור על עשה ולקיים פקודת אביו, להכי איצטריך קרא לאשמעינן איש אמו ואביו תיראו ואעפ\"כ ואת \"שבתתי\" תשמרו היינו שבת ותוספת שבת, כמ\"ש הייט\"פ הנ\"ל, ובא הכתוב להזהיר שלא ישמע לאביו לבעל תוספת שבת שקיבל ע\"ע, ויהיב קרא טעמא אני ה' אתה ואביך חייבים בכבודו של מקום. ולפיכך חיובא רמיא על הבן להודיע לאביו דבר לאשורו כי כבר קיבל ע\"ע תוספת שבת ואסור לו לעשות מלאכה (עיין בספר דבש לפי להרחיד\"א ז\"ל שיישב קו' החזקוני כעין זה, ועיין גם בספר בני יששכר מאמרי השבתות מאמר ב' סימן ח')."},{"passage_id":"vayikru2_cc3590c5_p13","passage_content":"ובהנחה זו סרו מהר כל התמיהות הנאמרות בענין, דמה שהקשה החזקוני דאם אביו מצוהו לחלל שבת לאו עושה מעשה עמך מקרי ואינו חייב בכבודו, תו לא קשה מידי, דשפיר איכא לאוקמיה דמיירי במצווהו לעבור איסור דאורייתא, אלא דמיירי שהאב אינו יודע שבנו קיבל ע\"ע תוספת שבת, ואילו הוה ידע לא הוה קאמר ליה מידי, וא\"כ שפיר מקרי עושה מעשה עמך, כי בתום לבבו ציוהו כל זאת, ונעלם ממנו והוא לא ידע, וע\"כ הוה אמינא דאתי עשה דמורא או\"א ודחי לעשה דתוספת שבת, ולא יצטרך הבן להודיע לאביו דבר, ע\"כ איצטריך קרא שלא ישמע אליו, אלא חיובא רמיא עליה להודיע לו כי כבר קבל עליו תוספת שבת."},{"passage_id":"vayikru2_cc3590c5_p14","passage_content":"והשתא אתי שפיר גם מה שהקשה הרא\"ם ז\"ל דאיפכא הו\"ל שתדחה השבת מפני מצות כיבוד או\"א, שהרי ברישא כתיב איש אמו ואביו תיראו ואח\"כ את שבתותי תשמרו (עיין קושיא א'), ולדברינו לק\"מ דהכא לא איצטריך קרא להכי דמצות מורא או\"א נדחית מפני מצות שבת, שהרי אילו ידע האב שבנו קיבל כבר תוספת שבת מעצמו היה נמנע מלצוותו, אלא שבא הכתוב שהבן חייב להודיעו פשר הדבר שקיבל ע\"ע תוספת שבת, ושפיר איכא למילף זאת מדהסמיך הכתוב מורא או\"א לשבת. ולדרכנו נתיישבה נמי קושיית המהרש\"א ז\"ל בנדה דמאי נדרוש במאה\"כ את שבתתי תשמרו הנאמר הכא דליכא למימר דקא מזהר על שתי שבתות דוקא, אמנם השתא ניחא דאיצטריך קרא למיכתב שבתתי לרבות תוספת שבת, וע\"כ כתיב שבתתי לשון רבים דהוו כשני שבתות כמ\"ש ק\"ז זלה\"ה, והודיענו הכתוב בזה דאף אם אביו מצווהו לחלל תוספת שבת מחמת שנעלם ממנו שבנו קיבל עליו תוספת שבת אפ\"ה אל ישמע לו. ומובן גם מה שהודיענו הכתוב שלא ישמע לאביו כשהוא מצוהו לחלל שבת ולא השמיענו כזאת בשאר מצוות, דלא שייך ענין זה כי אם גבי תוספת שבת, דבשאר מצוות בלא\"ה אינו חייב לשמוע לו משום שאינו עושה מעשה עמך."},{"passage_id":"vayikru2_cc3590c5_p15","passage_content":"וארווחנא בזה למצוא מקור לדעת הפוסקים דס\"ל תוספת שבת מדאורייתא, דלכאו' לא אשכחן קרא גבי שבת דצריך להוסיף מחול אל הקדש, ובמס' ר\"ה (ע' ע\"א) פליגי בי' תנאי דר' ישמעאל סבר ילפינן תוספת שבת מתוספת יוה\"כ ור\"ע סבר דילפי' כולהו משביעית, עיי\"ש. והרמב\"ם ז\"ל לא ס\"ל דצריך להוסיף מחול אל הקודש כי אם ביוה\"כ בלבד, והנך קראי אתי לענינא אחריני. אמנם לפי מה דאמרן אית לן קרא גבי שבת לרבות דחייבים להוסיף בו מחול אל הקדש, דכתיב ואת שבתתי תשמרו שבתתי שתים במשמע שבת ותוספת שבת, וניחא בזה דעת הפוסקים דס\"ל תוספת שבת דאורייתא, וע\"כ צריך לומר כן דאי לאו הכי קשה כקושיית החזקוני דאמאי איצטריך קרא למטע שאם אמר לו אביו חלל שבת לא ישמע לו, הא בלא\"ה אינו חייב לכבדו כיון שאינו עושה מעשה עמך, וע\"כ כדאמרן דאתי לתוספת שבת וכמו שנתבאר, ושפיר למדנו ממקרא זה דתוספת שבת דאורייתא. ולדרכנו יובן גם מה דשייכו הנך קראי לפרשת קדושים תהיו, כי לפי שמצות קדושים תהיו היא אזהרה שיקדש עצמו במותר לו, ע\"כ סמך ליה קרא את שבתתי תשמרו דמיירי נמי באותו ענין עצמו, שהכתוב מצוינו להוסיף מחול אל הקדש, כדי לעשות גדר וסייג לשמירת עצמו של שבת."},{"passage_id":"vayikru2_cc3590c5_p16","passage_content":"ואפ\"ל עוד בחינה במה שאמרו ז\"ל קדש עצמך במותר לך ומשם נבא ליישב יתר הקושיות והדקדוקים, בהקדם הא דאיתא בגמרא קידושין (דף ל\"א ע\"א) אמר רב יוסף מריש הוה אמינא מאן דהוה אמר לי הלכה כר' יהודה דאמר סומא פטור מן המצוות עבידנא יומא טבא לרבנן דהא לא מפקידנא ועבידנא השתא דשמענא להא דאמר רבי חנינא גדול מצווה ועושה יותר ממי שאינו מצווה ועושה אדרבה מאן דאמר לי דאין הלכה כר' יהודה עבידנא יומא טבא לרבנן. וכתב ק\"ז זלה\"ה בישמח משה פרשת ויצא לבאר טעמא דמילתא דגדול המצווה ועושה וזלה\"ק, דהנה בכל מצוה יש כוונות ידועים ליחידי סגולה בכל דור ויותר מזה אשר לא נודעו לא לרשב\"י וחביריו, ויותר מזה אשר לא נודעו רק למשה בחיר ה', ויותר עוד מהמה אשר עקבותיהם לא נודעו עוד לשום נברא, רק המצוה יתברך יודע מקומה, והנה העושה כאשר צווה השי\"ת, א\"כ מתקן בשרשו אף מה שנעלם מכל נברא, והיינו אשר קדשנו במצוותיו והבן, אבל אם אינו עושה רק עפ\"י שכל א\"כ הרי אינו יכול לתקן יותר ממה שהשכל מגיע, עכלה\"ק. ואח\"כ כתב עוד וזלה\"ק, נרדמתי על הספר ונתגלה לי שדוקא הכוונה לפ\"מ שציווי הבוי\"ת גורם התיקון, כיון שעושה רק לקיים ציווי הבוי\"ת שמו הרי עושה להשלים רצונו ית\"ש, וא\"כ נעשו התיקונים כפי הרצון, משא\"כ כשמתכוון לעשות תיקונים א\"כ לא נתקן רק כפי כוונתו, וגם אולי אינו כדאי וראוי שיעשה משא\"כ אם נעשה ע\"י הקב\"ה, ע\"כ."},{"passage_id":"vayikru2_cc3590c5_p17","passage_content":"ועפ\"י דרכו בקדש יתבארו לנו דברי המדרש עה\"פ קדושים תהיו יכול כמוני ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם, והכוונה כלפי מה שדרשו ז\"ל מדכתיב קדושים תהיו קדש עצמך במותר לך, וכמו שביאר הרמב\"ן ז\"ל דהכוונה שיוסיף לעשות גדרים וסייגים שלא נצעווה עליהם, ולפיכך קאמר המדרש יכול כמוני, כלומר דשמא תאמר דלפי שהזהירה תורה שתקדש עצמך במה שלא נצטוית, א\"כ תעשה אותם הגדרים והסייגים על פי כוונת עצמך, ותהיה להם ערך וחשיבות \"כמוני\", כלומר כעושה על כוונת המצווה יתברך שמו, ת\"ל כי קדוש אני קדושתי למעלה מקדושתכם, פירוש שאף מה שאתה מקדש עצמך במותר לך יהא על כוונת המצוה יתברך שמו, כי קדושתו יתברך למעלה מקדושתכם, ואם תעשו עפ\"י כוונת עצמכם לא יהיה התיקון כ\"א כפי דעתכם, ומי יודע אם אתם ראויים לתקן שרשה במקום עליון."},{"passage_id":"vayikru2_cc3590c5_p18","passage_content":"עכ\"פ ממה שצוה הכתוב קדש עצמך במותר לך, דהיינו שאף בדבר שאינו מצווה, עליו להתקדש ולעשות גדרים וסייגים, נמצינו למדים כי חד בחד סביך והאחד מניע את חבירו, דע\"י שהוא גודר גדר באיזה ענין יבא לידי קדושה ויתעלה ממדרגה למדרגה, ומצוה גוררת מצוה, וכה ילך מחיל אל חיל במעלות הקדושה, וידיעת ההפכים שוה דכשם שהגדר להזהר בקיום המצות כהלכתן היא ע\"י שיקדש עצמו במותר לו, כן הדבר בהיפך, שאם ח\"ו נכשל האדם בעבירה אזי קנה קנין רע בנפשו, כאמרם ז\"ל עבירה גוררת עבירה כי כך דרכו של יצה\"ר היום אומר לו עשה כך ומחר אומר אומר לו עשה כך וכו'. וזה הוא מפעולות השטן ותחבולותיו להתנכל אל האדם ולהסיתו, עד אשר עולה בידו להפילו ברשתו ולהכשילו בעבירה קלה, ומן הקל אל הכבד, וככה ילך הלוך וחסור עד בלי היות לו תרף ומזור. וזה יהיה ביאור הכתוב אל תפנו אל האלילים ואלהי מסיכה לא תעשו לכם, ופירש\"י תחלתן אלילים הם וסופך לעשותן אלהות. והכונה כי יש אשר האדם פונה אל האלילים בזמן שהוא יודע שאין בהם ממש, ואעפ\"כ הוא פונה אליהם לדעת אותם כאשר יתבאר להלן, והזהיר הכתוב שלא תחשוב בנפשך מה פשעי ומה חטאתי במה שאני פונה אחריהם, הלא יודע אנכי כי אלילים אלמים המה הבל ותוהו ורוח אין בהם, וכלפי זה אמר הכתוב אל תפנו אל האלילים אף באופן זה שידוע לך שהם אלילים, כי אעפ\"י שבתחלה אלילים הם אצלך, סופך להמשך אחריהם ולעשותן אלהות."},{"passage_id":"vayikru2_cc3590c5_p19","passage_content":"ובזה יתבאר גם סיפא דקרא ואלהי מסכה לא תעשו לכם, ופירש\"י לא תעשו לאחרים ולא אחרים לכם. דהנה הדבר נראה בחוש אשר לפעמים אדם הולך בדרכים רעים דרכי מינות וכפירה, אף כי הוא יודע שלא זו הדרך אשר ראוי לו ללכת בה, מ\"מ הוא הולך בדרכם מחמת שהוא מוכרח לעשות כן \"לאחרים\", היינו כדי למצוא חן בעיני הרשעים התובעים ממנו כזאת וכזאת תעשה, ואז כבד אכבדך מאד ומתן שכרך בצדך. ולזאת הזהירה תורה אלהי מסכה לא תעשו לאחרים, כלומר אפילו אם אתה בעצמך יודע כי תוהו המה ואינך עובד להם כי אם למצוא חן בעיני אחרים, אפ\"ה לא תעשו כן, משום שבסופו של דבר יבא הוא עצמו להיות נמשך אחריהם וילכד בשחיתותם, וז\"ש הכתוב לא תעשו \"לכם\" שאם תעשו לאחרים סופכם לעשותם לכם לעצמכם. ואפ\"ל עוד דהנה ישנם העושים כעין פשר לשתף שם שמים ודבר אחר, באמרם שכוונתם להמשיך גם האחר שיהי' נמשך ומתקרב אל השי\"ת, לפיכך הוא מוכרח לשתף את הד\"א עם שם שמים, וכל כוונתו לטובה, ע\"כ מזהיר הכתוב ואלהי מסכה לא תעשו לאחרים, כלומר לשתף אלהי מסכה עם ש\"ש ח\"ו מחמת אחרים, ונתן טעם לדבר באמרו \"לכם\", וכמו שדרשו ז\"ל ולא אחרים לכם, כלומר כי חלף אשר אתה תמשיך אותם להשי\"ת, ימשיכו האחרים אותך אליהם, וזהו ולא אחרים לכם."}]},{"dvar_torah_id":"vayikru2_f5c4b2a3","title":"קדושת פירות הארץ ותכלית עבודת השדה","summary":"בהדבר תורה נדונה חשיבות שמירת מצוות ערלה ורבעי להמשכת קדושת השכינה בארץ. רק כאשר ישראל מקיימים מצוות אלו, הפירות ראויים לאכילה ומביאים ברכה, והקשר בין עבודת השדה ללימוד התורה והחזקת תלמידי חכמים מתבהר.","contents":[{"passage_id":"vayikru2_f5c4b2a3_p1","passage_content":"וכי תבואו אל הארץ ונטעתם כל עץ מאכל וערלתם ערלתו את פריו שלש שנים יהיה לכם ערלים וגו' ובשנה הרביעית יהיה כל פריו קדש הלולים לה' ובשנה החמישית תאכלו את פריו להוסיף לכם תבואתו אני ה' אלקיכם. וצ\"ב דאומרו ובשנה החמישית תאכלו את פריו וגו' קרא יתירא הוא לכאורה, שהרי מדאסר הכתוב פירות ג' שנים וציווה לנהוג קדושה בפירות הרביעית ממילא שמעינן דמכאן ואילך הפירות מותרים באכילה, דמכלל לאו אתה שומע הן, ומאי איצטריך קרא לאשמעינן דפירות החמישית מותרות."},{"passage_id":"vayikru2_f5c4b2a3_p2","passage_content":"ב) ובשנה החמישית תאכלו את פריו להוסיף לכם תבואתו אני ה' אלקיכם. פירש\"י ז\"ל המצוה הזאת שתשמרו וכו' שבשכרה אני מברך לכם פירות הנטיעות היה ר\"ע אומר דברה תורה כנגד יצה\"ר שלא יאמר אדם הרי ארבע שנים אני מצטער בו חנם לפיכך נאמר להוסיף לכם תבואתו. וקשה דהבטחה זו היתה ראויה להאמר ברישא דקרא, סמוך לאומרו שלש שנים יהיה לכם ערלים, כי בציווי זה הוא שיש לחוש להתגברות היצה\"ר, אשר מתגרה באדם לאמר כי הוא טורח ומתייגע בשדהו כל השנים הללו על מגן, ולא ראה כל ברכה בעמלו, וכלפי מחשבות אלו היה ראוי שיבטיחו הכתוב כי לא לחנם כל הטורח הזה, אלא יראה ברכה בעמלו להוסיף תבואתו. ולמה המתין הכתוב מלהשמיענו ברכת להוסיף לכם תבואתו עד אחרי מאמר ובשנה החמישית וגו', והלא במאמר זה אין חשש להתגברות היצה\"ר, כי בשנה החמישית הריהו נהנה מפרי עמלו ואינו יגע בשדהו חנם, ושוב לא יעלו על לבו מחשבות עמל ואון כבשנים הקודמות, ואין צורך לנחמו ולהרגיעו בהבטחת להוסיף לכם תבואתו."},{"passage_id":"vayikru2_f5c4b2a3_p3","passage_content":"ג) במד\"ר (פכ\"ה א') איתא וכי תבואו אל הארץ וגו' הה\"ד (משלי ג') עץ חיים היא למחזיקים בה א\"ר הונא בשם ר' אחא שלא יהיו ד\"ת בעיניך כאדם שיש לו בת בוגרת והוא רוצה להשיאה אלא וכו' אם יש לך זכות קח אמרי אילו נאמר עץ חיים היא לעמלים בה לא היתה תקומה לשונאי ישראל אלא למחזיקים בה וכו', יעיי\"ש שהאריך במעלת עסק התורה ובשבח המחזיקים בה. וצ\"ב להבין שייכות דרשה זו לפרשת ערלה ורבעי. והיפה תואר כתב דהמדרש דייק לה מיתורא דתיבת ונטעתם, דהוה סגי שיאמר וערלתם ערלת פרי כל עץ מאכל, אלא ודאי משמע דבנטיעה גופה איכא מצוה, ולכן דרשה על לימוד התורה שהיא נטעי נעמנים, עכת\"ד היפ\"ת ז\"ל. ואכתי צ\"ב לקשר דרשות אלו דמוקי פרשתא דא בעסק התורה והמחזיקים בה אל פשוטו של מקרא דמיירי במצות ערלה ורבעי. ועוד יש להקשות דאם פרשה זו יפה נדרשת על לימוד התורה, כיצד נפרנם לפי זה דברי הכתוב בתחלת הפרשה וכי תבואו אל הארץ, והלא מצות לימוד התורה חובת הגוף היא ונוהגת בכל מקום בין בארץ בין בחוץ לארץ."},{"passage_id":"vayikru2_f5c4b2a3_p4","passage_content":"ד) בתנחומא ובילקוט דרשו פרשה זו על חינוך הבנים לתלמוד תורה, וזה לשון התנחומא, מדבר בתינוק שלש שנים יהיה לכם ערלים שאינו יכול לא להשיח ולא לדבר ובשנה הרביעית יהיה כל פריו קדש שאביו מקדשו לתורה הילולים שמהלל להקב\"ה וכו'. וגם על דרשה זו קשה כנ\"ל, כיצד תתקשר דרשתם דמיירי בחינוך תינוקות של בית רבן לת\"ת אל פשטות הפרשה שהכתוב מדבר במצות ערלה ורבעי."},{"passage_id":"vayikru2_f5c4b2a3_p5","passage_content":"ונראה לבאר הענין בהקדם אמרנו לבאר דברי הכתוב בפרשת שלח שציוה משרע\"ה למרגלים וראיתם את הארץ וגו' היש בה עץ אם. אין. ופשוטו של מקרא זה אין לו מובן לכאורה, שהרי אחרי שכבר הבטיחם הקב\"ה שהוא מכניסם לארץ טובה ורחבה ארץ זבת חלב ודבש ארץ אשר לא תחסר כל בה, מה מקום יש עוד להסתפק היש בה אילנות אם אין, והלא דבר אלקינו יקום לעולם, ודבר אחד מדבריו לא ישוב ריקם. והר\"א מזרחי ז\"ל כתב דמחמת קושיא זו הוכרת רש\"י ז\"ל לפרש מאה\"כ היש בה עץ אם אין, אם יש בהם אדם כשר שיגין עליהם בזכותו (והוא מדברי הגמרא בבא בתרא ע\"ו ע\"א). אכן זהו דרך דרש, אבל פשטות הכתוב קאי על אילנות ממש, וכן תרגם יונתן האית בה אילנין דמיכל אין לא, הרי שהוא מפרש הכתוב כפשוטו שציוה אותם לראות אם יש בה אילנות מאכל, והוא תמוה מאד. ועוד יל\"ד במה שתרגם יונתן האית בה אילנין דמיכל, דהול\"ל האית בה אילנין טעונין פירין דמיכל, שהרי האילן עצמו אינו ראוי לאכילה."},{"passage_id":"vayikru2_f5c4b2a3_p6","passage_content":"וביארנו כוונת הכתוב עפ\"י מה שכתב הב\"ח ז\"ל ליישב מה שדחה הטור (אורח חיים סימן ר\"ח) דעת הי\"א בברכת מעין שלש ונאכל מפריה ונשבע מטובה, וז\"ל הטור, ואין לאמרה שאין לחמוד הארץ בשביל פריה וטובה אלא לקיים מצוות התלויות בה, ע\"כ. וכתב עליו הב\"ח וזה לשונו, ותימה הלא קדושת הארץ הנשפע בה מקדושת הארץ העליונה היא נשפעת גם בפירותיה, שיונקים מקדושת השכינה השוכנת בקרב הארץ וכו', ואמר אם תטמא את הארץ נמשכת הטומאה גם בפירותיה היונקים ממנה, וכבר נסתלקה השכינה מקרב הארץ וכו', ועתה באכלם פירות היונקים מטומאת הארץ נסתלקה השכינה, וע\"כ ניחא שאנו מכניסים בברכה זו ונאכל מפריה וכו',  כי באכילת פירותיה אנו ניזונים מקדושת השכינה ומטהרתה וכו', עכ\"ל. ועפ\"י דבריו ז\"ל ניחא דדרשת הכתוב ופשטותו תואמים יחדיו, כי משרע\"ה ציוה למרגלים לראות אם יש בהם אדם כשר שיגין עליהם בזכותו כדרשתם ז\"ל, ואם אמנם המצא ימצא בהם אדם כשר הראוי להגין עליהם, אזי בזכותו נמשכת השפעת קדושה בקרב הארץ, וממנה יונקים האילנות, וא\"כ פירותיהם ראויים לאפלה, כי האדם האוכל מאותם הפירות היונקים מהשפעת הקדושה יביא אל תוכו ופנימיותו מזיו קדושת השכינה. ומבואר בזה גם מה שתרגם יונתן האית בה אילנין דמיכל, פירוש אם יש בה אילנות שיונקים מהשפעת השכינה הקדושה, שע\"י כן יהיו פירושיהם ראויים לאכילה, ולפיכך תלה האכילה באילן, כי הוא עיקר שהכל תלוי בו מהיכן אילן זה חי ויונק, אם ממקור הקדושה הוא ניזון אזי פירותיו טובים לאכלה וההיפך בהפכו."},{"passage_id":"vayikru2_f5c4b2a3_p7","passage_content":"ועפ\"י זה נחזור לבאר כל הדקדוקים והקושיות הנ\"ל בפרשתא דערלה, דמה שאמר הכתוב ובשנה החמישית תאכלו את פריו מובן שפיר, דדבר גדול השמיענו בזה, כי במה שישראל משמרין שני ערלה ומצות נטע רבעי כהלכתן המה ממשיכים השפעת קדושה בקרב הארץ, וממנה יונקים האילנות והפירוש הצומחים מהם ראויים וטובים לאכילה, כי הם משפיעים קדושה בנפש האוכל מהם, ובאכול ישראל מפירות אלו בשנה החמישית לנטיעתן אחרי שקיימו בהם כל המצוות האלו הרי הם ניזונים מקדושת השכינה ומטהרתה, אך ח\"ו אם אין ישראל משמרין המצוות כהלכתן מסתלקת קדושת השכינה מקרב הארץ, ומיד שורה עליה הס\"מ, שהרי ארץ ישראל אינה נתונה תחת השפעת השרים, כמאה\"כ ארץ אשר ה' אלקיך דורש אותה תמיד עיני ה' אלקיך בה וגו'. וע\"כ כאשר ישראל חוטאים והקב\"ה מסלק השגחתו ממנה הרי היא נתונה תחת רשות הס\"מ, ולא כן הדבר בשאר ארצות הנתונות תחת רשות שרי מעלה, דאף שאין הם מחלק הקדושה מ\"מ הרי השרים הם ממונים מאת הקב\"ה, ועל ידיהם נמשך השפע נחומות הנתונים תחת ממשלתם."},{"passage_id":"vayikru2_f5c4b2a3_p8","passage_content":"ולזאת אחרי שציווה הכתוב על שמירת ערלה ורבעי אמר ובשנה החמישית תאכלו את פריו, להודיע כי רק באופן זה הפירות ראויים לאכילה והם ממשיכים השפעת קדושה בנפש האוכלם, משא\"כ אם לא ישמרו ישראל מצות ערלה ורבעי כהלכתן אזי אסור להם לאכול מפירות הארץ גם בשנה החמישית, משום שהקב\"ה סילק את שכינתו מן הארץ, והיא מקבלת השפעתה ע\"י הס\"מ, והאוכל מפירות אלו גומל רעה לנפשו, כי מביא אל קרבו ארס טומאת נחש הקדמוני."},{"passage_id":"vayikru2_f5c4b2a3_p9","passage_content":"ובזה מבואר גם מה שהודיע הכתוב הבטחת להוסיף לכם תבואתו אחרי מאמר ובשנה החמישית תאכלו את פריו, כי להורות נתן שרק באופן זה תחול על הפירות ברכת ה' להוסיף לכם תבואתו, אם בשנה החמישית תאכלו את פריו, כלומר שיהיו הפירות ראויים לאכילה, דהיינו שתהיה יניקתם מקדושת השכינה השוכנת בקרב הארץ, ובאכילתם ישפיעו קדושה בנפש, ואז איכא שבח ומעלה בריבוי הפירות הללו, שהרי באמצעות ריבוי זה תתרבה יותר השפעת הקדושה בקרב ישראל. אבל אם לא ישמרו ישראל את המצוות כראוי, וסרה השראת השכינה הקדושה מקרב הארץ, אזי אין שום חשיבות ומעלה בריבוי הפירות, ולא תחול עליהם ברכת להוסיף לכם את תבואתו, וכהא דאיתא בגמרא כתובות (דף קי\"ב ע\"ב) ריש לקיש איקלע לגבלא חזינהו להנהו קטופי דהוו קיימו כי עגלי (קטופי, פירש\"י אשכולות) אמר עגלים בין הגפנים אמרו ליה קטופי נינהו אמר ארץ ארץ הכניסי פירותיך למי את מוציאה פירותיך לערביים הללו שעמדו עלינו בחטאתינו וכו', עיי\"ש."},{"passage_id":"vayikru2_f5c4b2a3_p10","passage_content":"הרי דאפילו בזמן ששכנו בארץ ישראל התנאים והאמוראים הקדושים, מ\"מ מכיון שהארץ היתה נתונה בידי העכו\"ם אין שבח ומעלה בריבוי הפירות ובגדלם, ולזאת אמר ר\"ל ארץ ארץ הכניסי פירותיך וכו'. והיינו נמי טעמא דקרא דנטר בהבטחת להוסיף לכם תבואתו עד אחרי אומרו ובשנה החמישית תאכלו את פריו, כמבואר דתנאי הם הדברים, אם יהיו הפירות ראויים לאכילה דהיינו שיהיו ניזונים מקדושת השכינה אזי תחול עליהם ברכת להוסיף לכם תבואתו, ולפיכך קא מסיים קרא אני ה' אלקיכם, פירוש דכאשר תבא ההשפעה מאת השי\"ת לבדו ולא ח\"ו ע\"י הסט\"א אז יוסיף לכם תבואתו, דרק באופן זה איכא מעליותא בריבוי הפירות כדאמרן."},{"passage_id":"vayikru2_f5c4b2a3_p11","passage_content":"וזאת אפ\"ל גם בדברי רש\"י ז\"ל היה רע\"א דברה תורה כנגד יצה\"ר, פירוש דמה שכתבה תורה להוסיף לכם תבואתו אחרי מאמר ובשנה החמישית תאכלו את פריו דברים אלו מכוונים כנגד היצה\"ר הוא הס\"מ, וכאשר נתבאר כי במה שהקדים הכתוב לאמר ובשנה החמישית תאכלו את פריו השמיענו כי ברכה זו שיתוספו להם הפירות ותבואת השדה נאמרה רק בתנאי זה שיהיו הפירות ראויים לאכילה, דהיינו שלא תהיה לס\"מ שליטה בארץ, ויהיה מקור יניקת הפירות מקדושת השכינה."},{"passage_id":"vayikru2_f5c4b2a3_p12","passage_content":"וכדי לבא אל הביאור בדברי המדרש (קושיא ג') שהוציא פרשה זו ממשמעותה ודרש לה בשבח לומדי התורה ותומכיהם, וגם לבאר דרשת התנחומא והילקוט שדרשו פרשה זו בחינוך תשב\"ר, נראה בהקדם עוד מה שכתב האה\"ח הקדוש עה\"פ וכי תבואו אל הארץ וגו', וז\"ל, ירמוז באומרו וכי תבואו אל הארץ שלא תהיה הכוונה לתיאבון המורגשות, אלא תהיה כוונת הביאה אל הארץ לחיבוב ולחשק הארץ הקדושה אשר בחר ה' בה הר ה' שמה, ואמר כי אין כוונת דבור זה להחליט המניעה מהשתדל בישוב הארץ, אלא ונטעתם, הא למדת שמה שהתנה במאמר אל הארץ הוא בבחינת תכלית המחשבה שתהיה למעלת הארץ במושכלות לא להנאת הגוף וכו', ע\"כ. היוצא מזה כי בפרשה זו הודיענו הכתוב שתכלית ביאת הארץ וההתעסקות בעבודת שדה וכרם היא למעלת קדושת הארץ, ולא בעבור התועליות החומריות הנמשכות ממנה. ובאמת אם היו ישראל זוכים להיות בבחינת עושי רצונו של מקום בשלימות הראוי לא היו צריכים להתעסק בעבודת שדה וכרם כלל, כי אם היתה כל ישיבתם בארץ לעסוק במושכלות, ולהתעלות בקדושה ובעבודת השי\"ת, וכאמרם ז\"ל (ברכות דף ל\"ה ע\"ב) בזמן שישראל עושים רצונו של מקום מלאכתן נעשית ע\"י אחרים, אמנם זעירין אינון הזוכים להיות במדריגה נשגבה זו, וכדאיתא בגמרא התם, הרבה עשו כרשב\"י ולא עלתה בידם. עוד איתא התם דאמר להו רבא לרבנן במטותא מינייכו ביומי ניסן וביומי תשרי לא תתחזו קמאי (שבהם ימי הזרע והקציר) כי היכי דלא תטרדו במזונייכו כולה שתא. ולכן אף גם אותם העוסקים במלאכת שדה וכרם בארץ ישראל צריכים ליישר כוונתם שהם עוסקים במלאכה כדי להחזיק את לומדי התורה, ולגדל בניהם לתלמוד תורה, כי זאת היא עיקר תכלית ביאת הארץ, לעסוק בה במושכלות ולהתעלות במעלות הקדושה, ואם יכוונו במלאכתם לכוונה זו אזי הם מכניסים שפע קדושה בפירות הארץ, והפירות טובים וראויים לאכילה, והאוכל מהם מקבל אל קרבו את שפע הקדושה שינקו הפירות."},{"passage_id":"vayikru2_f5c4b2a3_p13","passage_content":"והשתא יתבאר היטב מה שדרשו ז\"ל מדכתיב וכי תבואו אל הארץ ונטעתם הה\"ד עץ חיים היא למחזיקים בה וגו', ומבאר והולך מה גדול ונשגב הוא שבח המחזיקים בידי לומדי תורה, דשפיר שייכא דרשה זו לפשוטו של מקרא דמיירי בנטיעת אילנות ממש, דהא בהא תליין, שאם תהיה נטיעת האילנות במחשבה זכה וטהורה לחבוב ולחשק הארץ הקדושה, שהיא המקום הראוי והמסוגל ביותר להתעלות במושכלות, וע\"י עסקו בנטיעה יהיה ביכלתו להחזיק ידי עמלי תורה ולתמכם ולסעדם שיוכלו לעסוק בה בלי מפריע, ולטעום מנועם זיו קדושת הארץ, ואז יזכה לברכת ובשנה החמישית וגו' להוסיף לכם תבואתו, שהרי פירותיו נאים וטובים לאכלה מחמת שפע הקדושה שינקו אל קרבם כמבואר."},{"passage_id":"vayikru2_f5c4b2a3_p14","passage_content":"ובדרך זה הוא גם ביאור התנחומא והילקוט שדרשו מפרשה זו ענין חינוך תשב\"ר לת\"ת (קושיא ד'), דשפיר שייכא דרשה זו להכא, שהרי זו היא תכלית ביאת הארץ לגדל בה תשב\"ר עפ\"י התורה הקדושה, ולהקים להם בתי תלמוד שיתחנכו בהם בדרך התורה, ואם תהיה כוונת הביאה אל הארץ למחשבה זו, וכל עסקו ועמלו בפירות הארץ יהיה למען יתחנכו בה תשב\"ר לת\"ת, ויתמוך בהם בכל יכלתו, אזי פירות הנטיעות טובים וראויים לאכלם."},{"passage_id":"vayikru2_f5c4b2a3_p15","passage_content":"ובזה מבואר גם מה שהקשינו (בקושיא ג') דלפי מה שדרשו מפרשה זו שבח החזקת לומדי תורה, כיצד יתבאר מה שפתח הכתוב דבריו באמרו וכי תבואו אל הארץ, והלא מצות ת\"ת אינה תלויה בארץ, אכן השתא ניחא דהודיע לנו הכתוב כי ירושת הארץ תלויה בזכות לימוד התורה והחזקת ידי לומדי תורה, וחינוך תשב\"ר בדרך התורה והמסורה, ואם אין זכות זו אז הס\"מ שולט בארץ, ואין זו ירושת הארץ, ורק בזכות \"ונטעתם\" שיקימו ישראל נטעי נעמנים, דורות ישרים ומבורכים, בנים נאמנים לה' לתורתו הקדושה, עוסקים בתורה ובמצוות באמת, יזכו ישראל לירושח הארץ הקדושה."}]},{"dvar_torah_id":"vayikru2_47e52d60","title":"ערלה ונטע רבעי: טעמים ודקדוקים","summary":"בפרשת ערלה נדונה מצוות ערלה ונטע רבעי, עם דקדוקים על טעמי האיסור וההיתר. נידונה גם מעלת לימוד התורה והשפעתה על הגאולה, תוך הבהרת הקשר בין מצוות שבין אדם למקום ובין אדם לחבירו, ושכרן בעוה\"ז ובעוה\"ב.","contents":[{"passage_id":"vayikru2_47e52d60_p1","passage_content":"וכי תבואו אל הארץ ונטעתם כל עץ מאכל וערלתם ערלתו את פריו שלש שנים יהיה לכם ערלים וגו' ובשנה הרביעית יהיה כל פריו קדש הלולים לה' ובשנה החמישית תאכלו את פריו להוסיף לכם תבואתו אני ה' אלקיכם. במקראי קדש אלו רבו הדקדוקים, חדא למה הוצרך הכתוב לומר עץ \"מאכל\", והרי ממה שנאמר אח\"כ וערלתם ערלתו את פריו ידעינן דלאו באילני סרק קמיירי, דאינהו לא עבדי פירי."},{"passage_id":"vayikru2_47e52d60_p2","passage_content":"ב) גם מה שאמה\"כ ובשנה החמישית תאכלו את פריו קרא יתירא הוא לכאורה, דמה טעם הוצרך להשמיענו היתר אכילת הפירות בשנה החמישית, בלא\"ה נמי הוה ידעינן מדכתיב שלש שנים יהיו לכם ערלים ובשנה הרביעית וגו' דפירות הגדלים בשנה החמישית מותרים מדלא אסרינהו קרא."},{"passage_id":"vayikru2_47e52d60_p3","passage_content":"ג) להוסיף לכם תבואתו אני ה' אלקיכם, פירש\"י ז\"ל המצוה הזאת שתשמרו תהיה להוסיף לכם תבואתו שבשכרה אני מברך לכם פירות הנטיעות היה ר\"ע אומר דברה תורה כנגד יצה\"ר שלא יאמר אדם הרי ארבע שנים אני מצטער בו חנם לפיכך נאמר להוסיף לכם תבואתו, ע\"כ. וצריך ביאור דלפי דרשת ר\"ע שהבטחת הכתוב להוסיף לכם תבואתו היא כדי שלא ירע לבב האדם על שהוא טורח באילנות ארבע שנים חנם, א\"כ היתה הבטחת להוסיף לכם תבואתו ראויה להכתב ברישא דקרא, היכא דכתיב שלש שנים יהיו לכם ערלים וגו', כי שם מקומה להרגיע לבב אנוש שלא יאמר כמה קשה מצוה זו שיטרח בפירותיו ארבע שנים ולא יראה ברכה בעמלו, על כן מבטיחו הכתוב כי שכרו אתו ופעולתו לפניו, שיתברכו לו פירותיו, ומדוע נטר קרא מלכתוב הבטחת להוסיף לכם תבואתו עד אחרי הפסוק ובשנה החמישית וגו'."},{"passage_id":"vayikru2_47e52d60_p4","passage_content":"ד) במד\"ר (פכ\"ה א') איתא וכי תבואו אל הארץ וגו' הה\"ד (משלי ג') עץ חיים היא למחזיקים בה אמר רב הונא בשם ר' אחא שלא יהו דברי תורה בעיניך כאדם שיש לו בת בוגרת והוא רוצה להשיאה אלא (משלי ב') בני אם תקח אמרי ומצוותי תצפון אתך אם יש לך זכות קח אמרי וכו' אילו נאמר עץ חיים היא לעמלים בה לא היתה תקומה לשונאי ישראל אלא למחזיקים בה וכו',  יעיי\"ש שהאריך במעלת עסק התורה ובשבח המחזיקים בידי לומדי תורה. וצריך ביאור להבין שייכות דרשה זו דמיירי בלימוד התורה לפרשת ערלה ונטע רבעי, וביפה תואר פירש דהמדרש יליף לה מיתורא דתיבת ונטעתם, דהוה סגי למכתב כי תבאו אל הארץ וערלתם ערלת פרי כל עץ מאכל, ומדכתיב ונטעתם משמע דבנטיעה עצמה מצוה איכא, ולזאת דרשוהו על התורה הקרויה נטעי נעמנים, עכ\"ד ז\"ל. ובאמת מצינו בדברי חז\"ל שהתורה מכונה נטיעה כדאיתא בגמרא (שבת קי\"ח ע\"ב) אמר ר' יוסי וכו' ונטעתי חמשה ארזים בישראל. אך אכתי צ\"ב שהרי בכל מקום הדרש והפשט קשורים ומצומדים יחדיו, ואיך תתקשר דרשת הכתוב דמיירי בלימוד התורה לפשוטו דמיירי בדיני ערלה."},{"passage_id":"vayikru2_47e52d60_p5","passage_content":"ה) במדרש תנחומא (סימן ה') וכן בילקוט איתא ונטעתם וערלתם הכתוב מדבר בתינוק שלש שנים יהיה לכם ערלים שאינו יכיל להשיח ולא לדבר ובשנה הרביעית יהיה כל פריו קודש שאביו מקדישו לתורה וכו' ובשנה החמישית תאכלו את פריו משעה שהוא מתחייב לקרות בתורה וכו', ע\"כ. וגם דרשה זו צ\"ב מה שייך חינוך התינוק לת\"ת אל מצות ערלה."},{"passage_id":"vayikru2_47e52d60_p6","passage_content":"ו) בספר אור חדש עמ\"ס קידושין (בסוגיא דמקדש בערלה דף נ\"ז) מביא מאמר נפלא בשם גדולי הדור שלפניו ומובא בספרים, ואף שלא ידענו מקורו אך נאמן עלינו האו\"ח ז\"ל בעדותו, וז\"ל המאמר הפלאי הלז, שאל האי מינא את ר' מאיר אנת הוא מארי דמתניתין אימא לי טעמא דערלה ואימא לי ישראל דקבליתו אורייתא אמאי לא בעיתו בשכרכם לעוה\"ב, ע\"כ. והוא ז\"ל מפרשו בדרך פלפול עפ\"י דרכו בקודש, ואף אנן נימא בה מילתא."},{"passage_id":"vayikru2_47e52d60_p7","passage_content":"ונראה לבאר כל הדקדוקים בפרשת ערלה עפ\"י מה שכתב הרמב\"ם ז\"ל בפירוש המשניות ריש מסכת פאה על המשנה אלו דברים שאדם אוכל פירותיהן בעוה\"ז והקרן קיימת לו לעולם הבא, ותו\"ד כי המצוות נחלקות לשני חלקים החלק האחד הם המצוות המיוחדות לאדם בנפשו בינו לבין הקב\"ה כגון ציצית ותפילין וכיו\"ב, והחלק השני מצוות שבין אדם לחבירו כגון הנקימה והנטירה וכיוצא בהם, וכשיעשה אדם המצוות שבינו למקום תחשב לו לצדקה לעוה\"ב לפי שעשה המצוה, וגם ימצא טובה בעוה\"ז בעבור שנהג המנהג הטוב בין בני האדם, כי ע\"י מה שהוא נוהג בין בני האדם ילמדו אחרים ממנו לעשות כמעשהו, עכ\"ד ז\"ל."},{"passage_id":"vayikru2_47e52d60_p8","passage_content":"והנה בטעם מצות ערלה כתב הרמב\"ם ז\"ל בספר המורה (פ\"ז) כי היו לעובדי ע\"ז בזמנים ההם מיני כישוף שהיו עושים בעת נטיעת האילנות, והיו חושבין שימהר האילן להוציא פריו יותר מהנהוג בטבעו של עולם, ולכך ציותה תורה באיסור הפרי הבא קודם שלש שנים, שלא יבואו לעשות המעשים הרעים ההם, כי רובי האילנות מביאים פירותיהם בשנה הרביעית, ושנאכלהו לפני ה' היפך אכלם אותו לפני ע\"ז, עכ\"ד הרמב\"ם ז\"ל. והרמב\"ן וכן רבינו בחיי ז\"ל נתנו טעם לדבר כי המצוה הזאת היא לתת כבוד לה' מן הפרי הראשון שלא נאכל ממנו עד אשר נביא שנה אחת כל פריו קודש הילולים, ופירות ג' השנים הראשונות מועטים ואין בהם טעם וריח לכן אין ראוי להקריבן לפני ה', ועל כן באה המצוה הזאת להביא כל פריו הראשון הנגמר הראוי והמובחר קודש הלולים לה', עכ\"ד. ולכל הטעמים פשוט כי מצות ערלה היא מן הדברים שבין אדם למקום בלבד, שהרי אין בקיום מצוה זו הנאה לבני אדם, וכמו כן מצות נטע רבעי הוא ג\"כ מצוה שבין אדם למקום, שמעלה כל הפירות לירושלים ומשבח ומהלל להשי\"ת עליהם. ולפי מה שנתבאר בדברי הרמב\"ם ז\"ל בפיה\"מ נמצא כי אין הקב\"ה משלם שכר בעוה\"ז על קיום מצות ערלה ורבעי, ושכרם צפון לו לאדם לעוה\"ב. אמנם בשנה החמישית שהפירות הם שלו, ויכול לקיים בהם גם מצוות שבין אדם לחבירו, להנות בהם בני אדם כגון בהפרשת תרומות ומעשרות, לכן בדין הוא שיטול שכר גם בעוה\"ז בעבור חלק המצוה שבין אדם לחבירו."},{"passage_id":"vayikru2_47e52d60_p9","passage_content":"ובזה נתבאר לנו מה שכתבה תורה הבטחת להוסיף לכם תבואתו אחר מאה\"כ ובשנה החמישית תאכלו את פריו (עיין קושיא ג') כי הנה בשכר שמירת שני ערלה עדיין אין מגיע לו שכר בעוה\"ז, לפי שהיא מן המצוות שבין אדם למקום בלבד, אמנם בשנה החמישית שביד האדם לקיים בפירותיו גם מצוות שבין אדם לחבירו, לפיכך יתברך בעוה\"ז שתשלח הברכה בפירותיו להוסיף את תבואתו. ולא זו בלבד שישלח השי\"ת ברכה בפירותיו בשכר המצוות שקיים בהם בשנה החמישית, אלא שעתה יתוסף לו גם זכות שמירת שני ערלה ורבעי ויהיה שכרו מרובה יותר, שהרי לפי שעמל וטרח בשדהו ארבע שנים ולא נהנה מפירותיו, ודאי קשה בעיניו לתת מפרי עמלו לאחרים בשנה החמישית, כי ערבים עליו פירות שדהו שבאו לו אחרי טורח מרובה כ\"כ של ד' שנים, ובעודם בכפו יבלעם כבכורה בטרם קיץ, ואעפ\"כ הוא מתגבר על יצרו ונותן מפירותיו לאחרים, לפיכך שכרו מרובה מאד על פי פעלו, ויצטרף לו זכות מה שהמתין לפירותיו ד' שנים עם זכות המצוות שעשה בפירותיו בשנה החמישית, להרבות שכרו בעוה\"ז."},{"passage_id":"vayikru2_47e52d60_p10","passage_content":"ובדרך זה ניחא נמי מאה\"כ עץ \"מאכל\" (קושיא א') דלכאורה יתירא היא, ויובן ע\"ד מאמרם ז\"ל בריש פאה אלו דברים שאדם אוכל פירותיהן בעוה\"ז והקרן קיימת לו לעוה\"ב, הרי שכינה התנא את השכר הנשפע אל האדם מן השמים בזכות קיום מצוה בלשון אכילה, ולזאת רמז הכתוב באמרו ונטעתם כל עץ מאכל, פירוש שע\"י הנטיעות תזכו לאכול פירות שכרכם בעוה\"ז, בזכות קיום המצוות שבין אדם לחבירו בפירות האילנות, והקרן תהיה קיימת לכם לעוה\"ב בזכות חלק המצוה שבין אדם למקום. ובזה נתיישב גם מה שהוצרך הכתוב לומר ובשנה החמישית תאכלו את פריו (קושיא ב') להורות כי רק בצירוף שכר קיום המצוות שבין אדם לחבירו בשנה החמישית יזכו לאכול פירות המצוה בעוה\"ז, ויתקיים בהם להוסיף לכם תבואתו, דלא סגי בקיום מצות ערלה ורבעי לזכות בשכר עוה\"ז כמבואר."},{"passage_id":"vayikru2_47e52d60_p11","passage_content":"ובדרך זו נלך לבאר דברי המד\"ר הנ\"ל (קושיא ד') וכי תבאו אל הארץ ונטעתם וגו' הה\"ד עץ חיים היא למחזיקים בה וכו',  כי הנה במשנה ריש פאה מונה והולך המצוות שאדם אוכל פירותיהן בעוה\"ז, ומסיים בה ות\"ת כנגד כולם. ולכאורה לפי הך כללא דנתן הרמב\"ם ז\"ל דבמצוות שבין אדם למקום אין משתלם שכר בעוה\"ז קשה, שהרי ת\"ת היא מצוה שבין אדם למקום וכיצד אדם אוכל פירותיה בעוה\"ז, אלא שיש גם במצות ת\"ת חלק שבין אדם לחבירו, לתמוך ולהחזיק ידי לומדי תורה, ועל כך מגיע לו שכר טוב גם בעוה\"ז. ובזה מבואר היטב מה שסמך המדרש לפ' ערלה דרשתו בשבח מעלת לימוד התורה והמחזיקים ידי לומדיה, שהרי מפרשת ערלה נמצינו למדים כי במצוות שבין אדם למקום בלבד אין האדם מקבל שכר בעוה\"ז, ועל כן הוצרך הכתוב לכתוב ובשנה החמישית תאכלו את פריו ואח\"כ להוסיף את תבואתו, כי רק בשכר המצות שבין אדם לחבירו שהוא מקיים בשנה החמישית יזכה לשכר בעוה\"ז. ולזאת קאמר המדרש הה\"ד עץ חיים היא למחזיקים בה, שגם בלימוד התורה הוא כן, שלא סגי בלימוד התורה בלחוד ששכרה הוא רק לעוה\"ב, אלא חייב האדם להחזיק ידי לומדי התורה כדי שיהנה מפירות המצוה בעוה\"ז. וז\"ש המדרש אילו נאמר עץ חיים היא לעמלים בה לא היתה תקומה וכו', כי בעמל התורה בלבד אין לצפות לתשלום שכר בעוה\"ז, ובמה יתקיימו ישראל בעוה\"ז, אם כל שכרם יהיה גנוז לעוה\"ב, עכשיו שנאמר למחזיקים בה יש תקומה לישראל כי יתברכו ממעון הברכות גם בעוה\"ז בשכר החזקת לימוד התורה. והנה בהחזקת התורה ישנם כמה אופנים, ולא רק בממון בלבד מיקרי סיוע והחזקה, אלא המלמדין תורה לזולתם, ומסייעים בהרבצת תורה להרחיב גבולות התורה הרי זו החזקת התורה, דכשם שהמסייע בגשמיות בידי לומדי תורה הרי הוא מחזיק תורה, כן המסייע ברוחניות הויא החזקת התורה."},{"passage_id":"vayikru2_47e52d60_p12","passage_content":"ובזה מבוארים גם דברי התנחומא והילקוט הנ\"ל (קושיא ה') שהוציאו פרשה זו מפשטותה ודרשוה על תינוק שאביו מתחיל ללמדו תורה, כי הנה ביארנו שגם המלמד תורה לזולתו הריהו בכלל מחזיקי התורה ואין לך צדקה גדולה מזו שמחנכים את התינוק לת\"ת ומדריכים אותו בדרך הישר, וכהא דאמרו ז\"ל (כתובות דף נ' ע\"א) עושה צדקה בכל עת זה הזן בניו ובנותיו כשהם קטנים, ואם הזן ומפרנס בניו בגשמיות מיקרי עושה צדקה בכל עת, על אחת כו\"כ שהמחנך את בניו לת\"ת הוא בכלל עושה צדקה בכל עת, שהרי אמרו ז\"ל גדול המחטיאו יותר מן ההורגו (במדבר רבה פכ\"א ה') וכ\"כ גדול המקיים נפש מישראל ברוחניות מן המקיימו בגשמיות. ומה מאד מפליג הזה\"ק בשכר מאן דמזכי לחייביא, כי ממעשהו מתפאר ומתרומם שמו של הקב\"ה יותר מכל מעשה אחר, ושכרו מרובה מאד ביותר מן הנותן צדקה לעניים (עיין בזה\"ק ש' תרומה קכ\"ח ע\"ב וקכ\"ט ע\"א ובניצוצי אורות שם אות ב'). ומכאן נשמע גודל זכות חינוך תשב\"ר בדרכי התורה והיראה, כי כשלעצמן אין ביכלתן לעשות מאומה והכל תלוי במה שהאבות והמחנכים מלמדים אותם, והעיקר הוא התחלת הלימוד על דרך טוב, ואם אין מתחילין בלימוד מקרא ומשנה אינו כלום, דיסוד הכל הוא גירסא דינקותא (שבת כ\"א ע\"ב), וזהו ענין החזקת התורה במעלתה הגבוהה ביותר בין בגשמיות בין ברוחניות, כי תרוייהו איתנייהו בה שחינוך הנער תלוי בהוצאות רבות בגשמיות וברוחניות. ולפיכך שייכא שפיר הך דרשה לפרשת ערלה, שממנה ילפינן כי שכר מצוה בהאי עלמא איכא רק במצוות שבין אדם לחבירו. ולכן נרמז כאן ענין החינוך של תשב\"ר שעיקרו הוא החזקת התורה שבזכותה מתברכים ישראל בעוה\"ז להוסיף את תבואתם. כה יתן ה' וכה יוסיף לברך את ישראל ברכות שמים מעיל במדה גדושה, בזכות החזקת לימוד התורה בגשמיות וברוחניות."},{"passage_id":"vayikru2_47e52d60_p13","passage_content":"ועתה נבוא לביאור המדרש פליאה המובא באור חדש (קושיא ו'), בהקדם עוד מה שחקרו הקדמונים ז\"ל בפעם הדבר שלא נכתבו בתורה אלא יעודים הגשמיים, ולא נזכרו בה היעודים הרוחניים הוא שכר העוה\"ב, ונאמרו בענין זה תירוצים רבים, רבינו בחיי ז\"ל בפ' בחקותי כתב כי היעודים הגשמיים המבוארים בתורה אינם בתורת שכר כלל, אלא הם הכנות לנפש השכלית לדרוש ולהשיג ידיעת ה' כדי לזכותו בסוף באור פני מלך חיים, ולכך הבטיחה תורה כי בעשותנו החקים והמצוות יגיעו אלינו הכנות העוה\"ז שבהם נזכה ונחי' חיי עד, עכ\"ד ז\"ל. ויש מן המפרשים שביארו טעמא דמילתא שלא נזכרו בתורה יעודי עוה\"ב, עפ\"י מ\"ש הרמב\"ם ז\"ל בפיהמ\"ש פ' חלק כי כשם שלא ישיג הסומא עין הצבעים וכו' כן לא יושג בחוש גודל תענוג הנפשות בעה\"ב. ולפי שלא יתכן להשיג השכר ההוא בשכל אנושי לא הזכירו הכתוב (וזאת דעת האבן עזרא פרשת האזינו). אמנם השלה\"ק כתב כי אף שאין מפורש בתורה שכר העוה\"ב, מ\"מ בפנימיות הפסוקים כלול גם שכר עולם הנשמות, אלא שמלובש בלשון שמשמעו שכר עוה\"ז, ומי שאינו מבין חושב כי אמנם אין כתוב בתורה אלא שכר עוה\"ז. וכ\"כ רבינו בחיי ז\"ל בפ' בחקותי, וז\"ל, ונתבאר בכאן שכר עולם הנשמות וערב אותו הכתוב בכלל היעודים הגופניים, וסמך על שכלו של משכיל, ולרוב מעלת העולם ההוא לא תזכיר תורה בשום מקום ענינו מפורש, כי הוא נעלם ועמוק מהשגת היחידים בעוד שהם מחומר."},{"passage_id":"vayikru2_47e52d60_p14","passage_content":"היוצא מכ\"ז כל לא נתבארו להדיא בתורה היעודים הרוחניים שישראל עתידים לזכות בהם לעתיד. ולפי זה יתבאר המדרש פליאה אמר ליה האי מינא לר' מאיר אנת הוא מארי דמתניתין אימא לי טעמא דערלה, כלומר כיון שאתה הוא מאריה דמתניתין, וכל המשניות גלויות לפניך בטעמן ונימוקן, ובכללם גם הך מתניתין דריש פאה שממנה נשמע כי שכר העוה\"ז העוה\"ז ניתן רק על קיום מצוות שבין אדם לחבירו משא\"כ במצוות שבין אדם למקום אין לצפות לתשלום גמול בעולם הזה, וכמו שפירש הרמב\"ם ז\"ל, וא\"כ אימא לי טעמא דערלה, פירוש מדוע אסרה תורה פירות ג' שנים הראשונות משום ערלה, שהיא מצוה שבין אדם למקום בלבד, ואין עליה שכר בעוה\"ז, וכאשר נתבאר דעל כן הקדימה תורה לכתוב ובשנה החמישית תאכלו את פריו ואח\"כ נאמרה ההבטחה להוסיף לכם תבואתו משום שבשנה החמישית ביד האדם לקיים בפירותיו מצוות שבין אדם לחבירו, ועל ידי כך יזכה לשכר העוה\"ז להוסיף את תבואתו, והלא מוטב היה להתירם באכילה למען יזכה לקיים בהם מצוות שבין אדם לחבירו ויקבל שכר עליהם בעוה\"ז. ואם תמצי לומר כי שכר העוה\"ב הוא העיקר, ושכר העוה\"ז כאין נגדו, ולכן אין לתמוה על שנאסרו פירות ערלה, דאף שע\"י כך נמנע מן האדם לזכות בשכר עוה\"ז אין בכך כלום, כי לגדולה מזו הוא מתוקן, להתענג בנועם הנשמות ועדן הרוחות, ויזכה לרב טוב הצפון לעוה\"ב, על כך טען אותו המין שאם כ\"כ גדול הוא השכר המתוקן לכם לעוה\"ב, אם כן אימא לי ישראל דקבליתו אורייתא אמאי לא בעיתו בשכרכם לעוה\"ב, כלומר למה לא שאלתם כי יתבארו לכם בתורה היעודים הרוחניים המתוקנים לכם לעתיד לבא והרי לא מצינו בתורה מבואר כי אם היעודים הגשמיים, ואם כל כך גדול הוא השכר הצפון לכם לעוה\"ב היה ראוי שיתבאר בתורה. ולפי זה שייכים שני קושיות אותו המין להדדי, דקושיא חדא מחזקת חברתה, דעל טעם מצות ערלה הקשה מדוע נאסרו פירותיה באכילה, והרי בכך נמנע מהאדם שכר עוה\"ז, ובעל כרחך תאמר כי שכרו הרבה מאד לעוה\"ב, וא\"כ תקשי קושייתו השניה מדוע אין שכר העוה\"ב מפורש בתורה."},{"passage_id":"vayikru2_47e52d60_p15","passage_content":"ובאופן אחר קצת תתבאר הפליאה שהביא בספר אור חדש על מסכת קידושין וזה תוארה, שאל האי מינא את ר\"מ אנת הוא מאריה דמתניתין אימא לי טעמא דערלה ואימא לי ישראל דקבליתו אורייתא אמאי לא בעיתו בשכרכם לעוה\"ב, ע\"כ. ונראה בהקדם דברי הילקוט משלי (רמז תתקס\"ג) עה\"פ תחת שלש רגזה ארץ אלו שלש מלכיות שמשעבדות לישראל, ותחת ארבע לא תוכל שאת זו אומה רביעית, כביכול אין הקב\"ה יכול להניח את ישראל אלא מיד הוא גואלם, וכן הוא אומר שלש שנים יהיה לכם ערלים, אלו שלש מלכיות שלא תצפו לגאולתכם, אין לכם אלא בשנה רביעית תאכלו את פריו שבמלכות רביעית תהיה לכם גאולה, עכ\"ד המדרש. ולכאורה צריך ביאור להבין דברי הילקוט שהרי מקרא הוא דורש, ובקרא כתיב ובשנה הרביעית יהיה לכם כל פריו קדש הלולים וגו' ובשנה החמישית תאכלו את פריו וגו', וא\"כ כיצד דרש ממקרא זה אין לכם אלא ובשנה הרביעית תאכלו את פריו שבמלכות רביעית תהיה לכם גאולה, בעוד דבקרא לא כתיב הכי, אלא ובשנה החמישית תאכלו את פריו."},{"passage_id":"vayikru2_47e52d60_p16","passage_content":"וצריך לומר דהכוונה שבסוף שנה הרביעית דהיינו בסוף הגלות תחת מלכות הרביעית תתחיל התנוצצות הגאולה, בעת אשר יבא אליהו לבשר לישראל ביאת משיח צדקנו. אכן לפי זה אכתי צריך ביאור מה ידרוש במאה\"כ ובשנה החמישית תאכלו את פריו. גם מה שאמר המדרש שלש שנים יהיה לכם ערלים שבשלש מלכיות ראשונות לא תצפו לגאולתכם קשה לכאורה, שהרי אילו זכו ישראל היתה גאולת מצרים גאולה נצחית, והיה התיקון השלם מיד כמבואר בדבריהם ז\"ל, וכן אילו זכו ישראל היו נגאלים אחרי גלות בבל גאולה נצחית כדאיתא בגמרא (ברכות ד' ע\"א) ראויים היו ישראל שיעשה להם נס בימי עזרא כדרך שנעשה להם בימי יהושע בן נון אלא שגרם החטא, ע\"כ. וכיון שאם היו ראויין היו נגאלין לנצח מיד, א\"כ כיצד הודיע הכתוב מראש דבשלש גלויות הראשונות לא יצפו ישראל לגאולה, והלא אילו זכו היו נגאלין באותה שעה גאולת עולמים."},{"passage_id":"vayikru2_47e52d60_p17","passage_content":"אמנם לקושטא דמילתא אין כאן תימה כלל, כי בתוה\"ק מונח ברמז כל מה שעתיד להיות עד סוף כל הדורות, אלא שהבוכה\"ע אינו מגלה במפורש מראש מקדם את המאורעות התלויות בבחירת האדם, כדי שלא להכריח את הבחירה, אבל הידיעה אינה מכרחת את הבחירה, ולפיכך טמנו הכתוב ברמז באמרו שלש שנים יהיה לכם ערלים, כי עתידים ישראל לגלות בכל אלו המלכיות, וגאולתם הנצחית לא תהיה עד סוף מלכות רביעית, אלא שלא גילתה לנו התורה ענין זה להדיא עד דמטיא שעתא, כדי שלא להכריח את הבחירה, דאילו זכו היתה גאולת מצרים גאולה נצחית, וכן אילו היו ראויים היה נעשה להם נס בימי עזרא וכו', אלא שלפניו היה גלוי כי עד מלכות רביעית לא תהיה גאולתם הנצחית, וכאשר הגיע הזמן נתגלה למפרע כי כבר רמזה תורה כל זאת מתחלה. וכיוצא בזה מצינו (בראשית רבה פרשה מ\"ד כ\"א) שהקב\"ה הראה לאאע\"ה כל הגליות העתידות לבא על בניו וכן איתא בב\"ר (פצ\"ב ג') גבי יעקב אבינו עליו השלום שאמר ואני כאשר שכלתי שכלתי כאשר שכלתי בחרבן ראשון כן שכלתי בחורבן שני לא אשכל עוד, הרי כי כבר נרמזו בדבריהם הקדושים הגליות."},{"passage_id":"vayikru2_47e52d60_p18","passage_content":"ומובנים בזה שפיר דברי הילקוט דדריש מדכ' שלש שנים יהיה לכם ערלים שלא תצפו לגאולתכם בג' מלכיות, כי בסוף נתגלה שכל זאת היה מונח בכתוב. ומה שאמר הילקוט אין לכם אלא בשנה הרביעית תאכלו את פריו שבמלכות הרביעית תהיה לכם גאולה, והקשינו לעיל דבקרא כתיב ובשנה החמישית תאכלו את פריו, וכיצד הוציא הילקוט מזה שבמלכות הרביעית תהיה הגאולה, וכבר כתבנו כי בפשטות כוונת הילקוט על סוף מלכות הרביעית. אכן אפ\"ל עוד מ\"ש שבמלכות רביעית תהיה לכם גאולה, בהקדם לבאר מה שדרשו מדכתיב \"בשנה\" דקאי על המלכיות, על פי מה דאיתא בירושלמי (מס' ר\"ה פ\"א ה\"א) שהיו ישראל מונים חדשים ושנים ליציאת מצרים משנבנה הבית התחילו מונין לבנינו וכו', לא זכו למנות לבנינו התחילו מונין לחורבנו וכו', לא זכו למנות לעצמן התחילו מונין למלכיות וכו', עכ\"ד הירושלמי."},{"passage_id":"vayikru2_47e52d60_p19","passage_content":"והנה הא דהיו מונין למלכיות איתא בגמרא (גיטין דף פ' ע\"א) אמר עולא מפני מה תקינו מלכות בגיטין משום שלום מלכות. וכתבו התוספות (שם ע\"ב ד\"ה זו) דמה שאנו כותבין האידנא לבריאת העולם, משום דהשתא ליכא שלום מלכות בכך, שאפילו נכרים אינם מונים לשנות מלכים, אבל בימי חכמים היו רגילים למנות לשנות מלכים וכו'. והר\"ר יוסף פי' דעכשיו אין המלכות מקפדת, להכי אין כותבין לשנות מלכים וכו', עכ\"ד התוספות. וכ\"כ הרא\"ש ז\"ל בפסקיו. והרמב\"ם ז\"ל כתב בהלכות גירושין (פ\"א הלכה כ\"ז) שתיקנו חכמים שיהיו מונין למלכות אותו הזמן משום שלום מלכות וכו', עיי\"ש שכתב כי זה תלוי במנהג אנשי המקום, אם דרכם לכתוב לבנין הבית או לחורבנו וכתב כן בגט כשר, ואם לאו הריהו פסול, וכבר נהגו כל ישראל למנות בגיטין או ליצירה או למלכות אלכסנדר וכו',  עכ\"ד הרמב\"ם ז\"ל. ומדבריו ז\"ל למדנו כי בימיו עדיין היו מקומות שהיו כותבין בשטרות לבנין הבית או לחורבנו."},{"passage_id":"vayikru2_47e52d60_p20","passage_content":"היוצא לנו מכל זה כי המנינים המיוחדים לישראל למנות בהם שנים המה ארבעה, האחד לבריאת העולם וכנהוג האידנא, וכמ\"ש הרמב\"ם ז\"ל שנהגו כל ישראל למנות ליצירה, המנין הב' ליציאת מצרים והמנין הג' והד' לבנין הבית ולחרבנו. ומה שנהגו למנות למלכיות היינו רק בעת שהיה שייך משום שלום מלכות, אבל כבר בטל טעם זה כמבואר. והנה כבר היו אמרינו לפרש מה שאנו אומרים בליל התקדש החג וכן ביום הקדוש לעת נעילת שער לשנה הבאה בירושלים, דלכאורה מדוע אנו מתפללים רק לשנה הבאה, והלא אנחנו מצפים ומייחלים כמהים ומשתוקקים ומחכים למשיח צדקינו בכל יום שיבא, ולמה לנו לדחות את הזמן לשנה הבאה, ולא אמרינן שיבא מיד לאלתר. אמנם עפ\"י דברי הירושלמי הנ\"ל יתבאר, כי הנה חזינן דבכל תקופה שנשתנה מעמדו ומצבו של כלל ישראל החלו למנות לאותו זמן, מעת יצאו ממצרים מעבדות לחירות ומשעבוד לגאולה החלו מונים ליציאת מצרים, משנבנה הבית החלו מונים לבנינו, ומשחרב התחילו למנות לחורבנו. וא\"כ מילתא דפשיטא היא כי בעת שתהיה הגאולה השלימה יתחילו ישראל למנות מנין חדש, שהרי הגאולה העתידה תהי' גדולה מן הכל, שאז יתגלה ויושג תכלית בריאת העולם, ויעשה הקב\"ה עמנו נפלאות גדולות מנסי יצי\"מ, כדאיתא בגמרא (ברכות דף ד' ע\"א) שיהיו נסי גאולת מצרים טפל אל נסי הגאולה העתידה. וגם הבית השלישי בהבנותו ירום ונישא מאד משני הבתים הראשונים, כדכתיב קרא לאמר (חגי ב') גדול יהיה כבוד הבית הזה האחרון מן הראשון, א\"כ פשיעא אשר מיד לאלתר בעת התיקון השלם יתחילו למנות לבנין הבית השלישי, ומיד תחל שנה חדשה, ואפילו אם יהיה אז באמצע השנה יתחילו למנות מנין חדש, וזהו שאנו מתפללים לשנה הבאה בירושלים, דבאמת תחנתנו ובקשתינו שתהיה הגאולה מיד, אחכה לו בכל יום שיבא, אלא דתיכף ומיד כאשר יבא תהיה שנה חדשה, והבן."},{"passage_id":"vayikru2_47e52d60_p21","passage_content":"ולפי זה נמצא דתיבת \"שנה\" מורה על התחלת מנין חדש, וזה יהיה הביאור בדברי הכתוב שלש שנים יהיה לכם ערלים, היינו בכל שלשת המנינים הנזכרים עדיין לא תהיה הגאולה השלימה הנצחית, ובשנה הרביעית דהיינו בסוף המנין הרביעי שאנו מונין, לחורבן הבית או ליצירה, יהיה לכם כל פריו קדש הילולים, רמז לנו בזה לסוף מנין רביעי כי בוא יבוא תשבי בקול מבשר מבשר ואומר כי בטרם ביאת משיח בן דוד יבא אליהו זל\"ט לבשר לישראל כי הגיעה עתם עת דודים להגאל, ואז יהיה כל פריו קדש הלולים, כי כולם יודו וישבחו ויפארו בהלל וקול זמרה להשי\"ת על כל הטוב אשר יגמלנו, ובשנה החמישית הוא זמן התחלת המנין החמישי שנתחיל למנות לגאולתינו העתידה, תאכלו את פריו, שאז תהי' הגאולה השלימה הנצחית, ויזכו ישראל לשבוע מפרי מעלליהם, ולהתענג מרב טוב הצפון להם."},{"passage_id":"vayikru2_47e52d60_p22","passage_content":"ובדרך זה נלך לבאר הפליאה ששאל האי מינא מר' מאיר אנת הוא מאריה דמתניתין אימא לי טעמא דערלה, דהנה נתבאר כי פרשתא דערלה מורה על גליות ישראל, וכי לא יהיו מצפים לגאולה נצחית עד סוף מלכות הרביעית. והנה גדול זכות לימוד התורה לקרב את הגאולה וביחוד לימוד המשנה כדאי' במד\"ר פ' צו (פ\"ז ג') אין הגלויות הללו מתכנסות אלא בזכות המשניות שנאמר (הושע ח') גם כי יתנו בגוים עתה אקבצם. ובתנא דבי אליהו (רבה פ\"ע) איתא במה הקב\"ה מושיע את ישראל מבין העכו\"ם בבנים שהם משכימים ומעריבים לביהכ\"נ ולביהמ\"ד ועוסקין בד\"ת בכל יום תמיד."},{"passage_id":"vayikru2_47e52d60_p23","passage_content":"והנה בספר אבן יחיא בפירושו לדניאל עשה חשבון עפ\"י הסוד כי הגאולה העתידה תהיה בשלש מאות שנה האחרונים של האלף הששי בערך בשנת ת\"ש קצת לפניו או קצת לאחריו. ובעוה\"ר כבר עברו כשלש עשרות שנים מאז. וכתב עוד שם אין להאשים העליון על אורך הגלות בעוה\"ז, ועל קוצר טוב הגאולה אחר תחיית המתים, כי עיקר השכר לבני ישראל הוא בעוה\"ב, ואם ישראל נענשו בעול הגלות אפילו הריקים שבהם יהנו בטוב הגן עדן הגופני והעוה\"ב הרוחני, ואותו הטוב הגופני מהעוה\"ז אשר ינתן להם בסוף האלף הששי הוא לאות ולמופת שהם בני עליה, ויראו כל יושבי תבל סכלותם מקדם ומעלת ישראל, וישערו מטובם הגופני הטוב הרוחני אשר ירשו בני הגלות אחר המות ולנצח נצחים, וכן לתת שכרו גם לגוף החומרי אשר קבל ענשו בגלות, עכ\"ד ז\"ל. גם ידוע מה שכתבו הקדמונים כי למען יתקיים בנו מקרא שכתוב (תהלים צ') שמחנו כימות עניתנו, שיזכו ישראל להתעדן בעוה\"ז מרב טוב בגוף ובנפש גם יחד, יהיו הימים שאחרי הגאולה העתידה ארוכים מאד, כדי שיהיה העונג והשמחה בהם כשיעור העינוי בימ הגלות. ובזה פירש בסה\"ק מגלה עמוקות מאה\"כ ויהי מקץ שנתים ימים, שיהיו הימים בעת הקץ ארוכים כ\"א כשנתים. עכ\"פ מדברי הרב אבן יחיא מבואר כי עיקר השכר לבני ישראל צפון להם לעוה\"ב, ומה שישארו שנים מספר בעוה\"ז שבהם יתעדנו ישראל וישבעו מטובו יתברך הוא להראות קבל העולם כולו מה רב טוב גנוז להם לעוה\"ב, אבל עיקר שכרם של ישראל שמור להם לעולם הבא."},{"passage_id":"vayikru2_47e52d60_p24","passage_content":"וזו היתה שאלת אותו מין מר' מאיר, כי הוא ידע דפרשת ערלה רומזת על הגליות, וכי יארך מאד הזמן עדי ישיגו ישראל להגאל גאולת עולמים בסוף מלכות רביעית, ויהיה תשלום שכרם בעוה\"ז שנים מועטות בלבד כנ\"ל, ולזאת שאל מר\"מ אנת הוא מאריה דמתניתין, ולפניך גלוי וידוע כמה גדול כח לימוד התורה וביותר לימוד המשניות לקרב קץ הגאולה, וא\"כ אימא לי טעמא דערלה, פירוש מדוע איפוא כתיב בפרשת ערלה שלש שנים יהיה לכם ערלים, וכדרשת הילקוט שלא תצפו לגאולה בשלש מלכיות, ורק בסוף גלות רביעית גאולה תהיה לנו, הלא בזכות המשניות היה ראוי להם שיגאלו מיד. וא\"ת כי עיקר השכר שאתם מקוים לו הוא שכר עוה\"ב, ואתם בזים לשכר עוה\"ז הכלה והנפסד, א\"כ ישראל דקבליתו אורייתא מ\"ט לא בעיתו בשכרכם לעוה\"ב, והלא בתורה לא נתפרשו כי אם יעודי עוה\"ז הגשמיים, ואם חפצים אתם רק בעוה\"ב מ\"ט לא בקשתם שכר עוה\"ב בלבד, אלא ודאי שגם אתם חפצים בשכר עוה\"ז, א\"כ הדרא קושיא לדוכתא למה הוא מצער כל כך. אמנם כל קושיותיו הם רק לפי שהוא מין ואינו מאמין בנסתרות ובפנימיות התורה, לכן הוקשה לו מה שאין מפורש בתורה שכר העולם הנצחי, אבל באמת לאו קושיא היא כלל, כאשר נתבאר כי בפנימיות התורה גנוז שכר העוה\"ב אלא שלא ניתן להתבאר, לפי שלא יושג לשוכני בתי חומר."}]},{"dvar_torah_id":"vayikru2_dc058b6e","title":"שכר מצוות וגלות ישראל","summary":"בפרשת ערלה נדרש שכר המצוות והבטחת הגאולה במלכות הרביעית. המדרש מדגיש את חשיבות לימוד התורה כעץ חיים, המגן על ישראל בגלות. גאולה תלויה בתשובה ובקיום התורה, והבטחת ה' היא נצחית ואמינה.","contents":[{"passage_id":"vayikru2_dc058b6e_p1","passage_content":"וכי תבואו אל הארץ ונטעתם כל עץ מאכל וערלתם ערלתו את פריו שלש שנים יהיה לכם ערלים וכו', ובשנה הרביעית יהיה כל פריו קדש וגו', ובשנה החמישית תאכלו את פריו להוסיף לכם תבואתו אני ה' אלקיכם. פירש\"י ז\"ל להוסיף לכם תבואתו המצוה הזאת שתשמרו תהיה להוסיף לכם תבואתו שבשכרה אני מברך לכם פירות הנטיעות וכו'. אני ה', אני ה' המבטיח על כך ונאמן לקיים הבטחתי, ע\"כ. וצריך ביאור להבין שהרי בכל מצוה ומצוה יש שכר טוב למקיימה, ולא מצינו שיודיע הכתוב בכל מצוה כי נאמן ה' לקיים הבטחתו, ולשלם שכר בעד המצוות, ומדוע הוצרך הכתוב כאן לכתוב אני ה', להודיע שהקב\"ה הבטיח על כך ונאמן לקיים הבטחתו."},{"passage_id":"vayikru2_dc058b6e_p2","passage_content":"ב) במד\"ר (פכ\"ה א') איתא וכי תבואו אל הארץ וגו' הה\"ד (משלי ג') עץ חיים היא למחזיקים בה וכו', ר' הונא בשם ר' בנימין בן לוי אמר משל למלך שאמר לבנו צא לפרקמטיא א\"ל אבא מתיירא אני בדרך מהלסטים וכו' נטל מקל וחקקו ונתן בו קמיע וכו' ואמר לו יהיה המקל הזה בידך ואי אתה מתיירא משום בריה אף כך אמר הקב\"ה למשה אמור לישראל בני עסקו בתורה ואין אתם מתייראים משום אומה. אילו נאמר עץ חיים לעמלים בה לא היתה תקומה לשונאי ישראל אלא למחזיקים בה וכו', ע\"כ. וצ\"ב מה שייכא הך דרשא דמיירי בשבח לימוד התורה, שע\"י נזכה להנצל מאומות העולם, לפרשת ערלה ונטע רבעי, ולכאורה לא קרב זה אל זה, דלא מיירי קרא בלימוד התורה."},{"passage_id":"vayikru2_dc058b6e_p3","passage_content":"ג) גם במדרש תנחומא ובילקוט (רמז תרע\"ו) דרשו פרשת ערלה על עסק התורה, וז\"ל, מדבר בתינוק שלש שנים יהיה לכם ערלים שאינו יכול לא להשיח ולא לדבר, ובשנה הרביעית יהיה כל פריו קדש שאביו מקדשו לתורה הילולים שמהלל להקב\"ה, ובשנה החמישית תאכלו את פריו וכו' מכאן שנו רבותינו בן חמש שנים למקרא בן עשר שנים למשנה. בעוה\"ז אדם מלמד את בנו תורה ומשכחה, אבל לעת\"ל הקב\"ה מלמדה שנאמר וכל בניך למודי ה' ורב שלום בניך. ובתנחומא מסיים, בעוה\"ז ע\"י שיצה\"ר מצוי בניכם מתים אבל לעת\"ל לא יהיה עוד כן. וגם המדרש הזה אומר דרשוני וחיו, דמה שייך ענין לימוד התורה של תשב\"ר לפרשת ערלת האילן. וגם מה שסיים המדרש ילקוט בהבטחה שלעת\"ל לא תהיה שכחת התורה, ומה שסיים במדרש תנחומא שלא תהיה מיתה עוד אין לו קשר אל ענין הפרשה, ואין כאן מקומו כלל."},{"passage_id":"vayikru2_dc058b6e_p4","passage_content":"ד) עוד איתא בתנחומא (י\"א) וכי תבואו אל הארץ זש\"ה (תהלים קל\"ו) ויתן להם ארצות גויים ועמל לאומים ירשו בעבור ישמרו חקיו ותורותיו ינצורו וכו', כל מה שנטל הקב\"ה מהעכו\"ם נתן לישראל ארצות כסף וזהב שדות וכרמים וערים לא נתן להם כל אלו אלא כדי שיעסקו בתורה שנאמר בעבור ישמרו חוקיו וכו', והם לא עשו כן אלא ויטמאו אותה בדרכם ובעלילותם וכו', ומה עשה להם הקב\"ה הגלה אותן מתוכה שנאמר ויתשם ה' מעל אדמתם (דברים כ\"ט) וכשיעשו תשובה וכו' שהן נוטעין ואין נותשין שנאמר ולא ינתשו עוד מעל אדמתם (עמום ט'), עכ\"ד התנחומא וגם דרשא זו צ\"ב כנ\"ל מה שייכא להכא."},{"passage_id":"vayikru2_dc058b6e_p5","passage_content":"ה) עוד איתא במד\"ר (פכ\"ה י\"ב) דרש ר\"י בן פזי מי יגלה עפר מעיניך אדה\"ר שלא יכולת לעמוד בציוויך שעה אחת והרי בניך ממתינין לערלה ג' שנים. אמר ר' הונא כד שמעה בר קפרא אמר יפה דרש ר\"י בן אחותי הה\"ד וכי תבואו אל הארץ ונטעתם כל עץ מאכל. והוא פלא במה נאה דרשה שדרש ר\"י בן פזי מיתר הדרשות בפרשה זו, עד ששבחו בר קפרא כי יפה דרש."},{"passage_id":"vayikru2_dc058b6e_p6","passage_content":"ו) בספר אור חדש (עמ\"ס קידושין דף נ\"ז) הביא מדרש פליאה וזה תוארו, שאל האי מינא את ר\"מ אנת הוא מארי דמתניתין אימא לי טעמא דערלה ואימא לי ישראל דקבליתו אורייתא אמאי לא בעיתו בשכרכם לעוה\"ב, ע\"כ. והוא פלא מה קשר יש בין שתי השאלות הללו שהקשה אותו מין שניהם כאחת."},{"passage_id":"vayikru2_dc058b6e_p7","passage_content":"ונראה ליישב כל המדרשים בחדא מחתא על פי מה דאיתא במדרש ילקוט סוף משלי (רמז תתקס\"ג בשם מדרש ילמדנו) וז\"ל, תחת שלש רגזה ארץ (משלי ל\"א) אלו שלש מלכיות שמשעבדות לישראל, ותחת ארבע לא תוכל שאת זו אומה רביעית כביכול אין הקב\"ה יכול להניח את ישראל אלא מיד הוא גואלם, וכן הוא אומר שלש שנים יהיה לכם ערלים אלו שלש מלכיות שלא תצפו לגאולתכם, אין לכם אלא בשנה הרביעית תאכלו את פריו שבמלכות רביעית תהיה לכם גאולה, ע\"כ. הרי מבואר מדברי המדרש שפרשה זו של ערלה ורבעי יפה נדרשת על שעתידים ישראל להשתעבד בארבע מלכיות, ובמלכות רביעית עתידים הם להגאל. והנה חז\"ל כאשר למדו תורה שבכתב התבוננו תחלה בדרשות הפסוקים, כדאיתא בגמרא (שבת ס\"ג ע\"א) א\"ר כהנא כד הוינא בר תמני סרי שנין והוה גמירנא לכולה ש\"ס ולא הוה ידענא דאין מקרא יוצא מידי פשוטו עד השתא, ע\"כ. ולזאת כאשר למדו בפרשת ערלה השיגו בחכמתם גם הדרשה הכלולה בפרשה זו שהיא רומזת אל גלות ישראל בג' מלכיות, ושלא תהיה להם גאולה שלמה אלא במלכות רביעית, ואף שלא דרשו דרשה זו להדיא בפרשה זו, מ\"מ ודאי לא נעלמה מהשגתם."},{"passage_id":"vayikru2_dc058b6e_p8","passage_content":"ועפ\"י הדברים האלו מבוארים היטב דברי התנחומא (קושיא ד') שדרש בפרשה זו זש\"ה ויתן להם ארצות גוים וגו' בעבור ישמרו חקיו ותורותיו ינצורו וכו', שלא נתן להם כל אלו אלא שיעסקו בתורה וכו', והם לא עשו כן וכו' הגלה אותם מתוכה שנאמר ויתשם ה' מעל אדמתם וכו'. דשפיר שייכא הך דרשא לפרשת ערלה, שהרי מכאן למדנו שעתידין ישראל ללכת בגולה אחרי גולה ולהיות משועבדים לאומות העולם ולא תהיה גאולתם הנצחית אלא בסוף מלכות רביעית, ובשל מה כל הצער הגדול הזה, הן בעבור שלא שמרו ישראל ברית אלקים ובתורתו מיאנו ללכת, לפיכך היה הכרח שיצטרפו ויזדקקו בכור הגליות, ואין גאולתכם ממלכות רביעית תלויה אלא בתשובה וכמ\"ש הרמב\"ם ז\"ל (פ\"ז מה' תשובה הלכה ה,) אין ישראל נגאלין אלא בתשובה. וזהו שסיים המדרש וכשיעשו תשובה וכו' שהן נוטעין ואין נותשין שנאמר ולא ינחשו עוד מעל אדמתה, כי בזמן קץ גלותינו יערה ה' רוח ממרום לטהר לבות בני ישראל ואותם שלא יעשו תשובה עניהם נאמר (יחזקאל כ') וברותי מכה המורדים והפושעים, ולפיכך תהי' גאולה זו נצחית ולא יהיה שוב גלות אחריה, כי רוח הטומאה יעבור מן הארץ, וכמו שכתב היפה תואר ז\"ל לפרש דברי המדרש (ויקרא רבה) כל הקרבנות בטלים לעת\"ל וכו' שהכוונה היא על הקרבנות הבאים על חטא, כי לא יהיו אז חטאים ולא יצטרכו להבאת קרבנות אלו. וזה שמביא המדרש לכאן הפסוק ויתן להם ארצות גוים וגו' בעבור ישמרו חקיו, שהרי גם הגאולה האחרונה תלויה רק בעבור ישמרו חקיו ותורותיו ינצורו, ואז יתקיים בהם מקרא שכתוב ולא ינתשו עוד מעל אדמתם."},{"passage_id":"vayikru2_dc058b6e_p9","passage_content":"ובזה יובן מה ששיבח בר קפרא דרשת ר\"י בן פזי מי יגלה עפר מעיניך אדה\"ר וכו' ובניך ממתינין לערלה ג' שנים, באמרו יפה דרש ר\"י וכו' הה\"ד וכי תבאו אל הארץ (קושיא ג'). ואפ\"ל שנתכוון להודיע בכך דבר גדול, כי מה שממתינין ישראל ג' שנים על הפירות אין בכך רבותא גדולה כ\"כ, כי ישראל קדושים הם וששים ושמחים לעשות רצון קונם. אמנם הרי רמוז בפרשה זו שעתידין ישראל לגלות בין האומות ושגאולתן הנצחית תהיה במלכות הרביעית בבוא הקץ שיעד הקב\"ה לגאלה, ודבר זה הוא נסיון גדול מאד, להמתין עד בוא זמן הגאולה, כאשר רואין בעוה\"ר שרבים מאד לא יכלו עמוד בנסיון כבד זה, ומחפשים דרכים לקחת לעצמם גאולה בטרם הזמן, ובכך מעכבין את הגאולה האמיתית בעוה\"ר. ועל ענין זה יאות למימר מי יגלה עפר מעיניך אדה\"ר שלא יכולת לעמוד בציוויך שעה אחת והרי בניך יושבים וממתינים לערלה, הם המלכיות שישראל משועבדים תחת ידם הרמוזות בשנות הערלה, וזה זמן זמנים ועידן עידנים טובא שישראל יושבים ומצפים לישועת ה' שיגאלנו ברחמיו מן הגלות המר הזה שאנו נתונים בו, ולא יפרצו לעלות בחומה ולהמנות עם עושי רשעה המורדים במלכות שמים לדחוק את הקץ. ולזאת אפ\"ל נתכוון בר קפרא באמרו יפה \"דרש\" בן פזי הה\"ד וכי תבאו אל הארץ, כלו' כי עיקר השבח בדרשה זו אינה על הפ' כפשוטה שישראל ממתינין לפירות ערלה ג' שנים, אלא על הנדרש מפרשה זו, והן הגליות העתידות לבא על ישראל והגאולה העתידה במלכות רביעית, וז\"ש הה\"ד וכי תבאו אל הארץ כי כאן רמוזה ביאת הארץ לעת\"ל בעת ביאת המשיח."},{"passage_id":"vayikru2_dc058b6e_p10","passage_content":"ובדרך זו י\"ל מה שדקדקנו לעיל (קושיא א') מה טעם הוצרך הכתוב לסיים בפרשת ערלה אני ה' אלקיכם, כי לפי שפרשה זו נדרשת על הגליות והגאולה העתידה על כן אמה\"כ אני ה' לומר שגאולה זו תהיה ע\"י הקב\"ה בכבודו ובעצמו ולא ע\"י מלאך או שליח, וכמו שדרשו רבותינו ז\"ל בגאולת מצרים אני ה' אני הוא ולא אחר ועל כך חייבים ישראל להמתין וליזכות בתמימות ולא לעשות שום פעולות בידים לדחוק הקץ, וגם בא לרמוז שדבר זה הוא מעיקרי האמונה, ולפיכך כתיב ביה אני ה'."},{"passage_id":"vayikru2_dc058b6e_p11","passage_content":"וזאת אפ\"ל גם בכוונת המדרש משל למלך שאמר לבנו צא לפרקמעיא וכו' א\"ל מתיירא אני בדרך מהלסטים וכר כך אמר הקב\"ה וכו' בני עסקו בתורה ואין אתם מתיראים משום אומה. כי הנה לפי שפרשה זו מרמזת על ארבע מלכיות, נתייראו ישראל פן לא יוכלו לעמוד בכובד עול הגלות, ולזאת אמר להם הקב\"ה בני עסקו בתורה ואין אתם מתייראים משום אומה, כי בכח התורה מתקיימים ישראל בגלות, ולא יוכל צר ואויב לשלוט בהם, דתורה מגינא ומצלא, וכדאיתא נמי במד\"ר ר\"פ דברים (פ\"ב י\"ט) עה\"פ פנו לכם צפונה וז\"ל א\"ר חייא אמר להם אם ראיתם אותו (את עשיו) שמבקש להתגרות בכם על תעמדו כנגדו אלא הצפינו עצמכם ממנו עד שיעבור עולמו וכו', אמרו לו ישראל להיכן נברח א\"ל אם ראיתם שמזדווג לכם ברחו לתורה ואין צפונה אלא תורה שנאמר (משלי ב') יצפון לישרים תושיה, ע\"כ."},{"passage_id":"vayikru2_dc058b6e_p12","passage_content":"ובדרך זה יבואר גם מה שדרשו בתנחומא דפרשת ערלה קאי על גידול הבנים לת\"ת (עיין קושיא ד'), דאלו ואלו דא\"ח, וכל הדרשות נאחזות בסבך אחת אל אחת, כי זכות לימוד התורה של תשב\"ר הוא המקרב את הגאולה, ובפרע באחרית הימים בעיקבא דמשיחא, ולפיכך שייך לפרשה זו הנדרשת על הגלות והגאולה. ולזה מסיים בילקוט הנ\"ל בעוה\"ז אדם מלמד את בנו תורה ומשכחה אבל לעת\"ל הקב\"ה מלמדה, וכן בתנחומא מסיים בהבטחה שלעת\"ל שיתבטל היצה\"ר לא תהיה מיתה בעולם, דשפיר שייכי להכא דמיירי בגאולה העתידה שתהיה בזמן מלכות רביעית."},{"passage_id":"vayikru2_dc058b6e_p13","passage_content":"ועפ\"י האמור נראה לבאר הך מדרש פליאה (קושיא ו') ששאל אותו המין לר\"מ אנת הוא מארי דמתניתין אימא לי מ\"ע דערלה, ועוד שאל מ\"ט לא בעיתו שכר עוה\"ב. ויתבאר דהנה איתא במד\"ר (פ' צו פ\"ז ג') ר' הונא אמר וכו' אין כל הגליות הללו מתכנסות אלא בזכות משניות מה טעמא (הושע ח') גם כי יתנו בגוים עתה אקבצם. הרי כי גדול כח המשניות לקרב קץ הגאולה, והנה אותו המין נתכון להקניט את ר' מאיר בשאלות על מה ולמה ישראל נתונים למשיסה בעמים ולא נגאלו עדיין, ולפיכך פתח דבריו אמר אנת הוא מארי דמתניתין אימא לי מ\"ט דערלה, כלומר הרי פרשת ערלה נדרשת שיהיו ישראל משתעבדין בג' גליות ובגלות הרביעי גאולה תהיה להם, א\"כ מדוע לא נגאלו ישראל עדיין מן הגלות הרביעי, הלא אתה הוא מאריה דמתניתין ובזכות המשניות שאתם שונים היה ראוי שתגאלו."},{"passage_id":"vayikru2_dc058b6e_p14","passage_content":"וגם שאלתו השניה של אותו מין י\"ל בדרך זו, דהנה איתא בזה\"ק (שמות קפ\"ח ע\"ב) דכאשר רואים ישראל כמה יארך עליהם הגלות המר הזה לא היו יכולים לסבול, אלמלא שהם נכנסים לביהמ\"ד ורואים כל הנחמות הכתובות בתורה העתידות לבא עליהם ובזאת הם מתנחמיה ומתחזקים ומקבלים על עצמם לסבול כל מה שיעבור עליהם. והנה אף עפ\"י שהנחמות המובטחות כתובות בתורה, מ\"מ עדיין הנסיונות גדולים מאד, לפי שהכל מכוסה טמיר ונעלם, ואין אתנו יודע עד מה, מה הוא השכר המובטח והטובה העתידה לבא על ישראל, וכמ\"ש הרמב\"ם ז\"ל (פי\"ב מהלכות מלכים ה\"ב) שכל אלו הדברים שיהיו בזמן ביאת המשיח לא ידע אדם איך יהיו עד שיהיו שדברים סתומים הם אצל הנביאים גם החכמים אין להם קבלה בדברים הללו. אלא לפי הכרע הפסוקים וכו', ע\"כ. וגם במה שאמה\"כ שמחנו כימות ענותנו נחלקו המפרשים ז\"ל בפירושו, יש מהם שאומרים שיתארכו הימים בימות המשיח כדי שיהיו ימי השמחה בזמן ביאת המשיח בסוף האלף הששי מכוונים נגד ימי העינוי, ויש שפירשו באופן אחר, עכ\"פ אין יודע דבר ברור בענינים הללו כיצד יהיו, אף שאין אנו מסופקים שודאי יהיה, מ\"מ דבר זה עצמו שהכל טמיר ונעלם הוא מגדיל את הנסיונות, שאין יודעין כיצד תבא הישועה, ואפשר שאילו היינו יודעים יותר כיצד תהיה הישועה היה קל יותר להתחזק, אך כך גזרה חכמתו יתברך להטמין הדברים ולהעלים מאתנו כיצד תבא הישועה, ולפיכך זכות גדולה היא לנו כאשר נעמוד בכובד הנסיונות ונתחזק בתורת ה'."},{"passage_id":"vayikru2_dc058b6e_p15","passage_content":"והנה ימות המשיח מכונים ג\"כ עוה\"ב לפעמים וכמו שהאריך היפ\"ת ז\"ל (בראשית רבה פכ\"ו) דפעמים ימות המשיח קרויים עוה\"ב ופעמים שרק העולם הנצחיי מכונה בשם עוה\"ב. עכ\"פ זה ברור שמכלל העוה\"ז יצאו ימות המשיח, ולזאת כיון שכוונת המין בשאלתו הראשונה היתה להקניט את ר\"מ ולצערו על אורך הגלות לכן חזר ושאל שאלתו השניה מ\"ט לא בעיתו שכר עוה\"ב, פירוש מדוע לא ביקשתם שיבארו לכם כיצד תהיה הגאולה ומה הוא השכר שתקבלו בימות המשיח הקרוי עוה\"ב, כדי שיהיה לכם במה להתחזק בחשכות הנורא הזה. והנה המין הזה באמת שאל קושיא גדולה ומרה, אמנם שאלה זו שייכא רק לגביה שהוא אינו מאמין בתורה הקדושה, ועל כן רצה לצער את ר\"מ בשאלות כדרכם של המינים לצער את העוסק בתוה\"ק, ולפיכך הקיפו בשאלות הללו. אמנם יהודים המאמינים בה' ובתורתו הק' אין שואלין ומקשין בעניני האמונה, כי יודעים הם כי עולם הזה הוא עולם הנסיון, וחייבים לעבור ולהתגבר על כל הנסיונות, וזה דייקא הוא כח האמונה להאמין בדברים שאין רואים ואין מבינים, דאם רואים הכל ומבינים בשכל אין זה ענין אמונה, שהרי מבינו בשכלו, אלא גם בגודל החשכות וההסתרה שאין רואין ואין שומעין כלום בכל זאת מאמינים בבורא עולם ובקבלת אבות באמונה פשוטה, וכמ\"ש המהר\"ל מפראג ז\"ל בספרו נצח ישראל (פכ\"ד) שעל כן ישראל מושבעין ועומדין שלא יגלו את הקץ שאם יגלו את הקץ הרי יש כאן גאולה, כי מי שיודע זמנו לצאת כאילו כבר נגאל, והשי\"ת שם הגלות ולא יהיה נמצא הקץ קודם זמנו, ולפיכך אל יגלו הקץ, עכ\"ל. והשי\"ת יעזור שנתקיים באמונה האמיתית ונהיה דבוקים באמונה אמיתית דזה שורש הכל, בא חבקוק והעמידו על אחת וצדיק באמונתו יחיה (חבקוק ב'). ונזכה ללכת בדרך האמת ולהיות דבוקים בהשי\"ת ובתורתו הקדושה, ובמהרה נזכה לישועת כל ישראל ושמחתן. והבוכ\"ע יעזור שתהיה לנו הכנה לימי קבלת התורה באמת ובתמים, ונקבל כמו שהוא רצון השי\"ת, ונזכה במהרה לראות הגאולה השלמה והאמיתית, בהתגלות כבוד שמים עלינו בב\"א."}]},{"dvar_torah_id":"vayikru2_bc69cd46","title":"כוחו של אברהם בזכות הגאולה","summary":"במאמר זה נדונה זכותו של אברהם אבינו ע'ה בהבאת השיבה לעולם, וכיצד היא משפיעה על תקומת ישראל לעתיד. המדרש מדגיש את כבוד הזקנים ואת השפעתם על הדורות, ובסופו נבנית תקווה לגאולה בזכות האבות הקדושים.","contents":[{"passage_id":"vayikru2_bc69cd46_p1","passage_content":"מפני שיבה תקום והדרת פני זקן וגו', כ\"ק אבא מארי זלה\"ה בספרו קדושת יו\"ט מביא מאמר פלאי בשם ספר מאמר מרדכי וזה תוארו, כששמע משה רבינו ע\"ה מפי הקב\"ה מפני שיבה תקום א\"ל קום בתולת ישראל, ע\"כ. וצ\"ב."},{"passage_id":"vayikru2_bc69cd46_p2","passage_content":"ב) במדרש שוחר טוב על תהלים (פרק קי\"ט) איתא מאמר נפלא עה\"פ מזקנים אתבונן כי פקודיך נצרתי וזה לשונו, חלקת כבוד לזקנים ביציאת מצרים שנאמר (שמות ג') לך ואספת את זקני ישראל במ\"ת ויקרא משה לזקני ישראל ונאמר מפני שיבה תקום וממה שחלקת כבוד לזקנים אתא לי שאצור פקודיך שנאמר מזקנים אתבונן על כן פקודיך נצרתי א\"ל הקב\"ה עדיין לא ראית כלום ועתיד אתה לראות כשאבנה ציון הר קדשי וכו',  ע\"כ. ועיי\"ש במפרשים מה שביארו בזה."},{"passage_id":"vayikru2_bc69cd46_p3","passage_content":"ונ\"ל דהנה תשועתן של ישראל בזמן הגאולה העתידה תהיה בכוחו של אותו צדיק אאע\"ה, שהוא אבן הראשה לבנינו של כלל ישראל, והוא אשר יגין עליהם בזכותו הגדולה לעת\"ל. וכדאיתא בתנדב\"א זוטא (פכ\"א) כי בעת אשר יבא השי\"ת במשפט עם כל הגוים בעמק יהושפע ויגמר דינם לרדת לגיהנם, כיון שמגיעים לגיהנם הם ופסיליהם ורואין ישראל את כל העובדי כוכבים ופסיליהם בתוך הגיהנם, מיד מתייראים ישראל ואומרים לפני הקב\"ה רבש\"ע שמא כשם שעשית עם אלו כך תעשה עמנו, ואומר להם הקב\"ה מי אתם, והם משיבים לפניו אנחנו עמך ונחלתך ישראל, ואומר להם הקב\"ה מי מעיד עליכם ואומרים ישראל להקב\"ה אבינו אברהם יעיד עלינו, מיד קורא הקב\"ה לאברהם ואומר לו מעיד אתה עליהן שהן עמי ואני אלקיהם, ויאמר לפניו רבש\"ע לא כך אמרת לי (בראשית ט\"ו) וגם את הגוי אשר יעבודו דן אנכי וכו', עכ\"ד התנד\"א, יעיי\"ש. וכתב שם בזקוקין דנורא דלכאורה כיצד מוכח ממקרא זה שישראל דוקא הם עמו ונחלתו של הקב\"ה והוא אלקיהם, וי\"ל דמאחר שגלוי ומפורסם בראיות עד אין מספר שזרע אברהם הם עמו של הקב\"ה והקב\"ה הוא אלקיהם, ומאחר דכתיב גבי זרע אברהם וגם את הגוי אשר יעבודו דן אנכי, ופירש\"י מדברי המד' וגם את הגוי לרבות ד' מלכיות עכו\"ם שאף הן כלים על ששעבדו את ישראל וכו', ע\"כ. ומאחר שלא מצינו שום אומה שבכל האומות שהיו משועבדים בכל הארבעה מלכיות עכו\"ם ולא כפרו בהקב\"ה כי אם עם בני ישראל, א\"כ מזה מוכח שבני ישראל הם המה אותו זרע אברהם שעליהם נאמר וגם את הגוי אשר יעבודו לרבות ארבעה מלכיות, ומאחר שמוכח שהמה דוקא עמו של הקב\"ה והקב\"ה אלקיהם, א\"כ מוכח מכאן שבני ישמעאל אינם נקראים זרע אברהם, שהרי הם לא היו משועבדים במצרים ולא בארבע מלכיות, ואצ\"ל שאין שום אומה מכל שאר העכו\"ם עמו של הקב\"ה לפי שאינם מזרע אברהם, עכ\"ד ז\"ל."},{"passage_id":"vayikru2_bc69cd46_p4","passage_content":"ואיידי דאיירינן בהא מילתא, אף אנו נאמר דעפ\"י מה שדרשו רז\"ל במאה\"כ \"וגם\" את הגוי אשר יעבודו דן אנכי לרבות ארבע מלכיות, אפ\"ל גם מה שנאמר לו בברית בין הבתרים ודור רביעי ישובו הנה, דנתקשו כולם במקרא זה, שהרי לעיל מיניה כתיב ועבדום וענו אותם ארבע מאות שנה, אכן כבר נתבאר בדברנו לעיל דרשתם ז\"ל בילקוט משלי (רמז תתקס\"ג) במאה\"כ בפרשת ערלה שלש שנים וגו' ובשנה הרביעית דקאי על הגליות, כמו כן אומרו ודור רביעי ישובו הנה ירמוז על הגלות במלכות הרביעית, הוא הגלות האחרון הזה אשר אנו שרויים בו, ומובן שפיר מה שדרשו \"וגם\" את הגוי וגו' דן אנכי לרבות ד' מלכיות, שהרי כאן הודיעו הקב\"ה שעתידין ישראל להשתעבד בד' מלכיות הללו, לפיכך אמר כי בסופו של דבר יפרע מהם על מה ששעבדו בישראל. והבטיחנו הבורא יתעלה כי בסוף מלכות רביעית נזכה להגאל, כן ועזרנו הקב\"ה במהרה בקרוב לראות בשובו לביתו ברחמים."},{"passage_id":"vayikru2_bc69cd46_p5","passage_content":"ועתה נבא אל ביאור הענין, דהנה איתא בתדבא\"ר פ\"ה עה\"פ ואברהם זקן בא בימים וה' בירך את אברהם בכל, לא בימיו של אברהם הכתוב מדבר אלא בימים מן העוה\"ב וימות בן דוד (וכתב בזקוקין שם דדייק לה מדכתיב בא בימים דהול\"ל בא בימיו אלא על כרחך לא קאי על ימיו של אברהם אלא על אלו שני ימים א' ימי בן דוד וא' ימי עוה\"ב). וצריך ביאור להבין כוונת מאמר זה. וביארנו (בדברנו לעיל פ' חיי תס\"ח ע\"ב) עפי\"מ שדרשו ז\"ל (מדרש הובא ביש\"מ) וה' בירך את אברהם בכל, זה אליעזר שנאמר (בראשית כ\"ד) המושל בכל אשר לו. והנה במאה\"כ המושל בכל אשר לו דרשו ז\"ל (יומא כ\"ח ע\"ב) שהיה מושל בתורת רבו, וכן אמרו (שם) דמשק אליעזר נוטריקון דולה ומשקה שהיה דולה ומשקה מתורת רבו לאחרים. והנה ע\"י שנתפרסמו שמועותיו של אאע\"ה בעולם כולו על ידי בן משק ביתו הוא דמשק אליעזר, ונודעו לכל יושבי תבל דרכי חסידותו וצדקתו של אברהם אע\"ה, משם היה אבן היסוד להשתלשלות מסורת האבות, ולהמשך השפעת הקדושה עד סוף כל הדורות. וזכותו הגדולה היא שתעמוד להם לישראל באחרית הימים להנצל מיד שוטניהם ומקטרגיהם דורשי רעתם, ולזכות לגאולה נצחית כמבואר. וזה ביאור התנא דבי אליהו ואברהם זקן בא בימים וכו' בימים מן העוה\"ב וימות בן דוד, כי לא בימיו של עצמו בלבד בא אברהם, אלא זכויותיו הגדולות והשפעת קדושתו על באי עולם בכל דור ודור זכו לו שבא בימי עוה\"ב וימות המשיח, כלומר שגם אלו יתוספו על ימיו ויזקפו לזכותו, כי מכוחו והשפעתו יזכו ישראל לימות המשיח ולחיי עולם הבא. וזש\"ה ואברהם זקן בא בימים הם ימות המשיח ועולם הבא, והיינו טעמא משום וה' בירך את אברהם בכל, זה אליעזר שהפיץ שמועותיו בעולם, ולימד ליושבי תבל דרכי צדקתו וחסידותו."},{"passage_id":"vayikru2_bc69cd46_p6","passage_content":"ונקדים עוד מה שכתב האה\"ח הקדוש עה\"פ מפני שיבה תקום והדרת פני זקן וזלה\"ק, ירמוז ע\"ד אמרם ז\"ל בב\"ר (פס\"ה ט') כי אברהם אבינו ביקש על השיבה, כדי שיהיה ניכר האב מהבן, דכתיב ואברהם זקן. והוא אומרו מפני שיבה תקום ובזה אתה מהדר פני זקן שהוא אברהם, דכתיב ואברהם זקן שעל ידו היה דבר זה וכו'. גם רמז למאמר חכמינו ז\"ל שבשעה שהצדיק הולך מן העולם הזה אומרים לאברהם אבינו אשריך אברהם אבינו שצדיק זה יצא מחלציך, וכשהולך הרשע לא די שאין אומרים כן לפניו, אלא שהוא מצטער. לזה מעורר ה' להאדם ואומר לו והדרת פני זקן זה אברהם שמתהדר כשאומרים לפניך אשריך וכו', והוסיף להפחידו מעניני עוה\"ב באמרו ויראת מאלקיך זו יראת עונש יום הדין, אני ה' זה תשלום שכר טוב של עוה\"ב, עכלה\"ק. ודברות קדש הללו שכתב האה\"ח הקדוש מקור מקומם טהור בדברי חז\"ל במד\"ר פרשת אמור וז\"ל עה\"פ ולקחתם לכם פרי עץ הדר כנגד אברהם שהדרו להקב\"ה בשיבה, שנאמר ואברהם זקן ונאמר והדרת פני זקן, ע\"כ."},{"passage_id":"vayikru2_bc69cd46_p7","passage_content":"מבואר בדברי המדרש הללו דקרא דמפני שיבה תקום והדרת פני זקן על אברהם נאמר שהביא את השיבה לעולם. ועפ\"י זה אף אנו נאמר לבאר הפליאה הנ\"ל בשעה שאמר לו הקב\"ה למשה מפני שיבה תקום פירוש שתקומתן של ישראל וכח הקדושה שלהם בכל דור ודור היא בכוחו ובזכותו של אאע\"ה, דעלי' קאי הך קרא כמבו' באה\"ח הק', בעבור שהביא את השיבה לעולם, מיד אמר משה קום בתולת ישראל, פירוש דאף בעת ביאת המשיח תהיה כל תקומתן של ישראל בכוחו של אאע\"ה, אשר הוא יציל את בני ישראל מן המקטריגים עליהם."},{"passage_id":"vayikru2_bc69cd46_p8","passage_content":"ובדרך זו יתבאר גם מה דאיתא בשוחר טוב (קושיא ב') על מאמר אדונינו המלך דוד ע\"ה מזקנים אתבונן כי פקודיך נצרתי חלקת כבוד לזקנים ביצ\"מ וכו', במ\"ת וכו',  ונאמר מפני שיבה תקום. וממה שחלקת כבוד לזקנים אתא לי שאצור פקודיך, שנאמר מזקנים אתבונן על כן פקודיך נצרתי, א\"ל הקב\"ה וכו'. ונראה דהנה קיי\"ל דכל אדם מישראל אית ליה חזקת כשרות, ובמהות החזקה הזאת ישנם דיעות בין הפוסקים, דדעת הפני יהושע ז\"ל דחזקת כשרות היא חזקה הבאה מכח רוב, דרוב ישראל כשרים הם. ויש מן המפרשים שכ' דחזקה זו היא משום דכל אדם מישראל מונח בטבעו כח הקדושה, מחמת שהוא נצר מטע האבות הקדושים, ובכח קדושתם הגדולה המשיכו שפע קדושה לכל דורות ישראל. והספרים הקדושים (עיין באוהב ישראל פרשת וירא) הסמיכו זאת לדברי הכתוב כי ידעתיו למען אשר יצוה את בניו ואת ביתו אחריו ושמרו דרך ה', דלכאורה הול\"ל אשר יצוה וגו' \"לשמור\" דרך ה', שהרי זאת היא צוואתו שישמרו בניו דרך ה', ומדכתיב ושמרו משמע שהוא ענין לעצמו. וביארו דהכוונה דמחמת שהיה אברהם אבינו עליו השלום מצוה את בניו ואת ביתו להתנהג בדרכי התורה, ונטע בתוכם תורה וקדושה, זה הביא אח\"כ ושמרו דרך ה', כלומר שבודאי ישמרו דרך ה' ולא יטו ימין ושמאל. כי זה כבר מונח בטבעם, כי זרע קדש מצבתם. וזה כל כוחם של ישראל אשר בו הם מתחזקים לעתות בצרה ועומדים בכל הנסיונות המרים בדור השפל הזה. וזהו כח אהבה מסותרת כמ\"ש בספה\"ק ליקוטי אמרים להרב התניא זלה\"ה דבלב כל אדם מישראל מונח כח אהבה מסותרת מהאבות הקדושים אברהם יצחק ויעקב, אלא שח\"ו אם חוטאים מקלקלין כח קדושה זו."},{"passage_id":"vayikru2_bc69cd46_p9","passage_content":"והנה דוד המלך ע\"ה החזיק עצמו לאין ואפם, כאמרו ואנכי תולעת ולא איש. ובגודל ענותנותו ושפלות רוחו אמר כי כל מה שפעל ועשה בתורה ובעבודת ה' אין זה בכח עצמו, כי אם בכח האבות הקדושים אברהם יצחק ויעקב, שהשפיעו מקדושתם על כלל ישראל בכל דור ודור, ומונח הדבר בטבע איש הישראלי מבטן ומלידה, נשמור דרך ה' ולעשות צדקה ומשפט. וזהו שאמר מזקנים אתבונן כי פקודיך נצרתי, פירוש שמכחם ומזכותם של הזקנים האבות הקדושים התבוננתי לנצור פיקודיך. וזהו ביאור המדרש אמר דוד חלקת כבוד לזקנים ביצ\"מ ובמ\"ת וכו', ונאמר מפני שיבה תקום, הוא זכותו של אברהם אבינו ע\"ה אבן היסוד אשר כל בית ישראל נשען עליו, וממנו נמשך כח הקדושה לבני ישראל בכל דור ודור. וממה שחלקת כבוד לזקנים אתא לי שאצור פקודיך, כי מכחם ומזכותם של האבות הקדושים וזקני ישראל מוסדי דור ודור אני נפעל לעסוק בתורה ובמצות. כי בדרכם הכבושה אני הולך, וכל החיל הזה בתורה ובמצוות שזכיתי לו הוא מחמת שסללו לנו דרך ללכת בו."},{"passage_id":"vayikru2_bc69cd46_p10","passage_content":"ועל זאת השיבו הקב\"ה עדיין לא ראית כלום ועתיד אתה לראות כשאבנה ציון הר קדשי, שנאמר (ישעיה כ\"ד) כי מלך ה' צ' בהר ציון ובירושלים ונגד זקניו כבוד, פירוש כי לעתיד לבא יתגלה ויתוודע לעיני הכל כוחו של אברהם אבינו עליו השלום והאבות הקדושים, אשר בזכותן יהיו ישראל נגאלין. והכוונה בהך קרא אפ\"ל עפ\"י מה דאיתא בב\"ר (פצ\"ב ב') עה\"פ נגד אבותם עשה פלא (תהלים ע\"ח) כי האבות הקדושים אברהם יצחק ויעקב ראו במו עיניהם נסי יציאת מצרים, וכמו כן יהיה לעת\"ל שאמר הכתוב כימי צאתך מארץ מצרים אראנו נפלאות, יראה הקב\"ה לאבות הקדושים עצמם את הנסים הגדולים אשר יעשה לישראל עמו. וזהו שאמר הכתוב כי מלך ה' צ' בהר ציון ובירושלים ונגד זקניו כבוד, כי יראם הקב\"ה נפלאות וגדול יהיה כבודם של האבות הק' שבעבורם נזכה להגאל, וע\"כ אמר לו הקב\"ה כי הכבוד הזה שחלקת לזקנים הוא עדיין כטפה מן הים נגד מה שאני עתיד לחלק להם לעת\"ל. הקב\"ה יעזרנו שנזכה לחיות ולראות במו עינינו, ונזכה להיות בהנהו חבורתא קדישתא בביאת המשיח במהרה בימינו אמן."}]},{"dvar_torah_id":"vayikru2_36360fe9","title":"כבוד זקן וקדושת גאולה","summary":"מפני שיבה תקום, אף זקן אשמאי, מצווה לכבדו בעבור יסוריו. היסורין שישראל סובלים בגלות מביאים להקדמת הגאולה, אף אם אינם ראויים. כנסת ישראל, בתו של הקב\"ה, תזכה לגאולה בזכות סבלותיה.","contents":[{"passage_id":"vayikru2_36360fe9_p1","passage_content":"עיה\"ק ירושלים תובב\"א שנת ה'תש\"ו לפ\"ג"},{"passage_id":"vayikru2_36360fe9_p2","passage_content":"מפני שיבה תקום וגו'. במדרש פליאה (הביאו כ\"ק אבא מארי זלה\"ה בקדושת יו\"ט בשם ספר מאמר מרדכי) כששמע משה רבינו עליו השלום מפי הקב\"ה מפני שיבה תקום א\"ל קום בתולת ישראל, והוא פלאי."},{"passage_id":"vayikru2_36360fe9_p3","passage_content":"ונראה דהנה איתא בגמרא קידושין (דף ל\"ג ע\"א) דאיסי בן יהודה אומר מפני שיבה תקום ואפילו זקן אשמאי במשמע (אשמאי פירושו בור ועם הארץ), א\"ר יוחנן הלכה כאיסי בן יהודה. ומייתי בגמרא התם דר' יוחנן הוה קאים מקמי סבי דארמאי אמר כמה הרפתקי עדו עלייהו, עכ\"ד הגמרא. היוצא מזה דבכלל שיבה הוא גם מי שאינו חכם ובעל מעשים ואפילו הוא ריקם מכל מעלה שהיא, מ\"מ ציוותה תורה לכבדו ולקום מפניו בעבור שעברו עליו הרבה הרפתקאות ומאורעות שונות בימי חלדו. והנה האור החיים הקדוש כתב בפרשת משפטים עה\"פ כי ימכור איש את בתו לאמה, דקאי על כנסת ישראל בתו של הקב\"ה אומה הקדושה אשר נמכרה בגלות החל הזה לכל ע' אומות. והבטיחנו הקב\"ה כי בבוא הגאולה לא תצא כצאת העבדים, פירוש כצאת ישראל ממצרים מבית עבדים, כי אז לא הפליא ה' פלאיו כי אם באומה אחת, ועתה יעשה נסים מופלגים בעולם כולו וכו'. ואומרו ואם רעה יתבאר עפ\"י מאמר הזה\"ק כי תשתנה גאולת ישראל אם תהיה באמצעות מעשיהם הטובים, לאם תהיה לצד השלמת הקץ הסתום, כי אם תהיה באמצעות הכנת ישראל יבא הגואל בעמוד אש מוצב ארצה וראשו מגיע השמימה, ואם לצד הקץ שלא יהיו ישראל ראויים לו עליו נא' (זכרי' ט') עני ורוכב על החמור וכו'. וז\"ש אם רעה וגו', פירוש אפילו אם תהיה רעה בעיני אדוניה ולא תהיה ראויה להגאל, אעפ\"כ בהגיע זמן הקץ אשר קצב ליעדה וכו' והפדה, כי פדיון יושג לה על כל פנים. ואומרו אם אחרת וגו', בא הכתוב להתנות אימתי חלקתי לך בין זמן שהיא רעה לזמן שהיא במדריגת בנו אלא בזמן ששארה כסותה ועונתה לא יגרע, פי' שלא יחסרו ישראל פרנסתן וכל צרכיהן, אבל אם שלש אלה לא יעשה לה, אז ויצאה חנם אפילו אינם צדיקים לכסוף אל יום הפדות יצאו קודם זמן הגלות בזכות היסורין שקבלו במחסור שלש אלה, עכת\"ד הקדושים יעיי\"ש שהאריך."},{"passage_id":"vayikru2_36360fe9_p4","passage_content":"עכ\"פ מבואר מדבריו הקדושים כי בעבור היסורין העוברים על ישראל בגלות בדין הוא שיקדים הקב\"ה זמן גאולתם, אף אם אינם ראויים. וזהו ביאור המדרש כששמע משרע\"ה מפי הקב\"ה מפני שיבה תקום, וכדרשת חז\"ל ממקרא זה דאפילו זקן אשמאי חייבים אנו לכבדו, בעבור כל הני הרפתקאות צרות רבות ורעות שעברו על ראשו, אמר קום בתולת ישראל, כי צפה ברוח קדשו חבלי משיח הקשים העתידים לעבור על ישראל באחרית הימים, ובעבור היסורין הללו בדין הוא שתקום בתולת ישראל מנפילתה המטוי', אף אם אינם ראויים עדיין, כשם שמצוה עלינו לכבד אפילו איש שיבה שאין לו זכויות כלל בעבור היסורין שכבר סבל, וכמבואר באה\"ח הקדוש הנ\"ל, כי בכח היסורין אשר ישראל סובלין הרי הם שוים לבחי' בנים, ועתיד הקב\"ה להקדים להם זמן הגאולה בעבור כן, אכי\"ר."},{"passage_id":"vayikru2_36360fe9_p5","passage_content":"R"}]}]
