[{"dvar_torah_id":"devurim_c6616b0d","title":"בקשת משה רבינו לכניסה לארץ","summary":"משה רבינו התפלל רבות להיכנס לארץ ישראל, אך הקב\"ה השיב כי עליו להיקבר בחו\"ל מול פעור כדי לכפר על עונות ישראל. הוצגו טעמים שונים לבקשה, כולל חשיבות המקדש במלבן עונותיהם של ישראל.","contents":[{"passage_id":"devurim_c6616b0d_p1","passage_content":"ואתחנן אל ד' בעת ההוא לאמר וכו' אעברה נא ואראה וכו', ההר הטוב הזה והלבנון וכו', יש להבין למה הוצרך משה רבינו לכפול בבקשתו, אעברה נא ואראה, דמשמע שהם ב' דברים נפרדים, וביקש והתפלל על שניהם, ולפי הנראה היינו הך, דכשיעבור מובן מאליו שיראה את הארץ ג\"כ."},{"passage_id":"devurim_c6616b0d_p2","passage_content":"ב) ההר הטוב הזה והלבנון, איתא בילקוט והלבנון זה בהמ\"ק, ולמה נקרא שמו לבנון, שמלבין עונותיהם של ישראל, יש להבין מה בא לרמוז בזה שקראו לבנון ע\"ש שמלבין עונותיהם של ישראל, והרבה שמות יש לו בתורה, אברהם קראו הר, יצחק קראו שדה יעקב קראו בית, וגם נקרא מקדש ד', ומדוע קראו משה רבינו בשם חדש, ומה ענין שמלבין עונותיהם של ישראל לבקשתו."},{"passage_id":"devurim_c6616b0d_p3","passage_content":"ג) במדרש הביאו בישמח משה, ואתחנן למה, כדי שיכנס לארץ, עכ\"ד המדרש והוא פלא מה חידשו בזה, ומאי קושיא, ומאי פירוקא, והכל מפורש בתורה."},{"passage_id":"devurim_c6616b0d_p4","passage_content":"ד) במדרש אמר הקב\"ה למשה, אתה רוצה לאחוז את החבל בשני ראשין, אם אעברה נא אתה מבקש לקיים, בטל סלח נא, ואם סלח נא אתה מבקש לקיים, בטל אעברה נא, ארשב\"ל כיון ששמע משה כך, אמר ימות משה ומאה כיוצא בו, ולא תנזק צפורן של אחד מהם עכ\"ד המדרש. ויש להבין למה תלה הקב\"ה קיום הא' בביטול חבירתה, ומדוע אי אפשר שיתקיימו שניהם, והלא לכאורה אין נראה שום סתירה ביניהם, ובודאי יכולת בידו ית' ליתן לו שניהם גם יחד."},{"passage_id":"devurim_c6616b0d_p5","passage_content":"ה) עוד יקשה דבמדרש הנ\"ל מבואר דזו היתה תשובתו ית' אליו, ומשה רבינו קבל טענה זו לטובת ישראל, כמ\"ש ימות משה ואל תנזק צפורן של א' מהם, ובפסוק ליכא שום רמז מזה כלל, אדרבה בפסוק מבואר תשובה אחרת, דמפני שא\"ל הקב\"ה רב לך אל תוסף דבר וכ'ו, אז קבל גזרתו ית' ולא התפלל עוד."},{"passage_id":"devurim_c6616b0d_p6","passage_content":"ו) במס' סוטה (דף י\"ד ע\"א) דרש רבי שמלאי מפני מה נתאווה משה רבינו ליכנס לא\"י, וכי לאכול מפרי' הוא צריך, או לשבוע מטובה הוא צריך, אלא כך אמר משה, הרבה מצות נצטוו ישראל, ואין מתקיימין אלא בא\"י, אכנס אני לארץ כדי שיתקיימו כולן על ידי, א\"ל הקב\"ה כלום אתה מבקש אלא לקבל שכר, מעלה אני עליך כאלו עשיתם וכו' עכ\"ד המדרש. ויש להבין מה היתה התחלת קושיתו של ר' שמלאי, מפני מה נתאוה משה רבינו ליכנס לא\"י, וכי יש הו\"א בעולם שלאכול מפרי' נכנס, והלא תירוצו מובן מאליו, שרצה משרע\"ה לקיים מצות התלוים בארץ ולבנות בהמ\"ק, ולראות כהנים בעבודתן ולוים בדוכנן, ומה גם שהיתה תשוקת האבות, שיזכו לעלות לא\"י ולהיות נקבר שם, כמו שצוה יעקב ויוסף, וארץ ישראל חמדת כל ישראל, ומדוע לא יתאוה משה, וצריך להבין התחלת הקושיא מה היא."},{"passage_id":"devurim_c6616b0d_p7","passage_content":"ז) עלה ראש הפסגה ושא עיניך וכו' וראה בעיניך וכו', איתא בילקוט ר\"א אומר נתן הקב\"ה כח בעיניו של משה, וראה מסוף העולם ועד סופו וכו', עלה ראש הפסגה וראה, זו ראיה של צער, עוד איתא בילקוט (פ' ברכה) והובא בספרי ויראהו ד' את כל הארץ, מלמד שהראהו א\"י מיושבת על שלותה, וחזר והראהו המציקים לה ע\"כ, גם איתא במד\"ר (פ' מסעי) עה\"פ זאת הארץ וכו', מלמד שהראה לו הקב\"ה למשה, דור ודור ומנהיגיו דור ודור וצדיקיו, דור ודור ושופטיו, דור ודור ופושעיו וכו', ראוי להבין למה הראה לו הקב\"ה את כל אלה, בשלמא מה שהראה הצדיקים שבכל הדורות ניחא, אבל מה שהראה לו החורבן והמציקים והפושעים למה, והלא די' לצרה בשעתה, ואקדומי פורעניות לא מקדמינן."},{"passage_id":"devurim_c6616b0d_p8","passage_content":"ולבאר כל הענין נקדים מה שהקשו בעלי התוס', עה\"פ בפ' בשלח (פר י\"ד) וישובו ויחנו לפני פי החירות וגו' לפני בעל צפון וגו' והקשו האיך נתן הכ' סימן לחנייתם שיהי' לפני בעל צפון, הא אמרינן אסור לאדם לומר לחבירו, המתן לי בצד ע\"ז פלוני, ותירצו דדוקא לאדם אסור, אבל להקב\"ה לא, שהרי מצינו שהקב\"ה יושב ודן את כל העולם אפי' בשבת ואפי' בר\"ה ויוהכ\"פ, אע\"פ שלישראל אסור, וכה\"ג כתב רש\"י ז\"ל (ר\"ה ל' ע\"א) על דברי הגמ' שאמרו שם, דאיבני בחמיסר בניסן, וא\"ת היכי משכחת לה דאיבני בחמיסר ביו\"ט, והא קיימ\"ל (במס' שבועות ט\"ו) דאין בנין בהמ\"ק ביו\"ט, ותירצו דה\"מ בנין בידי אדם, אבל בנין העתיד לבא בידי שמים הוא עכ\"ל, עוד תירצו בעלי התוס' על קושיתם הנ\"ל כיון דעדיין לא נתנה התורה, אין לחוש עכת\"ד ז\"ל."},{"passage_id":"devurim_c6616b0d_p9","passage_content":"ושני התירוצים הנ\"ל אית להו פירכא, דמה שתירצו דלהקב\"ה שרי, הלא מפורש בכמה מקומות בדברי חז\"ל, דהקב\"ה שומר משמרתה של תורה, ובמד\"ר פ' קדושים עה\"פ ושמרתם משמרתי, מכאן שהקב\"ה שומר משמרתה של תורה ועוד בכ\"מ, ומה שהביאו ראי' ממה שמצינו שהקב\"ה יושב ודן אפי' בשבת ואפי' ביוהכ\"פ, אין משם ראי' כ\"כ, עפימ\"ש בב\"ר (פ\"ר י\"א ס\"ה), שאל טורנוסרופוס הרשע את ר\"ע, אם כדבריך שהקב\"ה מכבד את השבת אל יוריד בה גשמים ואל יצמיח בה עשב, א\"ל אמשול לך משל, לשנים שהיו דרין בחצר אחת, אם אין זה נותן עירוב וזה נותן עירוב שמא מותרין לטלטל בחצר, אבל אם הו' א' דר בחצר ה\"ה מותר בכל החצר כולה, אף כאן הקב\"ה לפי שאין רשות אחרת עמו, וכל העולם כולו שלו, מותר בכל העולם כולו ע\"כ במדרש."},{"passage_id":"devurim_c6616b0d_p10","passage_content":"וכתב בנזה\"ק דא\"ש מה שתירץ לו על הורדת גשמים, דאין כאן איסור טלטול מרשות לרשות, דכל העולם כולו שלו כד' אמות, אבל איך יהי' מתורץ קושיתו, מה שמצמיח זרעים בשבת, ותירץ דאצל הבוי\"ת אין שייך שום התחדשות, והכל מתוקן לפניו, ומה שיהי' כבר הי' לפניו ית', והעתיד והעבר הכל ברגע א' לפניו ית', וההשתנות הוא רק אצלנו א\"כ מה שמוציאן אל הגלוי, הוא רק כמוציא מרשות לרשות, וכיון שכל העולם כלו שלו, לא שייך מוציא מרשות לרשות כנ\"ל, וא\"ש דמה שתירץ לו ר\"ע היתה תשובתו על שניהם, ע\"כ תו\"ד הנזה\"ק."},{"passage_id":"devurim_c6616b0d_p11","passage_content":"וכמו\"כ אפשר לומר, לענין מה שהקב\"ה יושב ודן בשבת ויוהכ\"פ, כיון שאין שייך אצלו ית' שום התחדשות, אינו נכנס בגדר מלאכה במושג אצלנו, והוא רק כגלוי מלתא בעלמא, וא\"כ אין משם ראוי', ומה שהביאו ראי' מדברי רש\"י (בר\"ה ל' ע\"א) שכתב דבהמ\"ק דלעתיד שהוא בידי שמים אפשר שובנה בשבת ויו\"ט, - אפשר דאין ראי' משם, דבנין המקו' בנוי ומשוכלל כבר, ואמרו חז\"ל בפסחים (נ\"ד ע\"א) דהוא משבעה דברים שקדמו לעולם עיי\"ש, ולפי\"ז תירוצם הראשון צ\"ב."},{"passage_id":"devurim_c6616b0d_p12","passage_content":"ועל תירוצם הב' שכתבו דכיון שהי' קודם מתן תורה און לחוש הא תינח תירוץ זה שם בפ' בשלח, אבל הרי מצינו גם בפ' ברכה ויקבור אותו בגי וכו' מול בית פעור, הרי שהזכיר הכתוב פעור לסימן מקום קבורתו, וזה הי' כבר אחר מתן תורה, גם בפ' ואתחנן כתוב ונשב בגיא מול בית פעור והרי פסוק זה משה רבינו אמרו ולא שייך הכא אף א' משני התירוצים הנ\"ל, והדרא קושיתם לדוכתי', וצ\"ב."},{"passage_id":"devurim_c6616b0d_p13","passage_content":"ואפשר לתרץ קושית בעלי התוס' בפשטות, ויתורץ גם קושיתנו הנ\"ל, ונאמר דהא דאמרו חז\"ל, אסור לאדם שיאמר לחבירו המתן לי בצד ע\"ז פלונית, משוה שנא' ושם אלהים אחרים לא תזכירו ולא ישמע על פיך, האיסור אינו רק אם מזכירו לסימן, שעי\"ז נתכבד ע\"ז על ידו, ונותן להם הוי' ויש ודרשו חז\"ל לא יהי' לך אלהים אחרים, לא תתן להם הוי' ואלהות, אבל להזכירם שלא לשם סימן, אלא לשם אבדון ולשם גנאי מותר, ומצוה איכא בגווי', כמ\"ש ואבדתם את שמם, פרש\"י לכנות להם שם לגנאי וכו', והכי איתא בספרי שם, יכול לשבח ת\"ל שקץ תשקצנו וכו', וממעה בג' מקומות הנ\"ל לא הוזכרה פעור לסימן מקום, אלא לשם אבדון כמבואר בדרשת חז\"ל, וא\"כ אין כאן מקום קושיא כלל."},{"passage_id":"devurim_c6616b0d_p14","passage_content":"דהנה מ\"ש בפ' בשלח לפני בעל צפון, פרש\"י ז\"ל והוא מהמכילתא, וז\"ל הוא נשאר מכל אלהי מצרים כדו להטעותן, שיאמרו קשה יראתן וכו', ועליו נאמר משגוא לגוים ויאבדם עכ\"ל, וא\"כ לא נזכרה לשם סימן מקום, אלא לשם אבדון להם ולעובדיהם, ומ\"ש בפ' ברכה ויקבור אותו בגיא מול בית פעור, כתבו התוס' (בסוטה י\"ד ע\"א) בשם מדרש אגדה, (והוא בפדר\"א) בכל שנה ושנה בעת שחטאו ישראל בבנות מואב, באותו פרק פעור עולה למעלה לקטרג ולהזכיר עון, וכשהוא רואה קברו של משה, חוזר ושוקע עד חוטמו וכו', מבואר דמה דהוזכר שם פעור, לא לסימן מקום נאמרה, כי לא ידע איש את קבורתו של משרע\"ה אלא נזכרה פעור ע\"ש אבדון, שמשרע\"ה נקבר למולו כדי להכניע כחו ולאבדו."},{"passage_id":"devurim_c6616b0d_p15","passage_content":"וכמו\"כ כאן בפ' ואתחנן מ\"ש ונשב בגיא מול בית פעור, כתב האוהחה\"ק דלכאורה אין לפסוק זה קישור עם שלפניו, ופי' הוא ז\"ל אין ישיבה אלא עכבה עד עולם, שמשה רבינו רמז א' מטעמי קבורתו שם מול בית פעור, לבל ירים ראש לקטרג על ישראל עכדה\"ק. עכ\"פ מבואר דמשרע\"ה היה מוכרח להיות נקבר בחו\"ל מול בית פעור, כדי לכפר על מעשה פעור, והוא גמרא מפורשת בסוטה שם, אלא שבתוס' בשם המדרש מבואר יותר, דבכל שנה ושנה נתחדש קטרוג פעור, ואלולי משה רבינו מכניעו, הי' ח\"ו חשש כלי' לשונאי ישראל, נמצא דקבורת משה רבינו בחו\"ל, הי' הכרח להצלת ישראל."},{"passage_id":"devurim_c6616b0d_p16","passage_content":"ונקדים עוד מ\"ש רש\"י ז\"ל, עה\"פ כי אנכי מת בארץ הזאת אינני עובר את הירדן, וכתב רש\"י ז\"ל מאחר שמת מהיכן יעבור, אלא אף עצמותי אינם עוברים עכ\"ל, ומעתה אפשר לומר דמה שביקש משה רבינו בתחלה אעברה נא, היתה בקשתו שיעבור וגם יהי' נקבר שם, כמו שפרש\"י שם מלת עובר, וע\"ז א\"ל הקב\"ה שזה א\"א, דההכרח שיהי' נקבר בחו\"ל מול בית פעור לכפר על עונם. ומעתה מבוארים דברי המדרש הנ\"ל, אם אעברה נא אתה מבקש לקיים, בטל סלח נא, שאם לא תהיה נקבר בחו\"ל מול פעור, יהי' ח\"ו קטרוג על ישראל, כי הפעור עולה בכל שנה לקטרג, כדברי התוס' בשם המדרש, ואם סלח נא אתה מבקש לקיים, להכניע קטרוג פעור ולכפר על בנ\"י, בטל אעברה נא, וא\"א לך לבקש לעבור לא\"י ולהיות נקבר שם, ומשרע\"ה קבל טענה זו, והסכים להיות נקבר בחו\"ל לטובת הצלת ישראל, וז\"ש רשב\"ל אמר משה, ימות משה ומאה כיו\"ב, ואל תנזק צפורן של א' מהם."},{"passage_id":"devurim_c6616b0d_p17","passage_content":"אמנם עדיין הי' משרע\"ה מתפלל, שיתיר לו הקב\"ה הכניסה לבד, שיכנס לארץ ויקיים מצות התלויות בארץ, ואח\"כ יחזור ויוקבר בחו\"ל, וזה פי' הכתוב ואראה את הארץ הטובה, שבזה לא ביקש עוד אלא על הכניסה לבד, שיראה אותה ואח\"כ יחזור לחו\"ל."},{"passage_id":"devurim_c6616b0d_p18","passage_content":"ולדרכנו יתבאר דברי המדרש הנ\"ל, ואתחנן אל ד' למה, כדי שיכנס לארץ ע\"כ, ואפשר דהי' קשיא לי' לבעל המדרש, למה הפציר משה רבינו בתפלה כ\"כ, והתפלל תקט\"ו תפלות כמנין ואתחנן, עד שא\"ל הקב\"ה רב לך ולמה לא הספיק לו בטענה זו, שא\"ל הקב\"ה שמוכרח הוא להיות נקבר בחו\"ל לצורך הצלת ישראל, כי בודאי חש משרע\"ה להצלת ישראל, וע\"ז תירצו כדי שיכנס לארץ, כי באמת כבר הסכים לזה, שיהי' נקבר בחו\"ל לצורך הצלת ישראל, כדאיתא במדרש הנ\"ל (שאמר מוטב ימות משה ואל תנזק צפורן של א' מהם), ומה שהפציר בתפלה כ\"כ, הי' על הכניסה בלבד, וז\"ש כדי שיכנס לארץ, דהיינו כניסה בלבד והבן."},{"passage_id":"devurim_c6616b0d_p19","passage_content":"ונבוא לבאר קושית הגמ' (בסוטה י\"ד) מפני מה נתאוה משה לכנס לא\"י, דקדקו בלשונם לומר לכנס, ר\"ל דאחרי שא\"ל הקב\"ה שמוכרח להיות נקבר בחו\"ל, א\"כ הי' כל מאויו רק לכנס לא\"י, והרי כבר רמז לו הקב\"ה, שלא יהי' נבנה בהמ\"ק על ידו, ושלא יהי' עדיין התיקון השלם והגאולה שלמה בימיו כמו שרצה משה רבינו, דאל\"ה לא הי' צורך שיוקבר משה בחו\"ל להכניע טומאת פעור, כי אז יתקיים כל האלילים כרות יכרתון, ויתכפר עון ישראל, ולא יהי' עוד קטרוג עליהם, א\"כ קשיא לי' לר' שמלאי מפני מה נתאוה משה אל הכניסה בלבד, וע\"ז תירץ דכל מאויו הי' כדי לקיים מצות התלויות בארץ, ואח\"כ יחזור להיות נקבר בחו\"ל, לצורך הצלת ישראל."},{"passage_id":"devurim_c6616b0d_p20","passage_content":"וע\"ז היתה תשובתו של הקב\"ה אליו, רב לך אל תוסף דבר אלי עוד וגו', ויובן עפי\"מ דאיתא בגמ' מנחות (צ\"ט ע\"א) ויקם משה את המשכן וגו' ויתן את אדניו וגו' מכאן דאין מורידין בקדושה, ופרש\"י שם דלא סייעוהו הכהנים בהקמת העמודים והאדנים והקרשים, אלא הוא בעצמו עשאן, ש\"מ דאין מורידין, לפיכך לא נתעסקו בו אחרים עיי\"ש, ועתה אם הי' משרע\"ה נכנס לא\"י, והי' צריך לצאת, להיות נקבר בחו\"ל מטעם הנ\"ל, היה זה הורדה לא\"י בערך גדולת משה רבינו, וזה שא\"ל הקב\"ה רב לך, לפי גדולתך שהוא רב, א\"א למלאות מבוקשך, ולכן אל תוסף דבר אלי עוד בדבר הזה, כי א\"א שתכנס לארץ אפי' על דעת לחזור, שזה יהיה הורדה לא\"י, ואין מורידין כמבואר בגמ' הנ\"ל, ומה שרצונך לקיים מצות התליות בארץ, מעלה אני עליך שכר כאלו עשיתם."},{"passage_id":"devurim_c6616b0d_p21","passage_content":"ולפי\"ז אין כאן סתירה, דמ\"ש במדרש הטעם בשביל סלח נא, זהו הטעם שלא יוקבר בא\"י, ומוכרח ליקבר בחו\"ל בשביל לכפר על פעור, ומ\"ש בפסוק רב לך אל תוסף וכו', הוא טעם שא\"א לו ליכנס אפי' לשעה, ולחזור אח\"כ לחו\"ל כנ\"ל (ומתורץ קושיא ה'."},{"passage_id":"devurim_c6616b0d_p22","passage_content":"ומה שהזכיר משרע\"ה בתפלתו, לבנין זה בהמ\"ק שמלבין עונותיהם של ישראל, אפשר לומר שאחר כל הטענות עוד ביקש משרע\"ה, כיון שכל העיכוב שא\"א לו לכנס לארץ, ולהיות נקבר שם, הוא מפני קטרוג פעור כנ\"ל, והכניסה בלבד א\"א כי יהיה הורדה בזה לא\"י כנ\"ל, לכן ביקש משה רבינו ואראה את הארץ וכו' והלבנון ר\"ל שיזכה ליכנס ושיבנה בהמ\"ק על ידו, ובהמ\"ק מלבין עונותיהם של ישראל, ונמצא שיתקיים סלח נא ע\"י בהמ\"ק, ולא יהי' מוכרח לחזור לחו\"ל ולהיות נקבר שם, ובטל גם טעם הורדה מקדושה הנ\"ל."},{"passage_id":"devurim_c6616b0d_p23","passage_content":"ע\"כ אמר לו הקב\"ה עלה ראש הפסגה וראה בעיניך כי לא תעבור, ואמרו במדרש הנ\"ל, נתן הקב\"ה כח בעיניו של משה, וראה מסוף העולם ועד סופו, והראהו א\"י מיושבת על שלותה, והראהו המציקים לה, היינו שהראה לו חורבן ב' מקדשות, ולא יהי' התיקון השלם עד מקדש העתיד ובנין השלישי, ורק אז יתקיים ואת רוח הטומאה יעביר מן הארץ, ואז יבוקש עון ישראל ואיננו כמבואר בפסוקים, אבל עד העת ההוא עדיין ההכרח להכניע טומאת פעור, ובזמן מקדש ראשון ושני היה עוד קטרוג על ישראל, וא\"כ מוכרח משה רבינו להיות נקבר בחו\"ל, וחזרו הטעמים הנ\"ל למקומן, ולפי שרצה הקב\"ה להראות לו בתי מקדשים וחורבנן, ושיהי' עוד התגברות הטומאה בימיהם לטעם הנ\"ל, ע\"כ הוצרך להראות לו ג\"כ דור ודור ופושעיו, שהם הם הגורמים להתגברות הטומאה, ולחורבן בתי מקדשים, ועדיין הקטרוג שולט בתקפו ר\"ל, לכן מהכרח שלא יכנס משה לא\"י, וא\"ש מה שהראה לו הקב\"ה כל אלה, כי כל זה הוא טעם לגזירתו מה שאמר למשה לא תעבור והבן."}]},{"dvar_torah_id":"devurim_6ea518ee","title":"ספקות משה על ארץ סיחון ועוג","summary":"משה רבינו תמה אם ארץ סיחון ועוג בכלל א\"י, והעלה ספקות בעקבות שליחתו אליהם דברי שלום. המפרשים חלוקים אם הם נחשבים לארץ ישראל, והחיד\"א מבאר את ספקותיו בהלכה, מה שמוביל לקושיות על טעותו האפשרית.","contents":[{"passage_id":"devurim_6ea518ee_p1","passage_content":"ואתחנן אל ד' בעת ההוא לאמר וגו', פירש\"י בעת ההוא, לאחר שכבשתי ארץ סיחון ועוג, דמיתי שמא הותר הנדר עכ\"ל, והוא מדברי הספרי, וכתבו המפרשים דכוונת משה רבינו היתה, לפי שהי' סבור שארץ סיחון ועוג מכלל ארץ ישראל הם, וע\"ז בא בטענה לומר נדר שהותר מקצתו הותר כולו, והפרשת דרכים (בדרך הקדש דרוש ח') האריך בזה לברר דארץ סיחון ועוג הם בכלל א\"י, והביא ראי' לדבריו, דתנא במתני' (בסוף פ\"א דבכורים) מיעט ארץ סיחון ועוג מן הבכורים, מפני שאינה ארץ זבת חלב ודבש, ולענין תרומות ומעשרות חיובם מן התורה, כמ\"ש הרמב\"ם ז\"ל, ע\"כ ראייתו, אמנם לבסוף הקשה הוא בעצמו על הנחה זו, דא\"כ דהם בכלל א\"י, מה נשתנה ארץ סיחון ועוג טפי משאר א\"י, שלא הותר לו למשה ליכנס לא\"י, ולארץ סיחון ועוג הותרה לו, ונשאר בצ\"ע."},{"passage_id":"devurim_6ea518ee_p2","passage_content":"וק\"ז הישמח משה זלל\"ה תמה על הפר\"ד הנ\"ל, והעלה דודאי אינם מכלל א\"י, דאל\"כ איך שלח משה מלאכים אל סיחון דברי שלום, והרי לשבעה אומות אין קוראים להם לשלום לשיטת רוב המפרשים, ואפי' לשיטת הרמב\"ם ז\"ל (בה' מלכים) והרמב\"ן ז\"ל בפרשת שופטים, דס\"ל דנצטוינו לקרוא לשלום אף לז' אומות, ואם ירצו להשלים משלימין עמהם, אמנם כל זה רק בתנאי אם יקבלו עליהם שלא לעבוד ע\"ז עוד, אבל כאן הרי לא התנה משרע\"ה עמהם שום תנאי, אלא שיניחו את ישראל לעבור בארצם, ואלו היו שומעים לזה היו משלימין עמהם, ולא הי' נוגעים בהם כלל, ועכ\"ח ראי' דארץ סיחון ועוג אינה מארץ ז' אומות, ודחה ראיית הפרשת דרכים מה שלמד, מדנתחייבו בתרומות ומעשרות, מכלל דא\"י נינהו, וכתב הוא ז\"ל דאינו ראי', דאפשר דנתקדשו בקדושת א\"י אח\"כ, כשנכבשה כל א\"י, נתקדשו גם הם, אבל בימי משה וודאי שלא היו בכלל א\"י, מדשלח אליהם דברי שלו' עכ\"ד ז\"ל."},{"passage_id":"devurim_6ea518ee_p3","passage_content":"ולכאורה קשה לפי דבריו ז\"ל דודאי אינם בכלל א\"י, וגם משה רבינו בעצמו הכריע כן במה ששלח להם דברי שלום, א\"כ איך אמר כאן שמא הותר הנדר, מטעם נדר שהותר מקצתו הותר כולו, והרי לא היו בכלל הנדר מעולם, כיון שהם חו\"ל, וא\"כ קשה ממנ\"פ, אם נימא כדברי הפר\"ד דהם מכלל א\"י, א\"כ יקשה מה נשתנו ארץ סיחון ועוג, שהותרו למשה ליכנס בהם, יותר משאר א\"י שלא הותר לו, ואם נימא כדברי הישמח משה דהם מכלל חוץ לארץ והראי' מדשלח להם דברי שלו', א\"כ איך טעה משה לומר דהותר הנדר, הרי לא היו בכלל הנדר מעולם."},{"passage_id":"devurim_6ea518ee_p4","passage_content":"והחיד\"א ז\"ל בספרו ראש דוד כתב, דנסתפק משה רבינו בהלכה זו, אם הם מכלל א\"י או לא, וספיקתו תליא בפלוגתא דתנאי בבכורות (דף נ\"ה ע\"א), דפליגי ריב\"ב ורשב\"י, אם הירדן עצמו הוי מכלל א\"י או לא, וילפי שם מקראי, למר כדאית לי' ולמר כדאית לי' עיי\"ש, ונסתפק משה רבינו הלכה כדברי מי, אם הלכה כריב\"ב דהירדן עצמו חוץ לארץ, א\"כ גם עבר הירדן חו\"ל, או אפשר דהלכה כרשב\"י דהירדן א\"י, וגם עבר הירדן כמותו, ונסתפק עוד דאפשר גם לרשב\"י דס\"ל דהירדן א\"י, אבל עבר הירדן ארץ סיחון ועוג הם חו\"ל, נמצא דאסתפוקי לי' למשה תרי ספיקי, ולכן אמר דמיתי שמא הותר הנדר, עכ\"ד החיד\"א זלל\"ה."},{"passage_id":"devurim_6ea518ee_p5","passage_content":"ויש להבין דעכ\"ח קמי שמיא גליא, וליכא ספיקא, וע\"כ איפסקא הילכתא בב\"ד של מעלה כחד מינייהו, ועתה אם נימא דשיטת ההלכה דהם א\"י, א\"כ יקשה מה נשתנה ארץ סיחון ועוג, שהותרה לו למשה, יותר משאר א\"י שלא הותרה לו, אלא עכ\"ח דשיטת ההלכה דאינם א\"י, א\"כ איך אמר משה רבינו שמא הותר הנדר, והיתכן לחשוב על משה רבינו שטעה, ולא השיג ההלכה לאמיתתה, וע\"ק אחרי ששלח אליהם דברי שלום, עכ\"ח צ\"ל שלא הי' מסופק, והי' ברור בעיניו דהם חו\"ל, וא\"כ מדוע נסתפק לו עתה וצ\"ב."}]},{"dvar_torah_id":"devurim_73b82957","title":"קושיות על מדרש ואתחנן","summary":"המדרש שואל מדוע משה לא נכנס לארץ, והקב\"ה מציין חכמתו. יש להבין מה טענה זו, וכיצד היא מתקשרת לרצון משה להיכנס לארץ ישראל. הישמח משה האריך בביאור המדרש והקושיות שבו.","contents":[{"passage_id":"devurim_73b82957_p1","passage_content":"במדרש (הובא בישמח משה) ואתחנן אל ד' למה, כדי שיכנס לארץ עכ\"ד המדרש, וצ\"ב מאי קושיא ומאי פירוקא, והרי הכל מפורש בפסוק, ומה הוסיף המדרש דבר שאינו מבואר בקרא."},{"passage_id":"devurim_73b82957_p2","passage_content":"עוד במדרש, א\"ל הקב\"ה למשה כתבתי עליך שחכם אתה, שנאמר חכם לב יקח מצות, ואתה רוצה ליכנס לארץ ע\"כ, ויש להבין מה טענה היא זו, וכי מפני שהוא חכם לא ירצה ליכנס לא\"י אתמהה, וק\"ז הישמח משה זלל\"ה האריך בביאור דברי המדרש עיי\"ש."}]},{"dvar_torah_id":"devurim_74ada2d7","title":"","summary":"","contents":[{"passage_id":"devurim_74ada2d7_p1","passage_content":"איתא במדרש (הביאו החיד\"א ז\"ל) אתה החלות להראות את גדלך זו יציאת מצרים, ראוי להבין מה היתה טענת משה רבינו בזה, ואיך טענה זו מכרעת שיזכה על ידה לכניסת הארץ."}]},{"dvar_torah_id":"devurim_b60ef75c","title":"חכם לב יקח מצות","summary":"מדרש על משה רבינו שלא נכנס לארץ ישראל בשל חטא שלא הודה בארצו, לעומת יוסף שהודה. משה עסק בעצמות יוסף תוך שמירה על מצוות, והדבר נדרש לשבחו. הדיון מתעמק במעלות החכמה והענווה, ובקשר בין מצוות ליחס בין ישראל למצרים.","contents":[{"passage_id":"devurim_b60ef75c_p1","passage_content":"איתא בילקוט (רמז תתי\"ד) אמר משה לפני הקב\"ה רבש\"ע עצמותיו של יוסף נכנסין לארץ, ואני איני נכנס, א\"ל הקב\"ה מי שהודה בארצו יקבר בארצו, יוסף שאמרה אדונתו ראו הביא לנו איש עברי, ואינו כופר, אלא אמר כי גנב גנבתי מארץ העברים יקבר בארצו, אתה שלא הודית בארצך, בנות יתרו אומרות איש מצרי הצילנו וגו', ואתה שומע ושותק, לא תקבר בארצך, ויל\"ד הא מבואר בקרא יען לא האמנתם בי וגו', לכן לא תביאו וגו', ולמה שינה המדרש מטעם המבואר בפסוק ליתן טעם חדש, ועוד קשה שלא נזכר חטא זה בתורה בשום מקום."},{"passage_id":"devurim_b60ef75c_p2","passage_content":"ונקדים לפרש דברי המדרש הנ\"ל, א\"ל הקב\"ה למשה כתבתי עליך שחכם אתה, שנאמר חכם לב יקח מצות ואתה רוצה ליכנס לארץ וצ\"ב, ואפ\"ל בהקדם דברי הגמ' סוטה (דף י\"ג ע\"א) ת\"ר בא וראה כמה חביבות מצות על משרע\"ה, שכל ישראל כולן נתעסקו בביזה, והוא נתעסק במצות, שנאמר חכם לב יקח מצות ואויל שפתיים ילבט (משלי ד) עכ\"ד הגמ', והמהרש\"א ז\"ל בח\"א הקשה, למה תיאר אותו בשם חכם בשביל מעשה מצוה זו, ומדוע לא כינה אותו בשם צדיק או חסיד, שהוא יותר מתאים, ותירץ דשפיר הוא דבר חכמה, שחשב הפסד מצוה כנגד שכרה עכת\"ד עיי\"ש, וק\"ז הישמח משה זלל\"ה הקשה על דבריו, דאם חישב שכר מצוה ובשביל זה החזיק במצוה לעשותה, א\"כ הרי הוא עובד ע\"מ לקבל פרס, והיתכן לחשוב על משה רבינו כן, ותירץ דבכה\"ג שלא הי' מחויב במצוה זו, והכניס א\"ע לכלל החיוב מותר מדינא לעשות ע\"מ לקבל פרס יעייש\"ד, אמנם עדיין קשה להבין דברי המהרש\"א ז\"ל, דהן אמת דמדינא מותר לעשות עמל\"פ באופן זה, אבל אעפ\"כ אין זה בגדר שלימות העבודה, ואין זו מדת חסידות, ואיך יצוייר לומר כן על משה רבינו ע\"ה."},{"passage_id":"devurim_b60ef75c_p3","passage_content":"ונקדים עוד מה שהקשה המהרש\"א ז\"ל, ע\"ד הגמ' (סוטה י\"ג ע\"ב) ואי לא איעסק בי' משה (בעצמות יוסף) ישראל מי לא הוו מיעסקי בי', וכו' ותו אי לא איעסקו בי' ישראל, בניו מי לא הוו מיעסקי בי' וכו', אלא אמרו הניחו לו כבודו במרובים יותר מבמועטין, ותו אמרו הניחו לו כבודו בגדולים יותר מבקטנים עכ\"ד הגמ', ור\"ל דע\"כ הניחו ישראל למשה לבדו שיתעסק בהם וכיו\"ב אמרו שם בגמ' לעיל, גבי יעקב אבינו, שהקשו ואי לא עסק בי' יוסף, אחיו מי לא הוי מתעסקי בי' וכו', אלא אמרו הניחו לו, כבודו במלכים יותר מבהדיוטות עכ\"ד הגמ' שם, והקשה המהרש\"א ז\"ל דלפי המבואר בגמ', מה שלא נתעסקו ישראל בעצמות יוסף כל מ' שנה שהיו במדבר, עכ\"ח הי' טעמם בזה לכבודו של יוסף משום דכבודו בגדולים, דהרי במדבר לא היו טרודים בביזה, וא\"כ אמאי לא נימא דגם מעיקרא במצרים, מ\"ש ויקח משה את עצמות יוסף וכו' ולא נתעסקו בו ישראל, הי' ג\"כ מטעם הנ\"ל, ואמאי דרשו בגמ' לעיל ואויל שפתיים ילבט בגנותן של ישראל, דשבקי' לי' משום ביזה, אדרבה הו\"ל לתלות בשבחן של ישראל, דשבקי' לי' משום כבודו, ע\"כ תוכן קושייתו."},{"passage_id":"devurim_b60ef75c_p4","passage_content":"ותירץ המהרש\"א ז\"ל דאי משום טעם זה דכבודו יותר בגדולים, לא הוי שבקי לי' ישראל מלהתעסק בו מעיקרא, דאין זה כבודו שלא להתעסק בו כלל, ועכ\"ח מה שלא התעסקו בו מעיקרא במצרים, היתה הסיבה מפני שהיו טרודים בביזה, וכיון דכבר נתעסק בי' משה לחודי' במצרים מטעם הנ\"ל, הניחו לו כך גם במדבר, ואמרו הניחו לו כבודו בגדולים יותר וכו', וע\"כ דרשו לעיל בגנותן של ישראל דשבקי' לי', מעיקרא, משום שהיו טרודים בביזה עכ\"ד המהרש\"א ז\"ל, אמנם קשה על תירוצו, דהרי כמו\"כ מצינו שם בגמ' גבי יעקב אבינו, דשבקי' לי' אחי יוסף \"מעיקרא\" שיתעסק בו יוסף, מטעם דכבודו במלכים יותר מבהדיוטות, אלמא דטעם זה מספיק, גם למה דשבקי' לי' מעיקרא, וא\"כ כמו\"כ נימא גבי עצמות יוסף, דמה שלא נתעסקו בו ישראל מעיקרא, הי' ג\"כ הטעם משום דכבודו יותר בגדולים, וכיון שאפשר לדרוש לשבחן של ישראל, למה לן לדרוש בגנותן, והדרא קושיא לדוכתי'."},{"passage_id":"devurim_b60ef75c_p5","passage_content":"ואפשר לתרץ קושית המהרש\"א ז\"ל באופן אחר, עפ\"י המבואר (בשו\"ע יו\"ד סי' ת\"ג) דליקוט עצמות דינו כמו קבורת המת, ומחויבים עפ\"י הדין להתעסק עמו, וללותו ולהתאבל עליו עיי\"ש, והנה שיעור הלוית המת מבואר בגמ' כתובות (י\"ז ע\"א) למאן דקרי ותני מחויבים ללותו עד ס' רבוא, ולמאן דמתני לאחרים לית לי' שיעורא, והחיוב מוטל אפי' על יותר מששים רבוא, והנה שיעור זה דס' רבוא הוא הרבה יותר מכדי צרכו של מת כמבואר שם בגמ', ואין החיוב על כולם להתעסק במת, ולהיות מנושאי המטה, כי א\"א שתיעשה ע\"י כולם, אבל עכ\"פ החיוב על כולם ללוותו משום כבוד המת, וא\"כ לפי שורת הדין הי' מוטל חיוב זה על כל ישראל, כשלקח משה עצמותיו של יוסף מנהר נילוס, ואעפ\"י שהניחו העסק למשה לבדו מטעם שכבודו בגדולים, אבל לא הי' פטורים ממצות הלוי' מטעם זה, אדרבה לכבודו היו מחויבים כולם ללוותו."},{"passage_id":"devurim_b60ef75c_p6","passage_content":"והנה בתוס' שאנץ הביאו בשם מדרש אגדה, שיגע משה ג' ימים וג' לילות לבקש היכן יוסף קבור, עד שפגעה בו סרח בת אשר וכו', הלך משה על שפת הנילוס, וא\"ל יוסף יוסף הגיע העת וכו', מיד צף ארונו של יוסף וכו', נטלו משה והביאו אצלו ע\"כ, ואמרו במדרש הנ\"ל שכל ישראל נתעסקו בביזה, ומשה רבינו הי' עסוק בעצמותיו של יוסף, א\"כ מבואר דמה שהיו טרודים בביזה מנעם מלהתעסק במצוה, ועכ\"ח נלמד מדבריהם ז\"ל שלא היו כל ישראל בחבורת משה רבינו כלל במעמד ההוא, מפני שהיו טרודים בביזה בשאלת כליהם, דהרי לא הוטל על כל ישראל חיוב העסק כנ\"ל, וחיוב המצוה היה רק ללוותו ולעמוד שם לכבודו של מת, וטרדתם בעסק הביזה ובהשאלת כליהם מן המצרים, מנעם מלקיים מצוה זו, ומעתה בטלה טענת ההתנצלות לומר, דמה שלא נתעסקו עמו הי' לכבודו של יוסף, מפני שאמרו כבודו יותר בגדולים, דעכ\"פ היו מחוייבים לכבודו לקיים מצות הלוי', אלא ודאי עיקר הסיבה מה שלא עסקו בו, היתה מפני שהיו טרודים בביזה, ע\"כ דרשו עליהם חז\"ל הפסוק ואויל שפתים ילבט."},{"passage_id":"devurim_b60ef75c_p7","passage_content":"משא\"כ במדבר שהלכו כל ישראל אחר הארון, כדאיתא במדרש פ' בשלח, שהי' ארונו של יוסף מהלך עם ארון חי העולמים, והלכו כל ישראל אחריהם, ואפשר שגם סייעו למשה רבינו לשאת אותו, דבמדבר לא היו טרודים עוד בביזה, ואחרי שראו זריזות וחביבות משרע\"ה במצוה זו, ודאי שנכנס בלבם חביבות ואהבת המצוה וסייעו למשרע\"ה, אלא שהניחו למשה רבינו להיות נוטל חלק בראש ולהיות מעיקר הנושאים, לכבודו של יוסף כדי שיתכבד בגדולים, עכ\"פ הרי עשו כל מה שמוטל עליהם, ע\"כ שפיר אמרו בגמ' דמה שלא נתעסקו ישראל עמו במדבר, משום שאמרו כבודו בגדולים, אבל מעיקרא שלא עסקו בו במצרים, עכ\"ח הטעם משום שהיו טרודים בביזה כנ\"ל, וע\"כ דרשו לעיל ואויל שפתים ילבט בגנותן של ישראל."},{"passage_id":"devurim_b60ef75c_p8","passage_content":"נמצא שאין עוד סתירה בין המימרות שבגמ', ותירוצו של המהרש\"א ז\"ל אמת, במה שחילק בין מצרים למדבר, אבל לא מטעמי' כנ\"ל, וא\"ש ג\"כ קושייתנו הנ\"ל, מ\"ט גבי יעקב אבינו, שבקי לי' אחי יוסף מעיקרא, שיתעסק בו יוסף, מטעם דכבודו במלכים יותר מבהדיוטות, דהתם עכ\"פ כולם נתעסקו וסייעו ליוסף, דכתיב וישאו אותו בניו וגו', אלא שהניחו ליוסף להיות נוטל חלק בראש, מטעם דכבודו במלכים יותר והבן."},{"passage_id":"devurim_b60ef75c_p9","passage_content":"אמנם עדיין צ\"ב מה שדרשו בגמ', ואויל שפתיים ילבט לגנותן של ישראל, מפני שנתעסקו בביזה ולא נתעסקו בעצמות יוסף, הלא גם ביזת מצרים נצטוו עלי' מפי הגבורה, כמ\"ש הכתוב וישאלו איש מאת רעהו וגו', וא\"כ מאן מפיס דמצוה זו נדחית מפני חבירתה, ומאין הכריעו חז\"ל לומר דעשו שלא כהוגן, ולמה דרשו חז\"ל בגנותן, וע\"ק מה שדרשו עליהן הפסוק הזה ואויל שפתיים ילבט, דמשמעות הכתוב דכשלון האויל בשפתיו, ולפי דרשתם נכשלו ישראל במעשה, על שלא עסקו בעצמות יוסף, ולא הי' כשלונם בדיבור ובשפתיים כלל, וק\"ז הישמח משה זלל\"ה פי', משום דלא קיימו מה שנשבעו לבטא בשפתים לשאת ארונו של יוסף, ולכן קורא עליהם שפתיים ילבט שנכשלו בשפתים, עכת\"ד ז\"ל, אולם עדיין קשה דהרי לא בטלו את השבועה שהשביע אותם יוסף, כיון דנתקיימה ע\"י משה רבינו שהי' כללות ישראל וסוכ\"ס ישראל עצמם קברו אותו בשכם, וא\"כ לא נכשלו בשפתיים כלל, ולמה קורא הכתוב עליהם ואויל שפתיים ילבט, וצ\"ב."},{"passage_id":"devurim_b60ef75c_p10","passage_content":"ואפשר לפרש כל הענין, בהקדם מה דאיתא בגמ' (ברכות ז') דבר נא באזני העם וישאלו איש מאת רעהו ואשה מאת רעותה כלי כסף וכלי זהב וגו', אין נא אלא לשון בקשה, בבקשה ממך הזהירם על כך, שלא יאמר אותו צדיק אברהם, ועבדום וענו אותו קיים בהם, ואח\"כ יצאו ברכוש גדול לא קיים בהם עכ\"ד הגמ', והקשו המפרשים למה הי' צורך להזהירם על כך ובקשה זו למה, והלא אמרו ז\"ל (מכות כ\"ג ע\"ב) בגזל שנפשו של אדם מחמדתן, ומכ\"ש אם ינתן לאדם רשות ליטול כלי כסף וכלי זהב כאות נפשו וכרצונו, ודאי טבעו של אדם להיות עומד ונוטל, ומצינו בתנחומא פ' בשלח, ויסע משה את ישראל מים סוף, מהו ויסע שהסיען בעכ\"ח, שהיו ישראל יורדין בכל יום אצל הים ונוטלין מהבוזה וכו', עמד והסיען בעל כרחן, הרי שלקחו מן הביזה ברצונם הטוב, אפי' יותר ממה שנצטוו, וא\"כ למה הי' צריכים לאזהרה מרובה ולבקשת תחנונים שיקחו הרכוש, ועוד יל\"ד מ\"ש ועבדום וענו אותם קיים בהם, ואח\"כ יצאו ברכוש גדול לא קיים בהם, דלכאורה תיבת בהם הוא אך למותר, דמובן מאליו דמיירי בהם ולא באומה אחרת."},{"passage_id":"devurim_b60ef75c_p11","passage_content":"ופירשתי במקו\"א דאזהרה והבקשה היתה שיקחו בדרך שאלה, ולא בדרך מתנה, ודבר זה היה קשה בעיניהם לעשות, דנראה כעין גניבת דעת ורמאות, ומצינו (בסנהדרין צ\"א) שהלכו בני מצרים לדון עם ישראל לפני אלכסנדרוס מוקדון, ובקשו להחזיר להם מה ששאלו מאתם, יעיי\"ש, והנה כי כן באמת צריך לתת לב לדעת, למה צוה ד' ככה ליקח מאתם בדרך שאלה, וכבר הקשה כן האוה\"ח הק' (בפ' שמות) וז\"ל למה יצו ד' דברים שאינם מהמוסר, לגנוב דעתם וכו' בדרך מרמה, כי ח\"ו לא קצור קצרה ידו מפדות ישראל בעל כרחם, ולהוציא ממונם ועיניהם רואות וכלות, ותירץ הוא ז\"ל כי נתכוין ד' בזה להטעותם כדי שירדפו אחריהם, כי זולת השאלה וכו', לא היו המצרים רודפים אחריהם וכו', עכת\"ד ז\"ל. אמנם עדיין קשה דאין זה כבוד שמים לעשות בדרך זה, גם תירוצו אינו מספיק, דהרבה דרכים לפניו ית', והוא הי' יכול ליתן בלבבם שירדפו אחרי בני ישראל גם זולת השאלה, וא\"כ עדיין קשה למה הי' צורך שיקחו מהם בדרך שאלה."},{"passage_id":"devurim_b60ef75c_p12","passage_content":"ואפשר משום דרוב כליהם של מצרים היו תשמישי ע\"ז, וכמו שמצינו בשכם, שאמר יעקב הסירו את אלהי הנכר אשר בתוככם וגו' והחליפו שמלותיכם, וכתב שם האוהחה\"ק שהי' ע\"ז נסתרים בכלים, ולא הי' ניכרים אצלם, וע\"כ צוה יעקב לבדוק אותם להסיר הכיעור, וכמו\"כ מצינו בעגלות אשר שלח פרעה, דאיתא במדרש שבדקם יעקב ומצאם של ע\"ז, דיעקב אבינו הי' בקי בטוב ע\"ז, וברוב קדושתו הבחין לדעת אם יש עליהם טומאת ע\"ז, וכאן בכליהם של מצרים לא הי' יכולין ישראל להבחין ולבדוק אותם אם הם של ע\"ז, כי הם לא היו מבינים בהבחנה זו, ומשה רבינו הי' טרוד בעצמות יוסף ולא הי' לו פנאי לבדוק כליהם, גם מפני שהי' היציאה ממצרים בחפזון ובמהירות רב, כמ\"ש ותחזק מצרים למהר לשלחם מן הארץ, ולא הי' בכדי שיעשה לבדוק כל הכלים האלו מע\"ז."},{"passage_id":"devurim_b60ef75c_p13","passage_content":"ואפשר דלטעם זה היתה ההכרח והצווי מאתו ית', ליקח אותם רק בדרך שאלה, ולא בדרך מתנה, דאלו הי' נוטלים מהם במתנה, לא הי' אפשר להם להנות ממנה לעולם, והי' אסור להשתמש בהם, דע\"ז שבא לרשות ישראל אין לה ביטול, לכן הי' הכרח שיקחו בדרך שאלה, ולא זכו בה ישראל עדיין, ואח\"כ נתבטל ע\"י הערב רב שהלכו עמהם, ושפיר היו יכולים להנות מהם, ובזה יתבאר דברי הגמ' שאמר הקב\"ה למשה שלא יאמר אותו צדיק אברהם, ועבדום וענו אותו קיים בהם, ר\"ל בעצמותם ובפועל, ואח\"כ יצאו ברכוש גדול לא קיים בהם, כי אע\"פ שניטלה מאת המצרים הרכוש הזה, אבל אם לא יהי' להם תועלת בזה, כיון שלא יוכלו להנות ממנה, נמצא שלא נתקיימה בהם המתנה, ולכן אמר הקב\"ה בבקשה מכם וישאלו וגו', שיהי' בדרך שאלה, ואח\"ז יתבטל ע\"י הערב רב, ועי\"ז יתקיים בידם הרכוש."},{"passage_id":"devurim_b60ef75c_p14","passage_content":"ובזה פירשתי מאמר המובא בספרי, וז\"ל וגם ערב רב עלה אתם וגו', כאן נתקיימה ואח\"כ יצאו ברכוש גדול ע\"כ, והוא פלא לכאורה, ולדרכנו יבואר היטב, כי רק ע\"י הערב רב שיצאו אתם, ובטלו הע\"ז שהי' ברכוש מצרים, כאן נתקיימה ואח\"כ יצאו ברכוש גדול, כי אלולי זה לא הי' להם שום תועלת ברכוש ההוא, מבואר עכ\"פ מכל הנ\"ל, דעל עצם הרכוש לא הי' צורך להזהירם, כי בלא\"ה ינתן להם, אחר שהבטיח הקב\"ה לא\"א שיצאו ברכוש גדול, והי' רצון ד' שיהי' כן, ההוא אמר ולא יעשה, ואפי' אם לא היו שואלים, היו המצרים נותנים להם בעכ\"ח, כדי שיתקיים הבטחת השי\"ת, כמו שמצינו שאמרז\"ל במדרש שאמרו להם המצרים טול שנים וצא, והצווי לא הי' על עצם לקיחת הרכוש, רק שיהי' עפ\"י הדין, ובדרך שאלה, שלא יבא לרשותם בעוד שהם ע\"ז, ורק אחר שנתבטל הע\"ז ע\"י הערב רב יקנו אותם ברשותם כנ\"ל, וא\"כ לפי\"ז מה שהיו טרודים ועסוקים בביזה הי' אך למותר, ולא הי' נכנס בגדר הציווי, ובגדר המצוה כלל, ולא הי\"ל להניח העסק בעצמות יוסף שהיא מצוה חיובית, מפני עסיקת הביזה שלא הי' בגדר מצוה כלל."},{"passage_id":"devurim_b60ef75c_p15","passage_content":"ונקדים עוד מ\"ש בספה\"ק תולדות יעקב יוסף (פ' בא) בשם הישיש הרב מוה\"ר אפרים מ\"מ דק\"ק בראד, בביאור דברי הש\"ס מנוח ע\"ה הי' שהלך אחר אשתו, שנא' וילך מנוח אחר אשתו, והקשה עפ\"י משל כי הי' איש א' שנתעשר ונעשה מטובי העיר, ופעם א' נתאספו טובי העיר ונתעכבו עד חשיכת לילה, וכשיצא ללכת לביתו, הלך המשרת ונר בידו לפניו להאיר לו, והרע בעיני העשיר על שזה הולך לפניו, וא\"ל מי אתה שתלך לפני, ודבר אליו קשות עד כדי הכאה, ובאמת זה לא בדעת ידבר, שהרי הליכתו לפניו להאיר לו, הוא לטובתו, שאם ילך לאחריו האיך יכול להאיר לו, ומכח זה המשל יהי' קושיא על דברי הגמ' כאן, מנלן דמנוח ע\"ה הי', דלמא מה שהלך אחר אשתו, הוא משום שהיא ידעה מהמלאך ולא הוא, והלכה להראותו הדרך עד מקום תחומו של המלאך, ותירץ דדברי הגמ' יהיו ברורין עפ\"י משל בחייט אחד שהי' עסקו עם ערלים הידועים וניכרים לו, ומשם הי' פרנסתו, שהלך בשוק ופגע בהם, וקנו אצלו סחורה יותר מאצל אחרים, פעם אחת למד בספרי מוסר במעלת הבטחון, שאין אדם נוגע במה שמוכן לחבירו וכיו\"ב, אמר החייט מעתה מה לי לטרוח א\"ע ולחזור בדרכים ובשווקים, אני יושב בביתי ופרנסתי מוכרחת לבוא לביתי, ולא זז מפתח ביתו, וביומא דשוקא באו אלו הערלים ליקח אצלו ולא מצאו אותו בשוק, ובאת אשתו ודברה עמו בנחת ובקטטה, שילך לשוק ולא רצה מטעם הנ\"ל, ואלו הערלים הי' צער להם ליקח מאחרים, ובאו סמוך לביתו כדי שיצא לקראתם, ולא רצה מטעם הנ\"ל, עד שבאו לביתו ועשו המו\"מ אצלו כמו בשוק, ואמר ראיתם שאני אמרתי שמוכרח לבוא אצלי פרנסתי וכך הי', ע\"כ המשל, ועפי\"ז מתורץ קושיא הנ\"ל, שאם המלאך הוצרך לילך בשליחותו ית', להודיע להם מה יהי' משפט הנער הילוד, ואיך יתנהגו עמו, גם כשלא ילכו אצל המלאך, מוכרח המלאך לעשות שליחותו ולבוא אצלו, וא\"כ למה הלך מנוח אחר אשתו, אלא ש\"מ כדרשת חז\"ל שהי' ע\"ה ודפח\"ח ע\"כ הועתק בספה\"ק תולדות."},{"passage_id":"devurim_b60ef75c_p16","passage_content":"ואיתא בזוה\"ק פ' בשלח שטו העם ולקטו, מאי שטו, שטותא הוו נסב לגרמייהו, בגין דלא הוו בני מהימנותא וכו', אינון דלא מהימני בי' בהקב\"ה לא בעאן לאסתכלא בארחוי, ואינון בעאן לאטרחא גרמייהו כל יומא בתר מזונא יממא ולילי, דלמא לא סליק בידייהו פתא דנהמא, אף הכי שטו העם ולקטו, בשטותא דגרמייהו וכו' עכ\"ד הזוה\"ק. ואיתא בילקוט (פ' בשלח) שהי' ג' כתות בלקיטת המן, מי שהי' זריז הי' יוצא ומלקט מן השדה, שנא' ויצא העם ולקטו, והבינונים היו יוצאין לפתח אהליהם ומלקטים, והעצלים היו רובצים על מטותיהן ופושטים ידיהן, והוא יורד לתוך ידיהן, ובמד\"ר פ' בשלח עה\"פ ד' אלקיך עמך לא חסרת דבר, מהו דבר, כשהי' מתאוה לאכול, והי' אומר בפיו אלולי הי' לי פטמא אחת לאכול, מיד הי' נעשה לתוך פיו טעם פטמא, דבר היו אומרים והקב\"ה עושה רצונם, א\"ר אבא אף דבר לא הי' אומר בפיו, אלא חושב בלבו לומר מה שנפשו מתאוה, הי' הקב\"ה עושה רצונו, עכ\"ד המדרש."},{"passage_id":"devurim_b60ef75c_p17","passage_content":"ואאמו\"ר זלה\"ה בקדושת יו\"ט, פי' הפסוק הנני ממטיר לכם לחם מן השמים ויצא העם ולקטו דבר יום ביומו ותו\"ד בקיצור, דאם האדם מאמין באמת שהכל הוא מאתו ית' בהשגחה פרטיות, ולא יאמר בלבבו כחי ועוצם ידי וגו', אז לא יצטרך לעשות פעולות ולהטריח עצמו בפרנסתו, רק לקיים וברכתיך בכל אשר תעשה, ואפי' במעשה כל דהו, או אפי' בדיבור בעלמא, כמ\"ש בגמ' גבי חסמה בקול דעקימת שפתיו הוי מעשה, אך כ\"ז הוא רק אם האדם מאמין באמת כנ\"ל, והשי\"ת הרוצה להטיב עמו, נותן בלבו מקודם המדה להאמין באמת, וממילא נעשה כלי מוכשר, לקבל פרנסה והצלחה בנחת בלי שום צער, רק בדיבור בעלמא דג\"ז נחשב למעשה, וזש\"ה הנני ממטיר לכם לחם מן השמים, ר\"ל מקודם אשפיע לכם בלבכם לידע ולהאמין שהלחם הוא מן השמים בהשגחה פרטיות, ולא בכח יגבר איש, ואח\"כ כשתבואו למדה זו, ויצא העם ולקטו דבר יום ביומו, דבר דייקא, שהדיבור בלבד יחשב להם למעשה עכדה\"ק."},{"passage_id":"devurim_b60ef75c_p18","passage_content":"ומעתה נבין מה שדרשו ז\"ל ואויל שפתים ילבט על ישראל, מפני שעסקו בביזה ולא עסקו בעצמות יוסף, כי לא היה להם להיות טרודים בביזה, כי אף אלו לא שאלו מאתם, היו המצרים מעצמם נותנים להם, דמאחר שכן הוא רצון הבוי\"ת, היו מוכרחים לעשות כן כהמשל הנ\"ל, נמצא כי אלו היו במדריגה זו, להאמין שא\"צ לעשות פעולות להשיג קניני עוה\"ז ופרנסה ודומיהן, ודי בדיבור בעלמא, כי הדיבור יש בו כח כמעשה, דעקימת שפתיו הוי מעשה, אז לא באו לכשלון זה, ולא היו טרודים בביזה, והי' יכולין לקיים מצוה בעסיקת עצמותיו של יוסף, וע\"כ קורא עליהם ואויל שפתים ילבט שנכשלו בשפתים, ולא באו למדריגה זו להאמין דעקימת שפתים הוי מעשה, וזו היתה סיבת כשלונם, שגרם להם להיות טרודים בביזה, ולא עסקו בעצמות יוסף."},{"passage_id":"devurim_b60ef75c_p19","passage_content":"ועתה נבוא לבאר תחילת המאמר בגמ', שדרשו חכם לב יקח מצות על משה רבינו, שכל ישראל כולן נתעסקו בביזה, והוא נתעסק במצות בעצמות יוסף, והקשה המהרש\"א ז\"ל בח\"א כי העוסק במצות צדיק וחסיד יתקרי, ולמה תיארו את משה רבינו כאן בשם חכם עיי\"ש תירוצו, ואפשר לתרץ כי באמת הי' צריך לזה חכמה יתירא להכריע בין המצות, דהנה עפ\"י הלכה, המלקט עצמות והמוליך אותם ממקום למקום, מבואר בשו\"ע (יור\"ד סי' ת\"ג) דפטור מק\"ש ומתפלה ומהתפילין, ומכל מצות האמורות בתורה, ואפי' הם מלקטים רבים, ואם רצה להחמיר על עצמו לא יחמיר, מפני כבוד העצמות, ע\"כ לשון המחבר בש\"ע, והש\"ך כתב שם דאם הם משמרים רבים, זה משמר וזה קורא, אבל המלקט ועוסק בעצמות המת, אפי' הם רבים אינם רשאים להחמיר על עצמם ע\"כ, לפי\"ז משרע\"ה כשקיבל על עצמו לעסוק בעצמות יוסף, יתבטל עי\"ז בכל משך הזמן מקיום כל המצות, דהרי עפ\"י הדין אינו רשאי להחמיר על עצמו ולקיימן, ולמה הכריע לעשות כן להפסיד כל אותן המצות, כי אע\"פ שהי' קודם מתן תורה, אבל הרי קיים משרע\"ה כל התורה כולה עד שלא נתנה, והמצות של משרע\"ה הי' ערכם עד אין שיעור, ומה גם דמצוה זו הי' אפשר שתתקיים ע\"י אחרים, וא\"כ לכאורה איך הכריע לעשות כן."},{"passage_id":"devurim_b60ef75c_p20","passage_content":"ואפשר מפני שראה שיוסף הצדיק נזדעזע מעצמו לעלות בדרך נס, כדאיתא בגמ', כשרצה ליקח עצמותיו שהיו בנילוס צף ע\"ג המים, ולחד לישנא שהי' קבור בקברניט של מלכים נזדעזע מעצמו עפ\"י נס, עכ\"פ מבואר בדברי חז\"ל, דנזדמנה לו מצוה זו בסיוע נס, וכללא דלא עביד קוב\"ה ניסא לתקלה, ואולי מזה הכריע משרע\"ה לעסוק בעצמותיו של יוסף, והשיג ג\"כ שלא יתבטל ע\"י מעשה זה מקיום כל המצות, ויעלה בידו לקיים שניהם, ואפשר ע\"י שסייעו לו אחרים בנשיאת ארונו של יוסף, כמבואר בגמ' פסחים לחד מ\"ד, דאותן הטמאים לנפש שנדחו לפסח שני, היו מנושאי ארונו של יוסף, וע\"כ כשהי' משרע\"ה רוצה לקיים שאר מצות, נתקיימה מצוה זו ע\"י ישראל, אלא מפני שאמרו כבודו בגדולים, ע\"כ הניחו לו להיות נוטל חלק בראש במצוה זו, עכ\"פ יהיה איך שיהי' משה רבינו הי' רואה את הנולד שלא יתבטל עי\"ז משאר המצות, ולכן הכריע לעסוק במצוה זו, וא\"ש מה שכינו אותו כאן לחכם, ולא בשם צדיק וחסיד, כי צריך חכמה גדולה לזה להכריע בין המצוות, וגם הי' רואה את הנולד שלא יתבטל על ידו משאר מצות, וא\"ש דחכם יתקרי בפועל זה."},{"passage_id":"devurim_b60ef75c_p21","passage_content":"והשתא א\"ש מ\"ש במדרש שכל ישראל נתעסקו בביזה, והוא נתעסק במצות, שנא' חכם לב יקח מצות וכו', ולכאורה עפ\"י הפשטות משמיענו כאן שעסק בעצמות יוסף, וזו אינה אלא מצוה א', ומהו הלשון נתעסק במצות ודרשו הפסוק חכם לב יקח מצות, ולדרכנו באו חז\"ל לומר בשבחו של משה שקיים מצוה זו, וגם לא נתבטל על ידו מכל המצות, וזה הי' ע\"י חכמתו, שהכריע כן לבחור במצוה זו, והי' רואה את הנולד שיוכל לקיים גם שאר מצות, וזהו שנא' בקרא חכם לב יקח מצות, שחכמתו עמדה לו שקיים כל המצות, וגם לא מנע את עצמו ממצוה זו."},{"passage_id":"devurim_b60ef75c_p22","passage_content":"ועתה נחזור לפרש דברי המדרש בפ' ואתחנן, א\"ל הקב\"ה למשה כתבתי עליך שחכם אתה, שנא' חכם לב יקח מצות, ואתה רוצה לכנס לארץ, וגם נתרץ מה שהקשינו לעיל איך אמר משרע\"ה שמא הותר הנדר, לאחר שהותר לו לכבוש ארץ סיחון ועוג, הלא הוא עצמו הכריע שסיחון ועוג הם מחו\"ל, מדשלח אליהם דברי שלו' כדברי ק\"ז הישמח משה זלל\"ה, וא\"כ אחרי שהכריע בעצמו שהם חו\"ל, איך אמר שמא הותר הנדר, והרי הם לא היו בכלל הנדר כלל."},{"passage_id":"devurim_b60ef75c_p23","passage_content":"ונקדים עוד משפרש\"י ז\"ל עה\"פ ואשלח מלאכים ממדבר קדמות אל סיחון וגו' דברי שלו' וגו', פרש\"י אע\"פ שלא צוני המקום לקרא לסיחון לשלום, למדתי ממדבר סיני, מן התורה שקדמה לעולם, כשבא הקב\"ה ליתן התורה לישראל, חזר אותה על עשו וישמעאל, וגלוי לפניו שלא יקבלו, ואעפ\"כ פתח להם בשלום, אף אני קדמתי את סיחון בדברי שלום עכ\"ד, ונראה דרש\"י ז\"ל בא לתרץ יתור הלשון דלמה נאמר ממדבר קדמות, ומה נפק\"מ אם שלח ממדבר קדמות, או ממקום אחר, לזה פי' שלמדה מן התורה שקדמה לעולם, אבל עדיין אינו מובן, למה הזכיר הכתוב קדמות, וכי להורות בא שהתורה קדמה לעולם, והלא ידוע לכל, ולפי דרשת רש\"י הי\"ל לומר ממדבר סיני."},{"passage_id":"devurim_b60ef75c_p24","passage_content":"ונראה לומר עפ\"י מ\"ש החיד\"א ז\"ל בספרו ראש דוד, דדבר זה אם ארץ סיחון ועוג הוא מארץ ישראל או חו\"ל, תליא בפלוגתת ריב\"ב ורשב\"י בבכורות (נ\"ה ע\"א), דפליגי שם אם הירדן עצמו א\"י או חו\"ל, ולר' יהודה ב\"ב דדריש שם מקרא דהירדן עצמו חו\"ל, א\"כ ארץ סיחון ועוג ודאי שהוא ג\"כ חו\"ל, ולרשב\"י דס\"ל דהירדן עצמו א\"י, עדיין איכא לספוקא אם גם ארץ סיחון ועוג מא\"י, כ\"כ החיד\"א ז\"ל, והנה איתא בתנחומא פ' יתרו וידבר אלקים את כל הדברים האלה לאמר, א\"ר יצחק אף מה שהנביאים עתידין להתנבאות, כולם קבלו מהר סיני וכו', ולא הנביאים בלבד, אלא אף כל החכמים שהיו ושעתידין להיות וכו' וכן אמר ישעי' משעה שנתנה התורה קבלתי הנבואה זו וכו', אלא שלא נתנה לי רשות להתנבאות עד עכשיו וכו', ואמרו חז\"ל (בירושלמי פ\"ב דפאה) אפי' מה שתלמיד ותיק עתיד להורות לפני רבו, כבר נאמרה למשה בסיני, עכ\"פ מבואר דכל פלוגתת חז\"ל דברי האוסר ודברי המתיר כולם נתנו למשה מסיני, וכמ\"ש חז\"ל בכ\"מ (בעירובין י\"ג) דאלו ואלו דברי אלקים חיים, וכתב הריטב\"א שם, וז\"ל, שאלו רבני צרפת, האיך אפשר שיהיו אלו ואלו דא\"ח, ותירצו כי כשעלה משה למרום לקבל התורה, הראו לו על כל דבר ודבר מ\"ט פנים לאיסור ומ\"ט פנים להיתר, ושאל להקב\"ה ע\"ז, ואמר לו שיהא זה מסור לחכמי ישראל שבכל דור ודור ויהי' הכרעה כמותם עכ\"ל."},{"passage_id":"devurim_b60ef75c_p25","passage_content":"והנה משה רבינו כששלח מלאכים אל סיחון דברי שלו', בזה הכריע בין פלוגתת התנאים הנ\"ל, להורות דארץ סיחון ועוג הם חו\"ל, כמבואר בישמח משה המובא לעיל, ויובן שפיר מ\"ש ואשלח מלאכים ממדבר קדמות אל סיחון דברי שלו' ופרש\"י למדתי מן התורה שקדמה לעולם, דפלוגתא זו עדיין לא הי' בימיו, ולא נתחדשה אלא בימי התנאים, אבל כיון שכל התורה קדמה לעולם, וכל מה שתלמיד ותיק עתיד לחדש בכלל התורה הוא, וכבר הראה לו הקב\"ה למשה בשמי מרום כל התורה כולה, ע\"כ משם השיג פלוגתא זו, והכריע כדברי אחד מהם שסיחון ועוג הם חו\"ל."},{"passage_id":"devurim_b60ef75c_p26","passage_content":"אמנם כשהתפלל משרע\"ה על כניסת הארץ, וכתב באוהחה\"ק שהתפלל משה רבינו וכלל בתפלתו גם את דור המדבר שיכנסו עמו, ואיתא בספה\"ק שהתפלל משרע\"ה שיהי' התיקון השלם והגאולה מיד, וא\"כ ענין הכניסה הי' נוגע לכלל ישראל, ע\"כ חשש משרע\"ה אעפ\"י שכבר עשה מעשה, במה ששלח דברי שלום, והכריע בזה דסיחון ועוג הם חו\"ל, אולי טעה בהכרעתו, ואפשר שיכריעו חכמי דורו דסיחון ועוג הם מא\"י, וברוב ענותנותו חשב שהוא אינו כדאי להכריע בדבר זה, וכפי שנתוספה גדולתו וקדושתו, נתוספה גם מידת ענותנותו, וא\"ש מ\"ש דמיתי שמא הותר הנדר, דשמא טעיתי בהכרעתי, והלכה דסיחון ועוג מא\"י, וא\"כ נדר שהותרה מקצתו הותרה כולו, וע\"כ הפציר בתפלה לתועלת ישראל כנ\"ל, והשיב לו הקב\"ה כתבתי עליך שחכם אתה, שנא' חכם לב יקח מצות ר\"ל כיון שכבר הכרעת ההלכה שארץ סיחון ועוג הוא חו\"ל, ע\"י ששלחת אליהם דברי שלום, מעתה אין דבר זה תלוי עוד בחכמי דורך, ואין בכוחם לשנות מכפי הכרעתך, כי כבר העדתי עליך שחכם אתה, שנא' חכם לב יקח מצות, שהכריע משה רבינו בענין עצמות יוסף כנ\"ל, והסכים הקב\"ה להכרעתו וקראו חכם, וכמו\"כ כאן לענין כניסת הארץ נתקבלה הכרעתך, שארץ סיחון ועוג הוא חו\"ל, ולא הותר הנדר, ולא תוכל לכנס לארץ, וא\"ש קישור דברי המדרש כתבתי עליך שחכם אתה שנא' חכם לב יקח מצות, ומשם ראי' דאין אחר הכרעתך כלום ואיך אתה רוצה לכנס לארץ, כי אתה בעצמך הכרעת שהוא חו\"ל, וא\"א לשנות מדבריך כנ\"ל, ולכן לא תעבור."},{"passage_id":"devurim_b60ef75c_p27","passage_content":"עוד אפשר לפרש דברי המדרש הנ\"ל באופן אחר, עפ\"י מ\"ש ק\"ז הייטב לב זלל\"ה (בפ' נח) עה\"פ נח איש צדיק תמים וגו' את האלקים התהלך נח, בהקדם מה שפירש הגה\"ק מבארדיטשוב זצ\"ל, עה\"פ יתרון לחכמה מן הסכלות כיתרון האור מן החשך, ותו\"ד כי אור משמעותי' יממא, ומשמעותי' אורתא, כדאמרינן בריש פסחים, משא\"כ חשך אין במשמעותי' רק לילה, זה ההבדל בעצם בין החכמה והסכלות, כי החכם יוכל לשמש בשתי פנים, ולפעמים ישנה את טעמו וריחו לפי הצורך, ע\"ד שעשה דוד בשנותו את טעמו לפני אבימלך, משא\"כ הכסיל אין בידו לעשות עצמו חכם בשום אופן, עכ\"ד הקדושת לוי זלל\"ה, ובזה פי' ק\"ז זלל\"ה דכמו\"כ בענין ענוה, דבאמת גדר החכם להיות עניו ושפל, וכל גאה שוטה, אך לפעמים צריך להתלבש בלבוש הגאות לצורך הזמן, לקנא קנאת ד' צבאות, ולהשיב רבים מעון, וגם לאפושי ברחמים על בני דורו, וזהו גדר החכמה להשתמש בתרי אנפין להיות גבר ענותן ושפל, ולפעמים גאה וגאון, הכל לפי צורך השעה, וכפי הצורך לעבודתו ית'."},{"passage_id":"devurim_b60ef75c_p28","passage_content":"וגם נח הצדיק השתמש בשתי המדות אלה שהי' עניו, ואעפ\"כ במקום שהי' צורך לעבודתו ית', השתמש גם במדת הגאוה, כמ\"ש ויגבה לבו בדרכי ד', עיי\"ש, וזה פי' הפסוק אלה תולדות נח כלומר שתי המדות האמורות להלן הם תולדות נח, נח איש צדיק, עם היותו תמים במעשיו עניו ושפל, אעפ\"כ את האלקים המורה על התנשאות ומושל ותקיף התהלך נח, שהשתמש בב' המידות הנ\"ל, ויבואר הרמז שכתבו המפרשים, האלקים' התהלך' נח' ס\"ת חכם, לרמז כי הי' משתמש בשני המדות ענו' וגיאות עייש\"ד."},{"passage_id":"devurim_b60ef75c_p29","passage_content":"והנה כבר ביארנו לעיל דישראל במדבר רצו לקיים המצוה להתעסק בעצמותיו של יוסף, וגם סייעו לו במצוה זו והלכו כולם ללותו, אלא שהניחו למשה רבינו להיות נוטל חלק בראש, מפני כבודו של יוסף, ולהגדיל המצו', מפני שאמרו כבודו יותר בגדולים כנ\"ל, ומעתה לפי גודל ענותנותו של משרע\"ה שהי' עניו מכל אדם, לא הי' יכול לקיים מצוה זו להתעסק בעצמותיו של יוסף, כי אחרי שכבודו יותר בגדולים, ולפי גדר ענותנותו חשב שיש בישראל גדולים ממנו, הי' צריך להניח מצוה זו להם, ולכבודו של יוסף שיכבד בגדולים, ונמצא שהי' מפסיד מצוה זו מפני ענותנותו, אבל מפני שהי' משרע\"ה אב החכמים, וגדר החכמה להשתמש בתרי אנפין, וכשהוא צורך לעבודתו צ\"ל ויגבה לבו בדרכי ד', ע\"כ לא בחר כאן במדת הענו' שלו, אלא במדת החכמה, ועי\"ז קיים מצוה, וזש\"ה חכם לב יקח מצות, ע\"י שהי' חכם לב זכה לקיום המצוה, ועתה מתורץ קושית המהרש\"א ז\"ל למה תיארו הכתוב לחכם, ולא בשם צדיק וחסיד, ולפי דרכנו זכה לקיים מצוה זו רק מפני שהי' בו גם מעלת החכם, נוסף למעלות צדיק וחסיד ועניו, אבל אלו הי' צדיק וחסיד לבד, הי' מפסיד מצוה זו, לכך שבחו הכתוב כאן בשם חכם."},{"passage_id":"devurim_b60ef75c_p30","passage_content":"ועתה נחזור לפרש דברי המדרש הנ\"ל, א\"ל הקב\"ה למשה כתבתי עליך שחכם אתה שנא' חכם לב יקח מצות, ואתה רוצה לכנס לארץ, ויובן עפ\"י מ\"ש בסוטה (י\"ד ע\"א) א\"ר חמא ברבי חנינא מפני מה נקבר משה אצל בית פעור, כדי לכפר על מעשה פעור, ובתוס' שם כתבו בשם מדרש אגדה, בכל שנה ושנה בעת שחטאו ישראל בבנות מואב, באותו פרק פעור עולה למעלה, כדי לקטרג ולהזכיר עון, וכשהוא רואה קברו של משה חוזר ושוקע וכו' ע\"כ, נמצא שהי' הכרח לטובתן של ישראל שלא יכנס משה לארץ ישראל, ושיהי' נקבר מול בית פעור, כדי להציל את ישראל מן הקטרוג ומן הכלי', ואיתא במדרש מפני מה נקבר משה בחוץ לארץ, כדי שיחיו המתים שבחו\"ל בזכותו וכו', ועוד איתא במדרש רבה שלכך נקבר משה רבינו בחו\"ל, כדי שיביא עמו דור המדבר לארץ ישראל בעת הגאולה, אבל משה רבינו לגודל ענותנותו חשב שאין זכותו כדאי לכל אלה, לכפר על מעשה פעור, ולהציל את ישראל מן הקטרוג ע\"י זכותו, ושיחיו מתי חו\"ל בזכותו, ולכן התפלל שיכנס לארץ, כי לא האמין בעצמו שזכותו יועיל להצלת ישראל, לכן א\"ל הקב\"ה כתבתי עליך שחכם אתה, שנא' חכם לב יקח מצות, וכשהוא צורך לעבודתו ית' יכול אתה להשתמש בגדר החכמה ובתרי אנפין, ולקיים ויגבה לבו בדרכי ד', ולכן עתה שהוא לטובת הצלת ישראל אל תהי' עניו, אלא רב לך, תדע שאתה רב וגדול, וכדאי זכותך להצלת ישראל, ולכן אל תוסף דבר אלי בדבר הזה, וזה שמסיים במדרש ואתה רוצה לכנס לארץ מפני ענותנותך, לא תתפלל עוד ע\"ז, דצריך אתה להשתמש כאן לצורך הצלת ישראל בגדר החכם ולא בגדר עניו."},{"passage_id":"devurim_b60ef75c_p31","passage_content":"ובדרך הנ\"ל אפ\"ל המדרש הנ\"ל אתה החלות להראות את עבדך את גדלך זו יציאת מצרים, עכ\"ד המדרש וצ\"ב, ונראה דלכאורה קשה לפימ\"ש רש\"י ז\"ל (בפ' שמות) שלח נא ביד תשלח, ביד אחר שתרצה לשלוח, שאין סופי להכניסם לארץ ולהיות גואלם לעתיד, יש לך שלוחים הרבה עכ\"ד, ולפי\"ז ידע משה רבינו בנפשו כי כבר נגזרה הגזירה עליו שלא יכנס לארץ, והוחלט אצלו שגזרה זו תתקיים, כמ\"ש שאין סופי להכניסם, וא\"כ למה הפציר והרבה בתפלה כ\"כ לבטל הגזירה, ואפ\"ל דהנה מה שלא רצה להיות השליח להוציא את בנ\"י ממצרים, עד שהפציר בו הקב\"ה כמה פעמים ואח\"כ שלחו בע\"כ, הי' הכל לגודל ענותנותו, שחשב שאינו כדאי במעלה ובצדקות להיות גואלם של ישראל, כמ\"ש מי אנכי כי אלך אל פרעה וכי אוציא את בנ\"י וגו', ועפימ\"ש האוהחה\"ק כי לזה צריך אדם גדול במעשים, שיזכה לזכות גדול כזה, ולטעם זה חשש שמא יארע תקלה לישראל, באמצעות מניעת זכותו, וכמו\"כ מ\"ש משרע\"ה שאין סופי להכניסם לארץ ולהיות גואלם לעתיד, הי' ג\"כ לטעם הענו', שלפי ענותנותו הגדולה חשב, שאין זכותו כדאי להכניסם לארץ, ולהיות גואלם לעתיד, אבל אחר שראה משרע\"ה שלקחו ד' להיות שליח להוציא את ישראל ממצרים, ואע\"פ שאין זכותו מספקת לפי דעתו, ע\"כ חשב שזה ממדת טובו ית', א\"כ לפי\"ז בקש ג\"כ שיכניסם לארץ, ושיתבטל הגזירה, אע\"פ שאין זכותו מספיק לזה, ובזה יבואר המדרש אתה החלות להראות את עבדך את גדלך זו יציאת מצרים, ועוד דרשו ז\"ל במדרש את גדלך זו מדת טובך וכו', וז\"ש משה רבינו כי הראת לי מדת טובך ביצ\"מ, שהייתי השליח לגאול את ישראל, אע\"פ שלא היו זכיותי כדאי, לכן אעברה נא."},{"passage_id":"devurim_b60ef75c_p32","passage_content":"ולדרכנו יתבאר דברי המדרש הנ\"ל ואתחנן למה כדי שיכנס לארץ והוא פליאה, ונראה דלכאורה קשה קושיא הנ\"ל למה הפציר והרבה בתפלה כל כך, אחרי שהי' מוחלט אצלו כבר שאין סופו להכניסם לארץ, ולפי דרכנו יובן, כי מ\"ש שם שאין סופו להכניסם לארץ הי' דעתו לצד מיעוט זכותו שאינו כדאי לזה כנ\"ל, אבל עתה נתחדש אצלו טענה חדשה, שאע\"פ שאינו כדאי שיהי' הוא השליח להכניסם, אעפ\"כ התפלל שיכנס כשאר העם, כדי לקיים מצות התלויות בארץ, - וזה מאמר המדרש ואתחנן למה, פי' למה הפציר כ\"כ בתפילות, אחרי שהי' מוסכם אצלו שלא יכניסם לארץ, וע\"ז תירצו כדי שיכנס לארץ, כי אע\"פ שאין זכותו כדאי להכניסם, אעפ\"כ בקש שיכנס בעצמו לקיים המצות כנ\"ל."},{"passage_id":"devurim_b60ef75c_p33","passage_content":"ועתה נבוא לבאר דברי המדרש הנ\"ל, שא\"ל הקב\"ה יוסף שהודה בארצו יקבר בארצו וכו', אתה שלא הודית בארצך, בנות יתרו אומרות איש מצרי הצילנו וכו' ואתה שומע ושותק, לא תקבר בארצך ע\"כ, וכבר הקשינו לעיל וכי טעם זה מספיק ליתן עליו עונש חמור כזה שלא יכנס לארץ, וע\"ק הלא מבואר בקרא שבעון מי מריבה נענש שלא יכנס לארץ, ולמה שינה המדרש ליתן טעם חדש, ואפשר לומר דהנה איתא בזוה\"ק, שמה שאמרו איש מצרי הצילנו נצנצה בהם רוח הקודש, שסיבת הצלתם הי' מה שהרג את המצרי וברח, ועי\"ז ניצולו, והביאו משל ע\"ז, (ובזוה\"ק איתא דנצנצה בהם רוה\"ק, ואמרו ולא ידעו מה אמרו), ולפי\"ז משמעותו לשני פנים, בנות יתרו דלא ידעו מה דקאמרי, כוונו לומר איש מצרי על משרע\"ה, אבל ע\"י רוח הקודש ניתן בפיהם לומר איש מצרי לכוונה אחרת, שע\"י המצרי שהרג זה הי' סיבה להצלתן, וא\"כ לכאורה אין בזה חטא מה שלא הכחיש משרע\"ה אותם, אחרי שיש בדיבור זה גם כוונה לטובה, ובודאי משרע\"ה השיג הרוח הקודש."},{"passage_id":"devurim_b60ef75c_p34","passage_content":"והנה רש\"י ז\"ל כתב שהרג משה רבינו למצרי זה בשם המפורש, והוא מדברי הפדר\"א, ולכאורה ראוי להבין למה קנא משה על איש מצרי זה, שראה אותו מכה איש עברי, יותר מעל שאר מצרים שהשליכו ילדי ישראל ליאור, וכבשום לתוך הבנין, ועשו רעות הרבה יותר ממנו, גם למה הרגו בשם המפורש, והרי כתבו התוס' (ברכות ז') דלאו אורח ארעא להענישם ולהורגם בידי שמים אפי' אם יש חיוב מיתה עליהם עיי\"ש, ונראה דלפי שמשה רבינו התבונן במצרי זה ובדורותיו העתידים לצאת ממנו, כמ\"ש התרגום יונתן ואסתכל משה בחכמת דעתיה, ואתבונן בכל דר ודר וכו', וראה והבין מדורותיו שהמצרי הזה הוא אבי אבות הטומאה, והראי' שהניח אחריו בן נוקב שם ד' בישראל, והרבה טומאה נתפשט על ידו במחנה ישראל ע\"י חילול השם שגרם, יעיי\"ש מה שפירשתי בפסוק הוציא את המקלל, ע\"כ רצה לבערו מן העולם בכל אופן, שלא יתפשט הטומאה על ידו וע\"י דורותיו."},{"passage_id":"devurim_b60ef75c_p35","passage_content":"ולפי\"ז שבח גדול הי' למשה מה שהרג את המצרי, כי הכניע בזה כוחות הטומאה, ולכן שתק כשאמרו איש מצרי, ולא אמר להם שהוא עברי מארץ ישראל, כי שפט בעצמו שזה יותר שבח וזכות להכניע כוחות הטומאה בחו\"ל מלהיות איש עברי מארץ ישראל, ולכן א\"ל הקב\"ה לשיטתך כיון שלא הודית בעצמך והיית שומע ושותק, ומעתה הכרעת בעצמך שזה יותר שבח להכניע כוחות הטומאה, ולכן לא תעבור, כמו שהבאנו לעיל מתוס' (סוטה י\"ד) בשם המדרש דמשה רבינו נקבר מול בית פעור להכניע טומאת פעור, וזה שבח יותר מלכנס לארץ ישראל ולקיים מצות התלויות בארץ, וא\"כ מ\"ש לו הקב\"ה על שלא הודה בארצו, לא לצד העונש א\"ל כן, אלא לשבחו, כי זה שבח לשיטתו."}]},{"dvar_torah_id":"devurim_0c2e906a","title":"תפילה בעת צרה וייחוד ה'","summary":"משה רבינו התפלל לה' שידע אם ייענה, ללמד לדורות על תפילה בעת צרה. קיום מצוות האמונה בייחוד ה' הוא עיקרי, והגאולה תבוא רק על ידי ה' בעצמו, ולא על ידי נביאים, כדי לנסות את ישראל באמונתם.","contents":[{"passage_id":"devurim_0c2e906a_p1","passage_content":"ואתחנן אל ה' בעת ההוא לאמור, פירש\"י זה א' מג' מקומות שאמר משה לפני המקום איני מניחך, עד שתודיעני אם תעשה שאלתי אם לאו, ודרשו כן ממלת לאמור שהוא מיותר, ויש להבין למה ביקש משרע\"ה על הודעה זו, והלא א\"א בלא\"ה, ובודאי יתוודע לו אם נענה אם לא, וכי הי' הו\"א בעולם שלא יודיעהו ה', עד שהוצרך לבקש ולהפציר לומר איני מניחך, עד שתודיעני אם תעשה רצוני וצ\"ב."},{"passage_id":"devurim_0c2e906a_p2","passage_content":"ב) במד\"ר מהו בעת ההוא לאמור, לאמור לדורות שיהיו מתפללין בעת צרה, ויש להבין למה צריך לימוד ע\"ז, שיהיו מתפללין בעת צרה, ומצינו כיו\"ב (בילקוט פ' ויצא) וידר יעקב נדר לאמור, לאמור לדורות שיהיו נודרין בשעת הדחק, אבל התם ניחא דטובא קמ\"ל, כיון דאסרה תורה לנדור כמ\"ש טוב אשר לא תדור, ע\"כ דרשו ממלת לאמור, דבעת צרה הותר לנדור, אבל כאן הרי תפלה מצות עשה דאורייתא, לדעת הרמב\"ם בכל יום, ואפי' לדעת הרמב\"ן שהוא רק מדרבנן, מ\"מ בעת צרה מודה שהוא דאורייתא, וכבר נלמוד ממקום אחר וא\"כ לאמור למה לי."},{"passage_id":"devurim_0c2e906a_p3","passage_content":"ג) להלן בפרשה, שמע ישראל ה' אלקינו ה' אחד, דרז\"ל שפסוק זה הוא צווי ואזהרה עלינו לייחד שמו ית', כמ\"ש ברכות (דף י\"ג) צריך להאריך באחד עד דאמליכתי' למעלה ולמטה ולד' רוחות השמים, ובמה שאנו אומרים אלקינו ד' אחד, אנו מקיימין מצותו שצונו לייחד שמו ית', אולם רשיז\"ל פי', ה' שהוא אלקינו עתה, ולא אלהי האומות עוע\"ז, הוא עתיד להיות ה' אחד, שנא' אז אהפוך אל עמים שפה ברורה לקרוא כולם בשם ה', ונאמר ביום ההוא יהי' ה' אחד ושמו אחד, והקשה המזרחי דא\"כ לפי\"ז האי קרא אינו צווי על יחודו ית', רק סיפור שמודיענו הכתוב, שעתיד להיות אלקי אחד לכל האומות, והוא נגד קבלת חז\"ל, שלמדו מהאי קרא לייחדו ית' ושהוא מצות עשה, ותירץ דתרווייהו משתמעי' מני', ה' אחד הוא צווי על יחודו ית', ומדכתיב אלקינו, שהי' די לומר שמע ישראל ה' אחד, ע\"כ נשמע גם דרשא זו דעכשיו הוא אלקינו ולא אלהי האומות, אבל לעתיד יודו בו כל האומות ויאמרו ה' אחד עכת\"ד ז\"ל, אמנם קשה להעמיס כ\"ז במשמעות הפסוק."},{"passage_id":"devurim_0c2e906a_p4","passage_content":"ד) במד\"ר (פ\"ב סי' ל\"ה) מהיכן זכו ישראל לק\"ש, משעה שנטה יעקב למות, קרא לכל השבטים, וא\"ל שמא משאני נפטר מן העולם אתם משתחוים לאל אחר וכו', א\"ל שמע ישראל ה\"א ה' אחד וכו', שמע אבינו ישראל (פי' ישראל סבא), אותו הדבר שצויתני נוהג בנו ה\"א ה' אחד, ונראה שדרשו זאת מתיבת ישראל שהוא מיותר, דהרי כל התורה לישראל נאמרה, ולמה צריך הכתוב להדגיש במצוה זו תיבת ישראל, ע\"כ דרשו זה על ישראל סבא, דמצוה זו שקבלנו מיעקב אבינו, אנו מקיימים ומייחדים שמו ית' בכל יום, אמנם ראוי להבין קישור סוף הפסוק, באמרו ה' אלקינו שדרשו רז\"ל שעתה הוא אלקינו ולא אלהי האומות, ולפי דרשת המדרש אין לו שום קישור לכאורה, גם צ\"ב למה יאמרו זאת ישראל ליעקב אבינו, שאותו הדבר שצויתני נוהג בנו, ונראה כסיפור דברים ליעקב אבינו, והלא יחוד הבוי\"ת צ\"ל להקב\"ה לבדו, כמו כל המצות שאנו צריכים לייחדם אליו ית', ולעשותם לשם פעלם."},{"passage_id":"devurim_0c2e906a_p5","passage_content":"ה) איתא בילקוט (ישעי' רמז תמ\"ג) נחמו נחמו עמי, נחמוה עליונים נחמוה תחתונים, נחמוה חיים נחמוה מתים, נחמוה בעוה\"ז נחמוה בעוה\"ב, ראוי להבין למה הוכפלו כל אלו הניחומים, וצ\"ב הכוונה בו, עוד שם בילקוט (רמז תמ\"ג) וז\"ל א\"ל הקב\"ה לנביאים לכו ופייסו את כנסת ישראל, מיד מתכנסין כל הנביאים והולכים אצלה, והיא אומרת להם איך תנחמוני הבל ותשובותיכם נשאר מעל (איוב כ\"א) וכו', עד עכשיו אזני מלאות מן התוכחות שהוכחתם אותי, ועכשיו אתם באים לנחמני, וחושב שם בילקוט עשרה נביאים שהלכו לנחם לכנס\"י ולא רצתה לקבל מהם, הלך הושע לנחמה, אמר להם הקב\"ה שלחני אצלך לנחמך, א\"ל מה בידך, א\"ל אהי' כטל לישראל, א\"ל אתמול אמרת לי הכה אפרים, שרשם יבש, פרי בל יעשון, ועתה אתה אומר לי כך, לאיזה נאמין לראשונה או לשני', הלך יואל לנחמה א\"ל הקב\"ה שלחני אצלך לנחמך, א\"ל מה בידך, א\"ל והי' ביום ההוא יטפו ההרים עסיס, א\"ל אתמול אמרת לי וכו' לאיזה נאמין לראשונה או לשני', הלך עמוס וכו' הלך מיכה וכו', וכ\"א אמר נבואתו בשליחות ה' לנחמם ולא האמינו בהם, והשיבו להם מנבואה אחרת שאמרו להוכיחם ולענשם, עד שא\"ל הקב\"ה לאברהם לך נחם את ירושלים וכו' ולא קבלו ממנו והשיבו לו וכו', הלך יצחק וכו' הלך יעקב וכו' הלך משה רבינו וא\"ל קבלו ממני תנחומין, אמרו לו האיך אקבל ממך תנחומין, שכתבת עלי קללות וגזירות קשות שנא' מזי רעב ולחומי רשף ולא קבלו ממנו, מיד הלכו כולם לפני הקב\"ה, ואמרו רבש\"ע לא קבלה ממני תנחומין שנא' עני' סוערה לא נוחמה, א\"ל הקב\"ה אני ואתם נלך לנחמה, הוי נחמו נחמו עמי יאמר אלקיכם עכ\"ד המדרש, והשר מהר\"י אברבנאל פי' כל המאמר הזה לפי דרכו, ומרן החיד\"א בספרו ראש דוד ביאר כל דברי הנביאים האלה, ומיישב דבריהם שאין סתירה בנבואתם לנבואה הקודמת, יעיי\"ש."},{"passage_id":"devurim_0c2e906a_p6","passage_content":"ואחר כל דבריהם בפירושם קשה להבין דברי הילקוט, והוא הפלא ופלא, דהרי כל דבריהם מוסב כול לעתיד, ואז יהיו כל ישראל צדיקים, כמבואר בתוס' יומא שלאחר ביאת המשיח לא יהיו עוד רשעים בישראל, וכולם ישובו כמ\"ש ושבת עד ה' אלקיך, ואלי' הנביא יחזיר את כל ישראל בתשובה, וא\"כ איך יצוייר שלא יאמינו ישראל לכל אלו נביאי אמת, שיבואו אליהם בשליחות הקב\"ה, ובפרט להאבות הק' ולמשה רבינו, והרי כל מי שאינו מאמין לדברי הנביא חייב מיתה, כדאי' בסנהדרין (דף צ' ע\"א) שמפני שלא האמין השליש לדברי הנביא בדברי אלישע, נאמר בו וירמסוהו בשער וימות יעיי\"ש, ואיך אפשר שיהרהרו ישראל בנבואת משה רבינו."},{"passage_id":"devurim_0c2e906a_p7","passage_content":"ו) ועו\"ק שהרי ישראל שבכל הדורות רואין ויודעים אלו פסוקי התוכחה, שכולם נמצאים בתורה ובנביאים, ואעפ\"כ עומדים באמונתם חיים וקיימים, ומאמינים בבשורת הנחמה, ואיך אפשר שבדור הגאולה שיהיו כולם צדיקים, לא יאמינו בבשורת הנחמה מכח קושיא זו, שיהי' סתירה בעיניהם פסוקי התוכחה לפסוקי נחמה, והוא פלא."},{"passage_id":"devurim_0c2e906a_p8","passage_content":"ז) עו\"ק מדוע לא השיבו להם הנביאים על קושייתם, כי בוודאי יש תירוץ מספיק על טענותיהם של ישראל, ולעתיד יתגלה הכל, כמ\"ש בילקוט פ' חקת דברים המכוסים מכם בעוה\"ז עתידים להיות צופים לכם לעוה\"ב, ומכ\"ש שהי' נגלה לנביאים אלו כל סתום, וא\"כ מדוע לא השיבו לכנס\"י על טענותיהם, אדרבה הי\"ל לברר נבואתם בירור אמיתי, שלא ישאר בו שום מקום ספק."},{"passage_id":"devurim_0c2e906a_p9","passage_content":"ח) ועו\"ק הרי קמי שמיא גליא, והי' גלוי וידוע לפניו ית', שלא יקבלו ישראל שליחות הנביאים, וא\"כ למה הטריח הקב\"ה י\"ב נביאים אלו ללא צורך, ואחרי שהי' עת רצון לפניו ית' לנחם את ישראל, למה לא הלך הקב\"ה בעצמו לנחמם, והקב\"ה מגיד מראשית אחרית, וידע שסוכ\"ס לא יקבלו עד שילך בעצמו לנחמם, א\"כ מדוע לא הלך אליהם בתחלה, והוא הפלא ופלא ואין לו שום פירוש לכאורה, ובודאי יש בזה ענינים נשגבים וסודות נפלאים, אבל עכ\"פ צריך שיהי' מוסבר קצת גם ע\"פ פשוטו, ולהבין אפס קצהו עד מקום שידינו מגעת בפשוטן של דברים."},{"passage_id":"devurim_0c2e906a_p10","passage_content":"ונקדים מה שפירשתי (בפ' בלק) שמצינו בעצת בלעם שהטעה את ישראל כ\"כ אחר עצתו, שנכשלו בבנות מואב ועבדו לפעור, ועל ידו נפלו כ\"ד אלף מישראל, ולכאורה הוא פליאה עצומה, איך הי\"ל ירידה כזו, שהרי מצינו במצרים שהי' עוד קודם מתן תורה, והיו משועבדים תחת המצריים ושלטו בגופן, ועוד שהיו משוקעים במ\"ט שערי טומאה, ואעפ\"כ היו גדורים בעריות, כאמרם ז\"ל אחת היתה ופרסמה הכתוב, וכאן שהי' כבר אחר מתן תורה, והתוה\"ק מחליש כח היצר, והיו דור דעה ומשרע\"ה עמהם, היאומן כי יסופר שירדו פלאים עד כדי כך, ובמדרש העירו ע\"ז, וכתבו שהי' ע\"י עצת בלעם, אבל עדיין אינו מובן, איך הי\"ל כח זה להדיח רבים מישראל בעריות, ובודאי גם במצרים הי\"ל מסיתים ומדיחים, ואעפ\"כ עמדו באמונתם חזקה, והיו גדורים בעריות, ופירשתי שהי' לו כח זה ע\"י כשפים, דבלעם ובלק היו מכשפים גדולים כדאי' בזוה\"ק, וארז\"ל כשפים מכחישין פמליא של מעלה, וע\"י כוחות הטומאה שבהם החלישו כח קדושתם של ישראל, והגבירו בהם כח הטבעיות וכוח התאוות ר\"ל."},{"passage_id":"devurim_0c2e906a_p11","passage_content":"ואפשר להסביר עוד באופן אחר, עפי\"מ שפירשתי דברי המד\"ר (בפ' דברים) חן ימצא ממחליק לשון זה בלעם, שהחליק בנבואתו וגבה לבם ונפלו בשטים, מבואר שנבואת בלעם גרמה להם, ועל ידו נפלו ישראל בשטים, וראוי להבין, הלא נבואתו היתה דבר ד', כמאמר הכתוב אפס את הדבר אשר אדבר אליך אותו תדבר, ואמרו רז\"ל שנתן לו הקב\"ה רסן בפיו, ולא הי' יכול לשנות דבר ה', א\"כ איך יצוייר שאותן הדיבורים יזיקו, ועל ידו תעו ישראל מדרך ד', אחרי שהם דברי ה' ונביאות אמת, ונבואה זו חלק מהתוה\"ק, והרי כמו\"כ ניבא על ביאת המשיח וגאולה העתידה, וכל מי שאינו מאמין בנבואה זו שהוא אמת, ה\"ז כופר בתוה\"ק ובביאת המשיח כמ\"ש הרמב\"ם ז\"ל, ואיך אפשר שדיבורים הללו התעו את ישראל מאחרי ד', והוא פליאה עצומה."},{"passage_id":"devurim_0c2e906a_p12","passage_content":"אולם יבואר כ\"ז, עפ\"י מ\"ש רש\"י (במשלי כ\"ח) בשם התנחומא, ממחליק לשון זה בלעם וכו' שהחניף לישראל, וא\"ל עשו כל תאותכם ואין הקב\"ה מקפיד עליכם, לא איש אל ויכזב באומות, אבל בישראל ההוא אמר ולא יעשה וכו', ובעלי התוס' ז\"ל הביאו מדרש זה באריכות עיי\"ש, וסיום המדרש אבל בלעם השונא א\"ל עשו תאות לבבכם, כי לאומות עושה כל הרעה שגזר עליהם שנא' לא איש אל ויכזב, אבל בכם שאתם בניו, אף אם גזר רעה ההוא אמר ולא יעשה ודבר לא יקימנה וכו' ע\"כ, ומעתה יובן דהוא גופא גרם להם כל הרעה, מפני שידעו כל ישראל שנבואת בלעם אמת, ודבר ד' בפיו, וגם משרע\"ה הסכים לנבואתו, ע\"כ האמינו לנבואתו ותעו אחריו, ובלעם הרשע הכניס בדברי הנבואה הריסת הדת והפקרות, והפך דברי אלקים חיים לדברי מינות וכפירה, במה שאמר כי לא יעניש השי\"ת לעוברי רצונו, והי' מפרש הפסוק ההוא אמר ולא יעשה ודבר ולא יקימנה בניחותא עפ\"ל, ומפני שהוא הוריד נבואה זו וידעו כל ישראל כי דבר ה' בפיו, לכן האמינו לדבריו ולפירושיו השקריים, ואע\"פ שמשרע\"ה בודאי ביאר להם פי' האמיתי בנבואה זו, אבל האמינו לבלעם כי גבר עליהם כח התאוה וכח הטבע, וטענת היצר חזקה עליהם לאמר כי הוא דבר ד', ואחרי כי הנבואה הזאת נאמרה אליו, נאמן הוא גם על פירושיו, וזאת הטעה את ישראל להמשיך אחריו, ועיין בדברינו בפרשת דברים."},{"passage_id":"devurim_0c2e906a_p13","passage_content":"וזה פי' המדרש הנ\"ל ממחליק לשון זה בלעם שהחליק בנבואתו ונפלו בשטים, ר\"ל שבלעם הרשע הי' לוכד חכמים בערמה, שלא אמר לישראל דברים ברורים וגלויה, שרוצה להעבירם על דעת התורה שיכעיסו להבוי\"ת, ובאמת רק זה היתה כל כוונתו, כדאיתא במדרש שאמר אלקיהן של אלו שונא זימה וכו', אלא שלא גילה להם כל לבו, שידע נאמנה שישראל שבאותו הדור לא יאבו ולא ישמעו לו באופן זה, אמנם החליק את לשונו לפרש פסוקי התורה היפך האמת, ובירר להם שכן הוא דעת התורה, ושכן משמעות הפסוקים, ובאופן זה נלכדו בידו, ואח\"כ אעפ\"י שראו שהמעשה שנתפתו אליה תועבה הוא לפני המקום, לא הי' בכוחם עוד ליסוג אחור, כי כבר גבר עליהם האויב היצר הרע והתגברות התאוה, אבל התחלת הצלחתו הי' ע\"י שהחליק לשונו להביא ראי' מפסוקי התורה לדבריו, ועתה מבואר היטב דברי המדרש ממחליק לשון זה בלעם שהחליק בנבואתו ועי\"ז נפלו בעצת שטים."},{"passage_id":"devurim_0c2e906a_p14","passage_content":"וזה דרכו של היצה\"ר גם בדורינו שהולך בעצת בלעם, ע\"י שלוחיו מנהיגים שאינם הגונים, שמגלים פנים בתורה שלא עפ\"י האמת, ומבררים מפסוקי התורה ומאמרי חז\"ל, שדעת התורה מסכמת לתועבותם, ושאפשר להיות נבל ברשות התורה, ובאופן זה יפלו ברשתם רבים מבני עמנו התמימים והכשרים, וכמ\"ש הרמב\"ם (בפ\"ה תלמוד תורה) וז\"ל ואלו התלמידים שלא הרבו בתורה בראוי וכו', הם המחריבים את העולם, ומכבין נרה של תורה, והמחבלים כרם ד' צבאות וכו', ובעוה\"ר רבים מהמנהיגים האלה שבימינו נכללו בדבריו, ועוד נוספו עליהם."},{"passage_id":"devurim_0c2e906a_p15","passage_content":"וכבר אמרתי לפרש דברי הגמ' פסחים (דף נ\"ו ע\"א) שאמרו בני יעקב לאביהם, שמע ישראל ד' אלקינו ד' אחד, כשם שאין בלבך אלא אחד כך אין בלבינו אלא אחד עכ\"ל, ולכאורה צ\"ב וכי הרבה מדרגות הם באמונת האחדות, עד שהוצרכו לומר \"כשם\" שאין בלבך אלא אחד, הלא אם יחסר ח\"ו כחוט השערה משלימות האמונה באחדות גמור, אין זה אחדות כלל, כי אחדות פירושו א' יחיד ומיוחד, וא\"א שיהי' חלוקי מדריגות באמונה זו, וא\"כ הול\"ל אין בלבינו אלא אחד ודי בזה."},{"passage_id":"devurim_0c2e906a_p16","passage_content":"אמנם התירוץ לזה שישנם בעוה\"ר פשטים שאינם אמת באמונת האחדות, ובפרט בדורנו השפל ישנם הרבה, שאף שמאמינים באחדות הבורא ובסיבה ראשונה, אבל מפני שמתחברים לכופרים ומינים, ומשתתפים לדיעותיהם ומאמינים בהצלחתם, ושמו אותותם אותות, וכל הצלחתם של הכופרים האלה ע\"י מעשה השען שמצליח, והם תולין הכל שהוא מן השמים, ומאמינים באותות ובמופתים האלה, ובאמת הקב\"ה עושה כ\"ז כדי לנסותם, כמאמר הכתוב כי מנסה ה' אלקיכם אתכם לדעת וכו', אבל הם משתבשים בדיעותיהם ונעשו למאמינים גדולים, שמאמינים בסיבה הראשונה ומשתתפים לאמונה זו גם כפירה ומינות ר\"ל, ומכניסים כל דרכיהם לא טובים בהאמונה, ועושים מהאמונה היפוך האמונה שצונו השי\"ת, ומהפכים דברי אלקים חיים לדיעותיהם הכוזבת, ואומרים שכן הוא רצון הבוי\"ת, והולכים בעצת בלעם הרשע שמכניסים כל תועבותם במצות התורה, ומבררים בראיות כוזבות שכ\"ז נכלל במצות התורה ובמשמעות הכתובים, ועי\"ז תופסים ברשתם גם התמימים והישרים."},{"passage_id":"devurim_0c2e906a_p17","passage_content":"ובזה יתבאר לנו מאמר הגמ' הנ\"ל, שאמרו בני יעקב אל אביהם \"כשם\" שאין בלבך אלא אחד, כך אין בלבינו אלא אחד, דהיינו שאנו מקבלים עלינו האמונה באחדות הבוי\"ת, על דעתך ועל כוונתך, מבלי אמונות טפילות אליה, רק באמונה פשוטה באחדות גמור, וא\"ש מה שמזכירים שמע ישראל, ופירושו ישראל סבא כאמרז\"ל במדרש, כי הוא עיקר גדול באמונת האחדות, להאמין ע\"ד האמת וע\"ד ישראל סבא, וזולת זה לא די שאין מקיימים המצוה כהוגן, אלא עוד פוגמים ר'ל בעקרי האמונה."},{"passage_id":"devurim_0c2e906a_p18","passage_content":"ומעתה יתורץ קושית המזרחי ז\"ל, שהקשה על דרשת רש\"י ז\"ל ד' אלקינו ולא אלהי האומות, והלא לפי קבלת חז\"ל פסוק זה הוא צווי ואזהרה על האמונה באחדות הבוי\"ת, ובקריאת פסוק זה אנו מיחדים שמו ית', ואיך שייך להפסיק באמצע היחוד בסיפור אופני אמונתם של האומות, ועוד שאין זה שבחו ית', שהאומות אינם מודים באלוקותו ית', ולמה לנו להזכיר זו באמונת יחודו ית', ולדרכינו א\"ש כי כ\"ז שייך למצות האמונה באחדות, והוא מעקרי תנאי האמונה כאשר יבואר, דהנה כתב הרמב\"ם ז\"ל (בריש ה' ע\"ז) דאומות הראשונים הי' מאמינים בסיבה הראשונה, אלא שחשבו לפי טעותם שראוי לכבד גם השמשים וכוכבי לכת, אחרי כי הם משרתים לו ית', וכבוד האדון לכבד גם ממשרתיו, ויש מהם שהיו אומרים שאין כבודו ית' להשגיח בתחתונים, ומסר הנהגת העוה\"ז למערכי השמים, ונמצא שהיו עובדים ע\"ז בשיתוף, אבל היו מאמינים גם בסיבה הראשונה, ובס' העקרים פי' בזה הכתוב, אשר יומרוך למזימה, מלשון האמרת והאמירך, ששבחו את שמו ית' וגדלוהו, לומר כי רם ד' ונשא ואין כבודו להשגיח בתחתונים, וכ\"ז עשו למזימה, כדי להפיק זממם ותאותם ע\"כ, ובעוה\"ר בימינו אלה נתהוה בחינה אחרת של ע\"ז, והוא גרוע יותר מע\"ז בשותפות שעבדו הגוים, כי הגוים האלה שתפו לאחדות הבוי\"ת מערכת צבא השמים, אבל אלו המתחברים לכופרים משתפים מכעיסי הבוי\"ת לאמונת האחדות, ומאמינים במכעיסים האלה ובהצלחתם, ותולים כל הצלחתם שהוא מן השמים, ומהפכים האמונה לכפירה ומינות ר\"ל."},{"passage_id":"devurim_0c2e906a_p19","passage_content":"ומעתה נבין שפיר מה שאנו מזכירים במצות יחודו ית', שהוא אלקינו ולא אלהי האומות, דלכאורה למה נקרא אלקינו לבד, והלא גם האומות מאמינים באחדותו ית', אמנם לפי שמשתפים ע\"ז באמונתם, לא נקרא אלהיהם אלא אלקינו, וכ\"ש וק\"ו ועל אחת כמה וכמה אלו המשתפים מכעיסי הבוי\"ת ומינות וכפירה לאמונת האחדות, שאין זה אמונה כלל, רק כפירה ומינות ר\"ל, וע\"כ להוציא מאופני אמונתם, אנו אומרים אלקינו ולא אלהי האומות, שאנו מקבלים עלינו אמונת האחדות בבחי' זו שהוא אלקינו, דהיינו אחדות גמור נרד האמת וע\"ד ישראל סבא, בלי שותפות ובלי אמונות טפילות במכעיסי הבוי\"ת, נמצא שאין זה סיפור, אלא הוא מעיקרי ויסודי האמונה, ובאופן זה נצטוינו להאמין ולייחד שמו ית', ושפיר מתורץ קושית המזרחי, ומעתה גם לפי דברי המדרש הנ\"ל שדרשו שמע ישראל ישראל סבא, א\"ש קישור סוף הפסוק אלקינו ולא אלהי האומות, והכל עולה לכוונה א', שנצטווינו על האמונה ע\"ד ישראל סבא, מבלי לשתף אלי' דיעות נפסדות ואמונות טפילות, ורק באופן שהוא אלקינו ולא אלקי האומות, וא\"ש מ\"ש כשם שאין בלבך אלא א' כך אין בלבינו אלא א' כנ\"ל, וכל המדרשים עולים בקנה א', ומתוכם יתברר אמונת היחוד ע\"ד האמת."},{"passage_id":"devurim_0c2e906a_p20","passage_content":"ונבוא לתרץ דברי הילקוט הנ\"ל, דלכאורה איך אפשר שיבואו כל אלה הנביאים ומשה רבינו בכללם, ולא יאמינו להם ישראל, ואפשר שלא יכירו ישראל שהוא משה רבינו, שאם ידעו ולא יאמינו בו, הרי כופרים ח\"ו בנבואת משרע\"ה, וכן לא יכירו בישעי' ובכל הנביאים, וע\"כ לא יאמינו להם עפ\"י הדין, כי אין להאמין כי אם לנביא מוחזק כמ\"ש הרמב\"ם ז\"ל, אמנם לכאורה למה יעשה ד' ככה, להטריח כל אלה הנביאים ללא צורך, אחרי שגלוי וידוע לפניו ית', כי לא יאמינו להם ישראל, ואפשר דהסיבה והטעם שישלח ר את נביאיו, יהי' כדי לנסות את ישראל, אם יעמדו איתן באמונתם, שלא ישמעו בבשורת הגאולה לשום נביא, עד שישמעו מפי הקב\"ה בעצמו שיבוא לנחמם, והצורך לנסותם בזה, מפני שנכשלו ישראל בדורות האחרונים לפני ביאת משיח במנהיגים לא טובים, והאמינו להם ישועות ונחמות וגאולות, על ידי שהעמיסו כל שקריהם בראיות מפסוקי התורה."},{"passage_id":"devurim_0c2e906a_p21","passage_content":"ובספרי ויואל משה (מאמר א' סי' קרא) כתבתי לפרש מה שאמרו חז\"ל בגמ' (יבמות דף ק\"ב ובכ\"מ) אפי' אם יבוא אלי' ויאמר אין חולצין בסנדל אין שומעין לו, ולכאורה אינו מובן, למה אמרו חז\"ל בלשון זה על אליהו שאין שומעין לו, דהרי כיון שהוא היפך ההלכה והאמת, א\"א שיאמר אלי' היפך האמת, והול\"ל שאפי' אליהו לא יאמר אין חולצין בסנדל, ומדוע השתמשו חז\"ל בלשון אין שומעין לו, שאין זה לכבודו של אותו צדיק, וא\"א שיהי' במציאות כלל, אמנם האמת הברור שידעו חז\"ל שאליהו לא יאמר היפך האמת והיפך ההלכה המקובלת, אבל חששו שמא יבוא א' מגדולי הדור ויטעה בזה שלא כדין, ויטעו כל העולם אחריו מחמת גדלו, לשמוע אליו אף במה שהוא היפך האמת, לכן הזהירו אותנו חז\"ל שהיפך האמת והלכה המקובלת, אפי' אם יבוא אליהו ויאמר כן אין שומעין לו, ולפי\"ז לא הי' מספיק מאמרם שאלי' לא יאמר היפך ההלכה, דעדיין לא נדע להזהר שאם מי שהוא יבוא, ויעיד בשם אליהו נגד ההלכה המקובלת, שלא נאבה ולא נשמע לו, ע\"כ הזהירנו חז\"ל בפירוש שלא נשמע בשום אופן, אפי' לאליהו נגד התוה\"ק ונגד האמת."},{"passage_id":"devurim_0c2e906a_p22","passage_content":"נחזור לעניננו דהנה כשיבוא משיח צדקינו תתרבה הדעת, ויבואו ישראל להשגה אמיתית, ואז ידעו ויבינו שכל הצרות שבאו עליהם בעקבתא דמשיחא היה בשביל שהאמינו באלה התועים, ומדה כנגד מדה ירצה ד' לנסותם, וישלח ד' להם אלה הנביאים בדמות ישעי' הנביא ובדמות משה רבינו וכן כולם, ובאמת זה יהי' ישעי' הנביא וכן משה, אבל ישראל לא ידעו מי הם, ויהיו חזקים באמונתם ולא יאמינו להם ויעמדו בנסיון, ויבקשו מהם אות שהם נביאי אמת, ויקשו על נבואתם סתירות מפסוקי התורה, כמבואר בילקוט הנ\"ל, ואם יבררו שאין בנבואתם ניגוד לפסוקי התורה, רק אז יאמינו להם ולא באופן אחר, ובאמת הי' בכח השגת הנביאים לתרץ כל קושיתם של ישראל, אבל לא ישיבו להם תירוץ, כי אין הרצון שיקבלו דבריהם, רק הרצון העליון הי' לנסותם ושיעמדו בנסיון, ואח\"כ יחזרו כל הנביאים והאבות הקדושים ומשרע\"ה, ויאמרו להקב\"ה שעמדו ישראל בנסיון, וחזקים המה באמונתם, ובבשורת הגאולה אינם רוצים להאמין רק להבוי\"ת, ואז יאמר הקב\"ה אני ואתם נלך שכבר הגיע גאולתן של ישראל, וראויים המה להגאל."},{"passage_id":"devurim_0c2e906a_p23","passage_content":"ואפ\"ל עוד עפימ\"ש חז\"ל דבגאולה העתידה יגאלו ישראל ע\"י הקב\"ה לבדו, וז\"ל המדרש (ילקוט זכרי' רמז תקע\"ז) אשריך ישראל מי כמוך עם נושע בד' (דברים ל\"ג) אמר הקב\"ה בעוה\"ז הייתם נושעים ע\"י בני אדם, במצרים ע\"י משה ואהרן, בימי סיסרא ע\"י דבורה וברק וכו', וע\"י שהיו ע\"י בשר ודם הייתם חוזרים ומשתעבדים, אבל לעתיד לבוא אני בעצמי גואל אתכם, ועוד יותר אין אתם משתעבדים, שנא' (ישעי' מ\"ה) ישראל נושע בד' תשועת עולמים, וכן דרשו חז\"ל מדכתיב ופדויי ד' ישובון (ישעי' נ\"א) אין אומר ופדויי משה ואהרן אלא ופדויי ד', שגאולה העתידה יהי' רק ע\"י הקב\"ה ולא ע\"י בשר ודם, וכן מבואר בזוה\"ק פ' ויקרא (דף ו') נפלה לא תוסיף קום בתולת ישראל, נפלה ולא ואוסיף להקימה לא כתיב, מתל למלכא דרגז על מטרוניתא וכו', כך קוב\"ה כ\"ז דכנס\"י בגלותא, כד הוי' מטי זמנא היא אתיאת והדרת קמי מלכא, והשתא בגלותא דא בתראה לאו הכי, אלא קוב\"ה יוחיד בידהא ויוקים לה ויתפייס בהדה ויתיב לה להיכלי', ות\"ח דהכי הוא, דהא כתיב נפלה לא תוסיף קום, וע\"ד כתיב ביום ההוא אקים את סוכת דוד הנופלת, היא לא תוסיף קום מעצמה, אבל אנא אוקים לה וכו' עכ\"ד הזוה\"ק."},{"passage_id":"devurim_0c2e906a_p24","passage_content":"עכ\"פ מבואר בדברי חז\"ל בכ\"מ, דגאולה העתידה יהי' רק ע\"י הקב\"ה בעצמו, ולא ע\"י שליח בשר ודם, ומעתה ל\"ק כלל מה שלא יאמינו ישראל לכל אלו הנביאים, שיבואו לבשרם על הגאולה העתידה, כי כן יהי' מקובל בידם, שא\"א שיהי' הגאולה העתידה אלא ע\"י הקב\"ה לבדו, וכמו שמצינו ביצ\"מ, דאיתא במד\"ר שמות (פ\"ה סי\"ג) כשבא משרע\"ה לבשרם על הגאולה, וכו', יכול לא האמינו עד שראו האותות, לא אלא וישמעו כי פקד ד', על השמועה האמינו ולא על ראיית האותות, ובמה האמינו על סימן הפקידה שאמר להם, שכך הי' מסורת בידם מיעקב וכו', שכל גואל שיבא ויאמר לבני פקוד פקדתי אתכם הוא גואל של אמת, כיון שבא משה ואמר פקד פקדתי אתכם מיד ויאמן העם וכו', הרי מבואר דלא שמעו ישראל אפי' למשרע\"ה, ולא האמינו בהאותות שעשה, אלא כאשר נתאמת אצלם הסימן של פקוד פקדתי, שהי' מקובל בידם מיעקב שבלשון הזה הם נגאלים, ומעתה כמו\"כ בגאולה העתידה לא ירצו להאמין בבשורת הגאולה לשום נביא ואפי' למשרע\"ה כי סימן זה יהי' מסור ומקובל בידם, שיהי' הגאולה וגם בשורת הגאולה ע\"י הקב\"ה בעצמו."},{"passage_id":"devurim_0c2e906a_p25","passage_content":"וכבר אמר הנביא נחמו נחמו עמי יאמר אלקיכם, שבשורת הגאולה תהי' ע\"י הקב\"ה בעצמו, ואמה\"כ אנכי אנכי הוא מנחמכם, ובחי' דבורו ית' מכרחת, ואין מן התימה דלא יאמינו ישראל לכל אלה הנביאים כי כן ראוי להיות, וזה רצונו ית', אלא שהקב\"ה ישלח לכל אלה הנביאים לנסות את ישראל, לפי שנכשלו ישראל בעוקבתא דמשיחא במנהיגים לא טובים ובנביאי שקר, להאמין להם גאולה שקריית, ונחמות וישועות אשר בדו מלבם בעצת הס\"מ, להכשיל את ישראל ולהדיחם מאמונתם, וע\"כ ירצה הקב\"ה לצרפם ולנסותם אם יעמדו בנסיון ויהיו חזקים באמונתם, ואז יהיו ראויים להגאל, וכאשר יחזרו הנביאים ויאמרו להשי\"ת שאין רצון ישראל לשמוע ולהאמין להם, זה יהיה נחמה לפניו ית', שנבחנו ונמצאו שלמים ותמימים באמונתם, ואז יאמר השם אני בעצמי אלך לבשרם, כדאיתא בילקוט הנ\"ל, וכדכתיב נחמו נחמו עמי יאמר אליכם וגו'."},{"passage_id":"devurim_0c2e906a_p26","passage_content":"ופירשתי מ\"ש בנוסח קדושת כתר, ישמיענו ברחמיו שנית לעיני כל חי לאמר הן גאלתי אתכם וגו', דלכאורה הול\"ל ישמיעני לאזני כל חי, דהרי השמיעה הוא באזנים ולא בעינים, אולם מצינו כמו\"כ במתן תורה, דכתיב וכל העם רואים את הקולות, ודרשו חז\"ל שהיו רואים את הנשמע, ואפשר לקרב דבר זה אל השכל ולהבינו קצת גם עפ\"י פשוט, דבאמת כל קול יש בו ממשיות, ונתברר בחוש בדורינו, ע\"י שהמציאו כלים ומכונות שנקלט הקול על ידם, ונשמר לזמן מרובה ועכ\"ח שיש בו ממשיות, אלא שלרוב דקותו וחלישותו, אין כח בחוש הראות להרגיש ממשותו, משא\"כ בקול ד' כביכול לרוב גדולת בחינתו, ובפרט שהיו ישראל אז בשעת מתן תורה זכי הראות, אין מן התימא שהיו רואים את הקולות בחוש הראות ממש, ואפשר שזה הכוונה בתפלתינו, ישמיעני ברחמיו לעיני כל חי לאמר הן גאלתי אתכם וכו', ר\"ל שהקב\"ה בעצמו יבשרנו בשורת הגאולה, ואז יזכו ישראל למדריגה זו, שיהיו רואים את הנשמע כמו בשעת מתן תורה, וא\"ש ישמיעני לעיני כל חי, שתהי' שמיעה זו לעיני כל חי, הבוי\"ת יזכנו לראות בקיום הבטחות אלו, ויראו עינינו וישמח לבנו בשוב ד' את שבות עמו בב\"א."},{"passage_id":"devurim_0c2e906a_p27","passage_content":"ובזה יבואר דברי הילקוט הנ\"ל, שישלח הקב\"ה את הנביאים לנחם את ישראל, ולא יקבלו תנחומין מהם, מיד הלכו כולם לפני הקב\"ה, ואמרו רבש\"ע לא קבלו תנחומין וכו', אמר להם הקב\"ה אני ואתם נלך לנחמה, הוי נחמו נחמו עמי יאמר אלקיכם, ולכאורה צ\"ב, כיון דלא יקבלו דברי תנחומין מפי הנביאים, עד שהבוי\"ת בעצמו ינחמם, א\"כ מה צורך עוד שילכו גם הם, כמ\"ש אני ואתם נלך, ובודאי יספיק אם ישמעו דברי נחמה מהבוי\"ת בעצמו, ואולי אפשר לומר הכוונה, שהבוי\"ת ישלח דברי נחומיו אל ישראל ע\"י הנביאים, אלא שיהי' הנבואה אליהם בבחי' אספקלריא המאירה, ויהי' שכינה מדברת מתוך גרונם, כבחי' זה הדבר שנתנבא משרע\"ה, ואז יהיו ישראל רואים את הנשמע, ויתברר להם שהוא דיבורו של הבוי\"ת בעצמו, ואז יאמינו בבשורת הגאולה, וזולת זה א\"א ואין רשאי להאמין לשום נביא בהבטחת הגאולה, כי כבר הבטחנו שתהי' הגאולה העתידה ע\"י הבוי\"ת בעצמו, וכמו\"כ בשורת הגאולה יהי' ע\"י הבוי\"ת בלבד, כמ\"ש נחמו נחמו עמי יאמר אלקיכם, ואולי זה הכוונה במ\"ש אני ואתם נלך לנחמה, שיהי' ע\"י הנביאים בבחי' שכינה מדברת מתוך גרונם, ויהיו ישראל רואים את הקולות, ופסוק זה נחמו נחמו וגו' הוא לימוד ואזהרה רבה לכל דורות ישראל, ובפרט בדורינו היום בעיקבתא דמשיחא, דעד שיתגלה הבוי\"ת בעצמו, וישמיענו ברחמיו לעיני כל חי לאמר הן גאלתי אתכם, עד אז אין רשאי להאמין בשום גאולה, דכבר הבטחנו נחמו נחמו עמי יאמר אלקיכם, דנחמת הגאולה תהי' ע\"י הבוי\"ת בעצמו בב\"א."},{"passage_id":"devurim_0c2e906a_p28","passage_content":"נחזור לפרש דברי המדרש הנ\"ל ודברי רש\"י ז\"ל, עה\"פ ואתחנן אל ד' בעת ההוא לאמר שאמר משה לפני הקב\"ה איני מניחך עד שתודיעני וכו' (עוין קושיא א'), ולדרכנו נאמר דמבואר בספה\"ק כי משרע\"ה רצה לכנם לארץ ישראל, ולהביא את הגאולה ושיהי' התיקון השלם מיד, וע\"כ הפציר להתפלל אעברה נא, אמנם ידע משה רבינו שא\"א שהוא יבוא לבדו ויבשר להם הגאולה, כי בענין הגאולה, ההכרח שהקב\"ה יתגלה אלינו בעצמו, ויבשר לנו הגאולה, או שיאמר משה רבינו בבחי' אספקלריא המאירה, ובבחי' זה הדבר, שיהיו ישראל רואין את הנשמע שהוא דיבורו של הקב\"ה, ושכינה מדברת מתוך גרונו, ואף שהי' משה רבינו נביא מוחזק, וישראל שבאותו הדור ידעו בו, א\"כ בענין בשורת הגאולה איכא למיחש אפי' חששות רחוקות, ומשה רבינו לא רצה שהוא בעצמו יבשר להם הגאולה, פן ואולי אפשר שיבואו ישראל לטעות בדבריו, ולפרשם שלא עפ\"י האמת, גם יתכן שבודאי השיג משרע\"ה דבר זה, והיתה בקבלה אצלו, כי בענין הגאולה א\"א באופן אחר רק אם יאמר אלקיכם, שהקב\"ה בעצמו יבשר הגאולה, ע\"כ בקש מהקב\"ה שלא די אם תהי' נענה לבקשתו, אלא עוד תודיעני בפני כל ישראל, שאני שלוחך בבשורת הגאולה, וזה שהתפלל בעת ההיא לאמר, שיאמר ד', ושיהי' אמירתו של משה בבחי' זה הדבר, בבחי' שכינה מדברת מתוך גרונו."},{"passage_id":"devurim_0c2e906a_p29","passage_content":"ויבואר לדרכנו דברי המדרש הנ\"ל ואתחנן אל ד' בעת ההוא לאמר, לאמר לדורות שיהיו מתפללין בעת צרה, ונראה שדרשת חז\"ל מלמדנו עוד בחינה בענין הגאולה, ונרמז כאן במלת לאמר, דבאמת הי' אפשר למשה רבינו לבטל הגזירה ע\"י השתמשות בשמות הקדושים והפצרת תפלה יותר מדאי, כמ\"ש חז\"ל שאלולי התפלל עוד תפלה א' מיד הי' נענה, אבל משרע\"ה לימד אותנו דעת, שאסור לעשות פעולות בדבר הגאולה כ\"א להתפלל בתחנונים, וזה מאמר המדרש ואתחנן אל ד' בעת ההוא לאמר, לאמר לדורות שיהיו מתפללין בעת צרה, ולא יעשו פעולות לדחוק את הקץ, רק יתפללו בתחנונים, וזהו דרשו מיתור לשון לאמר שהוא אמירה לדורות והבן."},{"passage_id":"devurim_0c2e906a_p30","passage_content":"ואמרו ז\"ל במדרש שאמר הקב\"ה אם אעברה נא אתה מבקש בטל סלח נא, ואם סלח נא אתה מבקש בטל אעברה נא, אמר משה לפני הקב\"ה ימות משה ומאה כיו\"ב, ואל תנזק צפורן של א' מהם עכ\"ד המדרש, והנה מובן שמסר משה רבינו נפשו עבור הצלת ישראל, והסכים שלא יכנס לארץ בשביל שיסלח הקב\"ה לישראל, אמנם מ\"ש ימות משה ומאה כיוצא בו צ\"ב, כי אחר שחש משה רבינו להצלת ישראל, ואמר אל תנזק אפי' צפורן של אחד מהם, א\"כ איך אמר שימותו מאה כיוצא בו, והלא מאה הללו מכלל ישראל הם, גם יש להבין מהו כיוצא בו, ומי הוא בישראל כיוצא בו של משה."},{"passage_id":"devurim_0c2e906a_p31","passage_content":"ואפ\"ל עפ\"י מ\"ש בספר הלקוטים מהאר\"י הק' זלל\"ה עה\"פ ויתעבר ד' בי למענכם, וזלה\"ק דע כי בכל דור בא משה בסוד עיבור, לפי שהקב\"ה לא הי' רוצה לקבל ערב רב וכו', והוא קבלם בחשבו כי טוב הוא להכניסם בקדושה וכו', ורצה לתקנם, ואדרבה קלקלו לישראל, וזה סוד מ\"ש כי שחת עמך וכו' ועתה רוב הדור מהם, ולזה הוצרך לבוא משה בעיבור אחת לנ' שנה, לפי שהוא שורש נשמת ישראל לתקנם שלח יטעום ערב רב וכו' עכ\"ל האר\"י ז\"ל, ואין הדבר כפשוטו, שמשה רבינו בעצמו יבוא בגלגול בכל דור, אבל ניצוץ קדוש מנשמת משה רבינו מתגלגל בכל דור ודור, וזה נדרש מפסוק ויתעבר ד' בי למענכם, שנתעבר נשמת משה למען טובת ישראל כנ\"ל, ומשרע\"ה ראה כל אותן הדורות שיהיו לפני ביאת המשיח, וכל אותן הצדיקים שיהי' בהם חלק מניצוץ נשמתו, ומהם יסתלקו מן העולם עוד קודם זמן הגאולה, והשיג שהכל יהי' לצורך הצלת ישראל, ולכן אמר ימות משה ומאה כיוצא בו, ואל תנזק צפורן של א' מהם, ומה שאמר כיו\"ב היתה הכוונה ג\"כ על עצמו, דהיינו חלק ניצוץ נשמתו שיהי' מגולגל באותן הצדיקים והבן."},{"passage_id":"devurim_0c2e906a_p32","passage_content":"כתב ק\"ז הייטב לב בשם אביו זלל\"ה, לפרש דברי חז\"ל כל דור שלא נבנה בהמ\"ק בימיו כאלו נחרב בימיו, עפ\"י מ\"ש חז\"ל דחורבן ביהמ\"ק הי' מכפר על עונות ישראל, כמ\"ש שפך חמתו על עצים ואבנים, וכמאה\"כ תם עונך בת ציון, וכמו כן דור שלא נבנה בהמ\"ק בימיו, ע\"י גודל הצער שיש לדור ההוא, ממה שלא נבנה בהמ\"ק בימיו, מכפר עליהם כאלו נחרב בימיו עכת\"ד ז\"ל, ואפ\"ל עוד לעניננו, עפ\"י מה שאמרו בילקוט ישעי' בפרשת נחמו, ר\"ח ב\"פ אמר אמרו ישראל לפני ישעי', ישעי' רבינו תאמר שלא באת לנחם אלא אותו הדור שחרב בהמ\"ק בימיו, אמר להם לכל הדורות באתי לנחם, אמר אלקיכם אין כתיב כאן אלא יאמר אלקיכם ע\"כ, וז\"פ כל דור שלא נבנה בהמ\"ק בימיו, יקבלו ג\"כ נחמה כמו דור שנחרב בהמ\"ק בימיו ולכולם יהי' הנחמה, ולכן נאמר בפסוק נחמו נחמו עמי יאמר אלקיכם לכל הדורות, וזהו שדרשו חז\"ל במדרש מכפל לשון נחמו נחמו, נחמות חיים נחמות מתים, בעוה\"ז ובעוה\"ב וכו', ר\"ל דכל הדורות וכל הגלגולים שהיו כבר בעולם, כולם ינוחמו בדבר ד'."},{"passage_id":"devurim_0c2e906a_p33","passage_content":"נחמו נחמו עמי וגו' כי לקחה מיד ד' כפלים ככל חטאתי', הקשה רשיז\"ל האיך מידתו של הקב\"ה לשלם לאדם כפלים בחטאו בתמי', ובתרגום יונתן רצו לתרץ קושיא זו, ופי' ארי קבילת כוס תנחומין, כאלו לקתה על חד תרין עכ\"ל, ועדיין צ\"ב הכוונה בו, ואפשר לתרץ קושית רש\"י ז\"ל דהנה ישנם עבירות חמורות ר\"ל, שאינם מתכפרים ע\"י תשובה בלבד, כמבואר בגמ' דמני ד' חלוקי כפרה, עבר עבירה שיש בה כריתות ומיתות ב\"ד, תשובה תולה ויסורין מכפרין וכו', אמנם אעפ\"כ גדול כוחה של תשובה להקל מן היסורים, ואף בעבירות אלו שלא נשלם הכפרה בתשובה לבד, אבל אחר התשובה יהיו בחי' היסורים, קלים ונוחים ברחמים ובחמלה, משא\"כ ח\"ו אם לא יעשו תשובה, באים ח\"ו היסורין מצד דינא קשיא ר\"ל, וזו היתה סיבת היסורים בכל דורות הגלות, מפני שחסרה שלימות התשובה על בחינתה הראוי', אמנם טרם ביאת המשיח יעשו כל ישראל תשובה הראוי', וכמ\"ש הרמב\"ם ז\"ל דמ\"ש ושבת עד ד' אלקיך, זו הבטחה שכל ישראל יעשו תשובה לפני הגאולה, ויהי' תשובתם מעולה ומאהבה, עד שיהי' בכוחה לעקור את החטא מעיקרא ויתהפכו לזכיות, ואז יתברר למפרע שקבלו יסורים יותר מדאי וכפלים מכל חטאתיהם, ובאמת בשעתן כשקבלו היסורים, היתה שורת הדין מתחייבת כן, לפי שחסרה אצלם פעולת התשובה האמיתית, ולא עביד קוב\"ה בלא דינא, אלא שאז אחר שלימות התשובה שיתהפכו העבירות לזכיות, ישתנה החשבון ויתברר כי לקחה כפלים ככל חטאתי', ולכן יאמר ד' כיון שלקתה בכפלים ינוחמו בכפלים, וזהו נחמו נחמו עמי יאמר אלקיכם וכפי' התרגום יונתן, ויה\"ר שנזכה במהרה לראות בנחמת ציון וירושלים, וישמיעני ברחמיו מיד לעיני כל חי הן גאלתי וכו' והבוי\"ת בעצמו יבוא לנחמנו כאשר הבטיחנו, יראו עינינו וישמח לבנו בשוב ד' את שבות עמו יגל יעקב ישמח ישראל בב\"א."},{"passage_id":"devurim_0c2e906a_p34","passage_content":"R"}]}]
